
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Data/Intermediate/ca_pharmacy_locations.dta /export/storage_covidva
> ccine/Data/Intermediate/ca_blk_pharm_dist.csv 2000 100 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/block/geonear.log
  log type:  text
 opened on:   9 Sep 2023, 11:22:44

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Data/Intermediate/ca_pharmacy_locations.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Data/Intermediate/ca_blk_pharm_dist.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 100

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   436       5   4,035      20,175        10.0       0.7      00:25:10
   916       8   4,035      32,280        21.7       1.4      00:23:04
  1466       9   4,035      36,315        36.3       2.4      00:20:29
  1900       9   4,035      36,315        47.5       3.1      00:20:44
  2336       6   4,035      24,210        58.7       3.9      00:20:48
  2758       5   4,035      20,175        69.7       4.6      00:20:52
  3125       9   4,035      36,315        79.2       5.2      00:21:18
  3496       6   4,035      24,210        89.4       5.9      00:21:25
  3916       9   4,035      36,315       100.4       6.6      00:21:18
  4195       8   4,035      32,280       107.5       7.1      00:22:00
  4599       8   4,035      32,280       117.7       7.7      00:21:57
  5045       6   4,035      24,210       129.5       8.5      00:21:34
  5527       8   4,035      32,280       141.8       9.3      00:21:09
  5986      10   4,035      40,350       153.4      10.1      00:20:53
  6435       8   4,035      32,280       165.0      10.8      00:20:38
  6847      10   4,035      40,350       175.5      11.5      00:20:32
  7300       8   4,035      32,280       187.0      12.3      00:20:18
  7792       9   4,035      36,315       200.1      13.1      00:19:53
  8265       7   4,035      28,245       213.2      14.0      00:19:30
  8742       9   4,035      36,315       226.4      14.9      00:19:08
  9235       8   4,035      32,280       240.1      15.8      00:18:45
  9676       9   4,035      36,315       252.4      16.6      00:18:30
 10042       8   4,035      32,280       262.1      17.2      00:18:29
 10381       4   4,035      16,140       270.5      17.8      00:18:34
 10675       3   4,035      12,105       278.0      18.2      00:18:42
 10985       6   4,035      24,210       286.2      18.8      00:18:46
 11333       8   4,035      32,280       295.2      19.4      00:18:45
 11683       8   4,035      32,280       304.5      20.0      00:18:43
 12088       6   4,035      24,210       315.3      20.7      00:18:33
 12457       8   4,035      32,280       324.9      21.3      00:18:29
 12797       6   4,035      24,210       333.7      21.9      00:18:27
 13263       3   4,035      12,105       345.8      22.7      00:18:11
 13630      10   4,035      40,350       356.3      23.4      00:18:03
 13939       9   4,035      36,315       364.2      23.9      00:18:04
 14375       9   4,035      36,315       376.1      24.7      00:17:50
 14893       9   4,035      36,315       390.0      25.6      00:17:28
 15257       5   4,035      20,175       400.0      26.3      00:17:21
 15751       9   4,035      36,315       413.2      27.1      00:17:03
 16207       5   4,035      20,175       426.0      28.0      00:16:46
 16602       8   4,035      32,280       436.8      28.7      00:16:37
 16987       4   4,035      16,140       447.2      29.4      00:16:28
 17346       7   4,035      28,245       456.9      30.0      00:16:22
 17687       7   4,035      28,245       466.5      30.6      00:16:16
 18164      10   4,035      40,350       479.3      31.5      00:16:00
 18575       7   4,035      28,245       490.1      32.2      00:15:50
 18914       7   4,035      28,245       499.5      32.8      00:15:44
 19268       6   4,035      24,210       509.5      33.4      00:15:37
 19539       7   4,035      28,245       517.1      33.9      00:15:36
 19790       9   4,035      36,315       524.2      34.4      00:15:36
 20097       8   4,035      32,280       533.0      35.0      00:15:31
 20613       8   4,035      32,280       547.0      35.9      00:15:12
 21100       8   4,035      32,280       560.2      36.8      00:14:56
 21555       7   4,035      28,245       571.7      37.5      00:14:44
 22035      10   4,035      40,350       583.7      38.3      00:14:31
 22433       6   4,035      24,210       593.6      39.0      00:14:23
 22747       9   4,035      36,315       601.7      39.5      00:14:19
 23160       9   4,035      36,315       612.3      40.2      00:14:10
 23613       9   4,035      36,315       624.0      41.0      00:13:58
 24024       5   4,035      20,175       634.9      41.7      00:13:47
 24423       9   4,035      36,315       644.9      42.3      00:13:39
 24783       9   4,035      36,315       654.7      43.0      00:13:31
 25200       5   4,035      20,175       665.8      43.7      00:13:20
 25621       6   4,035      24,210       676.9      44.4      00:13:09
 25911       6   4,035      24,210       684.8      44.9      00:13:05
 26266      10   4,035      40,350       694.5      45.6      00:12:57
 26736       6   4,035      24,210       706.4      46.4      00:12:45
 27186      10   4,035      40,350       718.5      47.2      00:12:32
 27591       9   4,035      36,315       729.3      47.9      00:12:22
 28056       8   4,035      32,280       741.9      48.7      00:12:08
 28541      10   4,035      40,350       755.5      49.6      00:11:53
 28923       9   4,035      36,315       766.0      50.3      00:11:43
 29370      10   4,035      40,350       778.2      51.1      00:11:31
 29853       7   4,035      28,245       791.3      51.9      00:11:17
 30284       7   4,035      28,245       802.9      52.7      00:11:05
 30678       5   4,035      20,175       813.9      53.4      00:10:55
 31030       5   4,035      20,175       823.5      54.0      00:10:47
 31453      10   4,035      40,350       835.2      54.8      00:10:36
 31834       8   4,035      32,280       845.9      55.5      00:10:26
 32170       6   4,035      24,210       855.5      56.1      00:10:18
 32513       9   4,035      36,315       865.4      56.8      00:10:09
 32790       8   4,035      32,280       873.0      57.3      00:10:05
 33114       5   4,035      20,175       882.1      57.9      00:09:57
 33485       6   4,035      24,210       892.3      58.6      00:09:48
 33895       7   4,035      28,245       904.0      59.3      00:09:37
 34316      10   4,035      40,350       916.0      60.1      00:09:25
 34779      10   4,035      40,350       929.0      61.0      00:09:11
 35257       7   4,035      28,245       942.4      61.9      00:08:57
 35732       5   4,035      20,175       955.6      62.7      00:08:44
 36033       9   4,035      36,315       964.0      63.3      00:08:37
 36393      10   4,035      40,350       974.1      63.9      00:08:28
 36665       8   4,035      32,280       981.6      64.4      00:08:23
 36902       5   4,035      20,175       987.8      64.8      00:08:20
 37148       6   4,035      24,210       994.3      65.3      00:08:16
 37424       7   4,035      28,245     1,001.3      65.7      00:08:11
 37712       9   4,035      36,315     1,008.7      66.2      00:08:06
 38009       6   4,035      24,210     1,016.7      66.7      00:07:59
 38300       5   4,035      20,175     1,024.7      67.3      00:07:53
 38571      10   4,035      40,350     1,032.3      67.8      00:07:47
 38826       8   4,035      32,280     1,039.2      68.2      00:07:42
 39129       5   4,035      20,175     1,047.5      68.8      00:07:35
 39518       8   4,035      32,280     1,057.7      69.4      00:07:26
 39937       5   4,035      20,175     1,068.9      70.2      00:07:15
 40256      10   4,035      40,350     1,077.4      70.7      00:07:07
 40659       8   4,035      32,280     1,088.5      71.4      00:06:56
 41044      10   4,035      40,350     1,099.2      72.1      00:06:46
 41396       5   4,035      20,175     1,108.6      72.8      00:06:37
 41853       8   4,035      32,280     1,121.2      73.6      00:06:25
 42235       5   4,035      20,175     1,131.1      74.2      00:06:15
 42587       6   4,035      24,210     1,140.5      74.9      00:06:07
 42885       6   4,035      24,210     1,148.5      75.4      00:05:60
 43178       4   4,035      16,140     1,156.8      75.9      00:05:52
 43476       7   4,035      28,245     1,165.1      76.5      00:05:45
 43783       1   4,035       4,035     1,173.0      77.0      00:05:38
 44085      10   4,035      40,350     1,181.2      77.5      00:05:31
 44488      10   4,035      40,350     1,191.7      78.2      00:05:21
 44888       8   4,035      32,280     1,202.6      78.9      00:05:10
 45246       8   4,035      32,280     1,212.0      79.5      00:05:01
 45609       9   4,035      36,315     1,221.1      80.1      00:04:53
 45926       7   4,035      28,245     1,229.3      80.7      00:04:45
 46265       8   4,035      32,280     1,238.7      81.3      00:04:36
 46609      10   4,035      40,350     1,248.1      81.9      00:04:28
 47053      10   4,035      40,350     1,259.7      82.7      00:04:16
 47422       3   4,035      12,105     1,269.1      83.3      00:04:07
 47824       9   4,035      36,315     1,279.6      84.0      00:03:57
 48251       5   4,035      20,175     1,291.0      84.7      00:03:46
 48622       8   4,035      32,280     1,301.2      85.4      00:03:36
 49066      10   4,035      40,350     1,312.9      86.2      00:03:24
 49507       5   4,035      20,175     1,324.6      86.9      00:03:13
 49964       9   4,035      36,315     1,336.2      87.7      00:03:01
 50400       5   4,035      20,175     1,347.3      88.4      00:02:50
 50824      10   4,035      40,350     1,358.9      89.2      00:02:39
 51260       9   4,035      36,315     1,370.7      90.0      00:02:27
 51664      10   4,035      40,350     1,382.0      90.7      00:02:16
 52058       9   4,035      36,315     1,393.0      91.4      00:02:06
 52433       9   4,035      36,315     1,404.0      92.1      00:01:55
 52737       7   4,035      28,245     1,413.0      92.7      00:01:47
 53133       9   4,035      36,315     1,424.3      93.5      00:01:36
 53535       7   4,035      28,245     1,435.5      94.2      00:01:25
 53884       5   4,035      20,175     1,445.1      94.8      00:01:16
 54291       9   4,035      36,315     1,456.0      95.6      00:01:05
 54643       9   4,035      36,315     1,464.9      96.2      00:00:57
 55017       9   4,035      36,315     1,474.9      96.8      00:00:47
 55406       5   4,035      20,175     1,484.9      97.5      00:00:37
 55764       7   4,035      28,245     1,494.3      98.1      00:00:28
 56136       8   4,035      32,280     1,504.5      98.7      00:00:18
 56494       7   4,035      28,245     1,514.6      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1479.828
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  37,759,100

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Data/Intermediate/ca_blk_pharm_dist.csv saved

. 
. cap log close

. 
end of do-file
