
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Data/Intermediate/ca_Dollar_locations.dta /export/storage_covidvacc
> ine/Data/Intermediate/ca_blk_Dollar_dist.csv 100 100 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/block/geonear.log
  log type:  text
 opened on:  16 Aug 2023, 00:40:15

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Data/Intermediate/ca_Dollar_locations.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Data/Intermediate/ca_blk_Dollar_dist.csv

. di "within: `within'"
within: 100

. di "limit: `limit'"
limit: 100

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
  1444      32     153       4,896         5.8      16.0      00:00:53
  3085      32     154       4,928        12.8      27.3      00:00:53
  4411      50     102       5,100        18.5      41.1      00:00:43
  6146      16     335       5,360        26.0      48.6      00:00:42
  7896      11     319       3,509        34.0      55.1      00:00:41
  9741      19     303       5,757        42.5      62.2      00:00:37
 11318      12     304       3,648        49.5      71.5      00:00:28
 12847      27     153       4,131        55.7      84.9      00:00:14
 14326      24     258       6,192        62.4      94.2      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 1,016     
Bases * Neighbors  (M)  = 383.6          Number of regions         = 15,143    
Computed distances (M)  = 65.96          Total run time (seconds)  = 104.113
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  32,859,913

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file /export/storage_covidvaccine/Data/Intermediate/ca_blk_Dollar_dist.csv
    not found)
file /export/storage_covidvaccine/Data/Intermediate/ca_blk_Dollar_dist.csv save
> d

. 
. cap log close

. 
end of do-file
