
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Data/Intermediate/ca_HighSchools_locations.dta /export/storage_covi
> dvaccine/Data/Intermediate/ca_blk_HighSchools_dist.csv 500 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/block/geonear.log
  log type:  text
 opened on:  29 Sep 2023, 15:19:20

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Data/Intermediate/ca_HighSchools_locatio
> ns.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Data/Intermediate/ca_blk_HighSchools_dist
> .csv

. di "within: `within'"
within: 500

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
  1157       8     674       5,392         4.9       1.9      00:08:24
  2387       6   1,123       6,738        11.3       4.0      00:07:55
  3406       5     978       4,890        18.4       5.8      00:08:05
  4573       3     558       1,674        24.3       8.1      00:07:37
  5763       5     520       2,600        29.3      10.6      00:07:02
  7044       7     640       4,480        34.7      12.9      00:06:46
  8312       7     652       4,564        40.3      15.2      00:06:32
  9562      11     600       6,600        45.8      17.4      00:06:20
 10576       5     687       3,435        50.1      19.2      00:06:18
 11644       9     722       6,498        55.1      21.1      00:06:15
 12946       6     798       4,788        60.9      23.3      00:06:01
 14041       5     726       3,630        66.5      25.3      00:05:55
 15241       7     871       6,097        73.1      27.4      00:05:45
 16426       6     657       3,942        78.9      29.5      00:05:34
 17762       2     639       1,278        84.8      31.9      00:05:20
 19015       9     666       5,994        90.6      34.2      00:05:08
 20255       6     724       4,344        96.5      36.5      00:04:56
 21028       5   1,090       5,450       101.1      37.7      00:04:57
 22094       5     830       4,150       106.1      39.5      00:04:51
 23137       9     783       7,047       111.6      41.3      00:04:45
 24198       5     797       3,985       117.1      43.1      00:04:37
 25336       7     873       6,111       123.3      45.1      00:04:28
 26414       6     840       5,040       130.1      47.0      00:04:20
 27629       9     851       7,659       136.9      49.1      00:04:09
 28696       5     827       4,135       142.9      51.1      00:03:60
 29511       8     859       6,872       147.6      52.5      00:03:55
 30709       8     921       7,368       155.0      54.7      00:03:44
 31955      10     836       8,360       163.0      57.0      00:03:32
 33015       8     830       6,640       169.2      58.9      00:03:22
 34097       6     870       5,220       175.6      60.9      00:03:12
 35237       5     854       4,270       182.5      63.0      00:03:02
 36327       6     780       4,680       188.7      65.0      00:02:52
 37426       4     741       2,964       194.1      66.9      00:02:44
 38475       7     789       5,523       199.4      68.8      00:02:34
 39757       5     801       4,005       206.1      71.0      00:02:23
 41075       5     740       3,700       213.2      73.4      00:02:11
 41832       6   1,239       7,434       218.5      74.7      00:02:05
 42648      10   1,206      12,060       225.1      76.2      00:01:59
 43481      10   1,245      12,450       231.7      77.6      00:01:52
 44366       4   1,243       4,972       238.9      79.2      00:01:45
 45356       9   1,209      10,881       246.7      80.9      00:01:37
 46388       7   1,240       8,680       255.0      82.7      00:01:28
 47461       8   1,115       8,920       262.6      84.5      00:01:19
 48575       7   1,081       7,567       270.2      86.5      00:01:09
 49466      10   1,225      12,250       277.0      88.0      00:01:01
 50234      10     987       9,870       282.2      89.3      00:00:55
 51141       7     928       6,496       288.3      91.0      00:00:47
 52143      10     928       9,280       295.1      92.9      00:00:37
 53192      10     978       9,780       301.9      94.8      00:00:27
 54213       7   1,061       7,427       308.8      96.6      00:00:18
 55135       4   1,163       4,652       315.8      98.1      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 1,290     
Bases * Neighbors  (M)  = 487.1          Number of regions         = 56,157    
Computed distances (M)  = 322.14         Total run time (seconds)  = 525.467
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Data/Intermediate/ca_blk_HighSchools_dist.cs
    > v not found)
file /export/storage_covidvaccine/Data/Intermediate/ca_blk_HighSchools_dist.csv
>  saved

. 
. cap log close

. 
end of do-file
