
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Data/Intermediate/ca_Coffee_locations.dta /export/storage_covidvacc
> ine/Data/Intermediate/ca_blk_Coffee_dist.csv 500 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/block/geonear.log
  log type:  text
 opened on:  29 Sep 2023, 15:13:43

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Data/Intermediate/ca_Coffee_locations.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Data/Intermediate/ca_blk_Coffee_dist.csv

. di "within: `within'"
within: 500

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   816       4   1,384       5,536         7.2       1.3      00:12:49
  1725       9   1,390      12,510        15.3       2.8      00:11:26
  2403       6   1,687      10,122        24.2       4.0      00:12:06
  2990       8   2,085      16,680        33.7       5.0      00:12:47
  3640       7   2,485      17,395        43.7       6.1      00:12:48
  4532       7   1,268       8,876        52.2       7.6      00:12:10
  5323       5   1,255       6,275        58.6       9.0      00:11:51
  6366       7   1,310       9,170        65.8      10.7      00:11:08
  7302       6   1,352       8,112        73.6      12.3      00:10:44
  8219       8   1,364      10,912        82.1      13.9      00:10:19
  9164      10   1,375      13,750        90.9      15.6      00:09:54
  9982       4   1,344       5,376        98.5      17.1      00:09:42
 10883       6   1,346       8,076       105.9      18.6      00:09:29
 11692       6   1,562       9,372       113.3      20.0      00:09:20
 12522      10   1,372      13,720       121.9      21.4      00:09:10
 13375      10   1,412      14,120       129.8      22.9      00:08:59
 14040       3   1,581       4,743       137.8      24.1      00:08:56
 14914      10   2,005      20,050       147.2      25.6      00:08:43
 15719       5   1,871       9,355       157.3      27.1      00:08:33
 16481       8   1,833      14,664       167.4      28.5      00:08:23
 17318       4   1,388       5,552       175.1      29.9      00:08:12
 18128       8   1,346      10,768       182.7      31.4      00:08:01
 18894       8   1,427      11,416       189.9      32.7      00:07:53
 19759       7   1,411       9,877       198.6      34.3      00:07:39
 20556      10   1,653      16,530       206.5      35.8      00:07:29
 21220      10   3,134      31,340       213.6      37.0      00:07:24
 21709       2   3,015       6,030       221.9      37.8      00:07:25
 22300      10   2,012      20,120       229.5      38.7      00:07:23
 22928       6   2,121      12,726       237.2      39.8      00:07:19
 23549       8   2,030      16,240       245.6      40.8      00:07:15
 24154       6   2,049      12,294       253.6      41.9      00:07:10
 24717       8   2,058      16,464       261.2      42.9      00:07:07
 25403       8   2,032      16,256       270.4      44.1      00:06:59
 25895       5   2,157      10,785       277.4      44.9      00:06:57
 26475       8   2,546      20,368       286.1      45.9      00:06:52
 27069       6   2,116      12,696       295.8      47.0      00:06:47
 27665       7   2,109      14,763       304.1      48.0      00:06:41
 28360       9   2,154      19,386       314.2      49.2      00:06:32
 29053      10   2,069      20,690       324.2      50.5      00:06:22
 29739       8   2,090      16,720       333.8      51.7      00:06:14
 30360       9   2,235      20,115       343.0      52.8      00:06:06
 30927      10   2,387      23,870       351.8      53.9      00:05:60
 31519      10   2,212      22,120       361.1      54.9      00:05:53
 32184       8   2,270      18,160       371.7      56.2      00:05:44
 32790       8   2,146      17,168       381.1      57.3      00:05:36
 33343       4   2,112       8,448       389.3      58.3      00:05:29
 33982       9   2,112      19,008       398.8      59.5      00:05:20
 34667       6   2,164      12,984       409.0      60.8      00:05:10
 35369       8   2,194      17,552       419.9      62.1      00:04:60
 36109       7   2,133      14,931       430.9      63.4      00:04:49
 36713       5   2,028      10,140       439.7      64.5      00:04:41
 37334       4   1,963       7,852       447.7      65.6      00:04:33
 37949       7   1,960      13,720       455.7      66.6      00:04:26
 38519      10   1,960      19,600       463.4      67.7      00:04:18
 39119       6   2,034      12,204       471.4      68.7      00:04:10
 39849       6   2,068      12,408       481.1      70.0      00:04:00
 40557       8   2,099      16,792       490.9      71.3      00:03:50
 41230       7   2,017      14,119       500.4      72.5      00:03:41
 41829       5   1,960       9,800       508.4      73.5      00:03:32
 42270       2   3,137       6,274       516.1      74.3      00:03:28
 42686       6   2,968      17,808       524.5      75.0      00:03:23
 43056       6   2,977      17,862       532.0      75.7      00:03:19
 43434       7   2,977      20,839       539.9      76.4      00:03:15
 43831       7   2,952      20,664       547.3      77.1      00:03:11
 44249      10   3,128      31,280       555.7      77.8      00:03:05
 44700       7   3,137      21,959       564.9      78.6      00:02:60
 45161       5   3,044      15,220       574.5      79.4      00:02:54
 45624       8   3,138      25,104       583.5      80.2      00:02:48
 46075       9   3,122      28,098       592.7      81.0      00:02:42
 46535      10   3,123      31,230       602.4      81.8      00:02:36
 46957       3   3,136       9,408       611.3      82.5      00:02:30
 47361       8   2,827      22,616       618.8      83.2      00:02:26
 47907       7   2,060      14,420       627.8      84.1      00:02:18
 48520       7   2,025      14,175       637.2      85.2      00:02:08
 49164       9   2,575      23,175       647.5      86.4      00:01:59
 49687       7   3,131      21,917       657.0      87.2      00:01:51
 50093       9   3,131      28,179       665.3      87.9      00:01:46
 50567       9   2,550      22,950       673.9      88.7      00:01:39
 50984       8   2,479      19,832       681.0      89.5      00:01:33
 51450       2   2,385       4,770       688.9      90.3      00:01:26
 51994       4   2,457       9,828       697.9      91.3      00:01:17
 52525       9   2,332      20,988       707.1      92.3      00:01:08
 53074       7   2,295      16,065       716.3      93.4      00:00:59
 53710       6   2,514      15,084       726.6      94.5      00:00:49
 54185       3   2,834       8,502       734.8      95.4      00:00:41
 54720       5   2,797      13,985       744.2      96.3      00:00:33
 55215       3   3,114       9,342       753.5      97.1      00:00:26
 55629       5   3,012      15,060       761.5      97.8      00:00:20
 56124      10   2,258      22,580       770.3      98.7      00:00:12
 56703       5   2,193      10,965       779.2      99.8      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 3,172     
Bases * Neighbors  (M)  = 1,197.7        Number of regions         = 56,821    
Computed distances (M)  = 780.97         Total run time (seconds)  = 908.026
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file /export/storage_covidvaccine/Data/Intermediate/ca_blk_Coffee_dist.csv
    not found)
file /export/storage_covidvaccine/Data/Intermediate/ca_blk_Coffee_dist.csv save
> d

. 
. cap log close

. 
end of do-file
