
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do /mnt/staff/zhli/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /e
> xport/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_c
> ovidvaccine/Data/Intermediate/ca_pharmacy_locations.dta /export/storage_covid
> vaccine/Data/Intermediate/ca_blk_pharm_dist.csv 2000 300 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Data/Intermediate/ca_pharmacy_locations.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Data/Intermediate/ca_blk_pharm_dist.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 300

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   446       3   4,035      12,105        10.3       0.7      00:24:27
   824       6   4,035      24,210        19.9       1.3      00:25:15
  1205       9   4,035      36,315        29.5       1.9      00:25:23
  1691       6   4,035      24,210        42.5       2.8      00:23:15
  2146       7   4,035      28,245        54.0       3.5      00:22:41
  2679      10   4,035      40,350        67.7       4.4      00:21:31
  3200       7   4,035      28,245        81.5       5.4      00:20:39
  3646      10   4,035      40,350        93.6       6.1      00:20:24
  4018       8   4,035      32,280       103.0       6.8      00:20:42
  4406       3   4,035      12,105       112.7       7.4      00:20:53
  4786       8   4,035      32,280       122.9       8.1      00:20:55
  5170       7   4,035      28,245       132.9       8.7      00:20:57
  5519       3   4,035      12,105       141.7       9.3      00:21:09
  5926       7   4,035      28,245       152.1      10.0      00:21:04
  6341       6   4,035      24,210       162.7      10.7      00:20:56
  6691       5   4,035      20,175       171.6      11.3      00:21:02
  7145       3   4,035      12,105       183.1      12.0      00:20:45
  7657       4   4,035      16,140       196.7      12.9      00:20:15
  8166       8   4,035      32,280       210.8      13.8      00:19:44
  8694       8   4,035      32,280       225.2      14.8      00:19:14
  9207       6   4,035      24,210       239.5      15.7      00:18:47
  9627       5   4,035      20,175       251.2      16.5      00:18:35
  9981       9   4,035      36,315       260.7      17.1      00:18:35
 10347       7   4,035      28,245       269.7      17.7      00:18:36
 10726       1   4,035       4,035       279.6      18.4      00:18:33
 11124       8   4,035      32,280       290.0      19.0      00:18:29
 11488       8   4,035      32,280       299.6      19.7      00:18:26
 11879       8   4,035      32,280       309.8      20.4      00:18:20
 12299       9   4,035      36,315       321.0      21.1      00:18:09
 12835       9   4,035      36,315       334.8      22.0      00:17:48
 13364      10   4,035      40,350       348.8      22.9      00:17:26
 13759       7   4,035      28,245       359.7      23.6      00:17:18
 14122       6   4,035      24,210       369.2      24.3      00:17:14
 14517      10   4,035      40,350       380.1      25.0      00:17:05
 14989       5   4,035      20,175       392.8      25.8      00:16:50
 15444      10   4,035      40,350       405.2      26.6      00:16:36
 15967      10   4,035      40,350       419.5      27.6      00:16:16
 16451       8   4,035      32,280       433.1      28.4      00:15:59
 16787      10   4,035      40,350       442.0      29.0      00:15:56
 17134       9   4,035      36,315       451.3      29.6      00:15:52
 17472       9   4,035      36,315       460.8      30.3      00:15:47
 17876       6   4,035      24,210       471.6      31.0      00:15:39
 18369       9   4,035      36,315       485.0      31.9      00:15:22
 18768       8   4,035      32,280       495.8      32.6      00:15:14
 19133       6   4,035      24,210       506.0      33.2      00:15:07
 19494       7   4,035      28,245       516.0      33.9      00:14:60
 19901       8   4,035      32,280       527.5      34.6      00:14:49
 20234       4   4,035      16,140       536.8      35.3      00:14:44
 20608      10   4,035      40,350       547.1      35.9      00:14:36
 20992       7   4,035      28,245       557.6      36.6      00:14:27
 21314       1   4,035       4,035       565.4      37.1      00:14:26
 21696       6   4,035      24,210       575.3      37.8      00:14:19
 22013       5   4,035      20,175       583.4      38.3      00:14:15
 22355       9   4,035      36,315       591.9      38.9      00:14:11
 22652       7   4,035      28,245       599.6      39.4      00:14:09
 22944       4   4,035      16,140       606.7      39.9      00:14:07
 23285       6   4,035      24,210       616.0      40.5      00:14:01
 23720      10   4,035      40,350       627.0      41.2      00:13:51
 24149       8   4,035      32,280       638.2      41.9      00:13:40
 24595       9   4,035      36,315       649.9      42.7      00:13:28
 24991       6   4,035      24,210       660.3      43.4      00:13:18
 25482       9   4,035      36,315       673.7      44.2      00:13:03
 25835      10   4,035      40,350       683.1      44.9      00:12:56
 26234       9   4,035      36,315       693.9      45.6      00:12:46
 26755      10   4,035      40,350       707.4      46.5      00:12:31
 27211       7   4,035      28,245       719.4      47.3      00:12:19
 27617       5   4,035      20,175       730.3      48.0      00:12:08
 28059       7   4,035      28,245       742.4      48.8      00:11:56
 28518       7   4,035      28,245       755.2      49.6      00:11:43
 28909       9   4,035      36,315       766.0      50.3      00:11:33
 29332       7   4,035      28,245       777.5      51.1      00:11:22
 29787       4   4,035      16,140       789.7      51.9      00:11:10
 30122       9   4,035      36,315       798.8      52.5      00:11:03
 30542       6   4,035      24,210       810.5      53.2      00:10:52
 31022       7   4,035      28,245       823.5      54.1      00:10:38
 31500       9   4,035      36,315       836.9      55.0      00:10:24
 32011      10   4,035      40,350       851.4      55.9      00:10:08
 32478       7   4,035      28,245       864.7      56.8      00:09:55
 32867      10   4,035      40,350       875.5      57.5      00:09:45
 33280       8   4,035      32,280       887.1      58.3      00:09:34
 33728       7   4,035      28,245       899.6      59.1      00:09:22
 34200       7   4,035      28,245       913.1      60.0      00:09:08
 34576      10   4,035      40,350       923.6      60.7      00:08:59
 35036       5   4,035      20,175       936.5      61.5      00:08:47
 35450       7   4,035      28,245       948.2      62.3      00:08:36
 35839       9   4,035      36,315       958.9      63.0      00:08:27
 36210       9   4,035      36,315       969.3      63.7      00:08:18
 36580       8   4,035      32,280       979.5      64.3      00:08:09
 36964       9   4,035      36,315       989.8      65.0      00:08:00
 37313       6   4,035      24,210       998.6      65.6      00:07:53
 37672       4   4,035      16,140     1,008.0      66.2      00:07:46
 38030       7   4,035      28,245     1,017.6      66.8      00:07:37
 38378       4   4,035      16,140     1,027.3      67.5      00:07:29
 38657      10   4,035      40,350     1,035.0      68.0      00:07:24
 39009       7   4,035      28,245     1,044.7      68.6      00:07:15
 39387      10   4,035      40,350     1,054.5      69.3      00:07:07
 39826       5   4,035      20,175     1,066.3      70.0      00:06:56
 40186       5   4,035      20,175     1,075.9      70.7      00:06:48
 40658       8   4,035      32,280     1,088.8      71.5      00:06:35
 41072       9   4,035      36,315     1,100.2      72.3      00:06:25
 41458       9   4,035      36,315     1,110.7      73.0      00:06:15
 41800       8   4,035      32,280     1,120.0      73.6      00:06:07
 42041       6   4,035      24,210     1,126.5      74.0      00:06:03
 42347       9   4,035      36,315     1,134.3      74.5      00:05:57
 42677       9   4,035      36,315     1,143.3      75.1      00:05:49
 43012      10   4,035      40,350     1,152.4      75.7      00:05:41
 43329       9   4,035      36,315     1,161.3      76.3      00:05:33
 43681      10   4,035      40,350     1,170.6      76.9      00:05:25
 44028       9   4,035      36,315     1,180.0      77.5      00:05:17
 44401       9   4,035      36,315     1,189.7      78.1      00:05:08
 44892       7   4,035      28,245     1,203.1      79.0      00:04:55
 45322       6   4,035      24,210     1,213.9      79.7      00:04:45
 45719      10   4,035      40,350     1,224.1      80.4      00:04:36
 46123       9   4,035      36,315     1,235.0      81.1      00:04:26
 46489       5   4,035      20,175     1,244.9      81.8      00:04:17
 46930       9   4,035      36,315     1,256.9      82.6      00:04:06
 47268      10   4,035      40,350     1,265.3      83.1      00:03:58
 47660       4   4,035      16,140     1,275.6      83.8      00:03:49
 48083      10   4,035      40,350     1,286.9      84.5      00:03:38
 48477       7   4,035      28,245     1,297.5      85.2      00:03:28
 48862       9   4,035      36,315     1,307.8      85.9      00:03:19
 49341      10   4,035      40,350     1,320.7      86.7      00:03:07
 49687      10   4,035      40,350     1,329.3      87.3      00:02:59
 50171       4   4,035      16,140     1,341.9      88.1      00:02:47
 50522       9   4,035      36,315     1,351.0      88.7      00:02:39
 50887       8   4,035      32,280     1,361.0      89.4      00:02:30
 51277       5   4,035      20,175     1,371.7      90.1      00:02:20
 51623       6   4,035      24,210     1,381.3      90.7      00:02:11
 51981       9   4,035      36,315     1,391.3      91.4      00:02:02
 52330       6   4,035      24,210     1,401.4      92.0      00:01:53
 52752      10   4,035      40,350     1,413.9      92.9      00:01:41
 53157       9   4,035      36,315     1,425.3      93.6      00:01:30
 53561       9   4,035      36,315     1,436.7      94.4      00:01:20
 53958       8   4,035      32,280     1,447.4      95.1      00:01:10
 54295       8   4,035      32,280     1,456.5      95.7      00:01:01
 54740       6   4,035      24,210     1,467.9      96.4      00:00:51
 55141       4   4,035      16,140     1,478.5      97.1      00:00:41
 55513      10   4,035      40,350     1,487.9      97.7      00:00:32
 55891       9   4,035      36,315     1,498.2      98.4      00:00:23
 56262       7   4,035      28,245     1,508.4      99.1      00:00:13
 56620       9   4,035      36,315     1,518.5      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,522.5        Number of regions         = 56,767    
Computed distances (M)  = 1,522.49       Total run time (seconds)  = 1451.176
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  113,196,600

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Data/Intermediate/ca_blk_pharm_dist.csv saved

. 
. cap log close

. 
end of do-file
