
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do /mnt/staff/zhli/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /e
> xport/storage_covidvaccine/Data/Intermediate/ca_bg_coords.dta /export/storage
> _covidvaccine/Data/Intermediate/ca_pharmacy_locations.dta /export/storage_cov
> idvaccine/Data/Intermediate/ca_bg_pharm_dist.csv 

. 
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/staff/zhli/VaxDemandDistance/geonear.log
  log type:  text
 opened on:  19 Jul 2023, 12:07:24

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. 
. use "`baselocs'", clear

. 
. ds
id         latitude   longitude

. 
. geonear id latitude longitude using "`nborlocs'", neighbors(id latitude longi
> tude) report(5)

-------------------------------------------------------------------------------
Unique base locations   = 25,607         Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 103.3          Number of regions         = 366       
Computed distances (M)  = 2.40           Total run time (seconds)  = 4.866
-------------------------------------------------------------------------------

. 
. export delim "`outpath'", replace
(file /export/storage_covidvaccine/Data/Intermediate/ca_bg_pharm_dist.csv not
    found)
file /export/storage_covidvaccine/Data/Intermediate/ca_bg_pharm_dist.csv saved

. 
. cap log close

. 
end of do-file
