
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do /mnt/staff/zhli/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /e
> xport/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_c
> ovidvaccine/Data/Intermediate/ca_pharmacy_locations.dta /export/storage_covid
> vaccine/Data/Intermediate/ca_blk_pharm_dist.csv 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/staff/zhli/VaxDemandDistance/geonear.log
  log type:  text
 opened on:  20 Jul 2023, 13:28:02

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  id

. 
. geonear id latitude longitude using "`nborlocs'", neighbors(id latitude longi
> tude) report(5)

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   628     217      22       4,774         4.3      44.5      00:00:06
  1408     227      28       6,356         9.9      91.2      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 1,545     
Computed distances (M)  = 10.94          Total run time (seconds)  = 10.953
-------------------------------------------------------------------------------

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Data/Intermediate/ca_blk_pharm_dist.csv saved

. 
. cap log close

. 
end of do-file
