-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/geonear.log
  log type:  text
 opened on:  29 Aug 2023, 04:15:52

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000/Dollar
> /assigned/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000/Dollar/
> assigned/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 500

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   816       4   1,792       7,168         9.2       1.3      00:12:49
  1725       9   1,793      16,137        19.6       2.8      00:11:26
  2455       6   3,425      20,550        31.9       4.1      00:11:51
  3061       6   2,554      15,324        44.5       5.1      00:12:27
  3670       3   3,215       9,645        56.8       6.2      00:12:41
  4509       8   1,601      12,808        66.7       7.6      00:12:13
  5420       9   1,054       9,486        75.9       9.2      00:11:35
  6434      10   1,630      16,300        84.4      10.8      00:10:59
  7378       8   1,747      13,976        94.6      12.4      00:10:35
  8342       9   1,767      15,903       106.0      14.1      00:10:08
  9123       9   1,773      15,957       115.4      15.5      00:09:58
  9745       6   1,772      10,632       123.0      16.7      00:09:59
 10310      10   1,520      15,200       129.0      17.6      00:10:08
 10978      10   1,725      17,250       136.2      18.8      00:10:06
 11598       7   2,072      14,504       143.4      19.8      00:10:07
 12221       8   2,111      16,888       151.9      20.9      00:10:05
 13012       9   1,924      17,316       161.3      22.3      00:09:54
 13752       2   2,350       4,700       171.3      23.6      00:09:44
 14380      10   2,011      20,110       180.6      24.7      00:09:40
 15108       6   2,581      15,486       191.2      26.0      00:09:30
 15875       6   2,519      15,114       203.2      27.3      00:09:18
 16583       6   1,759      10,554       214.3      28.6      00:09:09
 17343      10   1,790      17,900       223.3      30.0      00:08:57
 18173      10   1,732      17,320       233.3      31.5      00:08:43
 18920       7   1,847      12,929       242.4      32.8      00:08:33
 19772       7   1,815      12,705       253.4      34.4      00:08:17
 20625       9   2,039      18,351       264.4      35.9      00:08:02
 21197       8   2,724      21,792       272.0      36.9      00:07:59
 21599       7   3,621      25,347       280.6      37.6      00:08:02
 22074       7   2,404      16,828       289.4      38.4      00:08:02
 22674      10   2,417      24,170       298.8      39.4      00:07:58
 23237       7   2,664      18,648       308.6      40.3      00:07:54
 23812       5   2,655      13,275       318.5      41.3      00:07:49
 24398       8   2,767      22,136       328.4      42.3      00:07:45
 24997       7   2,669      18,683       339.1      43.3      00:07:38
 25602       3   2,984       8,952       350.0      44.4      00:07:31
 26121       3   2,844       8,532       360.0      45.3      00:07:27
 26668       7   3,269      22,883       371.0      46.2      00:07:22
 27241      10   2,796      27,960       382.7      47.3      00:07:16
 27774       4   2,793      11,172       392.5      48.2      00:07:10
 28448      10   2,838      28,380       405.4      49.4      00:07:00
 29039       4   2,724      10,896       416.7      50.5      00:06:52
 29688       7   2,747      19,229       428.5      51.6      00:06:43
 30283      10   2,892      28,920       440.1      52.7      00:06:35
 30879       7   3,075      21,525       452.2      53.8      00:06:27
 31419       8   2,979      23,832       463.2      54.8      00:06:20
 31988       7   3,036      21,252       475.1      55.8      00:06:12
 32510       3   2,820       8,460       486.2      56.8      00:06:05
 32940       9   2,848      25,632       494.5      57.6      00:06:01
 33390       5   2,772      13,860       503.2      58.4      00:05:57
 33874       9   2,794      25,146       512.6      59.3      00:05:50
 34413       7   2,861      20,027       523.2      60.3      00:05:43
 35027       7   2,927      20,489       535.5      61.4      00:05:33
 35645       7   2,932      20,524       548.0      62.6      00:05:23
 36283       8   2,817      22,536       560.4      63.7      00:05:13
 36866       8   2,665      21,320       571.2      64.8      00:05:05
 37449       8   2,639      21,112       581.0      65.8      00:04:57
 38007       7   2,545      17,815       590.4      66.7      00:04:49
 38542      10   2,536      25,360       599.9      67.7      00:04:42
 39098       8   2,669      21,352       609.5      68.7      00:04:34
 39733       6   2,653      15,918       620.5      69.8      00:04:24
 40428       6   2,706      16,236       633.0      71.0      00:04:13
 41079       7   2,653      18,571       645.3      72.2      00:04:03
 41536       5   2,561      12,805       653.3      73.0      00:03:57
 42037      10   3,951      39,510       662.4      73.9      00:03:50
 42453      10   3,944      39,440       673.1      74.6      00:03:45
 42843      10   3,810      38,100       682.8      75.3      00:03:40
 43125       8   3,793      30,344       690.2      75.8      00:03:37
 43381      10   3,808      38,080       697.0      76.3      00:03:35
 43643       7   3,608      25,256       703.4      76.7      00:03:32
 43893       8   3,793      30,344       709.6      77.2      00:03:30
 44218      10   3,940      39,400       717.8      77.8      00:03:26
 44463       8   3,933      31,464       724.0      78.2      00:03:24
 44729       2   3,945       7,890       731.0      78.6      00:03:21
 44985       7   3,946      27,622       737.8      79.1      00:03:18
 45293       6   3,891      23,346       745.5      79.6      00:03:15
 45611       6   3,953      23,718       753.3      80.2      00:03:11
 45946      10   3,902      39,020       761.7      80.7      00:03:07
 46287       7   3,908      27,356       770.9      81.3      00:03:01
 46664       4   3,900      15,600       780.7      82.0      00:02:56
 47067       3   3,929      11,787       791.0      82.7      00:02:50
 47444       7   3,416      23,912       799.9      83.3      00:02:44
 47890      10   2,685      26,850       809.2      84.1      00:02:37
 48433       6   2,451      14,706       820.0      85.1      00:02:28
 49021       6   3,529      21,174       831.3      86.1      00:02:17
 49526       4   3,931      15,724       843.0      87.0      00:02:09
 49866       7   3,909      27,363       851.3      87.5      00:02:04
 50129       8   3,926      31,408       858.1      88.0      00:02:00
 50502       7   3,271      22,897       866.6      88.6      00:01:55
 50886       5   3,196      15,980       874.9      89.3      00:01:48
 51275       9   3,300      29,700       883.5      90.0      00:01:41
 51692       6   3,112      18,672       892.6      90.8      00:01:34
 52134       4   3,183      12,732       902.2      91.6      00:01:26
 52584      10   3,044      30,440       912.2      92.4      00:01:17
 53067       5   2,986      14,930       922.7      93.4      00:01:08
 53621       4   3,045      12,180       934.4      94.4      00:00:57
 54052       2   3,534       7,068       943.6      95.1      00:00:50
 54486       5   3,675      18,375       953.3      95.9      00:00:42
 54935      10   3,489      34,890       963.6      96.7      00:00:34
 55316      10   3,888      38,880       973.0      97.3      00:00:28
 55671       8   3,758      30,064       981.5      97.9      00:00:22
 56098       6   2,984      17,904       991.1      98.7      00:00:14
 56444       5   2,951      14,755       998.2      99.3      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,005.67       Total run time (seconds)  = 1047.02
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000/Dollar/assi
> gned/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close
