
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A600_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:22

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   424       5   4,635      23,175        11.2       0.6      00:25:49
   875       7   4,635      32,445        23.8       1.4      00:24:09
  1307       4   4,635      18,540        36.8       2.1      00:23:18
  1745       5   4,635      23,175        50.2       2.9      00:22:36
  2194       6   4,635      27,810        63.3       3.6      00:22:13
  2651       3   4,635      13,905        76.8       4.4      00:21:49
  3090      10   4,635      46,350        89.8       5.1      00:21:35
  3502       7   4,635      32,445       102.9       5.9      00:21:22
  3920       5   4,635      23,175       115.5       6.6      00:21:15
  4257       7   4,635      32,445       125.1       7.2      00:21:40
  4588       6   4,635      27,810       134.9       7.7      00:21:59
  4912       9   4,635      41,715       144.8       8.3      00:22:12
  5202       8   4,635      37,080       153.5       8.8      00:22:34
  5520       6   4,635      27,810       162.6       9.3      00:22:48
  5845       9   4,635      41,715       172.0       9.8      00:22:58
  6172      10   4,635      46,350       181.9      10.4      00:23:02
  6490       6   4,635      27,810       191.2      10.9      00:23:08
  6800       6   4,635      27,810       200.1      11.4      00:23:16
  7164       3   4,635      13,905       210.7      12.0      00:23:10
  7532       9   4,635      41,715       221.9      12.7      00:22:59
  7884       5   4,635      23,175       232.8      13.3      00:22:50
  8213       5   4,635      23,175       243.4      13.9      00:22:44
  8552       7   4,635      32,445       254.2      14.5      00:22:35
  8947       2   4,635       9,270       266.6      15.2      00:22:17
  9296      10   4,635      46,350       277.7      15.9      00:22:07
  9581      10   4,635      46,350       286.8      16.4      00:22:09
  9869       5   4,635      23,175       295.9      16.9      00:22:09
 10160       5   4,635      23,175       304.2      17.4      00:22:13
 10449       5   4,635      23,175       312.8      17.9      00:22:15
 10791       9   4,635      41,715       322.8      18.4      00:22:08
 11159       7   4,635      32,445       333.9      19.1      00:21:57
 11464       7   4,635      32,445       343.2      19.6      00:21:54
 11793       5   4,635      23,175       353.1      20.2      00:21:48
 12125       8   4,635      37,080       363.3      20.8      00:21:40
 12501       7   4,635      32,445       374.6      21.4      00:21:27
 12876       8   4,635      37,080       385.7      22.0      00:21:16
 13219      10   4,635      46,350       396.1      22.6      00:21:07
 13567       9   4,635      41,715       407.1      23.3      00:20:56
 13843       9   4,635      41,715       415.5      23.7      00:20:55
 14151       9   4,635      41,715       424.8      24.3      00:20:50
 14455       8   4,635      37,080       434.4      24.8      00:20:44
 14786      10   4,635      46,350       444.6      25.4      00:20:35
 15198       9   4,635      41,715       457.7      26.2      00:20:16
 15644       9   4,635      41,715       471.3      26.9      00:19:56
 16053       9   4,635      41,715       484.4      27.7      00:19:38
 16428       7   4,635      32,445       496.4      28.4      00:19:23
 16705       8   4,635      37,080       504.9      28.9      00:19:21
 16943       5   4,635      23,175       512.2      29.3      00:19:22
 17189       6   4,635      27,810       519.8      29.7      00:19:22
 17422       7   4,635      32,445       527.3      30.1      00:19:22
 17667       6   4,635      27,810       535.3      30.6      00:19:19
 17945       8   4,635      37,080       543.6      31.1      00:19:16
 18281       5   4,635      23,175       554.2      31.7      00:19:06
 18614       5   4,635      23,175       564.2      32.2      00:18:57
 18894       8   4,635      37,080       573.2      32.7      00:18:51
 19197       7   4,635      32,445       583.0      33.3      00:18:43
 19565      10   4,635      46,350       594.8      34.0      00:18:29
 19957       9   4,635      41,715       607.6      34.7      00:18:13
 20328       8   4,635      37,080       619.3      35.4      00:17:59
 20648       9   4,635      41,715       629.5      36.0      00:17:50
 20940       5   4,635      23,175       638.7      36.5      00:17:43
 21297       8   4,635      37,080       648.9      37.1      00:17:34
 21621       8   4,635      37,080       658.5      37.6      00:17:26
 21955       9   4,635      41,715       668.1      38.2      00:17:18
 22309      10   4,635      46,350       678.3      38.8      00:17:09
 22627       6   4,635      27,810       687.6      39.3      00:17:01
 22938       5   4,635      23,175       696.4      39.8      00:16:55
 23216       9   4,635      41,715       705.1      40.3      00:16:49
 23467       9   4,635      41,715       712.7      40.7      00:16:46
 23754       4   4,635      18,540       721.0      41.2      00:16:41
 24018       5   4,635      23,175       729.2      41.7      00:16:36
 24403      10   4,635      46,350       740.1      42.3      00:16:24
 24821       5   4,635      23,175       753.2      43.0      00:16:08
 25243       3   4,635      13,905       766.2      43.8      00:15:52
 25618       7   4,635      32,445       777.5      44.4      00:15:40
 25862       8   4,635      37,080       785.2      44.9      00:15:35
 26136       4   4,635      18,540       793.7      45.3      00:15:29
 26481       6   4,635      27,810       804.0      45.9      00:15:19
 26833       4   4,635      18,540       814.5      46.5      00:15:09
 27208       7   4,635      32,445       826.0      47.2      00:14:57
 27531      10   4,635      46,350       835.9      47.8      00:14:47
 27834       9   4,635      41,715       845.3      48.3      00:14:39
 28168       6   4,635      27,810       855.9      48.9      00:14:29
 28549       9   4,635      41,715       868.1      49.6      00:14:15
 28829       8   4,635      37,080       877.0      50.1      00:14:08
 29095       9   4,635      41,715       885.4      50.6      00:14:01
 29415       8   4,635      37,080       895.3      51.2      00:13:52
 29791       8   4,635      37,080       906.9      51.8      00:13:40
 30115       5   4,635      23,175       917.0      52.4      00:13:30
 30466       8   4,635      37,080       928.2      53.0      00:13:18
 30853       7   4,635      32,445       940.5      53.7      00:13:05
 31253       9   4,635      41,715       953.0      54.5      00:12:51
 31673       9   4,635      41,715       966.4      55.2      00:12:35
 32121       7   4,635      32,445       981.1      56.1      00:12:18
 32529       9   4,635      41,715       994.5      56.8      00:12:03
 32814       7   4,635      32,445     1,003.6      57.3      00:11:55
 33112       8   4,635      37,080     1,013.2      57.9      00:11:47
 33472       8   4,635      37,080     1,024.6      58.5      00:11:35
 33850      10   4,635      46,350     1,036.9      59.2      00:11:22
 34216      10   4,635      46,350     1,048.9      59.9      00:11:10
 34652       7   4,635      32,445     1,062.9      60.7      00:10:54
 35062       7   4,635      32,445     1,076.2      61.5      00:10:40
 35465      10   4,635      46,350     1,089.3      62.2      00:10:26
 35890      10   4,635      46,350     1,102.7      63.0      00:10:12
 36344      10   4,635      46,350     1,117.4      63.8      00:09:56
 36697       2   4,635       9,270     1,128.4      64.5      00:09:45
 36984       4   4,635      18,540     1,137.3      65.0      00:09:38
 37266       6   4,635      27,810     1,145.4      65.4      00:09:31
 37549       7   4,635      32,445     1,153.8      65.9      00:09:24
 37828      10   4,635      46,350     1,162.2      66.4      00:09:17
 38100       7   4,635      32,445     1,170.8      66.9      00:09:10
 38372       5   4,635      23,175     1,179.4      67.4      00:09:03
 38686      10   4,635      46,350     1,189.4      68.0      00:08:54
 39049       7   4,635      32,445     1,200.9      68.6      00:08:42
 39310       6   4,635      27,810     1,208.6      69.1      00:08:36
 39575       6   4,635      27,810     1,216.7      69.5      00:08:29
 39869       7   4,635      32,445     1,225.8      70.0      00:08:21
 40295       6   4,635      27,810     1,238.7      70.8      00:08:08
 40740       8   4,635      37,080     1,252.9      71.6      00:07:53
 41130       7   4,635      32,445     1,265.3      72.3      00:07:41
 41474       8   4,635      37,080     1,276.0      72.9      00:07:30
 41847       6   4,635      27,810     1,287.7      73.6      00:07:19
 42172       5   4,635      23,175     1,297.5      74.1      00:07:10
 42489       6   4,635      27,810     1,307.2      74.7      00:07:01
 42806       7   4,635      32,445     1,316.8      75.2      00:06:52
 43110       7   4,635      32,445     1,326.5      75.8      00:06:43
 43412       7   4,635      32,445     1,336.3      76.4      00:06:34
 43744       5   4,635      23,175     1,346.2      76.9      00:06:25
 44033       6   4,635      27,810     1,355.2      77.4      00:06:17
 44294       8   4,635      37,080     1,363.2      77.9      00:06:10
 44550       7   4,635      32,445     1,370.9      78.3      00:06:03
 44819      10   4,635      46,350     1,379.2      78.8      00:05:56
 45088      10   4,635      46,350     1,387.6      79.3      00:05:48
 45395       7   4,635      32,445     1,396.3      79.8      00:05:40
 45676       8   4,635      37,080     1,404.6      80.3      00:05:33
 45951       6   4,635      27,810     1,412.8      80.7      00:05:25
 46256       6   4,635      27,810     1,422.6      81.3      00:05:16
 46585      10   4,635      46,350     1,432.9      81.9      00:05:06
 46966       7   4,635      32,445     1,444.7      82.5      00:04:54
 47286       5   4,635      23,175     1,453.7      83.1      00:04:46
 47635       5   4,635      23,175     1,464.1      83.7      00:04:36
 47940       5   4,635      23,175     1,473.5      84.2      00:04:27
 48247      10   4,635      46,350     1,482.9      84.7      00:04:18
 48551       8   4,635      37,080     1,492.4      85.3      00:04:09
 48898       6   4,635      27,810     1,503.1      85.9      00:03:59
 49233       8   4,635      37,080     1,513.7      86.5      00:03:48
 49516       8   4,635      37,080     1,521.8      87.0      00:03:41
 49823       6   4,635      27,810     1,530.6      87.5      00:03:33
 50131      10   4,635      46,350     1,540.0      88.0      00:03:24
 50442       6   4,635      27,810     1,549.0      88.5      00:03:15
 50772       6   4,635      27,810     1,559.3      89.1      00:03:05
 51084       9   4,635      41,715     1,569.4      89.7      00:02:55
 51408       9   4,635      41,715     1,579.3      90.2      00:02:46
 51737       5   4,635      23,175     1,590.0      90.8      00:02:35
 52083      10   4,635      46,350     1,601.0      91.5      00:02:25
 52458       8   4,635      37,080     1,613.5      92.2      00:02:12
 52832       4   4,635      18,540     1,626.2      92.9      00:01:60
 53221       9   4,635      41,715     1,638.9      93.6      00:01:47
 53617       6   4,635      27,810     1,651.6      94.4      00:01:35
 53925      10   4,635      46,350     1,661.2      94.9      00:01:26
 54194       5   4,635      23,175     1,669.5      95.4      00:01:18
 54497       6   4,635      27,810     1,678.5      95.9      00:01:09
 54880       8   4,635      37,080     1,690.0      96.6      00:00:58
 55223       6   4,635      27,810     1,700.3      97.2      00:00:48
 55521       6   4,635      27,810     1,709.1      97.7      00:00:40
 55784       7   4,635      32,445     1,717.1      98.1      00:00:32
 56046       9   4,635      41,715     1,725.4      98.6      00:00:24
 56339       8   4,635      37,080     1,734.7      99.1      00:00:15
 56705       6   4,635      27,810     1,746.5      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1701.725
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
