
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A900_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:26

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   377       7   4,935      34,545        10.6       0.6      00:29:07
   768       9   4,935      44,415        22.3       1.2      00:27:31
  1163       8   4,935      39,480        34.5       1.9      00:26:32
  1556       3   4,935      14,805        47.3       2.5      00:25:39
  1937       5   4,935      24,675        59.2       3.2      00:25:26
  2295       4   4,935      19,740        70.7       3.8      00:25:25
  2679       6   4,935      29,610        82.6       4.4      00:25:12
  3060       9   4,935      44,415        94.7       5.1      00:24:56
  3417       2   4,935       9,870       106.7       5.7      00:24:43
  3772       8   4,935      39,480       118.4       6.4      00:24:36
  4096      10   4,935      49,350       128.3       6.9      00:24:50
  4399      10   4,935      49,350       137.4       7.4      00:25:10
  4692       5   4,935      24,675       147.1       7.9      00:25:19
  5018       4   4,935      19,740       157.5       8.5      00:25:19
  5327       5   4,935      24,675       167.3       9.0      00:25:23
  5604       7   4,935      34,545       175.7       9.4      00:25:40
  5889       5   4,935      24,675       184.4       9.9      00:25:51
  6190      10   4,935      49,350       194.1      10.4      00:25:51
  6476       9   4,935      44,415       203.1      10.9      00:25:56
  6774       7   4,935      34,545       212.3      11.4      00:25:58
  7087       5   4,935      24,675       222.1      11.9      00:25:54
  7413       9   4,935      44,415       232.5      12.5      00:25:45
  7754       6   4,935      29,610       243.4      13.1      00:25:33
  8081       7   4,935      34,545       254.6      13.7      00:25:19
  8418       8   4,935      39,480       266.1      14.3      00:25:03
  8772      10   4,935      49,350       277.9      14.9      00:24:46
  9096       8   4,935      39,480       288.8      15.5      00:24:34
  9415       9   4,935      44,415       299.6      16.1      00:24:24
  9733       7   4,935      34,545       310.6      16.7      00:24:12
 10052       8   4,935      39,480       320.8      17.2      00:24:05
 10381       4   4,935      19,740       330.8      17.8      00:23:59
 10677       9   4,935      44,415       340.2      18.3      00:23:55
 11013       9   4,935      44,415       351.0      18.8      00:23:44
 11275       9   4,935      44,415       359.2      19.3      00:23:46
 11503       5   4,935      24,675       366.7      19.7      00:23:51
 11796       8   4,935      39,480       376.0      20.2      00:23:46
 12093       9   4,935      44,415       385.8      20.7      00:23:40
 12427       6   4,935      29,610       396.5      21.3      00:23:28
 12847       6   4,935      29,610       409.6      22.0      00:23:07
 13242       8   4,935      39,480       422.4      22.7      00:22:47
 13601      10   4,935      49,350       434.6      23.3      00:22:30
 13905      10   4,935      49,350       444.5      23.9      00:22:23
 14180       6   4,935      29,610       453.3      24.3      00:22:20
 14440      10   4,935      49,350       462.0      24.8      00:22:17
 14733       9   4,935      44,415       471.6      25.3      00:22:10
 15086       7   4,935      34,545       483.4      25.9      00:21:55
 15447       8   4,935      39,480       495.4      26.6      00:21:40
 15817       6   4,935      29,610       507.6      27.2      00:21:24
 16194       6   4,935      29,610       520.6      27.9      00:21:06
 16561       1   4,935       4,935       533.0      28.6      00:20:50
 16838       7   4,935      34,545       542.0      29.1      00:20:46
 17079       9   4,935      44,415       550.0      29.5      00:20:44
 17317       5   4,935      24,675       557.8      29.9      00:20:43
 17555       6   4,935      29,610       566.2      30.4      00:20:40
 17842      10   4,935      49,350       575.4      30.9      00:20:34
 18165       7   4,935      34,545       586.3      31.5      00:20:22
 18504       8   4,935      39,480       597.0      32.0      00:20:12
 18747       6   4,935      29,610       605.4      32.5      00:20:08
 18991       7   4,935      34,545       613.7      32.9      00:20:04
 19239      10   4,935      49,350       622.2      33.4      00:19:59
 19653       8   4,935      39,480       636.2      34.1      00:19:39
 20036      10   4,935      49,350       649.7      34.9      00:19:21
 20434       8   4,935      39,480       662.9      35.6      00:19:03
 20710       7   4,935      34,545       672.3      36.1      00:18:56
 21001       7   4,935      34,545       682.0      36.6      00:18:48
 21362       7   4,935      34,545       692.8      37.2      00:18:38
 21700       8   4,935      39,480       703.6      37.8      00:18:27
 22005       9   4,935      44,415       713.0      38.3      00:18:19
 22296       8   4,935      39,480       721.7      38.7      00:18:14
 22629       8   4,935      39,480       732.2      39.3      00:18:04
 22971       9   4,935      44,415       742.6      39.9      00:17:54
 23226       8   4,935      39,480       751.1      40.3      00:17:49
 23498       9   4,935      44,415       759.7      40.8      00:17:43
 23746      10   4,935      49,350       767.4      41.2      00:17:39
 23987       3   4,935      14,805       775.3      41.6      00:17:35
 24303       4   4,935      19,740       785.1      42.1      00:17:26
 24692       9   4,935      44,415       797.9      42.8      00:17:10
 25074       4   4,935      19,740       810.1      43.5      00:16:56
 25443       7   4,935      34,545       822.3      44.1      00:16:42
 25739       9   4,935      44,415       831.8      44.6      00:16:34
 25961       8   4,935      39,480       839.2      45.0      00:16:31
 26214       7   4,935      34,545       847.6      45.5      00:16:25
 26584      10   4,935      49,350       859.3      46.1      00:16:12
 26955       8   4,935      39,480       871.2      46.8      00:15:59
 27275       6   4,935      29,610       881.6      47.3      00:15:49
 27582       7   4,935      34,545       891.6      47.8      00:15:39
 27917       6   4,935      29,610       902.9      48.5      00:15:28
 28330       6   4,935      29,610       916.7      49.2      00:15:11
 28718       9   4,935      44,415       929.9      49.9      00:14:55
 29001       8   4,935      39,480       939.6      50.4      00:14:47
 29300      10   4,935      49,350       949.3      50.9      00:14:38
 29584       7   4,935      34,545       958.7      51.4      00:14:30
 29829       8   4,935      39,480       966.9      51.9      00:14:24
 30056       8   4,935      39,480       974.5      52.3      00:14:19
 30285       8   4,935      39,480       982.1      52.7      00:14:14
 30595      10   4,935      49,350       992.7      53.3      00:14:04
 30993      10   4,935      49,350     1,006.0      54.0      00:13:49
 31402       8   4,935      39,480     1,019.7      54.7      00:13:33
 31802       8   4,935      39,480     1,033.5      55.5      00:13:17
 32215      10   4,935      49,350     1,047.9      56.2      00:12:60
 32579      10   4,935      49,350     1,060.5      56.9      00:12:46
 32816       7   4,935      34,545     1,068.6      57.3      00:12:40
 33040       8   4,935      39,480     1,076.3      57.8      00:12:35
 33316       7   4,935      34,545     1,085.7      58.3      00:12:27
 33576       8   4,935      39,480     1,094.6      58.7      00:12:19
 33854       5   4,935      24,675     1,104.1      59.3      00:12:10
 34180       6   4,935      29,610     1,115.6      59.9      00:11:59
 34609       4   4,935      19,740     1,130.2      60.7      00:11:42
 35033      10   4,935      49,350     1,144.9      61.4      00:11:25
 35442       6   4,935      29,610     1,159.0      62.2      00:11:10
 35856       6   4,935      29,610     1,172.9      62.9      00:10:55
 36258       8   4,935      39,480     1,186.6      63.7      00:10:40
 36606       8   4,935      39,480     1,198.4      64.3      00:10:28
 36916       5   4,935      24,675     1,208.6      64.9      00:10:19
 37236       8   4,935      39,480     1,218.6      65.4      00:10:10
 37493       5   4,935      24,675     1,226.7      65.8      00:10:03
 37752       4   4,935      19,740     1,234.9      66.3      00:09:57
 38033       9   4,935      44,415     1,244.2      66.8      00:09:48
 38285      10   4,935      49,350     1,252.8      67.2      00:09:41
 38535       8   4,935      39,480     1,261.4      67.7      00:09:34
 38934       6   4,935      29,610     1,274.6      68.4      00:09:20
 39218       4   4,935      19,740     1,283.9      68.9      00:09:12
 39474       6   4,935      29,610     1,292.1      69.3      00:09:05
 39792       5   4,935      24,675     1,302.5      69.9      00:08:55
 40153       6   4,935      29,610     1,314.3      70.5      00:08:43
 40556       6   4,935      29,610     1,327.8      71.3      00:08:29
 40970       5   4,935      24,675     1,341.8      72.0      00:08:15
 41308       6   4,935      29,610     1,353.1      72.6      00:08:04
 41649       8   4,935      39,480     1,364.5      73.2      00:07:53
 41972       8   4,935      39,480     1,375.4      73.8      00:07:42
 42261       8   4,935      39,480     1,384.3      74.3      00:07:34
 42560       8   4,935      39,480     1,394.1      74.8      00:07:25
 42871      10   4,935      49,350     1,404.3      75.4      00:07:16
 43170      10   4,935      49,350     1,414.6      75.9      00:07:06
 43448       5   4,935      24,675     1,424.0      76.4      00:06:57
 43770       7   4,935      34,545     1,434.2      77.0      00:06:48
 44077       8   4,935      39,480     1,444.3      77.5      00:06:38
 44368      10   4,935      49,350     1,453.8      78.0      00:06:30
 44701       5   4,935      24,675     1,464.6      78.6      00:06:19
 45000       6   4,935      29,610     1,474.5      79.1      00:06:10
 45305       2   4,935       9,870     1,484.1      79.6      00:06:01
 45533       8   4,935      39,480     1,491.2      80.0      00:05:55
 45815       8   4,935      39,480     1,500.0      80.5      00:05:47
 46087       2   4,935       9,870     1,508.9      81.0      00:05:39
 46376       9   4,935      44,415     1,518.7      81.5      00:05:30
 46721       7   4,935      34,545     1,530.1      82.1      00:05:19
 47044       4   4,935      19,740     1,540.4      82.7      00:05:09
 47325       6   4,935      29,610     1,549.0      83.1      00:05:01
 47619       5   4,935      24,675     1,558.4      83.6      00:04:52
 47911       9   4,935      44,415     1,567.8      84.1      00:04:43
 48185      10   4,935      49,350     1,576.9      84.6      00:04:35
 48450      10   4,935      49,350     1,585.7      85.1      00:04:27
 48729      10   4,935      49,350     1,594.9      85.6      00:04:18
 49006       9   4,935      44,415     1,603.9      86.1      00:04:10
 49289       9   4,935      44,415     1,613.3      86.6      00:04:01
 49580      10   4,935      49,350     1,622.4      87.1      00:03:52
 49912       9   4,935      44,415     1,632.4      87.6      00:03:43
 50231      10   4,935      49,350     1,642.8      88.2      00:03:33
 50544      10   4,935      49,350     1,652.7      88.7      00:03:23
 50814      10   4,935      49,350     1,661.7      89.2      00:03:15
 51106       4   4,935      19,740     1,671.7      89.7      00:03:05
 51445       7   4,935      34,545     1,682.8      90.3      00:02:54
 51785       8   4,935      39,480     1,694.5      90.9      00:02:43
 52100       8   4,935      39,480     1,705.2      91.5      00:02:32
 52384       8   4,935      39,480     1,715.3      92.1      00:02:23
 52694       7   4,935      34,545     1,726.6      92.7      00:02:12
 53046       9   4,935      44,415     1,739.0      93.3      00:01:60
 53364       6   4,935      29,610     1,749.9      93.9      00:01:49
 53727       6   4,935      29,610     1,762.2      94.6      00:01:37
 54021       7   4,935      34,545     1,771.8      95.1      00:01:28
 54294       9   4,935      44,415     1,780.9      95.6      00:01:19
 54636       8   4,935      39,480     1,791.4      96.1      00:01:09
 55004      10   4,935      49,350     1,803.5      96.8      00:00:58
 55272       6   4,935      29,610     1,812.1      97.2      00:00:49
 55575       9   4,935      44,415     1,821.3      97.7      00:00:41
 55862      10   4,935      49,350     1,830.8      98.2      00:00:31
 56180       6   4,935      29,610     1,841.5      98.8      00:00:21
 56513       7   4,935      34,545     1,853.1      99.4      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 1797.933
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
