
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A800_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:22

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   352       2   4,835       9,670         9.7       0.5      00:31:18
   732       9   4,835      43,515        20.7       1.1      00:29:04
  1108       5   4,835      24,175        32.0       1.8      00:28:01
  1453      10   4,835      48,350        43.1       2.4      00:27:34
  1805       4   4,835      19,340        54.1       3.0      00:27:18
  2190       5   4,835      24,175        66.0       3.6      00:26:42
  2579       6   4,835      29,010        77.8       4.3      00:26:14
  2960       6   4,835      29,010        89.7       4.9      00:25:49
  3323       7   4,835      33,845       101.5       5.6      00:25:30
  3688       5   4,835      24,175       113.3       6.2      00:25:13
  3998       7   4,835      33,845       122.6       6.7      00:25:30
  4222       9   4,835      43,515       129.6       7.1      00:26:13
  4481       5   4,835      24,175       137.2       7.5      00:26:42
  4761       8   4,835      38,680       146.3       8.0      00:26:50
  5023       8   4,835      38,680       154.5       8.5      00:27:05
  5285       2   4,835       9,670       162.5       8.9      00:27:20
  5527       8   4,835      38,680       169.9       9.3      00:27:40
  5724       5   4,835      24,175       175.7       9.6      00:28:13
  5962       4   4,835      19,340       183.1      10.0      00:28:28
  6221       5   4,835      24,175       191.2      10.5      00:28:33
  6490       6   4,835      29,010       199.4      10.9      00:28:35
  6807       6   4,835      29,010       209.0      11.4      00:28:25
  7128       5   4,835      24,175       219.0      12.0      00:28:10
  7473       5   4,835      24,175       229.7      12.6      00:27:50
  7801       7   4,835      33,845       240.1      13.2      00:27:34
  8104      10   4,835      48,350       250.2      13.7      00:27:19
  8461       8   4,835      38,680       262.1      14.4      00:26:53
  8791       6   4,835      29,010       272.8      14.9      00:26:36
  9142      10   4,835      48,350       284.5      15.6      00:26:13
  9388       4   4,835      19,340       292.7      16.0      00:26:14
  9632       8   4,835      38,680       300.9      16.5      00:26:13
  9905       9   4,835      43,515       309.8      17.0      00:26:08
 10194       5   4,835      24,175       318.4      17.4      00:26:05
 10474       7   4,835      33,845       327.0      17.9      00:26:00
 10775       6   4,835      29,010       336.3      18.4      00:25:53
 11091       9   4,835      43,515       346.2      19.0      00:25:41
 11361       8   4,835      38,680       354.7      19.4      00:25:37
 11606       7   4,835      33,845       362.4      19.8      00:25:37
 11868       6   4,835      29,010       370.8      20.3      00:25:33
 12153       7   4,835      33,845       379.9      20.8      00:25:25
 12437       6   4,835      29,010       388.7      21.3      00:25:18
 12750       3   4,835      14,505       398.5      21.8      00:25:06
 13072       7   4,835      33,845       408.5      22.4      00:24:54
 13393       8   4,835      38,680       418.6      22.9      00:24:41
 13654       7   4,835      33,845       427.6      23.4      00:24:34
 13865       7   4,835      33,845       434.2      23.8      00:24:37
 14102       3   4,835      14,505       441.5      24.2      00:24:36
 14343       8   4,835      38,680       449.6      24.6      00:24:32
 14603       8   4,835      38,680       458.0      25.1      00:24:26
 14867       9   4,835      43,515       466.4      25.5      00:24:20
 15179       6   4,835      29,010       476.8      26.1      00:24:05
 15503      10   4,835      48,350       487.2      26.7      00:23:51
 15873       8   4,835      38,680       499.1      27.3      00:23:31
 16220       6   4,835      29,010       510.9      28.0      00:23:12
 16545       1   4,835       4,835       521.7      28.6      00:22:57
 16811      10   4,835      48,350       530.2      29.0      00:22:51
 17043       7   4,835      33,845       537.7      29.5      00:22:47
 17269       6   4,835      29,010       544.9      29.8      00:22:46
 17484      10   4,835      48,350       552.2      30.2      00:22:43
 17763       8   4,835      38,680       561.3      30.7      00:22:34
 18115       7   4,835      33,845       572.7      31.4      00:22:17
 18484       8   4,835      38,680       584.3      32.0      00:21:60
 18777       6   4,835      29,010       594.0      32.5      00:21:48
 19098       4   4,835      19,340       604.8      33.1      00:21:34
 19474       9   4,835      43,515       617.3      33.8      00:21:15
 19870       4   4,835      19,340       630.8      34.6      00:20:52
 20228       7   4,835      33,845       642.9      35.2      00:20:35
 20548       7   4,835      33,845       653.3      35.8      00:20:23
 20787       7   4,835      33,845       661.2      36.2      00:20:17
 21042       7   4,835      33,845       669.5      36.7      00:20:11
 21366       8   4,835      38,680       678.9      37.2      00:20:01
 21610       2   4,835       9,670       686.6      37.6      00:19:56
 21891       7   4,835      33,845       695.0      38.1      00:19:50
 22171       8   4,835      38,680       703.3      38.5      00:19:43
 22490       8   4,835      38,680       713.0      39.1      00:19:32
 22821       6   4,835      29,010       722.9      39.6      00:19:21
 23082       9   4,835      43,515       731.3      40.1      00:19:14
 23364      10   4,835      48,350       740.4      40.6      00:19:05
 23651       4   4,835      19,340       748.9      41.0      00:18:58
 23972       5   4,835      24,175       759.1      41.6      00:18:46
 24334       7   4,835      33,845       770.1      42.2      00:18:32
 24699      10   4,835      48,350       782.0      42.8      00:18:16
 25008       8   4,835      38,680       791.5      43.4      00:18:06
 25337       3   4,835      14,505       802.2      43.9      00:17:53
 25653      10   4,835      48,350       812.0      44.5      00:17:43
 25890       6   4,835      29,010       820.0      44.9      00:17:37
 26118       3   4,835      14,505       827.3      45.3      00:17:32
 26391       7   4,835      33,845       835.9      45.8      00:17:24
 26713       5   4,835      24,175       845.7      46.3      00:17:13
 27021       6   4,835      29,010       855.8      46.9      00:17:02
 27248       5   4,835      24,175       862.8      47.3      00:16:57
 27458       8   4,835      38,680       869.6      47.6      00:16:53
 27732       6   4,835      29,010       878.5      48.1      00:16:44
 28113      10   4,835      48,350       891.0      48.8      00:16:28
 28497       9   4,835      43,515       903.7      49.5      00:16:11
 28812       8   4,835      38,680       914.2      50.1      00:15:59
 29037       7   4,835      33,845       921.7      50.5      00:15:53
 29291       7   4,835      33,845       929.7      50.9      00:15:46
 29586       9   4,835      43,515       939.3      51.5      00:15:36
 29842      10   4,835      48,350       947.8      51.9      00:15:28
 30080       9   4,835      43,515       955.5      52.3      00:15:21
 30368       4   4,835      19,340       964.9      52.9      00:15:11
 30672       6   4,835      29,010       975.1      53.4      00:15:00
 31090       8   4,835      38,680       988.6      54.2      00:14:42
 31484       7   4,835      33,845     1,002.0      54.9      00:14:25
 31892       6   4,835      29,010     1,015.7      55.6      00:14:07
 32257       6   4,835      29,010     1,028.1      56.3      00:13:51
 32551       8   4,835      38,680     1,038.1      56.9      00:13:41
 32748      10   4,835      48,350     1,044.6      57.2      00:13:36
 32958       7   4,835      33,845     1,051.7      57.6      00:13:31
 33190      10   4,835      48,350     1,059.5      58.0      00:13:24
 33463       7   4,835      33,845     1,068.6      58.5      00:13:15
 33799       4   4,835      19,340     1,079.9      59.2      00:13:02
 34141       7   4,835      33,845     1,091.5      59.8      00:12:48
 34531       5   4,835      24,175     1,104.8      60.5      00:12:32
 34942       7   4,835      33,845     1,118.7      61.3      00:12:14
 35370       3   4,835      14,505     1,133.0      62.1      00:11:56
 35788       7   4,835      33,845     1,146.9      62.8      00:11:40
 36223       7   4,835      33,845     1,161.4      63.6      00:11:22
 36621       8   4,835      38,680     1,174.6      64.3      00:11:06
 36951       8   4,835      38,680     1,185.4      64.9      00:10:55
 37272       7   4,835      33,845     1,195.1      65.5      00:10:45
 37579       8   4,835      38,680     1,204.7      66.0      00:10:35
 37887       7   4,835      33,845     1,214.3      66.5      00:10:25
 38153       7   4,835      33,845     1,223.0      67.0      00:10:17
 38417       8   4,835      38,680     1,231.9      67.5      00:10:08
 38719       5   4,835      24,175     1,241.8      68.0      00:09:58
 39044       6   4,835      29,010     1,252.5      68.6      00:09:47
 39285       9   4,835      43,515     1,260.0      69.0      00:09:40
 39595       8   4,835      38,680     1,269.9      69.6      00:09:30
 39941       6   4,835      29,010     1,280.9      70.2      00:09:18
 40347       9   4,835      43,515     1,293.8      70.9      00:09:03
 40758       6   4,835      29,010     1,307.5      71.6      00:08:48
 41109       9   4,835      43,515     1,319.1      72.3      00:08:35
 41449       6   4,835      29,010     1,330.2      72.9      00:08:24
 41800       5   4,835      24,175     1,341.7      73.5      00:08:11
 42076       9   4,835      43,515     1,350.6      74.0      00:08:03
 42373       6   4,835      29,010     1,359.7      74.5      00:07:54
 42645       8   4,835      38,680     1,368.4      75.0      00:07:45
 42868       6   4,835      29,010     1,375.8      75.4      00:07:39
 43091       8   4,835      38,680     1,383.1      75.8      00:07:32
 43300       5   4,835      24,175     1,390.2      76.1      00:07:26
 43566       5   4,835      24,175     1,398.8      76.6      00:07:17
 43929      10   4,835      48,350     1,410.4      77.3      00:07:05
 44269       8   4,835      38,680     1,421.3      77.8      00:06:53
 44601       8   4,835      38,680     1,431.7      78.4      00:06:42
 44942       6   4,835      29,010     1,442.8      79.0      00:06:31
 45314       5   4,835      24,175     1,454.3      79.7      00:06:19
 45626       9   4,835      43,515     1,463.7      80.2      00:06:09
 45973       7   4,835      33,845     1,474.6      80.8      00:05:58
 46262       7   4,835      33,845     1,484.2      81.3      00:05:48
 46578       8   4,835      38,680     1,494.5      81.9      00:05:37
 46955       2   4,835       9,670     1,506.8      82.5      00:05:24
 47268       9   4,835      43,515     1,516.0      83.0      00:05:15
 47552       9   4,835      43,515     1,524.6      83.5      00:05:07
 47861       8   4,835      38,680     1,534.5      84.1      00:04:57
 48138       8   4,835      38,680     1,543.5      84.5      00:04:48
 48435       8   4,835      38,680     1,553.1      85.1      00:04:38
 48780       5   4,835      24,175     1,564.2      85.7      00:04:26
 49127       7   4,835      33,845     1,575.3      86.3      00:04:15
 49440       7   4,835      33,845     1,585.2      86.8      00:04:05
 49679       8   4,835      38,680     1,592.2      87.2      00:03:58
 49897       7   4,835      33,845     1,598.9      87.6      00:03:52
 50117       8   4,835      38,680     1,606.0      88.0      00:03:45
 50413       5   4,835      24,175     1,614.9      88.5      00:03:36
 50664       9   4,835      43,515     1,623.1      88.9      00:03:28
 50942       9   4,835      43,515     1,632.3      89.4      00:03:18
 51274       3   4,835      14,505     1,643.0      90.0      00:03:07
 51595       8   4,835      38,680     1,653.7      90.6      00:02:56
 51928       8   4,835      38,680     1,664.9      91.2      00:02:44
 52265       8   4,835      38,680     1,676.5      91.8      00:02:32
 52666       5   4,835      24,175     1,690.6      92.6      00:02:18
 53086      10   4,835      48,350     1,705.1      93.4      00:02:03
 53527       4   4,835      19,340     1,719.8      94.2      00:01:47
 53875      10   4,835      48,350     1,731.3      94.8      00:01:36
 54170       7   4,835      33,845     1,740.9      95.4      00:01:26
 54474       3   4,835      14,505     1,750.2      95.9      00:01:16
 54883      10   4,835      48,350     1,763.0      96.6      00:01:03
 55233       7   4,835      33,845     1,774.1      97.2      00:00:52
 55576       7   4,835      33,845     1,784.4      97.7      00:00:42
 55878       6   4,835      29,010     1,794.3      98.3      00:00:32
 56188      10   4,835      48,350     1,804.5      98.8      00:00:21
 56512       5   4,835      24,175     1,815.5      99.4      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1849.082
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
