
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed13.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A1000_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  17 Apr 2024, 22:56:15

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed13.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   382       9   5,035      45,315        11.0       0.6      00:28:39
   765       9   5,035      45,315        22.7       1.2      00:27:39
  1137      10   5,035      50,350        34.4       1.8      00:27:12
  1494       8   5,035      40,280        46.3       2.4      00:26:44
  1906       6   5,035      30,210        59.4       3.1      00:25:52
  2291      10   5,035      50,350        71.9       3.8      00:25:28
  2600       5   5,035      25,175        81.7       4.3      00:26:01
  2977       1   5,035       5,035        93.9       4.9      00:25:42
  3336       9   5,035      45,315       106.2       5.6      00:25:23
  3699       7   5,035      35,245       118.3       6.2      00:25:09
  4038       8   5,035      40,280       129.0       6.8      00:25:14
  4266       9   5,035      45,315       136.2       7.2      00:25:57
  4497       5   5,035      25,175       143.5       7.5      00:26:35
  4723       6   5,035      30,210       151.1       7.9      00:27:03
  4949       7   5,035      35,245       158.5       8.3      00:27:31
  5211       7   5,035      35,245       167.0       8.8      00:27:44
  5489       2   5,035      10,070       175.9       9.3      00:27:50
  5787       5   5,035      25,175       185.0       9.7      00:27:52
  6089       5   5,035      25,175       194.9      10.3      00:27:46
  6347       3   5,035      15,105       203.0      10.7      00:27:56
  6576       4   5,035      20,140       210.3      11.1      00:28:11
  6833       1   5,035       5,035       218.6      11.5      00:28:16
  7109       6   5,035      30,210       227.4      12.0      00:28:15
  7470       7   5,035      35,245       239.1      12.6      00:27:51
  7800       8   5,035      40,280       250.0      13.1      00:27:33
  8143       6   5,035      30,210       261.9      13.8      00:27:09
  8459       6   5,035      30,210       272.9      14.4      00:26:53
  8787       6   5,035      30,210       284.0      14.9      00:26:37
  9119       5   5,035      25,175       295.5      15.5      00:26:18
  9380       7   5,035      35,245       304.5      16.0      00:26:15
  9614      10   5,035      50,350       312.7      16.4      00:26:17
  9861       8   5,035      40,280       321.2      16.9      00:26:16
 10106       6   5,035      30,210       329.0      17.3      00:26:19
 10400       6   5,035      30,210       338.1      17.8      00:26:14
 10691       3   5,035      15,105       347.5      18.3      00:26:07
 11028       6   5,035      30,210       358.6      18.9      00:25:51
 11289       5   5,035      25,175       366.9      19.3      00:25:49
 11513      10   5,035      50,350       374.5      19.7      00:25:51
 11728       5   5,035      25,175       381.4      20.1      00:25:56
 11950       7   5,035      35,245       388.7      20.4      00:25:59
 12186       8   5,035      40,280       396.7      20.9      00:25:57
 12520       6   5,035      30,210       407.6      21.4      00:25:41
 12908       9   5,035      45,315       419.9      22.1      00:25:19
 13286       8   5,035      40,280       432.3      22.7      00:24:57
 13628      10   5,035      50,350       444.5      23.4      00:24:37
 13909       6   5,035      30,210       453.6      23.9      00:24:30
 14250       8   5,035      40,280       464.9      24.5      00:24:14
 14591       2   5,035      10,070       476.5      25.1      00:23:57
 14965       8   5,035      40,280       489.0      25.7      00:23:37
 15344       7   5,035      35,245       502.0      26.4      00:23:16
 15744       6   5,035      30,210       515.3      27.1      00:22:54
 16094       7   5,035      35,245       527.7      27.8      00:22:36
 16452      10   5,035      50,350       540.2      28.4      00:22:17
 16721       8   5,035      40,280       549.1      28.9      00:22:12
 16977      10   5,035      50,350       557.7      29.3      00:22:07
 17192       6   5,035      30,210       564.8      29.7      00:22:07
 17450       8   5,035      40,280       573.7      30.2      00:22:01
 17729      10   5,035      50,350       583.4      30.7      00:21:52
 18040       6   5,035      30,210       593.7      31.2      00:21:41
 18367       2   5,035      10,070       604.9      31.8      00:21:28
 18661       7   5,035      35,245       614.6      32.3      00:21:19
 18932       6   5,035      30,210       624.0      32.8      00:21:11
 19207       9   5,035      45,315       633.6      33.3      00:21:02
 19554       9   5,035      45,315       645.7      34.0      00:20:46
 19940       8   5,035      40,280       659.4      34.7      00:20:26
 20350       9   5,035      45,315       673.4      35.4      00:20:05
 20645       7   5,035      35,245       683.7      36.0      00:19:55
 20910      10   5,035      50,350       692.8      36.4      00:19:48
 21226      10   5,035      50,350       702.9      37.0      00:19:38
 21551       7   5,035      35,245       713.3      37.5      00:19:28
 21795       8   5,035      40,280       720.6      37.9      00:19:25
 22024       4   5,035      20,140       728.0      38.3      00:19:22
 22272       6   5,035      30,210       735.6      38.7      00:19:19
 22549       5   5,035      25,175       744.5      39.2      00:19:12
 22867       5   5,035      25,175       754.2      39.7      00:19:02
 23166       9   5,035      45,315       764.3      40.2      00:18:52
 23480       7   5,035      35,245       774.5      40.7      00:18:42
 23777       7   5,035      35,245       784.1      41.2      00:18:33
 24034       8   5,035      40,280       792.6      41.7      00:18:27
 24400       9   5,035      45,315       803.9      42.3      00:18:14
 24778       9   5,035      45,315       816.8      43.0      00:17:57
 25072       6   5,035      30,210       826.5      43.5      00:17:48
 25431      10   5,035      50,350       838.6      44.1      00:17:34
 25750       6   5,035      30,210       849.0      44.7      00:17:23
 26037       6   5,035      30,210       858.8      45.2      00:17:13
 26342       6   5,035      30,210       868.9      45.7      00:17:03
 26697       9   5,035      45,315       880.2      46.3      00:16:51
 27050       9   5,035      45,315       892.1      46.9      00:16:37
 27325       6   5,035      30,210       901.1      47.4      00:16:29
 27608      10   5,035      50,350       910.7      47.9      00:16:21
 27858       5   5,035      25,175       919.1      48.3      00:16:14
 28145       7   5,035      35,245       929.0      48.9      00:16:04
 28494       9   5,035      45,315       941.0      49.5      00:15:51
 28778       4   5,035      20,140       950.9      50.0      00:15:41
 29011       8   5,035      40,280       958.9      50.4      00:15:35
 29310       4   5,035      20,140       968.8      51.0      00:15:25
 29601       8   5,035      40,280       978.7      51.5      00:15:16
 29836       9   5,035      45,315       986.7      51.9      00:15:10
 30045       9   5,035      45,315       993.8      52.3      00:15:05
 30290       6   5,035      30,210     1,002.2      52.7      00:14:59
 30553      10   5,035      50,350     1,011.4      53.2      00:14:50
 30911       3   5,035      15,105     1,023.6      53.8      00:14:36
 31281       6   5,035      30,210     1,036.2      54.5      00:14:21
 31691       5   5,035      25,175     1,050.4      55.3      00:14:04
 32051      10   5,035      50,350     1,063.4      55.9      00:13:49
 32402       8   5,035      40,280     1,075.9      56.6      00:13:34
 32641       7   5,035      35,245     1,084.1      57.0      00:13:28
 32853       9   5,035      45,315     1,091.5      57.4      00:13:23
 33109       8   5,035      40,280     1,100.5      57.9      00:13:14
 33404       7   5,035      35,245     1,110.7      58.4      00:13:04
 33688       6   5,035      30,210     1,120.8      59.0      00:12:54
 33985       9   5,035      45,315     1,131.2      59.5      00:12:44
 34313       9   5,035      45,315     1,142.9      60.1      00:12:31
 34712       7   5,035      35,245     1,156.8      60.8      00:12:15
 35101       8   5,035      40,280     1,170.4      61.6      00:11:59
 35470       7   5,035      35,245     1,183.4      62.2      00:11:45
 35879      10   5,035      50,350     1,197.5      63.0      00:11:29
 36263       8   5,035      40,280     1,210.9      63.7      00:11:14
 36610       7   5,035      35,245     1,222.8      64.3      00:11:01
 36893       7   5,035      35,245     1,232.3      64.8      00:10:52
 37125       6   5,035      30,210     1,240.0      65.2      00:10:46
 37392       5   5,035      25,175     1,248.4      65.7      00:10:39
 37658       7   5,035      35,245     1,257.1      66.1      00:10:31
 37957      10   5,035      50,350     1,266.9      66.6      00:10:22
 38170       8   5,035      40,280     1,274.2      67.0      00:10:16
 38391      10   5,035      50,350     1,281.9      67.4      00:10:10
 38664       5   5,035      25,175     1,291.3      67.9      00:10:01
 38983       9   5,035      45,315     1,302.2      68.5      00:09:50
 39220       9   5,035      45,315     1,310.0      68.9      00:09:43
 39494       8   5,035      40,280     1,319.0      69.4      00:09:35
 39772       7   5,035      35,245     1,328.2      69.9      00:09:26
 40110       3   5,035      15,105     1,339.5      70.5      00:09:15
 40481       8   5,035      40,280     1,352.0      71.1      00:09:01
 40886       8   5,035      40,280     1,366.0      71.8      00:08:46
 41172       4   5,035      20,140     1,375.8      72.4      00:08:36
 41511      10   5,035      50,350     1,387.4      73.0      00:08:25
 41856       9   5,035      45,315     1,399.1      73.6      00:08:12
 42145       8   5,035      40,280     1,408.7      74.1      00:08:03
 42431       9   5,035      45,315     1,418.1      74.6      00:07:54
 42742       9   5,035      45,315     1,428.3      75.1      00:07:44
 43058       8   5,035      40,280     1,439.1      75.7      00:07:34
 43351      10   5,035      50,350     1,449.4      76.2      00:07:23
 43663       5   5,035      25,175     1,459.8      76.8      00:07:13
 43987       5   5,035      25,175     1,470.7      77.4      00:07:02
 44332       6   5,035      30,210     1,482.1      78.0      00:06:51
 44701       5   5,035      25,175     1,494.3      78.6      00:06:38
 45043       7   5,035      35,245     1,505.8      79.2      00:06:27
 45383       5   5,035      25,175     1,516.4      79.8      00:06:16
 45705       2   5,035      10,070     1,526.7      80.3      00:06:06
 46037       7   5,035      35,245     1,537.8      80.9      00:05:55
 46348       5   5,035      25,175     1,548.6      81.5      00:05:44
 46694       9   5,035      45,315     1,560.2      82.1      00:05:33
 47023       5   5,035      25,175     1,571.0      82.6      00:05:22
 47291      10   5,035      50,350     1,579.4      83.1      00:05:14
 47540       7   5,035      35,245     1,587.4      83.5      00:05:07
 47746       5   5,035      25,175     1,594.2      83.9      00:05:01
 47961       4   5,035      20,140     1,601.4      84.2      00:04:54
 48162       7   5,035      35,245     1,608.1      84.6      00:04:48
 48360       7   5,035      35,245     1,614.8      84.9      00:04:42
 48650       9   5,035      45,315     1,624.6      85.5      00:04:33
 48953      10   5,035      50,350     1,634.6      86.0      00:04:23
 49189       9   5,035      45,315     1,642.7      86.4      00:04:15
 49464      10   5,035      50,350     1,651.6      86.9      00:04:07
 49702       7   5,035      35,245     1,658.8      87.3      00:04:00
 49930       6   5,035      30,210     1,666.1      87.6      00:03:53
 50166       6   5,035      30,210     1,674.0      88.1      00:03:46
 50423       7   5,035      35,245     1,682.0      88.5      00:03:38
 50659       9   5,035      45,315     1,690.0      88.9      00:03:30
 50878       6   5,035      30,210     1,697.4      89.3      00:03:23
 51109      10   5,035      50,350     1,705.7      89.7      00:03:15
 51368       8   5,035      40,280     1,714.2      90.2      00:03:07
 51624       6   5,035      30,210     1,723.0      90.6      00:02:58
 51867       9   5,035      45,315     1,731.7      91.1      00:02:50
 52100       8   5,035      40,280     1,739.8      91.5      00:02:42
 52316       7   5,035      35,245     1,747.6      91.9      00:02:34
 52631       8   5,035      40,280     1,759.1      92.5      00:02:22
 53008       8   5,035      40,280     1,772.8      93.2      00:02:08
 53384       5   5,035      25,175     1,786.0      93.9      00:01:55
 53735      10   5,035      50,350     1,798.2      94.6      00:01:43
 54003       9   5,035      45,315     1,807.2      95.1      00:01:34
 54267       9   5,035      45,315     1,816.1      95.5      00:01:25
 54563       6   5,035      30,210     1,825.2      96.0      00:01:16
 54862       9   5,035      45,315     1,835.2      96.5      00:01:06
 55149       6   5,035      30,210     1,844.8      97.0      00:00:56
 55420       5   5,035      25,175     1,853.3      97.5      00:00:48
 55642       9   5,035      45,315     1,860.3      97.9      00:00:41
 55847      10   5,035      50,350     1,867.4      98.2      00:00:34
 56107       8   5,035      40,280     1,876.3      98.7      00:00:25
 56345       8   5,035      40,280     1,884.6      99.1      00:00:17
 56624       5   5,035      25,175     1,894.4      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1915.998
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed13.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed13.csv sav
> ed

. 
. cap log close

. 
end of do-file
