
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed42.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A1000_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:24

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed42.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   350       5   5,035      25,175        10.1       0.5      00:31:22
   732       9   5,035      45,315        21.6       1.1      00:29:05
  1141       4   5,035      20,140        34.5       1.8      00:27:05
  1538      10   5,035      50,350        47.8       2.5      00:25:53
  1931       9   5,035      45,315        60.2       3.2      00:25:30
  2290       9   5,035      45,315        71.9       3.8      00:25:29
  2685       9   5,035      45,315        84.5       4.4      00:25:08
  3054       8   5,035      40,280        96.4       5.1      00:24:59
  3416       9   5,035      45,315       108.9       5.7      00:24:43
  3771       7   5,035      35,245       120.8       6.4      00:24:36
  4055       8   5,035      40,280       129.6       6.8      00:25:06
  4322       6   5,035      30,210       137.8       7.2      00:25:38
  4598       7   5,035      35,245       146.8       7.7      00:25:56
  4883       7   5,035      35,245       156.3       8.2      00:26:05
  5180      10   5,035      50,350       165.9       8.7      00:26:11
  5414       8   5,035      40,280       173.8       9.1      00:26:33
  5692       8   5,035      40,280       181.9       9.6      00:26:49
  5950       2   5,035      10,070       190.2      10.0      00:27:01
  6216       6   5,035      30,210       198.9      10.5      00:27:08
  6525       5   5,035      25,175       208.7      11.0      00:27:04
  6823       8   5,035      40,280       218.2      11.5      00:27:02
  7126       4   5,035      20,140       228.0      12.0      00:26:57
  7477       9   5,035      45,315       239.3      12.6      00:26:40
  7831       8   5,035      40,280       251.0      13.2      00:26:20
  8138       9   5,035      45,315       261.8      13.8      00:26:08
  8453       9   5,035      45,315       272.7      14.3      00:25:55
  8786       5   5,035      25,175       283.9      14.9      00:25:40
  9125       8   5,035      40,280       295.7      15.6      00:25:23
  9352       5   5,035      25,175       303.5      16.0      00:25:29
  9563       9   5,035      45,315       310.9      16.4      00:25:37
  9802       9   5,035      45,315       319.3      16.8      00:25:38
 10049       2   5,035      10,070       327.2      17.2      00:25:42
 10361      10   5,035      50,350       336.8      17.7      00:25:35
 10709       8   5,035      40,280       348.1      18.3      00:25:19
 11014       7   5,035      35,245       358.1      18.8      00:25:10
 11266       9   5,035      45,315       366.2      19.3      00:25:11
 11498       9   5,035      45,315       373.9      19.7      00:25:14
 11794      10   5,035      50,350       383.6      20.2      00:25:06
 12107       6   5,035      30,210       394.1      20.7      00:24:54
 12428      10   5,035      50,350       404.6      21.3      00:24:42
 12845       5   5,035      25,175       417.9      22.0      00:24:18
 13242       8   5,035      40,280       431.0      22.7      00:23:55
 13563       9   5,035      45,315       442.1      23.3      00:23:42
 13790       5   5,035      25,175       449.6      23.7      00:23:43
 14068      10   5,035      50,350       458.7      24.1      00:23:38
 14380      10   5,035      50,350       469.5      24.7      00:23:25
 14677       8   5,035      40,280       479.4      25.2      00:23:17
 14989       8   5,035      40,280       489.9      25.8      00:23:05
 15331      10   5,035      50,350       501.6      26.4      00:22:50
 15663      10   5,035      50,350       512.6      27.0      00:22:37
 15974       8   5,035      40,280       523.4      27.5      00:22:25
 16335       5   5,035      25,175       536.0      28.2      00:22:07
 16629       6   5,035      30,210       545.9      28.7      00:21:58
 16871       4   5,035      20,140       554.1      29.1      00:21:55
 17111       6   5,035      30,210       562.1      29.6      00:21:53
 17364      10   5,035      50,350       570.8      30.0      00:21:48
 17589       8   5,035      40,280       578.8      30.4      00:21:45
 17849       7   5,035      35,245       587.3      30.9      00:21:40
 18179       7   5,035      35,245       598.6      31.5      00:21:26
 18511       5   5,035      25,175       609.3      32.1      00:21:15
 18723       6   5,035      30,210       616.8      32.4      00:21:13
 18943       7   5,035      35,245       624.4      32.8      00:21:10
 19165       6   5,035      30,210       632.2      33.3      00:21:07
 19520       7   5,035      35,245       644.5      33.9      00:20:50
 19897       7   5,035      35,245       657.8      34.6      00:20:31
 20295      10   5,035      50,350       671.7      35.3      00:20:11
 20608       9   5,035      45,315       682.4      35.9      00:19:59
 20878       9   5,035      45,315       691.7      36.4      00:19:51
 21189      10   5,035      50,350       701.8      36.9      00:19:42
 21515       7   5,035      35,245       712.0      37.5      00:19:31
 21834      10   5,035      50,350       721.8      38.0      00:19:22
 22095       4   5,035      20,140       730.2      38.4      00:19:17
 22343      10   5,035      50,350       737.9      38.8      00:19:13
 22608       6   5,035      30,210       746.4      39.3      00:19:07
 22918       9   5,035      45,315       755.9      39.8      00:18:59
 23236       6   5,035      30,210       766.7      40.3      00:18:47
 23550       9   5,035      45,315       776.5      40.8      00:18:37
 23852       9   5,035      45,315       786.8      41.4      00:18:27
 24187       6   5,035      30,210       797.4      41.9      00:18:16
 24559       8   5,035      40,280       809.4      42.6      00:18:01
 24897       9   5,035      45,315       820.7      43.2      00:17:48
 25278       9   5,035      45,315       833.4      43.8      00:17:33
 25614       8   5,035      40,280       844.5      44.4      00:17:21
 25901       8   5,035      40,280       854.2      44.9      00:17:11
 26221       9   5,035      45,315       865.0      45.5      00:17:00
 26603       8   5,035      40,280       877.3      46.1      00:16:45
 26965      10   5,035      50,350       889.2      46.8      00:16:32
 27289       8   5,035      40,280       899.9      47.3      00:16:21
 27583       5   5,035      25,175       909.7      47.8      00:16:12
 27903       8   5,035      40,280       920.7      48.4      00:16:00
 28245       7   5,035      35,245       932.2      49.0      00:15:48
 28563       9   5,035      45,315       943.5      49.6      00:15:36
 28794       7   5,035      35,245       951.4      50.0      00:15:30
 28985       7   5,035      35,245       958.0      50.4      00:15:27
 29223       5   5,035      25,175       966.0      50.8      00:15:21
 29514       6   5,035      30,210       975.9      51.3      00:15:12
 29815       6   5,035      30,210       986.0      51.9      00:15:02
 30084       8   5,035      40,280       995.1      52.3      00:14:54
 30367       8   5,035      40,280     1,004.8      52.9      00:14:45
 30693       6   5,035      30,210     1,016.1      53.4      00:14:33
 31096       7   5,035      35,245     1,029.7      54.2      00:14:16
 31449       9   5,035      45,315     1,042.1      54.8      00:14:02
 31811       4   5,035      20,140     1,054.7      55.5      00:13:48
 32164       8   5,035      40,280     1,067.3      56.1      00:13:34
 32493       8   5,035      40,280     1,079.1      56.8      00:13:21
 32685       5   5,035      25,175     1,085.6      57.1      00:13:18
 32862       9   5,035      45,315     1,091.7      57.4      00:13:15
 33053      10   5,035      50,350     1,098.6      57.8      00:13:11
 33282       7   5,035      35,245     1,106.5      58.2      00:13:04
 33582       9   5,035      45,315     1,117.0      58.8      00:12:54
 33914      10   5,035      50,350     1,128.7      59.4      00:12:41
 34201       5   5,035      25,175     1,138.9      59.9      00:12:31
 34549       8   5,035      40,280     1,151.1      60.5      00:12:18
 34918       6   5,035      30,210     1,164.2      61.2      00:12:03
 35327       7   5,035      35,245     1,178.4      62.0      00:11:47
 35724       8   5,035      40,280     1,192.2      62.7      00:11:31
 36112       9   5,035      45,315     1,205.5      63.4      00:11:16
 36475       9   5,035      45,315     1,218.3      64.1      00:11:03
 36758       2   5,035      10,070     1,227.8      64.6      00:10:54
 37046       7   5,035      35,245     1,237.3      65.1      00:10:45
 37327       6   5,035      30,210     1,246.2      65.6      00:10:37
 37596       6   5,035      30,210     1,255.1      66.0      00:10:29
 37894       6   5,035      30,210     1,264.8      66.5      00:10:20
 38170       8   5,035      40,280     1,274.2      67.0      00:10:11
 38419      10   5,035      50,350     1,282.9      67.5      00:10:03
 38742       8   5,035      40,280     1,294.0      68.1      00:09:52
 39059      10   5,035      50,350     1,304.9      68.6      00:09:41
 39318       8   5,035      40,280     1,313.3      69.1      00:09:34
 39633      10   5,035      50,350     1,323.8      69.6      00:09:24
 39948       7   5,035      35,245     1,334.2      70.2      00:09:13
 40364       7   5,035      35,245     1,347.9      70.9      00:08:59
 40738       9   5,035      45,315     1,360.9      71.6      00:08:45
 41057       7   5,035      35,245     1,372.0      72.2      00:08:34
 41301       6   5,035      30,210     1,380.2      72.6      00:08:27
 41543       5   5,035      25,175     1,388.4      73.0      00:08:19
 41824       8   5,035      40,280     1,398.0      73.5      00:08:10
 42051       3   5,035      15,105     1,405.7      73.9      00:08:04
 42302       6   5,035      30,210     1,413.6      74.4      00:07:57
 42545       7   5,035      35,245     1,421.9      74.8      00:07:49
 42826       9   5,035      45,315     1,431.1      75.3      00:07:41
 43042       6   5,035      30,210     1,438.5      75.7      00:07:34
 43242       5   5,035      25,175     1,445.7      76.0      00:07:28
 43449       6   5,035      30,210     1,452.9      76.4      00:07:22
 43725      10   5,035      50,350     1,461.7      76.9      00:07:14
 44046       6   5,035      30,210     1,472.5      77.5      00:07:03
 44297       9   5,035      45,315     1,481.0      77.9      00:06:55
 44523      10   5,035      50,350     1,488.3      78.3      00:06:49
 44759       6   5,035      30,210     1,496.2      78.7      00:06:41
 45004      10   5,035      50,350     1,504.5      79.1      00:06:34
 45304       2   5,035      10,070     1,514.1      79.6      00:06:24
 45546       2   5,035      10,070     1,521.8      80.0      00:06:17
 45858       8   5,035      40,280     1,531.8      80.6      00:06:07
 46177       7   5,035      35,245     1,542.6      81.1      00:05:56
 46485       6   5,035      30,210     1,553.0      81.7      00:05:46
 46807       9   5,035      45,315     1,564.0      82.3      00:05:35
 47096       8   5,035      40,280     1,573.3      82.8      00:05:26
 47385       7   5,035      35,245     1,582.4      83.2      00:05:17
 47691      10   5,035      50,350     1,592.4      83.8      00:05:07
 47955       9   5,035      45,315     1,601.2      84.2      00:04:58
 48174       4   5,035      20,140     1,608.5      84.6      00:04:52
 48401       7   5,035      35,245     1,616.2      85.0      00:04:44
 48629       6   5,035      30,210     1,623.9      85.4      00:04:37
 48847       9   5,035      45,315     1,631.1      85.8      00:04:30
 49095       9   5,035      45,315     1,639.4      86.2      00:04:22
 49311       6   5,035      30,210     1,646.7      86.6      00:04:15
 49538       7   5,035      35,245     1,653.9      87.0      00:04:09
 49771       6   5,035      30,210     1,661.0      87.4      00:04:02
 50012       8   5,035      40,280     1,669.0      87.8      00:03:54
 50286       7   5,035      35,245     1,677.9      88.3      00:03:45
 50536       7   5,035      35,245     1,685.9      88.7      00:03:38
 50800       9   5,035      45,315     1,694.9      89.1      00:03:28
 51083       4   5,035      20,140     1,704.8      89.7      00:03:18
 51383       6   5,035      30,210     1,714.7      90.2      00:03:08
 51663      10   5,035      50,350     1,724.5      90.7      00:02:59
 51962       5   5,035      25,175     1,734.9      91.3      00:02:48
 52273       9   5,035      45,315     1,746.2      91.8      00:02:37
 52677       8   5,035      40,280     1,760.9      92.6      00:02:21
 53090       7   5,035      35,245     1,775.7      93.4      00:02:06
 53517       8   5,035      40,280     1,790.6      94.2      00:01:51
 53871       6   5,035      30,210     1,802.8      94.8      00:01:38
 54170       7   5,035      35,245     1,812.9      95.4      00:01:28
 54460       9   5,035      45,315     1,822.2      95.8      00:01:19
 54834       7   5,035      35,245     1,834.3      96.5      00:01:07
 55157       8   5,035      40,280     1,845.1      97.1      00:00:56
 55468       8   5,035      40,280     1,854.9      97.6      00:00:46
 55760       6   5,035      30,210     1,864.5      98.1      00:00:37
 56055       9   5,035      45,315     1,874.7      98.6      00:00:27
 56354       6   5,035      30,210     1,884.9      99.1      00:00:16
 56675      10   5,035      50,350     1,896.2      99.7      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1903.554
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed42.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed42.csv sav
> ed

. 
. cap log close

. 
end of do-file
