
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A800.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A800.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
(file /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   369       6   4,835      29,010        10.2       0.6      00:29:49
   765       9   4,835      43,515        21.8       1.2      00:27:38
  1155       7   4,835      33,845        33.6       1.8      00:26:42
  1556       3   4,835      14,505        46.3       2.5      00:25:38
  1955       5   4,835      24,175        58.6       3.2      00:25:09
  2337       4   4,835      19,340        70.4       3.9      00:24:57
  2685       9   4,835      43,515        81.1       4.4      00:25:07
  3043       6   4,835      29,010        92.2       5.1      00:25:05
  3398       8   4,835      38,680       104.0       5.7      00:24:52
  3794       7   4,835      33,845       116.6       6.4      00:24:27
  4166       7   4,835      33,845       127.8       7.0      00:24:23
  4528      10   4,835      48,350       138.7       7.6      00:24:21
  4840       9   4,835      43,515       148.7       8.1      00:24:28
  5141      10   4,835      48,350       158.1       8.7      00:24:39
  5402       7   4,835      33,845       166.5       9.1      00:24:57
  5661       5   4,835      24,175       173.8       9.5      00:25:23
  5957      10   4,835      48,350       182.9      10.0      00:25:29
  6286      10   4,835      48,350       193.2      10.6      00:25:23
  6661       3   4,835      14,505       204.5      11.2      00:25:08
  7013       8   4,835      38,680       215.4      11.8      00:24:57
  7384       4   4,835      19,340       226.9      12.4      00:24:42
  7783       6   4,835      29,010       239.5      13.1      00:24:19
  8181       5   4,835      24,175       252.9      13.9      00:23:52
  8569       8   4,835      38,680       265.7      14.6      00:23:30
  8962      10   4,835      48,350       278.6      15.3      00:23:10
  9307       5   4,835      24,175       290.0      15.9      00:22:58
  9585       5   4,835      24,175       299.3      16.4      00:22:59
  9920      10   4,835      48,350       310.3      17.0      00:22:49
 10241       1   4,835       4,835       319.8      17.5      00:22:47
 10509       6   4,835      29,010       328.2      18.0      00:22:50
 10790       3   4,835      14,505       336.7      18.4      00:22:52
 11122       8   4,835      38,680       347.2      19.0      00:22:44
 11378      10   4,835      48,350       355.3      19.5      00:22:47
 11645       6   4,835      29,010       363.6      19.9      00:22:49
 11970       6   4,835      29,010       373.9      20.5      00:22:41
 12280       8   4,835      38,680       383.9      21.0      00:22:34
 12651       5   4,835      24,175       395.5      21.7      00:22:20
 13070       6   4,835      29,010       408.4      22.4      00:22:01
 13474      10   4,835      48,350       421.5      23.1      00:21:41
 13800       9   4,835      43,515       432.1      23.7      00:21:32
 14137      10   4,835      48,350       442.7      24.2      00:21:23
 14473       9   4,835      43,515       453.8      24.9      00:21:11
 14819       6   4,835      29,010       464.9      25.5      00:21:00
 15188       8   4,835      38,680       477.1      26.1      00:20:46
 15608       8   4,835      38,680       490.5      26.9      00:20:27
 15991      10   4,835      48,350       503.2      27.6      00:20:11
 16379       7   4,835      33,845       516.2      28.3      00:19:54
 16705       8   4,835      38,680       526.7      28.9      00:19:45
 16986       8   4,835      38,680       535.9      29.4      00:19:41
 17302       5   4,835      24,175       546.0      29.9      00:19:34
 17559       9   4,835      43,515       554.8      30.4      00:19:30
 17909      10   4,835      48,350       565.9      31.0      00:19:19
 18260       8   4,835      38,680       577.5      31.6      00:19:07
 18596       5   4,835      24,175       587.9      32.2      00:18:58
 18906       6   4,835      29,010       598.3      32.8      00:18:50
 19251       4   4,835      19,340       610.0      33.4      00:18:38
 19645      10   4,835      48,350       623.0      34.1      00:18:22
 20016       8   4,835      38,680       635.7      34.8      00:18:07
 20433       9   4,835      43,515       649.5      35.6      00:17:50
 20739       7   4,835      33,845       659.6      36.1      00:17:42
 21015       8   4,835      38,680       668.7      36.6      00:17:37
 21373       3   4,835      14,505       679.1      37.2      00:17:28
 21686      10   4,835      48,350       688.9      37.7      00:17:21
 21992       6   4,835      29,010       698.1      38.2      00:17:15
 22315       8   4,835      38,680       707.7      38.8      00:17:08
 22645       8   4,835      38,680       717.9      39.3      00:16:60
 22971       9   4,835      43,515       727.6      39.9      00:16:53
 23259       5   4,835      24,175       737.0      40.4      00:16:46
 23558       8   4,835      38,680       746.0      40.9      00:16:40
 23800       4   4,835      19,340       753.8      41.3      00:16:37
 24121       2   4,835       9,670       763.8      41.8      00:16:29
 24547       8   4,835      38,680       776.9      42.6      00:16:13
 24959       8   4,835      38,680       789.9      43.3      00:15:59
 25352       8   4,835      38,680       802.7      44.0      00:15:44
 25708       7   4,835      33,845       813.9      44.6      00:15:34
 26008       3   4,835      14,505       823.7      45.1      00:15:26
 26353       5   4,835      24,175       834.8      45.7      00:15:15
 26724       5   4,835      24,175       846.1      46.3      00:15:04
 27052       8   4,835      38,680       856.7      46.9      00:14:55
 27348       6   4,835      29,010       866.1      47.4      00:14:48
 27664       8   4,835      38,680       876.3      48.0      00:14:39
 28052       9   4,835      43,515       888.9      48.7      00:14:25
 28467       8   4,835      38,680       902.6      49.4      00:14:10
 28799       7   4,835      33,845       913.8      50.1      00:13:59
 29059       5   4,835      24,175       922.4      50.5      00:13:54
 29374       5   4,835      24,175       932.6      51.1      00:13:45
 29703      10   4,835      48,350       943.0      51.7      00:13:35
 29967       8   4,835      38,680       951.7      52.1      00:13:29
 30243       6   4,835      29,010       960.9      52.6      00:13:22
 30581       7   4,835      33,845       972.1      53.2      00:13:11
 30998       7   4,835      33,845       985.8      54.0      00:12:56
 31399       9   4,835      43,515       998.9      54.7      00:12:43
 31737       7   4,835      33,845     1,010.4      55.3      00:12:32
 32056       6   4,835      29,010     1,021.3      55.9      00:12:21
 32425      10   4,835      48,350     1,034.0      56.6      00:12:09
 32669       8   4,835      38,680     1,042.0      57.1      00:12:03
 32881      10   4,835      48,350     1,049.0      57.5      00:11:59
 33142       9   4,835      43,515     1,057.9      57.9      00:11:52
 33494      10   4,835      48,350     1,069.5      58.6      00:11:41
 33850      10   4,835      48,350     1,081.6      59.2      00:11:29
 34186      10   4,835      48,350     1,093.2      59.9      00:11:18
 34559       8   4,835      38,680     1,105.7      60.6      00:11:05
 34964       7   4,835      33,845     1,119.4      61.3      00:10:51
 35384       6   4,835      29,010     1,133.4      62.1      00:10:36
 35818       7   4,835      33,845     1,147.8      62.9      00:10:21
 36237       9   4,835      43,515     1,161.9      63.6      00:10:06
 36619       9   4,835      43,515     1,174.5      64.3      00:09:54
 36929       4   4,835      19,340     1,184.6      64.9      00:09:45
 37258       8   4,835      38,680     1,194.6      65.4      00:09:37
 37570      10   4,835      48,350     1,204.3      66.0      00:09:28
 37874       8   4,835      38,680     1,213.9      66.5      00:09:20
 38142       8   4,835      38,680     1,222.7      67.0      00:09:13
 38419      10   4,835      48,350     1,231.9      67.5      00:09:05
 38758       9   4,835      43,515     1,243.2      68.1      00:08:55
 39104       9   4,835      43,515     1,254.4      68.7      00:08:45
 39398       5   4,835      24,175     1,263.6      69.2      00:08:37
 39711      10   4,835      48,350     1,273.6      69.8      00:08:28
 40061       7   4,835      33,845     1,284.8      70.4      00:08:18
 40434       4   4,835      19,340     1,296.8      71.0      00:08:06
 40811       5   4,835      24,175     1,309.3      71.7      00:07:54
 41131       5   4,835      24,175     1,319.9      72.3      00:07:44
 41431       7   4,835      33,845     1,329.5      72.8      00:07:36
 41742       7   4,835      33,845     1,339.8      73.4      00:07:27
 42021      10   4,835      48,350     1,349.0      73.9      00:07:19
 42297       6   4,835      29,010     1,357.3      74.3      00:07:12
 42598       9   4,835      43,515     1,367.0      74.9      00:07:03
 42913       6   4,835      29,010     1,377.1      75.4      00:06:54
 43223      10   4,835      48,350     1,387.7      76.0      00:06:45
 43508      10   4,835      48,350     1,397.0      76.5      00:06:36
 43782       9   4,835      43,515     1,405.5      77.0      00:06:29
 44059       8   4,835      38,680     1,414.5      77.5      00:06:21
 44328       5   4,835      24,175     1,423.1      78.0      00:06:14
 44637      10   4,835      48,350     1,432.9      78.5      00:06:05
 44980       6   4,835      29,010     1,444.0      79.1      00:05:55
 45386       8   4,835      38,680     1,456.3      79.8      00:05:43
 45655       4   4,835      19,340     1,464.6      80.2      00:05:36
 45923       5   4,835      24,175     1,472.9      80.7      00:05:29
 46185       5   4,835      24,175     1,481.6      81.2      00:05:21
 46476       6   4,835      29,010     1,491.0      81.7      00:05:13
 46807       9   4,835      43,515     1,501.9      82.3      00:05:02
 47075       7   4,835      33,845     1,510.1      82.7      00:04:55
 47377       8   4,835      38,680     1,519.3      83.2      00:04:47
 47607       8   4,835      38,680     1,526.4      83.6      00:04:41
 47878       8   4,835      38,680     1,535.0      84.1      00:04:33
 48149       3   4,835      14,505     1,543.8      84.6      00:04:25
 48442       5   4,835      24,175     1,553.3      85.1      00:04:16
 48731       4   4,835      19,340     1,562.6      85.6      00:04:08
 49042       4   4,835      19,340     1,572.4      86.1      00:03:59
 49362       7   4,835      33,845     1,582.9      86.7      00:03:49
 49669       8   4,835      38,680     1,591.9      87.2      00:03:41
 49944       9   4,835      43,515     1,600.4      87.7      00:03:33
 50222       7   4,835      33,845     1,609.3      88.1      00:03:25
 50522       8   4,835      38,680     1,618.4      88.6      00:03:16
 50820      10   4,835      48,350     1,628.2      89.2      00:03:07
 51101       4   4,835      19,340     1,637.7      89.7      00:02:58
 51403       7   4,835      33,845     1,647.2      90.2      00:02:49
 51702       6   4,835      29,010     1,657.3      90.8      00:02:40
 51987       8   4,835      38,680     1,666.8      91.3      00:02:31
 52300       8   4,835      38,680     1,677.6      91.9      00:02:21
 52688      10   4,835      48,350     1,691.4      92.6      00:02:07
 53079       6   4,835      29,010     1,704.8      93.4      00:01:54
 53466      10   4,835      48,350     1,717.7      94.1      00:01:42
 53790       8   4,835      38,680     1,728.6      94.7      00:01:32
 54046       7   4,835      33,845     1,736.8      95.1      00:01:24
 54314      10   4,835      48,350     1,745.5      95.6      00:01:16
 54637      10   4,835      48,350     1,755.2      96.1      00:01:07
 54979       6   4,835      29,010     1,766.1      96.7      00:00:56
 55291       8   4,835      38,680     1,776.0      97.3      00:00:47
 55603       7   4,835      33,845     1,785.2      97.8      00:00:38
 55897       8   4,835      38,680     1,795.0      98.3      00:00:29
 56192       9   4,835      43,515     1,804.6      98.8      00:00:20
 56504       6   4,835      29,010     1,815.2      99.4      00:00:10
 56785       6   4,835      29,010     1,824.6      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1739.64
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800.csv saved

. 
. cap log close

. 
end of do-file
