
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A1000.dta /export/storage_covidvaccine/Result/MN
> L_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_
> 5_4q_mnl_A1000.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   366       8   5,035      40,280        10.5       0.6      00:30:04
   780       9   5,035      45,315        23.2       1.2      00:27:01
  1175       6   5,035      30,210        35.6       1.9      00:26:12
  1582       7   5,035      35,245        49.2       2.6      00:25:07
  2018       8   5,035      40,280        63.0       3.3      00:24:19
  2425       6   5,035      30,210        76.2       4.0      00:23:59
  2863       8   5,035      40,280        90.5       4.8      00:23:22
  3292       6   5,035      30,210       104.8       5.5      00:22:53
  3704       7   5,035      35,245       118.4       6.2      00:22:36
  4069       4   5,035      20,140       130.0       6.8      00:22:44
  4426       3   5,035      15,105       141.1       7.4      00:22:54
  4722       7   5,035      35,245       151.1       7.9      00:23:11
  5022      10   5,035      50,350       160.9       8.5      00:23:28
  5321       5   5,035      25,175       170.5       9.0      00:23:42
  5626      10   5,035      50,350       179.9       9.5      00:23:57
  5913       4   5,035      20,140       189.0       9.9      00:24:12
  6190      10   5,035      50,350       198.0      10.4      00:24:24
  6458      10   5,035      50,350       206.6      10.9      00:24:39
  6760       6   5,035      30,210       216.1      11.4      00:24:44
  7098       5   5,035      25,175       227.0      11.9      00:24:37
  7491       7   5,035      35,245       239.8      12.6      00:24:17
  7849       7   5,035      35,245       251.7      13.2      00:24:04
  8211       7   5,035      35,245       264.4      13.9      00:23:46
  8555       3   5,035      15,105       276.2      14.5      00:23:34
  8916      10   5,035      50,350       288.5      15.2      00:23:20
  9259       4   5,035      20,140       300.4      15.8      00:23:08
  9544       8   5,035      40,280       310.2      16.3      00:23:07
  9819       3   5,035      15,105       319.8      16.8      00:23:07
 10082       9   5,035      45,315       328.3      17.3      00:23:12
 10347      10   5,035      50,350       336.3      17.7      00:23:18
 10650       8   5,035      40,280       346.1      18.2      00:23:15
 10981       9   5,035      45,315       357.1      18.8      00:23:06
 11256       8   5,035      40,280       365.9      19.2      00:23:07
 11503       5   5,035      25,175       374.1      19.7      00:23:10
 11799       8   5,035      40,280       383.8      20.2      00:23:06
 12088       6   5,035      30,210       393.4      20.7      00:23:02
 12373      10   5,035      50,350       402.7      21.2      00:22:59
 12788       8   5,035      40,280       416.0      21.9      00:22:39
 13164       8   5,035      40,280       428.3      22.5      00:22:23
 13515       6   5,035      30,210       440.5      23.2      00:22:09
 13788       8   5,035      40,280       449.6      23.6      00:22:06
 14081       9   5,035      45,315       459.1      24.1      00:22:02
 14429       9   5,035      45,315       471.0      24.8      00:21:48
 14736       7   5,035      35,245       481.3      25.3      00:21:41
 15063       4   5,035      20,140       492.4      25.9      00:21:30
 15361       9   5,035      45,315       502.6      26.4      00:21:22
 15767       5   5,035      25,175       516.1      27.1      00:21:04
 16166       6   5,035      30,210       530.2      27.9      00:20:44
 16550       7   5,035      35,245       543.4      28.6      00:20:26
 16877       2   5,035      10,070       554.2      29.2      00:20:17
 17144       9   5,035      45,315       563.2      29.6      00:20:14
 17390       7   5,035      35,245       571.7      30.1      00:20:11
 17643       5   5,035      25,175       580.6      30.5      00:20:08
 17939       6   5,035      30,210       590.3      31.1      00:20:01
 18251       7   5,035      35,245       601.1      31.6      00:19:52
 18570       8   5,035      40,280       611.4      32.2      00:19:44
 18858       6   5,035      30,210       621.3      32.7      00:19:36
 19196      10   5,035      50,350       633.3      33.3      00:19:23
 19577       8   5,035      40,280       646.5      34.0      00:19:07
 19962       7   5,035      35,245       660.2      34.7      00:18:50
 20317       9   5,035      45,315       672.4      35.4      00:18:37
 20585       6   5,035      30,210       681.6      35.9      00:18:31
 20770       5   5,035      25,175       687.9      36.2      00:18:33
 20993       7   5,035      35,245       695.6      36.6      00:18:31
 21254      10   5,035      50,350       703.7      37.0      00:18:28
 21567       7   5,035      35,245       713.8      37.5      00:18:20
 21914       4   5,035      20,140       724.5      38.1      00:18:10
 22281      10   5,035      50,350       736.0      38.7      00:17:59
 22631      10   5,035      50,350       747.2      39.3      00:17:48
 22916       8   5,035      40,280       755.8      39.8      00:17:43
 23225      10   5,035      50,350       766.3      40.3      00:17:33
 23538      10   5,035      50,350       776.2      40.8      00:17:25
 23792       8   5,035      40,280       784.6      41.3      00:17:21
 24045       8   5,035      40,280       793.0      41.7      00:17:16
 24351       4   5,035      20,140       802.5      42.2      00:17:09
 24654      10   5,035      50,350       812.7      42.7      00:16:60
 24964       8   5,035      40,280       822.7      43.3      00:16:51
 25292       9   5,035      45,315       833.9      43.9      00:16:40
 25620       7   5,035      35,245       844.7      44.4      00:16:30
 25876       4   5,035      20,140       853.4      44.9      00:16:24
 26173       5   5,035      25,175       863.3      45.4      00:16:16
 26511       6   5,035      30,210       874.3      46.0      00:16:05
 26856       7   5,035      35,245       885.5      46.6      00:15:54
 27172      10   5,035      50,350       896.2      47.1      00:15:44
 27504       8   5,035      40,280       907.1      47.7      00:15:33
 27816       9   5,035      45,315       917.6      48.3      00:15:23
 28164       8   5,035      40,280       929.6      48.9      00:15:11
 28525      10   5,035      50,350       942.1      49.6      00:14:57
 28851      10   5,035      50,350       953.4      50.1      00:14:46
 29139       8   5,035      40,280       963.3      50.7      00:14:38
 29506       6   5,035      30,210       975.7      51.3      00:14:25
 29837       9   5,035      45,315       986.8      51.9      00:14:14
 30101       7   5,035      35,245       995.7      52.4      00:14:07
 30383       9   5,035      45,315     1,005.3      52.9      00:13:59
 30679       8   5,035      40,280     1,015.6      53.4      00:13:50
 31056       8   5,035      40,280     1,028.4      54.1      00:13:36
 31419       8   5,035      40,280     1,041.0      54.8      00:13:23
 31791       8   5,035      40,280     1,054.1      55.4      00:13:09
 32164       8   5,035      40,280     1,067.3      56.1      00:12:55
 32544       7   5,035      35,245     1,080.8      56.8      00:12:40
 32831       9   5,035      45,315     1,090.8      57.4      00:12:32
 33097       8   5,035      40,280     1,100.1      57.9      00:12:24
 33421      10   5,035      50,350     1,111.4      58.5      00:12:13
 33752       9   5,035      45,315     1,123.0      59.1      00:12:02
 33990       4   5,035      20,140     1,131.4      59.5      00:11:56
 34323       5   5,035      25,175     1,143.3      60.1      00:11:44
 34727       8   5,035      40,280     1,157.3      60.9      00:11:29
 35152      10   5,035      50,350     1,172.2      61.7      00:11:13
 35566       7   5,035      35,245     1,186.7      62.4      00:10:57
 35991      10   5,035      50,350     1,201.4      63.2      00:10:42
 36395       6   5,035      30,210     1,215.6      63.9      00:10:27
 36757       6   5,035      30,210     1,227.7      64.6      00:10:15
 37068       7   5,035      35,245     1,238.1      65.1      00:10:06
 37369       6   5,035      30,210     1,247.5      65.6      00:09:58
 37674       7   5,035      35,245     1,257.6      66.2      00:09:50
 37948      10   5,035      50,350     1,266.6      66.6      00:09:42
 38220       9   5,035      45,315     1,276.0      67.1      00:09:34
 38478       4   5,035      20,140     1,284.9      67.6      00:09:27
 38852       8   5,035      40,280     1,297.7      68.3      00:09:14
 39164       9   5,035      45,315     1,308.3      68.8      00:09:05
 39498       8   5,035      40,280     1,319.1      69.4      00:08:55
 39830      10   5,035      50,350     1,330.1      70.0      00:08:45
 40218      10   5,035      50,350     1,343.2      70.7      00:08:32
 40601      10   5,035      50,350     1,356.2      71.3      00:08:19
 40986      10   5,035      50,350     1,369.6      72.0      00:08:06
 41238       7   5,035      35,245     1,378.1      72.5      00:07:59
 41547       6   5,035      30,210     1,388.5      73.0      00:07:50
 41886       6   5,035      30,210     1,400.2      73.6      00:07:39
 42204       5   5,035      25,175     1,410.5      74.2      00:07:30
 42532       4   5,035      20,140     1,421.4      74.8      00:07:20
 42807       9   5,035      45,315     1,430.5      75.2      00:07:12
 43091       8   5,035      40,280     1,440.3      75.8      00:07:03
 43379       4   5,035      20,140     1,450.4      76.3      00:06:54
 43643       7   5,035      35,245     1,459.1      76.7      00:06:47
 43923       8   5,035      40,280     1,468.5      77.2      00:06:38
 44233      10   5,035      50,350     1,478.9      77.8      00:06:29
 44558       8   5,035      40,280     1,489.5      78.3      00:06:19
 44899       7   5,035      35,245     1,501.0      79.0      00:06:09
 45251       7   5,035      35,245     1,512.5      79.6      00:05:58
 45584       9   5,035      45,315     1,523.0      80.1      00:05:48
 45913      10   5,035      50,350     1,533.5      80.7      00:05:39
 46244       6   5,035      30,210     1,545.0      81.3      00:05:28
 46497       8   5,035      40,280     1,553.4      81.7      00:05:21
 46776       7   5,035      35,245     1,563.0      82.2      00:05:12
 47118       5   5,035      25,175     1,574.0      82.8      00:05:02
 47426       8   5,035      40,280     1,583.8      83.3      00:04:53
 47718       9   5,035      45,315     1,593.3      83.8      00:04:45
 47952      10   5,035      50,350     1,601.0      84.2      00:04:38
 48222       8   5,035      40,280     1,610.0      84.7      00:04:30
 48528       2   5,035      10,070     1,620.5      85.2      00:04:20
 48788       8   5,035      40,280     1,629.1      85.7      00:04:13
 49023       8   5,035      40,280     1,636.9      86.1      00:04:06
 49258       7   5,035      35,245     1,645.2      86.5      00:03:59
 49543       5   5,035      25,175     1,654.0      87.0      00:03:51
 49828       5   5,035      25,175     1,662.9      87.5      00:03:43
 50104       7   5,035      35,245     1,672.0      87.9      00:03:34
 50412       9   5,035      45,315     1,681.7      88.5      00:03:25
 50650       7   5,035      35,245     1,689.7      88.9      00:03:18
 50903       8   5,035      40,280     1,698.4      89.3      00:03:10
 51183       6   5,035      30,210     1,708.0      89.8      00:03:01
 51466       6   5,035      30,210     1,717.6      90.3      00:02:52
 51720       9   5,035      45,315     1,726.5      90.8      00:02:44
 51978       8   5,035      40,280     1,735.4      91.3      00:02:36
 52233       5   5,035      25,175     1,744.7      91.8      00:02:27
 52581       8   5,035      40,280     1,757.3      92.4      00:02:15
 52958       7   5,035      35,245     1,771.0      93.2      00:02:02
 53352       5   5,035      25,175     1,784.9      93.9      00:01:49
 53727       6   5,035      30,210     1,797.9      94.6      00:01:37
 53962       6   5,035      30,210     1,805.8      95.0      00:01:29
 54234      10   5,035      50,350     1,814.9      95.5      00:01:21
 54505       2   5,035      10,070     1,823.6      95.9      00:01:13
 54859       4   5,035      20,140     1,835.1      96.5      00:01:02
 55189       7   5,035      35,245     1,846.1      97.1      00:00:52
 55504       5   5,035      25,175     1,856.1      97.6      00:00:42
 55720       6   5,035      30,210     1,863.1      98.0      00:00:36
 55921       8   5,035      40,280     1,870.0      98.4      00:00:29
 56180       6   5,035      30,210     1,878.8      98.8      00:00:21
 56419       7   5,035      35,245     1,887.2      99.3      00:00:13
 56692       9   5,035      45,315     1,896.8      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1802.702
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000.csv saved

. 
. cap log close

. 
end of do-file
