
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A500_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:26

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   388       6   4,535      27,210        10.1       0.6      00:28:14
   820       6   4,535      27,210        22.1       1.3      00:25:33
  1249       7   4,535      31,745        34.3       2.0      00:24:31
  1663       5   4,535      22,675        46.7       2.7      00:23:49
  2110      10   4,535      45,350        59.5       3.5      00:23:10
  2571       6   4,535      27,210        72.7       4.2      00:22:34
  2988       5   4,535      22,675        84.9       5.0      00:22:24
  3402      10   4,535      45,350        97.6       5.7      00:22:04
  3799       7   4,535      31,745       109.6       6.4      00:21:58
  4163       8   4,535      36,280       119.8       7.0      00:22:11
  4498       7   4,535      31,745       129.2       7.5      00:22:29
  4788      10   4,535      45,350       138.0       8.1      00:22:50
  5117       6   4,535      27,210       147.5       8.6      00:23:00
  5429       7   4,535      31,745       156.9       9.2      00:23:09
  5686       9   4,535      40,815       163.7       9.6      00:23:40
  5949       8   4,535      36,280       171.3      10.0      00:24:01
  6218       9   4,535      40,815       179.2      10.5      00:24:16
  6526       6   4,535      27,210       188.0      11.0      00:24:21
  6853       9   4,535      40,815       197.4      11.5      00:24:20
  7249       6   4,535      27,210       208.6      12.2      00:24:03
  7665       8   4,535      36,280       221.2      12.9      00:23:38
  8058       5   4,535      22,675       233.3      13.6      00:23:16
  8407       4   4,535      18,140       244.2      14.3      00:23:05
  8758       6   4,535      27,210       254.9      14.9      00:22:54
  9145      10   4,535      45,350       267.0      15.6      00:22:35
  9430       7   4,535      31,745       275.8      16.1      00:22:36
  9713       7   4,535      31,745       284.8      16.6      00:22:35
  9971       8   4,535      36,280       292.5      17.1      00:22:41
 10318      10   4,535      45,350       302.0      17.6      00:22:36
 10692       8   4,535      36,280       313.0      18.3      00:22:23
 11076       3   4,535      13,605       324.3      18.9      00:22:09
 11322       6   4,535      27,210       331.5      19.4      00:22:15
 11522       7   4,535      31,745       337.6      19.7      00:22:26
 11792       9   4,535      40,815       345.4      20.2      00:22:27
 12039       8   4,535      36,280       352.8      20.6      00:22:31
 12351       7   4,535      31,745       362.1      21.1      00:22:24
 12788       8   4,535      36,280       374.7      21.9      00:22:03
 13234       6   4,535      27,210       387.9      22.7      00:21:39
 13621       9   4,535      40,815       400.1      23.4      00:21:21
 13941       9   4,535      40,815       409.4      23.9      00:21:15
 14278       8   4,535      36,280       419.7      24.5      00:21:05
 14585       7   4,535      31,745       429.0      25.1      00:20:58
 14848      10   4,535      45,350       436.9      25.5      00:20:57
 15167       4   4,535      18,140       446.8      26.1      00:20:48
 15548       6   4,535      27,210       458.2      26.8      00:20:33
 15938       8   4,535      36,280       470.3      27.5      00:20:17
 16335       5   4,535      22,675       482.8      28.2      00:19:59
 16637       5   4,535      22,675       491.9      28.7      00:19:52
 16891       8   4,535      36,280       499.6      29.2      00:19:51
 17144       9   4,535      40,815       507.3      29.6      00:19:49
 17404      10   4,535      45,350       515.3      30.1      00:19:46
 17688       4   4,535      18,140       524.4      30.6      00:19:40
 18023      10   4,535      45,350       534.2      31.2      00:19:30
 18333       6   4,535      27,210       543.9      31.8      00:19:22
 18610       7   4,535      31,745       551.9      32.2      00:19:18
 18845       8   4,535      36,280       559.2      32.7      00:19:16
 19102       5   4,535      22,675       567.4      33.1      00:19:12
 19417       2   4,535       9,070       577.2      33.7      00:19:02
 19789       8   4,535      36,280       589.1      34.4      00:18:46
 20128       9   4,535      40,815       600.0      35.0      00:18:34
 20546       7   4,535      31,745       612.7      35.8      00:18:16
 20860       8   4,535      36,280       622.4      36.3      00:18:07
 21187       1   4,535       4,535       632.1      36.9      00:17:58
 21530       8   4,535      36,280       641.8      37.5      00:17:49
 21877       6   4,535      27,210       651.4      38.0      00:17:40
 22240       5   4,535      22,675       661.7      38.6      00:17:29
 22579       4   4,535      18,140       671.4      39.2      00:17:20
 22887       7   4,535      31,745       680.0      39.7      00:17:14
 23171      10   4,535      45,350       688.5      40.2      00:17:07
 23506       8   4,535      36,280       698.3      40.8      00:16:58
 23850       6   4,535      27,210       708.6      41.4      00:16:47
 24247      10   4,535      45,350       720.0      42.0      00:16:34
 24649       9   4,535      40,815       731.8      42.7      00:16:19
 25048      10   4,535      45,350       743.6      43.4      00:16:05
 25422       9   4,535      40,815       755.0      44.1      00:15:52
 25770       8   4,535      36,280       765.4      44.7      00:15:42
 26059       9   4,535      40,815       774.1      45.2      00:15:34
 26422       9   4,535      40,815       784.9      45.8      00:15:23
 26839       7   4,535      31,745       797.1      46.5      00:15:08
 27191       8   4,535      36,280       807.7      47.2      00:14:57
 27531      10   4,535      45,350       817.9      47.8      00:14:47
 27787       7   4,535      31,745       825.6      48.2      00:14:42
 28085       5   4,535      22,675       834.8      48.7      00:14:34
 28440       6   4,535      27,210       845.8      49.4      00:14:22
 28736       9   4,535      40,815       855.1      49.9      00:14:13
 29020       3   4,535      13,605       863.9      50.5      00:14:06
 29361       9   4,535      40,815       874.3      51.1      00:13:55
 29748       8   4,535      36,280       886.0      51.7      00:13:42
 30057       9   4,535      40,815       895.5      52.3      00:13:33
 30381       6   4,535      27,210       905.4      52.9      00:13:23
 30729       5   4,535      22,675       916.3      53.5      00:13:12
 31185      10   4,535      45,350       930.3      54.3      00:12:55
 31631      10   4,535      45,350       944.3      55.1      00:12:37
 32072      10   4,535      45,350       958.4      56.0      00:12:20
 32498      10   4,535      45,350       972.2      56.8      00:12:04
 32757       7   4,535      31,745       980.1      57.2      00:11:58
 33070       7   4,535      31,745       990.0      57.8      00:11:49
 33426       9   4,535      40,815     1,001.2      58.5      00:11:37
 33738       9   4,535      40,815     1,011.0      59.0      00:11:28
 34078       9   4,535      40,815     1,021.7      59.7      00:11:17
 34415       5   4,535      22,675     1,032.6      60.3      00:11:06
 34814       8   4,535      36,280     1,045.2      61.0      00:10:52
 35212       5   4,535      22,675     1,057.8      61.8      00:10:38
 35599       8   4,535      36,280     1,069.9      62.5      00:10:25
 35991      10   4,535      45,350     1,082.1      63.2      00:10:13
 36423       7   4,535      31,745     1,095.7      64.0      00:09:58
 36795       6   4,535      27,210     1,106.9      64.6      00:09:46
 37123       5   4,535      22,675     1,116.9      65.2      00:09:37
 37466       6   4,535      27,210     1,126.5      65.8      00:09:28
 37771       6   4,535      27,210     1,135.5      66.3      00:09:20
 38042       1   4,535       4,535     1,143.6      66.8      00:09:13
 38319       8   4,535      36,280     1,152.3      67.3      00:09:05
 38653       7   4,535      31,745     1,162.7      67.9      00:08:55
 39041       8   4,535      36,280     1,174.7      68.6      00:08:43
 39366       6   4,535      27,210     1,184.3      69.2      00:08:33
 39690      10   4,535      45,350     1,193.9      69.7      00:08:24
 40088       6   4,535      27,210     1,205.9      70.4      00:08:12
 40451       4   4,535      18,140     1,216.9      71.1      00:08:01
 40823      10   4,535      45,350     1,228.4      71.7      00:07:49
 41088       3   4,535      13,605     1,236.7      72.2      00:07:42
 41300      10   4,535      45,350     1,243.1      72.6      00:07:37
 41592       9   4,535      40,815     1,252.1      73.1      00:07:29
 41903      10   4,535      45,350     1,261.7      73.7      00:07:20
 42176       6   4,535      27,210     1,269.6      74.1      00:07:13
 42503       9   4,535      40,815     1,279.4      74.7      00:07:04
 42850      10   4,535      45,350     1,289.8      75.3      00:06:53
 43166      10   4,535      45,350     1,299.8      75.9      00:06:44
 43495       6   4,535      27,210     1,309.9      76.5      00:06:34
 43822       7   4,535      31,745     1,319.5      77.1      00:06:25
 44150       6   4,535      27,210     1,329.4      77.6      00:06:15
 44488      10   4,535      45,350     1,339.4      78.2      00:06:05
 44862       6   4,535      27,210     1,350.8      78.9      00:05:54
 45271       9   4,535      40,815     1,362.9      79.6      00:05:42
 45618      10   4,535      45,350     1,372.7      80.2      00:05:32
 45980       7   4,535      31,745     1,383.3      80.8      00:05:22
 46270       7   4,535      31,745     1,392.4      81.3      00:05:13
 46580       7   4,535      31,745     1,401.8      81.9      00:05:04
 46922       7   4,535      31,745     1,412.3      82.5      00:04:54
 47211       5   4,535      22,675     1,420.1      82.9      00:04:47
 47548       7   4,535      31,745     1,429.9      83.5      00:04:37
 47874       5   4,535      22,675     1,439.6      84.1      00:04:28
 48193       6   4,535      27,210     1,449.3      84.6      00:04:18
 48528       2   4,535       9,070     1,459.5      85.2      00:04:08
 48915       3   4,535      13,605     1,471.1      85.9      00:03:57
 49241       4   4,535      18,140     1,481.3      86.5      00:03:47
 49560      10   4,535      45,350     1,490.3      87.0      00:03:38
 49870       8   4,535      36,280     1,498.9      87.5      00:03:30
 50166       6   4,535      27,210     1,507.8      88.1      00:03:21
 50484       4   4,535      18,140     1,516.9      88.6      00:03:12
 50804       5   4,535      22,675     1,526.7      89.2      00:03:03
 51085       9   4,535      40,815     1,535.6      89.7      00:02:54
 51395       7   4,535      31,745     1,544.8      90.2      00:02:45
 51694       8   4,535      36,280     1,554.2      90.8      00:02:36
 52008       9   4,535      40,815     1,564.0      91.3      00:02:26
 52292       7   4,535      31,745     1,573.3      91.9      00:02:17
 52675       5   4,535      22,675     1,586.0      92.6      00:02:04
 53070       9   4,535      40,815     1,598.8      93.4      00:01:52
 53497       8   4,535      36,280     1,612.2      94.1      00:01:38
 53857       7   4,535      31,745     1,623.4      94.8      00:01:27
 54157       8   4,535      36,280     1,632.4      95.3      00:01:19
 54481       9   4,535      40,815     1,641.9      95.9      00:01:09
 54841       6   4,535      27,210     1,652.3      96.5      00:00:59
 55184       8   4,535      36,280     1,662.6      97.1      00:00:49
 55529       1   4,535       4,535     1,672.5      97.7      00:00:39
 55830       8   4,535      36,280     1,681.4      98.2      00:00:30
 56172       7   4,535      31,745     1,692.0      98.8      00:00:20
 56511       9   4,535      40,815     1,702.8      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1687.384
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
