
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A500.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
(file /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   397       9   4,535      40,815        10.3       0.6      00:27:32
   841       4   4,535      18,140        22.6       1.3      00:24:57
  1255      10   4,535      45,350        34.5       2.0      00:24:22
  1661       6   4,535      27,210        46.6       2.7      00:23:51
  2117       8   4,535      36,280        59.8       3.5      00:23:05
  2567       4   4,535      18,140        72.6       4.2      00:22:37
  3030       7   4,535      31,745        86.1       5.0      00:22:04
  3495       8   4,535      36,280       100.5       5.9      00:21:25
  3966      10   4,535      45,350       114.1       6.7      00:21:02
  4350       9   4,535      40,815       124.9       7.3      00:21:13
  4683       8   4,535      36,280       134.9       7.9      00:21:28
  5036       4   4,535      18,140       145.3       8.5      00:21:36
  5373       7   4,535      31,745       155.3       9.1      00:21:45
  5681       9   4,535      40,815       163.6       9.6      00:22:08
  5999       8   4,535      36,280       172.8      10.1      00:22:19
  6365      10   4,535      45,350       183.3      10.7      00:22:16
  6763       9   4,535      40,815       194.7      11.4      00:22:07
  7062       5   4,535      22,675       203.4      11.9      00:22:18
  7373      10   4,535      45,350       212.5      12.4      00:22:23
  7728       8   4,535      36,280       222.9      13.0      00:22:19
  8107       8   4,535      36,280       234.8      13.7      00:22:04
  8520       7   4,535      31,745       247.7      14.5      00:21:43
  8928      10   4,535      45,350       260.3      15.2      00:21:25
  9285       7   4,535      31,745       271.3      15.8      00:21:17
  9581      10   4,535      45,350       280.6      16.4      00:21:18
  9906       8   4,535      36,280       290.6      17.0      00:21:14
 10207       7   4,535      31,745       299.0      17.5      00:21:19
 10556      10   4,535      45,350       309.1      18.0      00:21:13
 10937       8   4,535      36,280       320.3      18.7      00:21:03
 11255       7   4,535      31,745       329.5      19.2      00:21:01
 11534       9   4,535      40,815       337.8      19.7      00:21:03
 11813       7   4,535      31,745       346.1      20.2      00:21:05
 12087       6   4,535      27,210       354.3      20.7      00:21:07
 12362       7   4,535      31,745       362.4      21.2      00:21:08
 12750       3   4,535      13,605       373.8      21.8      00:20:55
 13152       6   4,535      27,210       385.5      22.5      00:20:41
 13517       7   4,535      31,745       396.8      23.2      00:20:29
 13788       8   4,535      36,280       404.9      23.6      00:20:29
 14072       8   4,535      36,280       413.3      24.1      00:20:28
 14375       9   4,535      40,815       422.7      24.7      00:20:23
 14623       3   4,535      13,605       430.1      25.1      00:20:24
 14938       8   4,535      36,280       439.6      25.7      00:20:18
 15335       5   4,535      22,675       451.9      26.4      00:20:01
 15770      10   4,535      45,350       465.0      27.2      00:19:42
 16177       6   4,535      27,210       477.8      27.9      00:19:24
 16618       5   4,535      22,675       491.4      28.7      00:19:05
 16968       9   4,535      40,815       502.0      29.3      00:18:55
 17301       9   4,535      40,815       512.1      29.9      00:18:47
 17568       6   4,535      27,210       520.7      30.4      00:18:43
 17902       6   4,535      27,210       530.6      31.0      00:18:35
 18208       9   4,535      40,815       540.1      31.5      00:18:29
 18541      10   4,535      45,350       549.7      32.1      00:18:21
 18815       7   4,535      31,745       558.3      32.6      00:18:17
 19114      10   4,535      45,350       567.8      33.2      00:18:10
 19463       6   4,535      27,210       578.7      33.8      00:17:59
 19887       8   4,535      36,280       592.1      34.6      00:17:41
 20330       7   4,535      31,745       606.0      35.4      00:17:22
 20706       7   4,535      31,745       617.7      36.1      00:17:10
 21049      10   4,535      45,350       628.1      36.7      00:17:00
 21414       8   4,535      36,280       638.2      37.3      00:16:51
 21747       6   4,535      27,210       647.7      37.8      00:16:44
 22123       7   4,535      31,745       658.3      38.4      00:16:34
 22489       5   4,535      22,675       668.7      39.1      00:16:25
 22860       8   4,535      36,280       679.1      39.7      00:16:15
 23216       9   4,535      40,815       689.9      40.3      00:16:05
 23603       8   4,535      36,280       701.0      40.9      00:15:54
 23988       5   4,535      22,675       712.5      41.6      00:15:42
 24435       8   4,535      36,280       725.2      42.3      00:15:27
 24882       5   4,535      22,675       738.8      43.1      00:15:11
 25312      10   4,535      45,350       751.7      43.9      00:14:56
 25718      10   4,535      45,350       763.7      44.6      00:14:43
 26023       9   4,535      40,815       773.1      45.1      00:14:36
 26340       6   4,535      27,210       782.6      45.7      00:14:29
 26694       8   4,535      36,280       792.7      46.3      00:14:20
 27081       6   4,535      27,210       804.4      47.0      00:14:08
 27421      10   4,535      45,350       814.5      47.6      00:13:59
 27762      10   4,535      45,350       824.9      48.2      00:13:50
 28154       6   4,535      27,210       837.0      48.9      00:13:37
 28559       9   4,535      40,815       849.7      49.6      00:13:23
 28886       9   4,535      40,815       859.8      50.2      00:13:15
 29246       8   4,535      36,280       870.6      50.8      00:13:04
 29630       4   4,535      18,140       882.4      51.5      00:12:53
 29911       9   4,535      40,815       891.0      52.0      00:12:46
 30154       9   4,535      40,815       898.4      52.5      00:12:42
 30446       8   4,535      36,280       907.5      53.0      00:12:35
 30832       8   4,535      36,280       919.6      53.7      00:12:23
 31261       4   4,535      18,140       932.7      54.5      00:12:08
 31684       7   4,535      31,745       945.9      55.2      00:11:54
 32023       9   4,535      40,815       956.9      55.9      00:11:44
 32380       9   4,535      40,815       968.3      56.6      00:11:33
 32642       8   4,535      36,280       976.5      57.0      00:11:27
 32865       8   4,535      36,280       983.4      57.4      00:11:23
 33129       9   4,535      40,815       991.9      57.9      00:11:17
 33495       9   4,535      40,815     1,003.2      58.6      00:11:06
 33838       5   4,535      22,675     1,014.1      59.2      00:10:55
 34218       8   4,535      36,280     1,026.4      59.9      00:10:43
 34648       6   4,535      27,210     1,039.9      60.7      00:10:28
 35091       8   4,535      36,280     1,053.9      61.5      00:10:13
 35528      10   4,535      45,350     1,067.8      62.4      00:09:59
 35960       9   4,535      40,815     1,081.1      63.1      00:09:45
 36367      10   4,535      45,350     1,093.9      63.9      00:09:32
 36728       7   4,535      31,745     1,104.9      64.5      00:09:22
 37084       2   4,535       9,070     1,115.7      65.2      00:09:12
 37429       6   4,535      27,210     1,125.5      65.7      00:09:03
 37754       4   4,535      18,140     1,134.9      66.3      00:08:55
 38041       2   4,535       9,070     1,143.6      66.8      00:08:48
 38299       7   4,535      31,745     1,151.7      67.3      00:08:42
 38587       8   4,535      36,280     1,160.8      67.8      00:08:34
 38984       8   4,535      36,280     1,172.9      68.5      00:08:22
 39292      10   4,535      45,350     1,182.0      69.0      00:08:14
 39668      10   4,535      45,350     1,193.3      69.7      00:08:04
 40045       8   4,535      36,280     1,204.6      70.3      00:07:53
 40483       7   4,535      31,745     1,217.9      71.1      00:07:40
 40933       4   4,535      18,140     1,231.8      71.9      00:07:26
 41240       9   4,535      40,815     1,241.3      72.5      00:07:17
 41612      10   4,535      45,350     1,252.7      73.2      00:07:06
 41988       1   4,535       4,535     1,264.4      73.8      00:06:55
 42337       6   4,535      27,210     1,274.2      74.4      00:06:47
 42673       6   4,535      27,210     1,284.4      75.0      00:06:37
 43015       7   4,535      31,745     1,294.8      75.6      00:06:28
 43273       6   4,535      27,210     1,303.1      76.1      00:06:21
 43534       8   4,535      36,280     1,311.1      76.6      00:06:14
 43817      10   4,535      45,350     1,319.4      77.0      00:06:07
 44151       7   4,535      31,745     1,329.4      77.6      00:05:58
 44499      10   4,535      45,350     1,339.8      78.2      00:05:48
 44872       6   4,535      27,210     1,351.0      78.9      00:05:38
 45253       4   4,535      18,140     1,362.4      79.6      00:05:27
 45560       8   4,535      36,280     1,371.1      80.1      00:05:19
 45956       8   4,535      36,280     1,382.5      80.7      00:05:08
 46304       8   4,535      36,280     1,393.5      81.4      00:04:58
 46681       4   4,535      18,140     1,404.9      82.0      00:04:47
 47060       2   4,535       9,070     1,416.0      82.7      00:04:37
 47393       8   4,535      36,280     1,425.5      83.2      00:04:28
 47720       9   4,535      40,815     1,435.2      83.8      00:04:19
 48012       8   4,535      36,280     1,443.9      84.3      00:04:12
 48306       9   4,535      40,815     1,452.8      84.8      00:04:03
 48636       3   4,535      13,605     1,462.8      85.4      00:03:54
 48985       6   4,535      27,210     1,473.3      86.0      00:03:44
 49295       7   4,535      31,745     1,482.7      86.6      00:03:36
 49632       9   4,535      40,815     1,492.1      87.1      00:03:27
 49960       5   4,535      22,675     1,501.6      87.7      00:03:18
 50285       7   4,535      31,745     1,511.2      88.3      00:03:09
 50578       8   4,535      36,280     1,519.8      88.8      00:03:02
 50921       8   4,535      36,280     1,530.3      89.4      00:02:52
 51232       4   4,535      18,140     1,539.8      89.9      00:02:43
 51572       8   4,535      36,280     1,550.3      90.5      00:02:33
 51876      10   4,535      45,350     1,560.0      91.1      00:02:24
 52193      10   4,535      45,350     1,570.2      91.7      00:02:14
 52578       7   4,535      31,745     1,582.7      92.4      00:02:02
 52997       6   4,535      27,210     1,596.3      93.2      00:01:49
 53423       8   4,535      36,280     1,609.8      94.0      00:01:36
 53813       9   4,535      40,815     1,622.0      94.7      00:01:25
 54088       6   4,535      27,210     1,630.3      95.2      00:01:17
 54343       8   4,535      36,280     1,638.0      95.7      00:01:10
 54643       9   4,535      40,815     1,646.5      96.2      00:01:02
 54942       9   4,535      40,815     1,655.4      96.7      00:00:54
 55265       7   4,535      31,745     1,665.0      97.2      00:00:45
 55567      10   4,535      45,350     1,673.5      97.7      00:00:37
 55854       5   4,535      22,675     1,682.1      98.2      00:00:29
 56190       3   4,535      13,605     1,692.5      98.8      00:00:19
 56514       6   4,535      27,210     1,702.9      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1626.857
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
