
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A600.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A600.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:56

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   340       8   4,635      37,080         9.0       0.5      00:32:11
   711       6   4,635      27,810        19.2       1.1      00:30:06
  1059       8   4,635      37,080        29.3       1.7      00:29:25
  1412       5   4,635      23,175        40.0       2.3      00:28:32
  1771       6   4,635      27,810        50.9       2.9      00:27:51
  2162       9   4,635      41,715        62.3       3.6      00:27:08
  2542       5   4,635      23,175        73.4       4.2      00:26:42
  2915       5   4,635      23,175        84.8       4.8      00:26:14
  3296       8   4,635      37,080        96.6       5.5      00:25:44
  3655      10   4,635      46,350       107.5       6.1      00:25:31
  3983       9   4,635      41,715       117.2       6.7      00:25:36
  4255       8   4,635      37,080       125.1       7.1      00:26:02
  4522       7   4,635      32,445       132.8       7.6      00:26:26
  4770       6   4,635      27,810       140.5       8.0      00:26:47
  5031      10   4,635      46,350       148.3       8.5      00:27:03
  5294       9   4,635      41,715       156.1       8.9      00:27:17
  5559       6   4,635      27,810       163.7       9.4      00:27:30
  5818       5   4,635      23,175       171.2       9.8      00:27:44
  6086       7   4,635      32,445       179.3      10.2      00:27:48
  6344       2   4,635       9,270       186.8      10.7      00:27:58
  6640       3   4,635      13,905       195.4      11.2      00:27:54
  6928       6   4,635      27,810       204.0      11.7      00:27:51
  7258       7   4,635      32,445       213.5      12.2      00:27:39
  7589       8   4,635      37,080       223.7      12.8      00:27:21
  7928       5   4,635      23,175       234.3      13.4      00:27:01
  8280       9   4,635      41,715       245.4      14.0      00:26:38
  8596      10   4,635      46,350       255.5      14.6      00:26:23
  8887       8   4,635      37,080       264.6      15.1      00:26:15
  9175      10   4,635      46,350       273.9      15.6      00:26:06
  9421       7   4,635      32,445       281.6      16.1      00:26:08
  9682      10   4,635      46,350       290.2      16.6      00:26:03
  9978      10   4,635      46,350       299.2      17.1      00:25:55
 10283       6   4,635      27,810       307.7      17.6      00:25:50
 10550       6   4,635      27,810       315.7      18.0      00:25:48
 10886       9   4,635      41,715       325.7      18.6      00:25:34
 11222       5   4,635      23,175       335.9      19.2      00:25:19
 11505       5   4,635      23,175       344.5      19.7      00:25:13
 11838       7   4,635      32,445       354.5      20.3      00:24:59
 12159       8   4,635      37,080       364.4      20.8      00:24:47
 12560       5   4,635      23,175       376.5      21.5      00:24:22
 13019       4   4,635      18,540       389.9      22.3      00:23:53
 13425       7   4,635      32,445       402.3      23.0      00:23:30
 13700       9   4,635      41,715       411.3      23.5      00:23:22
 13922       2   4,635       9,270       417.9      23.9      00:23:26
 14176      10   4,635      46,350       425.6      24.3      00:23:23
 14415      10   4,635      46,350       433.2      24.8      00:23:21
 14670       9   4,635      41,715       441.1      25.2      00:23:18
 14988       7   4,635      32,445       450.9      25.8      00:23:06
 15359       8   4,635      37,080       462.6      26.4      00:22:47
 15721       7   4,635      32,445       473.6      27.1      00:22:31
 16080       7   4,635      32,445       485.3      27.7      00:22:12
 16426       7   4,635      32,445       496.4      28.4      00:21:56
 16708       8   4,635      37,080       505.0      28.9      00:21:50
 16969       8   4,635      37,080       513.2      29.3      00:21:45
 17186       5   4,635      23,175       519.7      29.7      00:21:45
 17422       7   4,635      32,445       527.3      30.1      00:21:42
 17727       5   4,635      23,175       537.0      30.7      00:21:31
 18086       5   4,635      23,175       548.1      31.3      00:21:15
 18455       6   4,635      27,810       559.3      32.0      00:20:59
 18792      10   4,635      46,350       570.0      32.6      00:20:45
 19145       9   4,635      41,715       581.3      33.2      00:20:29
 19560       5   4,635      23,175       594.6      34.0      00:20:07
 20007       6   4,635      27,810       609.1      34.8      00:19:43
 20463       9   4,635      41,715       623.6      35.6      00:19:19
 20792       7   4,635      32,445       634.0      36.2      00:19:07
 21173       8   4,635      37,080       645.6      36.9      00:18:51
 21536       9   4,635      41,715       656.1      37.5      00:18:40
 21885       5   4,635      23,175       666.1      38.1      00:18:29
 22256       9   4,635      41,715       676.8      38.7      00:18:17
 22606       7   4,635      32,445       687.0      39.3      00:18:05
 22968       6   4,635      27,810       697.4      39.8      00:17:54
 23301       3   4,635      13,905       707.8      40.4      00:17:42
 23661       7   4,635      32,445       718.1      41.0      00:17:31
 23994       9   4,635      41,715       728.4      41.6      00:17:20
 24406       8   4,635      37,080       740.3      42.3      00:17:05
 24786       9   4,635      41,715       752.1      43.0      00:16:50
 25163       6   4,635      27,810       763.8      43.6      00:16:36
 25562       6   4,635      27,810       776.0      44.3      00:16:21
 25871      10   4,635      46,350       785.5      44.9      00:16:12
 26187       6   4,635      27,810       795.1      45.4      00:16:03
 26600       6   4,635      27,810       807.5      46.1      00:15:47
 26990       7   4,635      32,445       819.4      46.8      00:15:33
 27313       7   4,635      32,445       829.1      47.4      00:15:24
 27609       8   4,635      37,080       838.4      47.9      00:15:15
 27992      10   4,635      46,350       850.4      48.6      00:15:01
 28413       7   4,635      32,445       863.6      49.3      00:14:45
 28751      10   4,635      46,350       874.5      50.0      00:14:33
 29010       7   4,635      32,445       882.7      50.4      00:14:26
 29308       8   4,635      37,080       891.8      51.0      00:14:18
 29627       6   4,635      27,810       901.8      51.5      00:14:08
 29933       4   4,635      18,540       911.3      52.1      00:13:59
 30255      10   4,635      46,350       921.5      52.7      00:13:49
 30623       8   4,635      37,080       933.2      53.3      00:13:36
 31057       5   4,635      23,175       946.7      54.1      00:13:19
 31479      10   4,635      46,350       960.3      54.9      00:13:03
 31913      10   4,635      46,350       974.4      55.7      00:12:46
 32337       8   4,635      37,080       988.2      56.5      00:12:29
 32658       9   4,635      41,715       998.6      57.1      00:12:19
 32925       8   4,635      37,080     1,007.1      57.5      00:12:12
 33229       9   4,635      41,715     1,016.9      58.1      00:12:02
 33617       8   4,635      37,080     1,029.4      58.8      00:11:48
 33942       7   4,635      32,445     1,039.9      59.4      00:11:38
 34273       5   4,635      23,175     1,050.8      60.0      00:11:27
 34679       7   4,635      32,445     1,063.7      60.8      00:11:12
 35082       9   4,635      41,715     1,076.8      61.5      00:10:58
 35494       6   4,635      27,810     1,090.2      62.3      00:10:43
 35902       6   4,635      27,810     1,103.1      63.0      00:10:29
 36311       9   4,635      41,715     1,116.2      63.8      00:10:14
 36654       7   4,635      32,445     1,127.2      64.4      00:10:04
 37009       8   4,635      37,080     1,138.0      65.0      00:09:53
 37335       4   4,635      18,540     1,147.4      65.6      00:09:44
 37600       7   4,635      32,445     1,155.5      66.0      00:09:37
 37874       8   4,635      37,080     1,163.7      66.5      00:09:31
 38143       5   4,635      23,175     1,172.1      67.0      00:09:23
 38421       8   4,635      37,080     1,181.0      67.5      00:09:15
 38780       2   4,635       9,270     1,192.4      68.1      00:09:04
 39118       6   4,635      27,810     1,203.0      68.7      00:08:53
 39464       6   4,635      27,810     1,213.3      69.3      00:08:43
 39826       8   4,635      37,080     1,224.3      70.0      00:08:32
 40235      10   4,635      46,350     1,237.0      70.7      00:08:19
 40624      10   4,635      46,350     1,249.2      71.4      00:08:06
 41038       8   4,635      37,080     1,262.4      72.1      00:07:52
 41370       3   4,635      13,905     1,272.7      72.7      00:07:42
 41718       7   4,635      32,445     1,283.6      73.3      00:07:32
 42064       7   4,635      32,445     1,294.4      74.0      00:07:21
 42419       9   4,635      41,715     1,305.0      74.6      00:07:11
 42695       9   4,635      41,715     1,313.4      75.0      00:07:03
 42930       9   4,635      41,715     1,320.7      75.5      00:06:57
 43176       7   4,635      32,445     1,328.8      75.9      00:06:50
 43436       9   4,635      41,715     1,337.1      76.4      00:06:42
 43710      10   4,635      46,350     1,345.1      76.9      00:06:35
 43943       5   4,635      23,175     1,352.5      77.3      00:06:29
 44187      10   4,635      46,350     1,359.8      77.7      00:06:22
 44412       5   4,635      23,175     1,366.6      78.1      00:06:17
 44707      10   4,635      46,350     1,375.8      78.6      00:06:08
 45014       2   4,635       9,270     1,385.3      79.2      00:05:59
 45353      10   4,635      46,350     1,395.1      79.7      00:05:49
 45596       8   4,635      37,080     1,402.3      80.1      00:05:43
 45927       7   4,635      32,445     1,412.1      80.7      00:05:33
 46228       9   4,635      41,715     1,421.7      81.2      00:05:24
 46551       8   4,635      37,080     1,431.8      81.8      00:05:14
 46902       8   4,635      37,080     1,442.9      82.4      00:05:03
 47179       7   4,635      32,445     1,450.6      82.9      00:04:56
 47470      10   4,635      46,350     1,459.2      83.4      00:04:48
 47720       9   4,635      41,715     1,466.8      83.8      00:04:41
 47961       4   4,635      18,540     1,474.2      84.2      00:04:34
 48247      10   4,635      46,350     1,482.9      84.7      00:04:25
 48527       6   4,635      27,810     1,491.7      85.2      00:04:17
 48826       8   4,635      37,080     1,500.9      85.8      00:04:08
 49098       3   4,635      13,905     1,509.2      86.2      00:03:60
 49400       7   4,635      32,445     1,518.5      86.8      00:03:51
 49669       8   4,635      37,080     1,526.1      87.2      00:03:44
 49923       5   4,635      23,175     1,533.5      87.6      00:03:37
 50232       3   4,635      13,905     1,543.0      88.2      00:03:27
 50560       9   4,635      41,715     1,552.7      88.7      00:03:17
 50849       6   4,635      27,810     1,561.8      89.2      00:03:09
 51161       6   4,635      27,810     1,571.6      89.8      00:02:59
 51477       5   4,635      23,175     1,581.5      90.4      00:02:49
 51772       6   4,635      27,810     1,591.0      90.9      00:02:39
 52019      10   4,635      46,350     1,598.9      91.4      00:02:32
 52282      10   4,635      46,350     1,607.7      91.9      00:02:23
 52658       9   4,635      41,715     1,620.4      92.6      00:02:10
 53062       7   4,635      32,445     1,633.8      93.4      00:01:56
 53491       9   4,635      41,715     1,647.5      94.1      00:01:42
 53848       8   4,635      37,080     1,658.8      94.8      00:01:31
 54125       4   4,635      18,540     1,667.3      95.3      00:01:23
 54396       6   4,635      27,810     1,675.8      95.8      00:01:14
 54736       3   4,635      13,905     1,685.7      96.3      00:01:04
 55050       9   4,635      41,715     1,695.2      96.9      00:00:55
 55350       9   4,635      41,715     1,704.0      97.4      00:00:46
 55668      10   4,635      46,350     1,713.4      97.9      00:00:37
 55966       9   4,635      41,715     1,722.9      98.4      00:00:27
 56287       6   4,635      27,810     1,733.0      99.0      00:00:17
 56592       9   4,635      41,715     1,742.9      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1757.247
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600.csv saved

. 
. cap log close

. 
end of do-file
