
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A400_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:22

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   405       9   4,435      39,915        10.3       0.6      00:26:57
   840       7   4,435      31,045        22.1       1.3      00:25:00
  1258       7   4,435      31,045        33.8       2.0      00:24:19
  1671       7   4,435      31,045        45.9       2.7      00:23:40
  2106       6   4,435      26,610        58.1       3.5      00:23:13
  2525       7   4,435      31,045        69.8       4.2      00:23:02
  2980       6   4,435      26,610        82.8       4.9      00:22:28
  3404       8   4,435      35,480        95.5       5.7      00:22:04
  3836       6   4,435      26,610       108.2       6.5      00:21:45
  4197       7   4,435      31,045       118.2       7.1      00:21:59
  4548      10   4,435      44,350       127.8       7.6      00:22:13
  4899       8   4,435      35,480       138.2       8.3      00:22:17
  5249      10   4,435      44,350       148.2       8.8      00:22:21
  5617       6   4,435      26,610       158.2       9.4      00:22:24
  5974       9   4,435      39,915       168.3      10.0      00:22:25
  6325       6   4,435      26,610       178.2      10.6      00:22:26
  6654       7   4,435      31,045       187.4      11.2      00:22:32
  6941       7   4,435      31,045       195.6      11.7      00:22:43
  7308       9   4,435      39,915       205.8      12.3      00:22:38
  7632       7   4,435      31,045       215.3      12.9      00:22:38
  7951      10   4,435      44,350       224.9      13.4      00:22:36
  8308       7   4,435      31,045       235.7      14.1      00:22:26
  8691       7   4,435      31,045       247.3      14.8      00:22:10
  9080       7   4,435      31,045       259.1      15.5      00:21:54
  9403      10   4,435      44,350       268.8      16.1      00:21:50
  9686       5   4,435      22,175       277.7      16.6      00:21:50
  9975       6   4,435      26,610       286.2      17.1      00:21:52
 10222      10   4,435      44,350       292.8      17.5      00:22:03
 10456      10   4,435      44,350       299.5      17.9      00:22:14
 10731       9   4,435      39,915       307.3      18.3      00:22:17
 11021       6   4,435      26,610       315.7      18.9      00:22:17
 11312       6   4,435      26,610       323.8      19.3      00:22:17
 11583       6   4,435      26,610       331.7      19.8      00:22:18
 11880       5   4,435      22,175       340.4      20.3      00:22:15
 12176       6   4,435      26,610       349.1      20.8      00:22:11
 12557       5   4,435      22,175       360.2      21.5      00:21:56
 12965       7   4,435      31,045       371.4      22.2      00:21:40
 13345       4   4,435      17,740       382.6      22.8      00:21:25
 13620       6   4,435      26,610       391.2      23.4      00:21:21
 13869       9   4,435      39,915       398.4      23.8      00:21:23
 14200       3   4,435      13,305       408.0      24.4      00:21:15
 14520       2   4,435       8,870       417.7      24.9      00:21:06
 14837       9   4,435      39,915       427.0      25.5      00:20:59
 15175       7   4,435      31,045       437.2      26.1      00:20:47
 15516       5   4,435      22,175       447.3      26.7      00:20:37
 15901       9   4,435      39,915       458.7      27.4      00:20:21
 16282       8   4,435      35,480       470.5      28.1      00:20:05
 16619       6   4,435      26,610       480.6      28.7      00:19:55
 16931       5   4,435      22,175       489.8      29.2      00:19:47
 17190      10   4,435      44,350       497.4      29.7      00:19:45
 17443       7   4,435      31,045       505.1      30.2      00:19:43
 17712       7   4,435      31,045       513.4      30.7      00:19:38
 18037       9   4,435      39,915       522.9      31.2      00:19:29
 18347       8   4,435      35,480       532.3      31.8      00:19:21
 18640       9   4,435      39,915       540.7      32.3      00:19:15
 18936       6   4,435      26,610       549.8      32.8      00:19:08
 19242      10   4,435      44,350       559.2      33.4      00:18:59
 19624       8   4,435      35,480       570.9      34.1      00:18:43
 20020       9   4,435      39,915       583.3      34.8      00:18:26
 20389       9   4,435      39,915       594.4      35.5      00:18:12
 20663       6   4,435      26,610       602.8      36.0      00:18:07
 20906       5   4,435      22,175       610.1      36.4      00:18:04
 21187       1   4,435       4,435       618.1      36.9      00:17:59
 21489       5   4,435      22,175       626.4      37.4      00:17:54
 21789      10   4,435      44,350       634.5      37.9      00:17:48
 22111       5   4,435      22,175       643.5      38.4      00:17:40
 22466       6   4,435      26,610       653.3      39.0      00:17:30
 22829       1   4,435       4,435       663.3      39.6      00:17:19
 23195       7   4,435      31,045       674.1      40.3      00:17:07
 23547       4   4,435      17,740       683.9      40.8      00:16:56
 23900       8   4,435      35,480       694.4      41.5      00:16:45
 24298       8   4,435      35,480       705.5      42.1      00:16:31
 24734       8   4,435      35,480       718.3      42.9      00:16:14
 25172       3   4,435      13,305       731.1      43.7      00:15:57
 25579       4   4,435      17,740       742.9      44.4      00:15:43
 25839       8   4,435      35,480       750.6      44.8      00:15:38
 26120      10   4,435      44,350       759.0      45.3      00:15:31
 26494       5   4,435      22,175       769.7      46.0      00:15:19
 26859       6   4,435      26,610       780.0      46.6      00:15:08
 27165       7   4,435      31,045       789.1      47.1      00:14:60
 27450      10   4,435      44,350       797.4      47.6      00:14:53
 27781      10   4,435      44,350       807.2      48.2      00:14:43
 28132       9   4,435      39,915       817.8      48.8      00:14:31
 28546       9   4,435      39,915       830.5      49.6      00:14:16
 28927       7   4,435      31,045       842.1      50.3      00:14:02
 29289       5   4,435      22,175       852.8      50.9      00:13:51
 29665       4   4,435      17,740       863.9      51.6      00:13:38
 29979      10   4,435      44,350       873.4      52.2      00:13:29
 30298       7   4,435      31,045       883.0      52.7      00:13:20
 30655       7   4,435      31,045       893.9      53.4      00:13:08
 31112       8   4,435      35,480       907.5      54.2      00:12:51
 31554       4   4,435      17,740       921.1      55.0      00:12:34
 31971       8   4,435      35,480       934.1      55.8      00:12:19
 32350      10   4,435      44,350       946.0      56.5      00:12:05
 32662      10   4,435      44,350       955.6      57.1      00:11:56
 32921       8   4,435      35,480       963.5      57.5      00:11:50
 33119       6   4,435      26,610       969.7      57.9      00:11:47
 33399       5   4,435      22,175       978.2      58.4      00:11:39
 33679       8   4,435      35,480       986.9      58.9      00:11:31
 33978       7   4,435      31,045       996.2      59.5      00:11:22
 34318       8   4,435      35,480     1,006.9      60.1      00:11:11
 34743       5   4,435      22,175     1,019.9      60.9      00:10:56
 35187       6   4,435      26,610     1,033.6      61.7      00:10:40
 35620      10   4,435      44,350     1,046.9      62.5      00:10:25
 36089      10   4,435      44,350     1,061.2      63.4      00:10:08
 36546       5   4,435      22,175     1,075.1      64.2      00:09:52
 36864       9   4,435      39,915     1,084.5      64.8      00:09:43
 37189       6   4,435      26,610     1,093.9      65.3      00:09:34
 37514      10   4,435      44,350     1,103.1      65.9      00:09:26
 37833      10   4,435      44,350     1,112.2      66.4      00:09:17
 38142       8   4,435      35,480     1,121.5      67.0      00:09:09
 38426       8   4,435      35,480     1,130.3      67.5      00:09:01
 38804       2   4,435       8,870     1,141.6      68.2      00:08:49
 39150       4   4,435      17,740     1,152.0      68.8      00:08:38
 39472       7   4,435      31,045     1,161.1      69.3      00:08:30
 39801       8   4,435      35,480     1,170.8      69.9      00:08:20
 40184       5   4,435      22,175     1,182.1      70.6      00:08:08
 40556       6   4,435      26,610     1,193.3      71.3      00:07:57
 40924       5   4,435      22,175     1,204.3      71.9      00:07:46
 41192       8   4,435      35,480     1,212.5      72.4      00:07:38
 41498       8   4,435      35,480     1,221.7      73.0      00:07:30
 41813       7   4,435      31,045     1,231.1      73.5      00:07:20
 42099       4   4,435      17,740     1,239.5      74.0      00:07:13
 42415       9   4,435      39,915     1,248.5      74.6      00:07:04
 42743       9   4,435      39,915     1,258.1      75.1      00:06:55
 43055      10   4,435      44,350     1,267.5      75.7      00:06:45
 43317       7   4,435      31,045     1,275.7      76.2      00:06:38
 43574       8   4,435      35,480     1,283.3      76.6      00:06:31
 43861       7   4,435      31,045     1,291.6      77.1      00:06:23
 44160       4   4,435      17,740     1,300.3      77.6      00:06:15
 44465       7   4,435      31,045     1,309.2      78.2      00:06:06
 44805      10   4,435      44,350     1,319.3      78.8      00:05:56
 45177       5   4,435      22,175     1,330.2      79.4      00:05:45
 45550      10   4,435      44,350     1,340.6      80.1      00:05:35
 45925       6   4,435      26,610     1,351.1      80.7      00:05:24
 46280       6   4,435      26,610     1,362.0      81.3      00:05:13
 46616       9   4,435      39,915     1,372.0      81.9      00:05:03
 46991       6   4,435      26,610     1,382.9      82.6      00:04:52
 47295       5   4,435      22,175     1,391.3      83.1      00:04:44
 47584       9   4,435      39,915     1,399.5      83.6      00:04:36
 47885       5   4,435      22,175     1,408.2      84.1      00:04:27
 48205       6   4,435      26,610     1,417.7      84.7      00:04:18
 48514      10   4,435      44,350     1,427.0      85.2      00:04:09
 48814       9   4,435      39,915     1,435.8      85.7      00:04:00
 49158       8   4,435      35,480     1,445.9      86.3      00:03:50
 49426       4   4,435      17,740     1,453.6      86.8      00:03:42
 49698       9   4,435      39,915     1,461.0      87.2      00:03:35
 49941      10   4,435      44,350     1,467.9      87.7      00:03:29
 50232       3   4,435      13,305     1,476.4      88.2      00:03:20
 50580       9   4,435      39,915     1,486.3      88.8      00:03:10
 50928       6   4,435      26,610     1,496.8      89.4      00:02:60
 51271       3   4,435      13,305     1,506.9      90.0      00:02:49
 51627       4   4,435      17,740     1,517.8      90.6      00:02:38
 51982       7   4,435      31,045     1,528.7      91.3      00:02:27
 52313       8   4,435      35,480     1,539.3      91.9      00:02:17
 52595       6   4,435      26,610     1,548.4      92.5      00:02:07
 52837       8   4,435      35,480     1,556.2      92.9      00:01:60
 53101       9   4,435      39,915     1,564.4      93.4      00:01:51
 53380       4   4,435      17,740     1,573.0      93.9      00:01:43
 53744       6   4,435      26,610     1,584.2      94.6      00:01:32
 54057       8   4,435      35,480     1,593.4      95.2      00:01:22
 54394       6   4,435      26,610     1,603.4      95.7      00:01:12
 54816      10   4,435      44,350     1,615.3      96.5      00:01:00
 55182       7   4,435      31,045     1,625.9      97.1      00:00:49
 55520       6   4,435      26,610     1,635.4      97.7      00:00:40
 55828       4   4,435      17,740     1,644.3      98.2      00:00:31
 56194      10   4,435      44,350     1,655.4      98.9      00:00:19
 56532       7   4,435      31,045     1,665.9      99.5      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1698.757
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
