
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A200_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  17 Apr 2024, 22:56:26

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   355       9   4,235      38,115         8.6       0.5      00:31:04
   732       9   4,235      38,115        18.1       1.1      00:29:07
  1104       5   4,235      21,175        28.0       1.7      00:28:08
  1481       7   4,235      29,645        38.6       2.4      00:27:01
  1848      10   4,235      42,350        48.5       3.0      00:26:40
  2231      10   4,235      42,350        59.0       3.7      00:26:10
  2615       5   4,235      21,175        69.1       4.3      00:25:52
  2992      10   4,235      42,350        79.4       5.0      00:25:34
  3335      10   4,235      42,350        89.3       5.6      00:25:25
  3680      10   4,235      42,350        99.0       6.2      00:25:18
  3999       8   4,235      33,880       107.4       6.7      00:25:30
  4255       8   4,235      33,880       114.3       7.1      00:26:01
  4527       2   4,235       8,470       121.4       7.6      00:26:24
  4783      10   4,235      42,350       128.8       8.1      00:26:41
  5064       8   4,235      33,880       136.5       8.5      00:26:50
  5321       5   4,235      21,175       143.4       9.0      00:27:06
  5548       7   4,235      29,645       149.3       9.3      00:27:33
  5762       9   4,235      38,115       154.9       9.7      00:28:01
  6049       5   4,235      21,175       162.8      10.2      00:27:59
  6351      10   4,235      42,350       170.8      10.7      00:27:55
  6640       3   4,235      12,705       178.5      11.2      00:27:54
  6970       8   4,235      33,880       187.5      11.7      00:27:40
  7336       9   4,235      38,115       197.3      12.3      00:27:17
  7708       7   4,235      29,645       207.6      13.0      00:26:52
  8105       9   4,235      38,115       219.2      13.7      00:26:17
  8432      10   4,235      42,350       228.8      14.3      00:26:00
  8783       5   4,235      21,175       238.7      14.9      00:25:41
  9114       9   4,235      38,115       248.4      15.5      00:25:25
  9405       7   4,235      29,645       256.8      16.1      00:25:19
  9695       8   4,235      33,880       265.5      16.6      00:25:10
 10005       9   4,235      38,115       274.0      17.1      00:25:02
 10272       8   4,235      33,880       280.9      17.6      00:25:05
 10600       6   4,235      25,410       289.8      18.1      00:24:54
 10925       4   4,235      16,940       298.7      18.7      00:24:43
 11242       8   4,235      33,880       307.4      19.2      00:24:34
 11485       9   4,235      38,115       314.2      19.6      00:24:35
 11765       5   4,235      21,175       321.7      20.1      00:24:32
 12048      10   4,235      42,350       329.7      20.6      00:24:26
 12359       7   4,235      29,645       338.4      21.2      00:24:16
 12782       4   4,235      16,940       349.8      21.9      00:23:51
 13202       6   4,235      25,410       361.3      22.6      00:23:27
 13595       6   4,235      25,410       372.7      23.3      00:23:05
 13942       5   4,235      21,175       382.4      23.9      00:22:51
 14332       9   4,235      38,115       393.4      24.6      00:22:31
 14699       8   4,235      33,880       403.8      25.3      00:22:15
 15132       7   4,235      29,645       416.2      26.0      00:21:50
 15575       7   4,235      29,645       428.7      26.8      00:21:26
 16029       9   4,235      38,115       441.8      27.6      00:20:59
 16449      10   4,235      42,350       454.3      28.4      00:20:37
 16790       7   4,235      29,645       463.8      29.0      00:20:26
 17067       9   4,235      38,115       471.7      29.5      00:20:21
 17305       4   4,235      16,940       478.3      29.9      00:20:21
 17534       6   4,235      25,410       485.3      30.3      00:20:19
 17860      10   4,235      42,350       494.3      30.9      00:20:09
 18215      10   4,235      42,350       504.6      31.6      00:19:55
 18594       9   4,235      38,115       514.9      32.2      00:19:41
 18960       9   4,235      38,115       525.7      32.9      00:19:26
 19244       8   4,235      33,880       534.1      33.4      00:19:19
 19674       9   4,235      38,115       546.6      34.2      00:18:58
 20113       7   4,235      29,645       559.9      35.0      00:18:36
 20526       8   4,235      33,880       571.6      35.7      00:18:19
 20866       4   4,235      16,940       581.4      36.4      00:18:07
 21222       7   4,235      29,645       591.1      37.0      00:17:56
 21585       9   4,235      38,115       600.7      37.6      00:17:46
 21969       9   4,235      38,115       610.9      38.2      00:17:33
 22333       8   4,235      33,880       620.4      38.8      00:17:23
 22710       4   4,235      16,940       630.6      39.4      00:17:11
 23097      10   4,235      42,350       640.9      40.1      00:16:58
 23428      10   4,235      42,350       650.3      40.7      00:16:49
 23845       8   4,235      33,880       661.5      41.4      00:16:34
 24272       8   4,235      33,880       673.1      42.1      00:16:19
 24731       3   4,235      12,705       685.8      42.9      00:16:01
 25188       7   4,235      29,645       698.5      43.7      00:15:43
 25612       9   4,235      38,115       710.2      44.4      00:15:28
 25926       6   4,235      25,410       719.2      45.0      00:15:19
 26194       5   4,235      21,175       726.7      45.4      00:15:14
 26511       6   4,235      25,410       735.4      46.0      00:15:06
 26867       9   4,235      38,115       745.1      46.6      00:14:56
 27224       9   4,235      38,115       755.2      47.2      00:14:44
 27579       9   4,235      38,115       765.1      47.8      00:14:34
 27863       7   4,235      29,645       773.2      48.4      00:14:27
 28263       8   4,235      33,880       784.6      49.1      00:14:13
 28676       5   4,235      21,175       796.8      49.8      00:13:57
 29011       8   4,235      33,880       806.6      50.4      00:13:47
 29385       8   4,235      33,880       817.2      51.1      00:13:35
 29754       8   4,235      33,880       827.6      51.8      00:13:23
 30054       9   4,235      38,115       836.2      52.3      00:13:15
 30390       6   4,235      25,410       845.8      52.9      00:13:05
 30710      10   4,235      42,350       855.1      53.5      00:12:56
 31089       8   4,235      33,880       865.9      54.1      00:12:43
 31417       9   4,235      38,115       875.5      54.7      00:12:33
 31771       8   4,235      33,880       886.0      55.4      00:12:22
 32133       9   4,235      38,115       896.8      56.1      00:12:10
 32485       5   4,235      21,175       907.4      56.7      00:11:58
 32732       9   4,235      38,115       914.5      57.2      00:11:52
 33039       3   4,235      12,705       923.6      57.8      00:11:43
 33335       7   4,235      29,645       932.3      58.3      00:11:35
 33665       7   4,235      29,645       942.0      58.9      00:11:25
 34028       8   4,235      33,880       952.7      59.6      00:11:13
 34419       6   4,235      25,410       964.4      60.3      00:10:59
 34860       9   4,235      38,115       977.5      61.1      00:10:43
 35330       4   4,235      16,940       991.2      62.0      00:10:27
 35807       5   4,235      21,175     1,005.1      62.9      00:10:10
 36277       7   4,235      29,645     1,018.9      63.7      00:09:53
 36641      10   4,235      42,350     1,029.5      64.4      00:09:42
 36909       9   4,235      38,115     1,037.0      64.8      00:09:36
 37173       3   4,235      12,705     1,044.2      65.3      00:09:30
 37423      10   4,235      42,350     1,050.9      65.7      00:09:24
 37741       4   4,235      16,940     1,059.5      66.3      00:09:16
 38004      10   4,235      42,350     1,066.9      66.7      00:09:10
 38286       6   4,235      25,410     1,075.1      67.2      00:09:02
 38598       4   4,235      16,940     1,084.3      67.8      00:08:53
 39035       9   4,235      38,115     1,096.8      68.6      00:08:38
 39384       4   4,235      16,940     1,106.5      69.2      00:08:28
 39694       7   4,235      29,645     1,115.1      69.7      00:08:20
 40075       2   4,235       8,470     1,125.7      70.4      00:08:09
 40483       7   4,235      29,645     1,137.3      71.1      00:07:56
 40871       5   4,235      21,175     1,148.5      71.8      00:07:44
 41137       6   4,235      25,410     1,156.2      72.3      00:07:37
 41398       6   4,235      25,410     1,163.6      72.8      00:07:30
 41699       8   4,235      33,880     1,172.2      73.3      00:07:21
 42016       6   4,235      25,410     1,181.5      73.9      00:07:12
 42370       7   4,235      29,645     1,190.9      74.5      00:07:02
 42695       9   4,235      38,115     1,200.0      75.0      00:06:53
 43020       6   4,235      25,410     1,209.3      75.6      00:06:44
 43284       8   4,235      33,880     1,217.2      76.1      00:06:36
 43597       6   4,235      25,410     1,226.0      76.7      00:06:27
 43914       9   4,235      38,115     1,234.9      77.2      00:06:18
 44253       9   4,235      38,115     1,244.5      77.8      00:06:08
 44584       6   4,235      25,410     1,253.5      78.4      00:05:59
 44947       6   4,235      25,410     1,263.9      79.0      00:05:48
 45348      10   4,235      42,350     1,274.6      79.7      00:05:37
 45751       6   4,235      25,410     1,285.4      80.4      00:05:25
 46064       8   4,235      33,880     1,294.3      80.9      00:05:16
 46391       3   4,235      12,705     1,303.7      81.5      00:05:06
 46836       6   4,235      25,410     1,316.4      82.3      00:04:53
 47173       4   4,235      16,940     1,325.3      82.9      00:04:44
 47531       9   4,235      38,115     1,334.9      83.5      00:04:34
 47845       7   4,235      29,645     1,343.6      84.0      00:04:25
 48156      10   4,235      42,350     1,352.4      84.6      00:04:16
 48498       7   4,235      29,645     1,362.1      85.2      00:04:06
 48864       6   4,235      25,410     1,372.4      85.8      00:03:55
 49201       8   4,235      33,880     1,382.1      86.4      00:03:45
 49572       5   4,235      21,175     1,392.0      87.1      00:03:35
 49965       7   4,235      29,645     1,402.4      87.7      00:03:24
 50330       8   4,235      33,880     1,412.4      88.3      00:03:13
 50731       9   4,235      38,115     1,423.5      89.0      00:03:02
 51096       3   4,235      12,705     1,434.3      89.7      00:02:50
 51473       6   4,235      25,410     1,444.9      90.4      00:02:39
 51829      10   4,235      42,350     1,455.4      91.0      00:02:28
 52197       9   4,235      38,115     1,466.4      91.7      00:02:17
 52491       7   4,235      29,645     1,475.3      92.3      00:02:08
 52759       3   4,235      12,705     1,483.7      92.8      00:01:59
 53051      10   4,235      42,350     1,492.4      93.3      00:01:50
 53377       6   4,235      25,410     1,502.0      93.9      00:01:40
 53757      10   4,235      42,350     1,513.1      94.6      00:01:29
 54094       3   4,235      12,705     1,522.6      95.2      00:01:19
 54407       8   4,235      33,880     1,531.4      95.8      00:01:10
 54786      10   4,235      42,350     1,541.6      96.4      00:00:59
 55131       2   4,235       8,470     1,551.1      97.0      00:00:50
 55435       8   4,235      33,880     1,559.2      97.5      00:00:41
 55697       9   4,235      38,115     1,566.5      98.0      00:00:34
 55955       8   4,235      33,880     1,573.9      98.4      00:00:26
 56286       7   4,235      29,645     1,583.4      99.0      00:00:16
 56611       7   4,235      29,645     1,593.0      99.6      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1665.718
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
