
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A700.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A700.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:58

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   373      10   4,735      47,350        10.1       0.6      00:29:24
   788       8   4,735      37,880        22.1       1.2      00:26:40
  1186       2   4,735       9,470        33.9       1.9      00:25:56
  1564       8   4,735      37,880        45.6       2.6      00:25:29
  1945       7   4,735      33,145        57.0       3.2      00:25:18
  2315       8   4,735      37,880        68.4       3.8      00:25:10
  2702       7   4,735      33,145        80.0       4.5      00:24:56
  3060       9   4,735      42,615        90.9       5.1      00:24:55
  3420       6   4,735      28,410       102.5       5.7      00:24:41
  3806       6   4,735      28,410       114.6       6.4      00:24:21
  4112       8   4,735      37,880       123.5       6.9      00:24:44
  4405       5   4,735      23,675       132.0       7.4      00:25:07
  4743       3   4,735      14,205       142.8       8.0      00:24:60
  5119      10   4,735      47,350       154.1       8.6      00:24:46
  5497       5   4,735      23,675       165.6       9.3      00:24:32
  5835      10   4,735      47,350       175.4       9.8      00:24:33
  6206       8   4,735      37,880       186.7      10.4      00:24:20
  6612      10   4,735      47,350       198.9      11.1      00:24:00
  6980       8   4,735      37,880       209.9      11.7      00:23:50
  7414       4   4,735      18,940       223.1      12.5      00:23:24
  7826       6   4,735      28,410       235.9      13.2      00:23:03
  8166      10   4,735      47,350       247.1      13.8      00:22:53
  8490       8   4,735      37,880       257.7      14.4      00:22:48
  8801       8   4,735      37,880       267.6      15.0      00:22:46
  9112       9   4,735      42,615       277.7      15.5      00:22:42
  9346       7   4,735      33,145       285.3      16.0      00:22:52
  9614      10   4,735      47,350       294.1      16.4      00:22:53
  9935       9   4,735      42,615       304.3      17.0      00:22:47
 10249       9   4,735      42,615       313.4      17.5      00:22:46
 10563       9   4,735      42,615       323.0      18.1      00:22:43
 10950       6   4,735      28,410       334.8      18.7      00:22:28
 11292       6   4,735      28,410       345.1      19.3      00:22:20
 11551       6   4,735      28,410       353.2      19.8      00:22:22
 11840       7   4,735      33,145       362.2      20.3      00:22:20
 12110      10   4,735      47,350       370.7      20.7      00:22:20
 12420       6   4,735      28,410       380.2      21.3      00:22:15
 12850       9   4,735      42,615       393.1      22.0      00:21:55
 13247       4   4,735      18,940       405.4      22.7      00:21:38
 13607      10   4,735      47,350       417.2      23.3      00:21:23
 13822       9   4,735      42,615       423.8      23.7      00:21:29
 14056       6   4,735      28,410       430.9      24.1      00:21:33
 14352      10   4,735      47,350       440.6      24.6      00:21:27
 14604       8   4,735      37,880       448.5      25.1      00:21:26
 14886      10   4,735      47,350       457.3      25.6      00:21:22
 15203       5   4,735      23,675       467.7      26.2      00:21:12
 15549       7   4,735      33,145       478.5      26.8      00:21:01
 15983       6   4,735      28,410       492.5      27.5      00:20:38
 16416       5   4,735      23,675       506.7      28.3      00:20:16
 16778       9   4,735      42,615       518.2      29.0      00:20:03
 17121       5   4,735      23,675       528.9      29.6      00:19:52
 17432       3   4,735      14,205       538.9      30.1      00:19:44
 17750       3   4,735      14,205       549.3      30.7      00:19:34
 18113       9   4,735      42,615       560.8      31.4      00:19:22
 18490       8   4,735      37,880       572.4      32.0      00:19:09
 18884       6   4,735      28,410       585.2      32.7      00:18:52
 19293       6   4,735      28,410       598.6      33.5      00:18:34
 19696       9   4,735      42,615       612.0      34.2      00:18:17
 20062       8   4,735      37,880       624.3      34.9      00:18:03
 20435       9   4,735      42,615       636.1      35.6      00:17:50
 20667      10   4,735      47,350       643.7      36.0      00:17:48
 20938      10   4,735      47,350       652.5      36.5      00:17:43
 21300       9   4,735      42,615       663.0      37.1      00:17:34
 21647       8   4,735      37,880       673.4      37.7      00:17:24
 21977       8   4,735      37,880       683.2      38.2      00:17:17
 22324       7   4,735      33,145       693.3      38.8      00:17:08
 22644       8   4,735      37,880       703.1      39.3      00:17:00
 22991       4   4,735      18,940       713.1      39.9      00:16:52
 23303       2   4,735       9,470       723.2      40.4      00:16:43
 23687       6   4,735      28,410       734.5      41.1      00:16:31
 24057       7   4,735      33,145       746.1      41.7      00:16:19
 24488       9   4,735      42,615       759.0      42.4      00:16:04
 24846       6   4,735      28,410       770.2      43.1      00:15:53
 25268       5   4,735      23,675       783.5      43.8      00:15:37
 25632       4   4,735      18,940       794.6      44.4      00:15:26
 25871      10   4,735      47,350       802.4      44.9      00:15:23
 26150       5   4,735      23,675       811.2      45.4      00:15:17
 26506       8   4,735      37,880       822.0      46.0      00:15:06
 26813       5   4,735      23,675       831.5      46.5      00:14:59
 27106      10   4,735      47,350       840.5      47.0      00:14:52
 27314       8   4,735      37,880       847.0      47.4      00:14:50
 27504       8   4,735      37,880       853.0      47.7      00:14:49
 27734       5   4,735      23,675       860.3      48.1      00:14:46
 28135       5   4,735      23,675       873.3      48.8      00:14:31
 28565       8   4,735      37,880       887.4      49.6      00:14:14
 28888       6   4,735      28,410       897.8      50.2      00:14:04
 29197       5   4,735      23,675       907.7      50.8      00:13:55
 29484       9   4,735      42,615       916.9      51.3      00:13:48
 29803       3   4,735      14,205       926.8      51.8      00:13:39
 30035       5   4,735      23,675       934.3      52.3      00:13:35
 30310       9   4,735      42,615       943.1      52.8      00:13:27
 30640       8   4,735      37,880       953.9      53.4      00:13:17
 31055       9   4,735      42,615       967.1      54.1      00:13:02
 31399       9   4,735      42,615       978.2      54.7      00:12:51
 31710       9   4,735      42,615       988.5      55.3      00:12:41
 32011      10   4,735      47,350       998.7      55.9      00:12:32
 32337       8   4,735      37,880     1,009.5      56.5      00:12:22
 32614      10   4,735      47,350     1,018.6      57.0      00:12:14
 32866      10   4,735      47,350     1,026.8      57.4      00:12:08
 33142       9   4,735      42,615     1,036.1      57.9      00:11:60
 33502       2   4,735       9,470     1,047.6      58.6      00:11:48
 33860       6   4,735      28,410     1,059.6      59.3      00:11:35
 34220       6   4,735      28,410     1,071.7      59.9      00:11:23
 34647       9   4,735      42,615     1,085.7      60.7      00:11:07
 35081       2   4,735       9,470     1,100.0      61.5      00:10:52
 35511       7   4,735      33,145     1,114.3      62.3      00:10:36
 35929       9   4,735      42,615     1,127.7      63.1      00:10:22
 36361       8   4,735      37,880     1,142.0      63.9      00:10:06
 36712       3   4,735      14,205     1,153.2      64.5      00:09:55
 36974       9   4,735      42,615     1,161.6      65.0      00:09:49
 37240       8   4,735      37,880     1,169.3      65.4      00:09:43
 37468       9   4,735      42,615     1,176.3      65.8      00:09:38
 37736       9   4,735      42,615     1,184.5      66.2      00:09:32
 37989       8   4,735      37,880     1,192.4      66.7      00:09:25
 38216       8   4,735      37,880     1,199.8      67.1      00:09:20
 38468       7   4,735      33,145     1,208.1      67.6      00:09:13
 38797       6   4,735      28,410     1,218.6      68.2      00:09:03
 39085       5   4,735      23,675     1,227.8      68.7      00:08:55
 39313       9   4,735      42,615     1,234.8      69.1      00:08:49
 39597       8   4,735      37,880     1,243.7      69.6      00:08:42
 39896       8   4,735      37,880     1,253.0      70.1      00:08:33
 40279       8   4,735      37,880     1,264.9      70.8      00:08:21
 40697       4   4,735      18,940     1,278.5      71.5      00:08:07
 41044      10   4,735      47,350     1,289.8      72.1      00:07:56
 41304       6   4,735      28,410     1,298.1      72.6      00:07:49
 41629       5   4,735      23,675     1,308.5      73.2      00:07:39
 41920      10   4,735      47,350     1,318.0      73.7      00:07:30
 42222       9   4,735      42,615     1,327.0      74.2      00:07:22
 42503       9   4,735      42,615     1,335.8      74.7      00:07:14
 42810       9   4,735      42,615     1,345.4      75.2      00:07:05
 43106       6   4,735      28,410     1,355.0      75.8      00:06:56
 43409       8   4,735      37,880     1,365.0      76.3      00:06:47
 43742      10   4,735      47,350     1,375.2      76.9      00:06:37
 44044       3   4,735      14,205     1,384.7      77.5      00:06:28
 44344       7   4,735      33,145     1,394.1      78.0      00:06:19
 44698       6   4,735      28,410     1,405.1      78.6      00:06:08
 45026       7   4,735      33,145     1,415.6      79.2      00:05:58
 45402       5   4,735      23,675     1,426.7      79.8      00:05:47
 45727       6   4,735      28,410     1,436.4      80.3      00:05:38
 46059       6   4,735      28,410     1,446.9      80.9      00:05:28
 46364       9   4,735      42,615     1,456.8      81.5      00:05:19
 46726       9   4,735      42,615     1,468.3      82.1      00:05:07
 47039       7   4,735      33,145     1,477.9      82.7      00:04:58
 47240       7   4,735      33,145     1,483.7      83.0      00:04:54
 47446       5   4,735      23,675     1,490.0      83.3      00:04:48
 47712       6   4,735      28,410     1,498.2      83.8      00:04:41
 47957       9   4,735      42,615     1,505.9      84.2      00:04:34
 48169      10   4,735      47,350     1,512.5      84.6      00:04:28
 48384       8   4,735      37,880     1,519.4      85.0      00:04:22
 48614       9   4,735      42,615     1,526.7      85.4      00:04:15
 48852       5   4,735      23,675     1,534.0      85.8      00:04:09
 49077      10   4,735      47,350     1,541.1      86.2      00:04:02
 49309      10   4,735      47,350     1,548.6      86.6      00:03:55
 49561       1   4,735       4,735     1,556.0      87.0      00:03:48
 49796       8   4,735      37,880     1,562.8      87.4      00:03:42
 50017       8   4,735      37,880     1,569.7      87.8      00:03:36
 50269       5   4,735      23,675     1,577.4      88.2      00:03:29
 50552       9   4,735      42,615     1,586.0      88.7      00:03:20
 50827       9   4,735      42,615     1,594.8      89.2      00:03:12
 51085       9   4,735      42,615     1,603.3      89.7      00:03:03
 51383       6   4,735      28,410     1,612.5      90.2      00:02:54
 51639       5   4,735      23,675     1,620.9      90.7      00:02:46
 51884       8   4,735      37,880     1,629.1      91.1      00:02:38
 52135       8   4,735      37,880     1,637.3      91.6      00:02:30
 52375       8   4,735      37,880     1,645.5      92.0      00:02:22
 52686       9   4,735      42,615     1,656.3      92.6      00:02:11
 53004       9   4,735      42,615     1,667.0      93.2      00:02:01
 53354       9   4,735      42,615     1,678.6      93.9      00:01:49
 53712       9   4,735      42,615     1,690.3      94.5      00:01:37
 53925      10   4,735      47,350     1,697.0      94.9      00:01:31
 54152      10   4,735      47,350     1,704.2      95.3      00:01:24
 54362       6   4,735      28,410     1,710.9      95.7      00:01:17
 54634       8   4,735      37,880     1,718.8      96.1      00:01:09
 54922       5   4,735      23,675     1,727.8      96.6      00:01:00
 55204       8   4,735      37,880     1,736.5      97.1      00:00:52
 55461       8   4,735      37,880     1,744.2      97.6      00:00:44
 55707       8   4,735      37,880     1,751.7      98.0      00:00:36
 55926       6   4,735      28,410     1,758.8      98.4      00:00:29
 56201       7   4,735      33,145     1,767.6      98.9      00:00:20
 56478       8   4,735      37,880     1,776.8      99.4      00:00:11
 56746       8   4,735      37,880     1,785.5      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1811.407
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700.csv saved

. 
. cap log close

. 
end of do-file
