
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A900_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  17 Apr 2024, 22:56:26

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   319       9   4,935      44,415         9.0       0.5      00:34:31
   672       6   4,935      29,610        19.3       1.0      00:31:57
   981       9   4,935      44,415        28.6       1.5      00:32:06
  1315       4   4,935      19,740        39.4       2.1      00:30:55
  1641       9   4,935      44,415        50.1       2.7      00:30:12
  1944       4   4,935      19,740        59.4       3.2      00:30:25
  2285       7   4,935      34,545        70.3       3.8      00:29:49
  2649       4   4,935      19,740        81.7       4.4      00:29:08
  3006       5   4,935      24,675        92.9       5.0      00:28:38
  3329       4   4,935      19,740       103.8       5.6      00:28:17
  3656       7   4,935      34,545       114.5       6.1      00:28:03
  3951      10   4,935      49,350       123.8       6.6      00:28:09
  4189       9   4,935      44,415       131.2       7.0      00:28:39
  4425       8   4,935      39,480       138.2       7.4      00:29:10
  4645      10   4,935      49,350       145.5       7.8      00:29:34
  4902       3   4,935      14,805       153.8       8.3      00:29:42
  5163       8   4,935      39,480       162.1       8.7      00:29:48
  5394       9   4,935      44,415       169.7       9.1      00:30:01
  5670       7   4,935      34,545       177.7       9.5      00:30:07
  5958       9   4,935      44,415       186.7      10.0      00:29:60
  6218       9   4,935      44,415       195.0      10.5      00:30:01
  6492       4   4,935      19,740       203.6      10.9      00:29:57
  6759       7   4,935      34,545       211.8      11.4      00:29:58
  7052       9   4,935      44,415       221.0      11.9      00:29:48
  7385       9   4,935      44,415       231.6      12.4      00:29:25
  7727       6   4,935      29,610       242.6      13.0      00:29:01
  8021       6   4,935      29,610       252.6      13.6      00:28:45
  8314       8   4,935      39,480       262.5      14.1      00:28:31
  8641       4   4,935      19,740       273.6      14.7      00:28:08
  8953       7   4,935      34,545       284.1      15.2      00:27:51
  9237       5   4,935      24,675       293.6      15.8      00:27:41
  9479      10   4,935      49,350       301.7      16.2      00:27:40
  9736       5   4,935      24,675       310.7      16.7      00:27:32
  9953       7   4,935      34,545       317.8      17.1      00:27:37
 10185       3   4,935      14,805       324.7      17.4      00:27:42
 10409      10   4,935      49,350       331.7      17.8      00:27:46
 10697       6   4,935      29,610       340.8      18.3      00:27:37
 10977       6   4,935      29,610       349.8      18.8      00:27:28
 11263       9   4,935      44,415       358.8      19.3      00:27:19
 11482       7   4,935      34,545       366.0      19.6      00:27:20
 11748       8   4,935      39,480       374.4      20.1      00:27:14
 12036       9   4,935      44,415       383.8      20.6      00:27:03
 12318      10   4,935      49,350       392.9      21.1      00:26:53
 12683       6   4,935      29,610       404.7      21.7      00:26:29
 13047       6   4,935      29,610       416.0      22.3      00:26:09
 13435       6   4,935      29,610       428.7      23.0      00:25:43
 13724       7   4,935      34,545       438.8      23.5      00:25:29
 14040       3   4,935      14,805       448.6      24.1      00:25:17
 14339       8   4,935      39,480       458.7      24.6      00:25:04
 14690      10   4,935      49,350       470.3      25.2      00:24:44
 15022       7   4,935      34,545       481.3      25.8      00:24:28
 15396       8   4,935      39,480       493.8      26.5      00:24:05
 15764       5   4,935      24,675       505.8      27.1      00:23:46
 16113      10   4,935      49,350       517.9      27.8      00:23:26
 16494      10   4,935      49,350       530.9      28.5      00:23:03
 16793       5   4,935      24,675       540.6      29.0      00:22:53
 17101       7   4,935      34,545       550.7      29.6      00:22:41
 17343      10   4,935      49,350       558.7      30.0      00:22:37
 17577       7   4,935      34,545       566.9      30.4      00:22:32
 17842      10   4,935      49,350       575.4      30.9      00:22:26
 18109       9   4,935      44,415       584.4      31.4      00:22:18
 18380       7   4,935      34,545       593.3      31.8      00:22:10
 18660       8   4,935      39,480       602.4      32.3      00:22:01
 18959       4   4,935      19,740       612.5      32.9      00:21:50
 19286      10   4,935      49,350       623.7      33.5      00:21:35
 19672       6   4,935      29,610       636.9      34.2      00:21:13
 20061       7   4,935      34,545       650.6      34.9      00:20:51
 20477       5   4,935      24,675       664.4      35.7      00:20:30
 20758       7   4,935      34,545       673.8      36.2      00:20:20
 21034       3   4,935      14,805       683.1      36.7      00:20:12
 21361       8   4,935      39,480       692.7      37.2      00:20:02
 21659       4   4,935      19,740       702.2      37.7      00:19:53
 21984       7   4,935      34,545       712.3      38.2      00:19:42
 22295       4   4,935      19,740       721.7      38.7      00:19:33
 22584      10   4,935      49,350       730.8      39.2      00:19:25
 22844       4   4,935      19,740       738.5      39.6      00:19:20
 23077       9   4,935      44,415       746.2      40.0      00:19:15
 23354       6   4,935      29,610       755.3      40.5      00:19:06
 23689      10   4,935      49,350       765.6      41.1      00:18:55
 24014       6   4,935      29,610       776.2      41.7      00:18:43
 24272       8   4,935      39,480       784.3      42.1      00:18:36
 24619       6   4,935      29,610       795.4      42.7      00:18:23
 25007       8   4,935      39,480       807.8      43.4      00:18:07
 25397       7   4,935      34,545       820.8      44.0      00:17:49
 25730       8   4,935      39,480       831.5      44.6      00:17:37
 25998      10   4,935      49,350       840.4      45.1      00:17:29
 26304       9   4,935      44,415       850.6      45.6      00:17:18
 26659       7   4,935      34,545       861.6      46.2      00:17:05
 26977       9   4,935      44,415       872.0      46.8      00:16:54
 27270       6   4,935      29,610       881.4      47.3      00:16:45
 27457       8   4,935      39,480       887.5      47.6      00:16:43
 27648       7   4,935      34,545       893.8      48.0      00:16:40
 27908       4   4,935      19,740       902.6      48.4      00:16:32
 28319       7   4,935      34,545       916.3      49.2      00:16:13
 28690       8   4,935      39,480       929.0      49.9      00:15:57
 28940       9   4,935      44,415       937.5      50.3      00:15:50
 29215       8   4,935      39,480       946.6      50.8      00:15:41
 29512       9   4,935      44,415       956.5      51.3      00:15:31
 29829       8   4,935      39,480       966.9      51.9      00:15:20
 30086       5   4,935      24,675       975.4      52.3      00:15:12
 30392       7   4,935      34,545       985.7      52.9      00:15:01
 30745       8   4,935      39,480       997.6      53.5      00:14:47
 31148       5   4,935      24,675     1,011.0      54.3      00:14:30
 31543       9   4,935      44,415     1,024.6      55.0      00:14:13
 31893       8   4,935      39,480     1,036.7      55.6      00:13:59
 32258       8   4,935      39,480     1,049.4      56.3      00:13:44
 32592       8   4,935      39,480     1,061.0      56.9      00:13:31
 32834       8   4,935      39,480     1,069.3      57.4      00:13:24
 33086       6   4,935      29,610     1,077.9      57.8      00:13:16
 33351       9   4,935      44,415     1,086.9      58.3      00:13:07
 33660       6   4,935      29,610     1,097.6      58.9      00:12:56
 33982       9   4,935      44,415     1,108.6      59.5      00:12:44
 34308      10   4,935      49,350     1,120.0      60.1      00:12:31
 34712       7   4,935      34,545     1,133.8      60.8      00:12:15
 35070       8   4,935      39,480     1,146.1      61.5      00:12:01
 35419       9   4,935      44,415     1,158.2      62.2      00:11:48
 35781       9   4,935      44,415     1,170.3      62.8      00:11:34
 36158       8   4,935      39,480     1,183.3      63.5      00:11:19
 36518       8   4,935      39,480     1,195.5      64.2      00:11:06
 36764       8   4,935      39,480     1,203.6      64.6      00:10:59
 37039       7   4,935      34,545     1,212.5      65.1      00:10:51
 37349       6   4,935      29,610     1,222.2      65.6      00:10:41
 37628      10   4,935      49,350     1,231.2      66.1      00:10:33
 37908       4   4,935      19,740     1,240.2      66.6      00:10:24
 38186       8   4,935      39,480     1,249.5      67.1      00:10:15
 38447      10   4,935      49,350     1,258.5      67.5      00:10:07
 38801      10   4,935      49,350     1,270.2      68.2      00:09:54
 39118       6   4,935      29,610     1,280.8      68.7      00:09:43
 39432       8   4,935      39,480     1,290.8      69.3      00:09:33
 39774       5   4,935      24,675     1,301.9      69.9      00:09:22
 40162       7   4,935      34,545     1,314.6      70.5      00:09:08
 40567       8   4,935      39,480     1,328.2      71.3      00:08:53
 40982       8   4,935      39,480     1,342.2      72.0      00:08:37
 41293       6   4,935      29,610     1,352.6      72.6      00:08:27
 41643       9   4,935      44,415     1,364.3      73.2      00:08:15
 41964      10   4,935      49,350     1,375.1      73.8      00:08:04
 42280       2   4,935       9,870     1,384.8      74.3      00:07:54
 42563       6   4,935      29,610     1,394.2      74.8      00:07:45
 42882       7   4,935      34,545     1,404.6      75.4      00:07:35
 43211       7   4,935      34,545     1,415.9      76.0      00:07:23
 43529       9   4,935      44,415     1,426.7      76.6      00:07:12
 43850       4   4,935      19,740     1,436.9      77.1      00:07:02
 44182       7   4,935      34,545     1,447.6      77.7      00:06:51
 44502       4   4,935      19,740     1,458.1      78.2      00:06:41
 44869       9   4,935      44,415     1,470.1      78.9      00:06:29
 45258       5   4,935      24,675     1,482.7      79.6      00:06:16
 45596       8   4,935      39,480     1,493.1      80.1      00:06:05
 45965      10   4,935      49,350     1,504.8      80.8      00:05:53
 46325       7   4,935      34,545     1,517.1      81.4      00:05:41
 46716       8   4,935      39,480     1,530.0      82.1      00:05:28
 47082       6   4,935      29,610     1,541.6      82.7      00:05:16
 47342       8   4,935      39,480     1,549.6      83.2      00:05:08
 47646       8   4,935      39,480     1,559.2      83.7      00:04:59
 47928       9   4,935      44,415     1,568.4      84.2      00:04:50
 48219       8   4,935      39,480     1,578.0      84.7      00:04:41
 48453       9   4,935      44,415     1,585.8      85.1      00:04:34
 48678       5   4,935      24,675     1,593.2      85.5      00:04:27
 48890       7   4,935      34,545     1,600.1      85.9      00:04:20
 49118       6   4,935      29,610     1,607.5      86.3      00:04:14
 49329      10   4,935      49,350     1,614.6      86.6      00:04:07
 49534       9   4,935      44,415     1,620.9      87.0      00:04:01
 49768       4   4,935      19,740     1,627.9      87.4      00:03:55
 49989       6   4,935      29,610     1,635.1      87.7      00:03:48
 50197       5   4,935      24,675     1,641.8      88.1      00:03:42
 50381       5   4,935      24,675     1,647.3      88.4      00:03:37
 50587       6   4,935      29,610     1,654.1      88.8      00:03:30
 50795       4   4,935      19,740     1,661.1      89.1      00:03:24
 50999       9   4,935      44,415     1,668.0      89.5      00:03:17
 51220       7   4,935      34,545     1,675.2      89.9      00:03:10
 51440       9   4,935      44,415     1,682.6      90.3      00:03:03
 51656       7   4,935      34,545     1,690.0      90.7      00:02:56
 51879       6   4,935      29,610     1,697.7      91.1      00:02:48
 52116      10   4,935      49,350     1,705.8      91.5      00:02:40
 52346       5   4,935      24,675     1,713.9      92.0      00:02:32
 52631       8   4,935      39,480     1,724.2      92.5      00:02:22
 52929       6   4,935      29,610     1,734.9      93.1      00:02:11
 53243       9   4,935      44,415     1,745.7      93.7      00:01:60
 53554       7   4,935      34,545     1,756.4      94.3      00:01:49
 53825       9   4,935      44,415     1,765.5      94.7      00:01:39
 54063      10   4,935      49,350     1,773.2      95.2      00:01:32
 54295       3   4,935      14,805     1,780.9      95.6      00:01:24
 54564       5   4,935      24,675     1,789.0      96.0      00:01:16
 54837      10   4,935      49,350     1,798.0      96.5      00:01:07
 55106       8   4,935      39,480     1,806.7      97.0      00:00:58
 55383       5   4,935      24,675     1,815.4      97.4      00:00:49
 55634       6   4,935      29,610     1,823.1      97.8      00:00:41
 55862      10   4,935      49,350     1,830.8      98.2      00:00:33
 56114       5   4,935      24,675     1,839.3      98.7      00:00:25
 56373      10   4,935      49,350     1,848.1      99.2      00:00:16
 56633       7   4,935      34,545     1,857.0      99.7      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 1917.473
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
