
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A700_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 16:18:13

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   430      10   4,735      47,350        11.7       0.7      00:25:28
   859       4   4,735      18,940        24.0       1.3      00:24:37
  1283       6   4,735      28,410        36.8       2.1      00:23:51
  1707       6   4,735      28,410        50.2       2.8      00:23:08
  2163      10   4,735      47,350        63.7       3.6      00:22:36
  2601      10   4,735      47,350        76.9       4.3      00:22:18
  2999       3   4,735      14,205        88.9       5.0      00:22:20
  3375       8   4,735      37,880       101.2       5.7      00:22:16
  3776       6   4,735      28,410       113.7       6.4      00:22:07
  4163       8   4,735      37,880       125.1       7.0      00:22:12
  4533       4   4,735      18,940       136.0       7.6      00:22:19
  4846       7   4,735      33,145       145.8       8.2      00:22:34
  5157       6   4,735      28,410       155.3       8.7      00:22:49
  5384      10   4,735      47,350       162.5       9.1      00:23:23
  5607       4   4,735      18,940       168.6       9.4      00:24:03
  5857       7   4,735      33,145       176.0       9.8      00:24:28
  6206       8   4,735      37,880       186.7      10.4      00:24:20
  6557       5   4,735      23,675       197.2      11.0      00:24:14
  6887       4   4,735      18,940       207.1      11.6      00:24:13
  7260       6   4,735      28,410       218.2      12.2      00:24:02
  7608       8   4,735      37,880       229.2      12.8      00:23:51
  7941       7   4,735      33,145       239.7      13.4      00:23:43
  8293       7   4,735      33,145       251.1      14.0      00:23:30
  8672       5   4,735      23,675       263.4      14.7      00:23:11
  9027      10   4,735      47,350       274.9      15.4      00:22:59
  9325       6   4,735      28,410       284.6      15.9      00:22:56
  9556       9   4,735      42,615       292.1      16.3      00:23:05
  9784       8   4,735      37,880       299.7      16.8      00:23:13
 10046       8   4,735      37,880       307.6      17.2      00:23:18
 10372       7   4,735      33,145       317.1      17.7      00:23:14
 10714       9   4,735      42,615       327.6      18.3      00:23:05
 11016       9   4,735      42,615       336.9      18.8      00:23:01
 11336       7   4,735      33,145       346.6      19.4      00:22:55
 11638       5   4,735      23,675       355.8      19.9      00:22:51
 11970       6   4,735      28,410       366.1      20.5      00:22:41
 12232      10   4,735      47,350       374.5      20.9      00:22:41
 12599       8   4,735      37,880       385.7      21.6      00:22:28
 13007       9   4,735      42,615       397.9      22.3      00:22:10
 13375      10   4,735      47,350       409.4      22.9      00:21:55
 13675      10   4,735      47,350       419.4      23.5      00:21:48
 13974       1   4,735       4,735       428.5      24.0      00:21:43
 14323       8   4,735      37,880       439.6      24.6      00:21:30
 14683      10   4,735      47,350       451.0      25.2      00:21:17
 15052       4   4,735      18,940       462.7      25.9      00:21:02
 15382       7   4,735      33,145       473.4      26.5      00:20:52
 15726       4   4,735      18,940       484.0      27.1      00:20:41
 16066       6   4,735      28,410       495.3      27.7      00:20:29
 16419      10   4,735      47,350       506.9      28.3      00:20:15
 16721       8   4,735      37,880       516.4      28.9      00:20:09
 17016       7   4,735      33,145       525.7      29.4      00:20:03
 17296       9   4,735      42,615       534.5      29.9      00:19:58
 17560       9   4,735      42,615       543.4      30.4      00:19:53
 17834       9   4,735      42,615       551.8      30.9      00:19:49
 18132       5   4,735      23,675       561.4      31.4      00:19:42
 18447      10   4,735      47,350       571.2      31.9      00:19:34
 18695       7   4,735      33,145       579.1      32.4      00:19:31
 18948       5   4,735      23,675       587.3      32.9      00:19:27
 19214       6   4,735      28,410       596.1      33.3      00:19:22
 19567       5   4,735      23,675       607.7      34.0      00:19:08
 19951       7   4,735      33,145       620.4      34.7      00:18:51
 20284       6   4,735      28,410       631.2      35.3      00:18:40
 20617      10   4,735      47,350       642.0      35.9      00:18:28
 20915       8   4,735      37,880       651.7      36.5      00:18:20
 21244       9   4,735      42,615       661.5      37.0      00:18:12
 21570       4   4,735      18,940       671.3      37.5      00:18:03
 21901       1   4,735       4,735       680.9      38.1      00:17:55
 22231       6   4,735      28,410       690.6      38.6      00:17:46
 22578       7   4,735      33,145       701.0      39.2      00:17:36
 22914       4   4,735      18,940       710.7      39.7      00:17:28
 23208       6   4,735      28,410       720.1      40.3      00:17:20
 23555       7   4,735      33,145       730.5      40.9      00:17:09
 23882       8   4,735      37,880       740.8      41.4      00:16:59
 24228       8   4,735      37,880       751.1      42.0      00:16:49
 24646      10   4,735      47,350       764.0      42.7      00:16:33
 25049       9   4,735      42,615       776.5      43.4      00:16:19
 25431      10   4,735      47,350       788.6      44.1      00:16:05
 25736       7   4,735      33,145       798.0      44.6      00:15:57
 25972       6   4,735      28,410       805.5      45.1      00:15:53
 26245       6   4,735      28,410       814.2      45.5      00:15:46
 26555       6   4,735      28,410       823.5      46.1      00:15:39
 26904       6   4,735      28,410       834.3      46.7      00:15:27
 27231       3   4,735      14,205       844.5      47.2      00:15:17
 27537      10   4,735      47,350       854.1      47.8      00:15:09
 27852       8   4,735      37,880       864.2      48.3      00:14:59
 28282       6   4,735      28,410       877.9      49.1      00:14:43
 28705      10   4,735      47,350       891.8      49.9      00:14:26
 29012       6   4,735      28,410       901.8      50.4      00:14:16
 29305       6   4,735      28,410       911.0      51.0      00:14:09
 29663       5   4,735      23,675       922.3      51.6      00:13:57
 29956       5   4,735      23,675       931.7      52.1      00:13:48
 30224      10   4,735      47,350       940.4      52.6      00:13:41
 30505      10   4,735      47,350       949.6      53.1      00:13:34
 30828       8   4,735      37,880       960.0      53.7      00:13:23
 31196      10   4,735      47,350       971.7      54.3      00:13:11
 31540       9   4,735      42,615       983.0      55.0      00:12:59
 31954       8   4,735      37,880       996.7      55.7      00:12:43
 32375       9   4,735      42,615     1,010.9      56.5      00:12:27
 32674       6   4,735      28,410     1,020.6      57.1      00:12:18
 32918       8   4,735      37,880     1,028.5      57.5      00:12:12
 33210       8   4,735      37,880     1,038.2      58.1      00:12:03
 33596      10   4,735      47,350     1,050.9      58.8      00:11:50
 33955       6   4,735      28,410     1,062.7      59.4      00:11:37
 34296       7   4,735      33,145     1,074.2      60.1      00:11:26
 34699       9   4,735      42,615     1,087.4      60.8      00:11:11
 35085       6   4,735      28,410     1,100.1      61.5      00:10:58
 35505       7   4,735      33,145     1,114.1      62.3      00:10:42
 35938       7   4,735      33,145     1,128.0      63.1      00:10:27
 36372       6   4,735      28,410     1,142.3      63.9      00:10:11
 36721      10   4,735      47,350     1,153.5      64.5      00:10:01
 37007       6   4,735      28,410     1,162.4      65.0      00:09:53
 37284       9   4,735      42,615     1,170.8      65.5      00:09:46
 37556       1   4,735       4,735     1,178.9      65.9      00:09:40
 37869      10   4,735      47,350     1,188.6      66.5      00:09:31
 38158      10   4,735      47,350     1,197.9      67.0      00:09:22
 38401       7   4,735      33,145     1,205.8      67.4      00:09:16
 38715      10   4,735      47,350     1,216.0      68.0      00:09:06
 39044       6   4,735      28,410     1,226.6      68.6      00:08:56
 39291       9   4,735      42,615     1,234.1      69.0      00:08:50
 39585       6   4,735      28,410     1,243.3      69.5      00:08:42
 39837       6   4,735      28,410     1,251.1      70.0      00:08:36
 40167       4   4,735      18,940     1,261.5      70.6      00:08:26
 40513       5   4,735      23,675     1,272.6      71.2      00:08:15
 40844       7   4,735      33,145     1,283.3      71.8      00:08:05
 41102      10   4,735      47,350     1,291.6      72.2      00:07:57
 41427       6   4,735      28,410     1,301.9      72.8      00:07:47
 41783       6   4,735      28,410     1,313.4      73.5      00:07:36
 42065       6   4,735      28,410     1,322.3      74.0      00:07:28
 42364      10   4,735      47,350     1,331.2      74.5      00:07:20
 42649       8   4,735      37,880     1,340.3      75.0      00:07:12
 42971       5   4,735      23,675     1,350.5      75.5      00:07:02
 43277       7   4,735      33,145     1,360.7      76.1      00:06:52
 43584      10   4,735      47,350     1,370.4      76.7      00:06:43
 43884       6   4,735      28,410     1,379.7      77.2      00:06:34
 44188       8   4,735      37,880     1,389.2      77.7      00:06:25
 44457      10   4,735      47,350     1,397.5      78.2      00:06:18
 44778       8   4,735      37,880     1,407.6      78.7      00:06:08
 45086       5   4,735      23,675     1,417.4      79.3      00:05:59
 45454       6   4,735      28,410     1,428.3      79.9      00:05:48
 45794       7   4,735      33,145     1,438.5      80.5      00:05:38
 46149       9   4,735      42,615     1,449.8      81.1      00:05:27
 46469       5   4,735      23,675     1,459.9      81.7      00:05:17
 46857       4   4,735      18,940     1,472.5      82.4      00:05:05
 47177       7   4,735      33,145     1,481.8      82.9      00:04:56
 47453       8   4,735      37,880     1,490.2      83.4      00:04:48
 47753       6   4,735      28,410     1,499.5      83.9      00:04:39
 48061       9   4,735      42,615     1,509.2      84.4      00:04:30
 48378       6   4,735      28,410     1,519.2      85.0      00:04:20
 48717       7   4,735      33,145     1,529.9      85.6      00:04:10
 49079       6   4,735      28,410     1,541.1      86.2      00:03:59
 49410       9   4,735      42,615     1,551.5      86.8      00:03:49
 49664       3   4,735      14,205     1,558.9      87.2      00:03:42
 49892       6   4,735      28,410     1,565.7      87.6      00:03:36
 50103      10   4,735      47,350     1,572.4      87.9      00:03:30
 50335       4   4,735      18,940     1,579.3      88.3      00:03:24
 50576       4   4,735      18,940     1,586.7      88.7      00:03:17
 50812       7   4,735      33,145     1,594.3      89.2      00:03:10
 51054      10   4,735      47,350     1,602.2      89.6      00:03:02
 51417       5   4,735      23,675     1,613.6      90.3      00:02:51
 51754       4   4,735      18,940     1,624.8      90.9      00:02:40
 52061       7   4,735      33,145     1,634.8      91.4      00:02:30
 52372       7   4,735      33,145     1,645.4      92.0      00:02:20
 52778       6   4,735      28,410     1,659.5      92.8      00:02:06
 53188       6   4,735      28,410     1,673.1      93.6      00:01:52
 53612       7   4,735      33,145     1,687.1      94.4      00:01:38
 53947       8   4,735      37,880     1,697.7      95.0      00:01:28
 54258       8   4,735      37,880     1,707.6      95.5      00:01:18
 54591       8   4,735      37,880     1,717.4      96.1      00:01:09
 54955       9   4,735      42,615     1,728.8      96.7      00:00:58
 55296       5   4,735      23,675     1,739.4      97.3      00:00:47
 55634       6   4,735      28,410     1,749.2      97.8      00:00:38
 55906       6   4,735      28,410     1,758.1      98.3      00:00:29
 56225      10   4,735      47,350     1,768.4      98.9      00:00:19
 56562       8   4,735      37,880     1,779.6      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1746.052
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
