
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A900.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A900.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   334       8   4,935      39,480         9.5       0.5      00:32:35
   738       7   4,935      34,545        21.3       1.1      00:28:47
  1130       5   4,935      24,675        33.4       1.8      00:27:24
  1533       6   4,935      29,610        46.7       2.5      00:25:58
  1963      10   4,935      49,350        60.1       3.2      00:25:01
  2368       8   4,935      39,480        72.8       3.9      00:24:36
  2808       6   4,935      29,610        86.9       4.7      00:23:52
  3243      10   4,935      49,350       100.9       5.4      00:23:18
  3672      10   4,935      49,350       115.0       6.2      00:22:49
  4062       6   4,935      29,610       127.2       6.8      00:22:46
  4447       5   4,935      24,675       139.0       7.5      00:22:46
  4743       3   4,935      14,805       148.8       8.0      00:23:04
  5038      10   4,935      49,350       158.2       8.5      00:23:23
  5340      10   4,935      49,350       167.8       9.0      00:23:36
  5652       6   4,935      29,610       177.1       9.5      00:23:50
  5926       4   4,935      19,740       185.7      10.0      00:24:07
  6169       9   4,935      44,415       193.5      10.4      00:24:29
  6450       8   4,935      39,480       202.2      10.9      00:24:41
  6754       3   4,935      14,805       211.6      11.4      00:24:45
  7084       9   4,935      44,415       222.1      11.9      00:24:40
  7461       9   4,935      44,415       234.0      12.6      00:24:24
  7805       6   4,935      29,610       245.2      13.2      00:24:14
  8145       5   4,935      24,675       256.8      13.8      00:24:01
  8479      10   4,935      49,350       268.1      14.4      00:23:50
  8804       8   4,935      39,480       279.0      15.0      00:23:42
  9155       8   4,935      39,480       290.9      15.6      00:23:28
  9452       9   4,935      44,415       300.9      16.1      00:23:24
  9759       9   4,935      44,415       311.5      16.7      00:23:17
 10032       9   4,935      44,415       320.2      17.2      00:23:20
 10284       6   4,935      29,610       327.7      17.6      00:23:28
 10494       6   4,935      29,610       334.5      18.0      00:23:39
 10751       7   4,935      34,545       342.5      18.4      00:23:43
 11060       7   4,935      34,545       352.4      18.9      00:23:37
 11310       8   4,935      39,480       360.3      19.3      00:23:41
 11498       9   4,935      44,415       366.5      19.7      00:23:52
 11741       8   4,935      39,480       374.2      20.1      00:23:55
 11978      10   4,935      49,350       381.9      20.5      00:23:58
 12242       7   4,935      34,545       390.7      21.0      00:23:55
 12629       9   4,935      44,415       403.0      21.6      00:23:36
 13046      10   4,935      49,350       416.0      22.3      00:23:14
 13430       9   4,935      44,415       428.6      23.0      00:22:55
 13703       6   4,935      29,610       438.1      23.5      00:22:49
 13978      10   4,935      49,350       446.7      24.0      00:22:46
 14300       5   4,935      24,675       457.3      24.5      00:22:35
 14630       5   4,935      24,675       468.3      25.1      00:22:23
 15004       9   4,935      44,415       480.7      25.8      00:22:05
 15425       7   4,935      34,545       494.7      26.5      00:21:43
 15823       7   4,935      34,545       507.8      27.3      00:21:24
 16189       6   4,935      29,610       520.4      27.9      00:21:07
 16581       8   4,935      39,480       533.6      28.6      00:20:48
 16912       9   4,935      44,415       544.3      29.2      00:20:38
 17208       6   4,935      29,610       554.1      29.7      00:20:31
 17492      10   4,935      49,350       563.9      30.3      00:20:24
 17791       5   4,935      24,675       573.7      30.8      00:20:16
 18123       9   4,935      44,415       584.8      31.4      00:20:05
 18481      10   4,935      49,350       596.2      32.0      00:19:52
 18779       9   4,935      44,415       606.4      32.5      00:19:44
 19107       9   4,935      44,415       617.6      33.1      00:19:32
 19473       6   4,935      29,610       630.0      33.8      00:19:17
 19850       8   4,935      39,480       643.1      34.5      00:19:00
 20212       5   4,935      24,675       655.7      35.2      00:18:45
 20516       8   4,935      39,480       665.7      35.7      00:18:37
 20724       8   4,935      39,480       672.7      36.1      00:18:37
 20924      10   4,935      49,350       679.6      36.5      00:18:37
 21215       9   4,935      44,415       688.6      37.0      00:18:31
 21549       7   4,935      34,545       699.0      37.5      00:18:21
 21878      10   4,935      49,350       709.0      38.0      00:18:13
 22197       7   4,935      34,545       718.7      38.6      00:18:05
 22516       6   4,935      29,610       728.7      39.1      00:17:56
 22808       8   4,935      39,480       737.6      39.6      00:17:50
 23094       8   4,935      39,480       746.7      40.1      00:17:44
 23368       4   4,935      19,740       755.8      40.6      00:17:37
 23698       4   4,935      19,740       765.9      41.1      00:17:28
 24009       9   4,935      44,415       776.1      41.6      00:17:19
 24358       3   4,935      14,805       786.7      42.2      00:17:08
 24733       6   4,935      29,610       799.2      42.9      00:16:54
 25105       5   4,935      24,675       811.2      43.5      00:16:40
 25453      10   4,935      49,350       822.7      44.1      00:16:28
 25755       6   4,935      29,610       832.4      44.7      00:16:20
 26047       5   4,935      24,675       842.1      45.2      00:16:12
 26412       3   4,935      14,805       853.8      45.8      00:15:59
 26813       5   4,935      24,675       866.6      46.5      00:15:45
 27153       8   4,935      39,480       877.7      47.1      00:15:34
 27460       7   4,935      34,545       887.6      47.6      00:15:25
 27796       9   4,935      44,415       898.7      48.2      00:15:14
 28187      10   4,935      49,350       911.9      48.9      00:14:59
 28584       9   4,935      44,415       925.5      49.7      00:14:43
 28877       9   4,935      44,415       935.4      50.2      00:14:35
 29168       8   4,935      39,480       945.1      50.7      00:14:26
 29491       3   4,935      14,805       955.8      51.3      00:14:16
 29776       8   4,935      39,480       965.1      51.8      00:14:08
 30016       8   4,935      39,480       973.0      52.2      00:14:03
 30283      10   4,935      49,350       982.0      52.7      00:13:56
 30565      10   4,935      49,350       991.7      53.2      00:13:48
 30929       6   4,935      29,610     1,003.9      53.9      00:13:35
 31316       6   4,935      29,610     1,016.8      54.6      00:13:21
 31685       5   4,935      24,675     1,029.4      55.2      00:13:07
 32052       5   4,935      24,675     1,042.3      55.9      00:12:53
 32447      10   4,935      49,350     1,056.1      56.7      00:12:38
 32711       5   4,935      24,675     1,064.9      57.1      00:12:31
 32969       5   4,935      24,675     1,073.8      57.6      00:12:24
 33181       9   4,935      44,415     1,081.1      58.0      00:12:19
 33414       9   4,935      44,415     1,089.0      58.4      00:12:14
 33651       4   4,935      19,740     1,097.3      58.9      00:12:07
 33946       6   4,935      29,610     1,107.3      59.4      00:11:58
 34284       5   4,935      24,675     1,119.1      60.1      00:11:46
 34684       6   4,935      29,610     1,132.8      60.8      00:11:31
 35048       6   4,935      29,610     1,145.4      61.5      00:11:18
 35430      10   4,935      49,350     1,158.6      62.2      00:11:04
 35858       7   4,935      34,545     1,173.0      62.9      00:10:49
 36275      10   4,935      49,350     1,187.3      63.7      00:10:33
 36634       8   4,935      39,480     1,199.3      64.4      00:10:21
 36919       6   4,935      29,610     1,208.7      64.9      00:10:13
 37210      10   4,935      49,350     1,217.9      65.4      00:10:05
 37473      10   4,935      49,350     1,226.1      65.8      00:09:59
 37722       9   4,935      44,415     1,234.0      66.2      00:09:53
 37969       5   4,935      24,675     1,242.1      66.7      00:09:46
 38259       8   4,935      39,480     1,251.9      67.2      00:09:37
 38553       7   4,935      34,545     1,262.0      67.7      00:09:28
 38951       9   4,935      44,415     1,275.2      68.4      00:09:14
 39254       6   4,935      29,610     1,285.0      69.0      00:09:06
 39590       9   4,935      44,415     1,296.0      69.5      00:08:55
 39970       8   4,935      39,480     1,308.4      70.2      00:08:43
 40403       9   4,935      44,415     1,322.5      71.0      00:08:28
 40818       7   4,935      34,545     1,336.6      71.7      00:08:14
 41167       5   4,935      24,675     1,348.3      72.4      00:08:02
 41457       6   4,935      29,610     1,357.9      72.9      00:07:54
 41763       7   4,935      34,545     1,368.2      73.4      00:07:44
 42074       5   4,935      24,675     1,378.4      74.0      00:07:35
 42419       9   4,935      44,415     1,389.5      74.6      00:07:24
 42739       5   4,935      24,675     1,399.8      75.1      00:07:15
 43059       8   4,935      39,480     1,410.6      75.7      00:07:04
 43372       9   4,935      44,415     1,421.4      76.3      00:06:54
 43666       7   4,935      34,545     1,430.9      76.8      00:06:46
 43893       8   4,935      39,480     1,438.3      77.2      00:06:40
 44143       8   4,935      39,480     1,446.4      77.6      00:06:33
 44401       2   4,935       9,870     1,454.7      78.1      00:06:26
 44745       8   4,935      39,480     1,466.0      78.7      00:06:15
 45075       8   4,935      39,480     1,477.0      79.3      00:06:04
 45445       9   4,935      44,415     1,488.3      79.9      00:05:53
 45725       9   4,935      44,415     1,497.0      80.3      00:05:46
 46023       8   4,935      39,480     1,506.8      80.9      00:05:37
 46252       5   4,935      24,675     1,514.6      81.3      00:05:30
 46490       6   4,935      29,610     1,522.3      81.7      00:05:23
 46765       6   4,935      29,610     1,531.6      82.2      00:05:15
 47013       8   4,935      39,480     1,539.5      82.6      00:05:08
 47262       7   4,935      34,545     1,547.1      83.0      00:05:01
 47451       5   4,935      24,675     1,553.1      83.3      00:04:56
 47661       8   4,935      39,480     1,559.7      83.7      00:04:51
 47903       5   4,935      24,675     1,567.6      84.1      00:04:44
 48158       8   4,935      39,480     1,576.0      84.6      00:04:36
 48422      10   4,935      49,350     1,584.8      85.0      00:04:28
 48717       7   4,935      34,545     1,594.5      85.6      00:04:18
 49006       9   4,935      44,415     1,603.9      86.1      00:04:10
 49288       9   4,935      44,415     1,613.3      86.6      00:04:01
 49563       7   4,935      34,545     1,621.8      87.0      00:03:53
 49857       7   4,935      34,545     1,630.7      87.5      00:03:44
 50113       6   4,935      29,610     1,639.1      88.0      00:03:37
 50428       2   4,935       9,870     1,648.8      88.5      00:03:27
 50727       7   4,935      34,545     1,658.6      89.0      00:03:18
 51022       7   4,935      34,545     1,668.8      89.6      00:03:08
 51349       8   4,935      39,480     1,679.5      90.1      00:02:58
 51631       7   4,935      34,545     1,689.0      90.6      00:02:49
 51897       8   4,935      39,480     1,698.3      91.1      00:02:40
 52172      10   4,935      49,350     1,707.9      91.7      00:02:30
 52509       6   4,935      29,610     1,719.8      92.3      00:02:19
 52877       5   4,935      24,675     1,733.1      93.0      00:02:06
 53246       9   4,935      44,415     1,745.8      93.7      00:01:53
 53626      10   4,935      49,350     1,758.8      94.4      00:01:41
 53922       5   4,935      24,675     1,768.6      94.9      00:01:31
 54189       7   4,935      34,545     1,777.4      95.4      00:01:23
 54465       6   4,935      29,610     1,786.2      95.9      00:01:14
 54778      10   4,935      49,350     1,796.1      96.4      00:01:05
 55085       6   4,935      29,610     1,806.0      96.9      00:00:55
 55361       7   4,935      34,545     1,814.7      97.4      00:00:47
 55615       4   4,935      19,740     1,822.5      97.8      00:00:40
 55887       7   4,935      34,545     1,831.7      98.3      00:00:31
 56233       4   4,935      19,740     1,843.4      98.9      00:00:19
 56580       6   4,935      29,610     1,855.3      99.6      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 1804.712
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900.csv saved

. 
. cap log close

. 
end of do-file
