
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A300_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  17 Apr 2024, 22:56:13

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   464       7   4,335      30,345        11.5       0.7      00:23:37
   882       7   4,335      30,345        22.5       1.4      00:23:58
  1287       5   4,335      21,675        33.8       2.1      00:23:42
  1665      10   4,335      43,350        44.7       2.7      00:23:46
  2135       9   4,335      39,015        57.6       3.5      00:22:53
  2568       8   4,335      34,680        69.4       4.2      00:22:36
  3023       6   4,335      26,010        82.1       5.0      00:22:07
  3440      10   4,335      43,350        94.5       5.8      00:21:47
  3856       6   4,335      26,010       106.3       6.5      00:21:38
  4179      10   4,335      43,350       115.0       7.0      00:22:06
  4514       6   4,335      26,010       124.0       7.6      00:22:23
  4836       3   4,335      13,005       133.2       8.1      00:22:36
  5172       9   4,335      39,015       142.6       8.7      00:22:43
  5501       1   4,335       4,335       151.6       9.3      00:22:53
  5797       8   4,335      34,680       159.5       9.7      00:23:11
  6149       9   4,335      39,015       169.5      10.4      00:23:07
  6434      10   4,335      43,350       177.2      10.8      00:23:22
  6698      10   4,335      43,350       184.4      11.3      00:23:40
  7013       8   4,335      34,680       193.2      11.8      00:23:42
  7413       9   4,335      39,015       204.3      12.5      00:23:25
  7811       6   4,335      26,010       215.5      13.2      00:23:07
  8194       7   4,335      30,345       227.1      13.9      00:22:48
  8581       3   4,335      13,005       238.6      14.6      00:22:30
  8986       5   4,335      21,675       250.5      15.3      00:22:11
  9268      10   4,335      43,350       258.9      15.8      00:22:13
  9545       8   4,335      34,680       267.1      16.3      00:22:16
  9857       9   4,335      39,015       276.5      16.9      00:22:11
 10168      10   4,335      43,350       284.8      17.4      00:22:12
 10449       5   4,335      21,675       292.5      17.9      00:22:15
 10796       6   4,335      26,010       302.1      18.5      00:22:08
 11147       8   4,335      34,680       312.0      19.1      00:21:59
 11425       8   4,335      34,680       319.9      19.5      00:21:60
 11708       8   4,335      34,680       327.8      20.0      00:21:60
 12016       6   4,335      26,010       336.5      20.6      00:21:56
 12274       7   4,335      30,345       344.0      21.0      00:21:58
 12683       6   4,335      26,010       355.5      21.7      00:21:40
 13092       9   4,335      39,015       366.7      22.4      00:21:24
 13483       8   4,335      34,680       378.2      23.1      00:21:07
 13777       6   4,335      26,010       386.8      23.6      00:21:03
 14096       8   4,335      34,680       395.7      24.2      00:20:57
 14381       7   4,335      30,345       404.2      24.7      00:20:52
 14717       8   4,335      34,680       413.8      25.3      00:20:43
 15126       8   4,335      34,680       425.9      26.0      00:20:25
 15564       6   4,335      26,010       438.5      26.8      00:20:05
 16009       8   4,335      34,680       451.7      27.6      00:19:43
 16431      10   4,335      43,350       464.4      28.4      00:19:23
 16774       6   4,335      26,010       474.3      29.0      00:19:14
 17053       5   4,335      21,675       482.4      29.5      00:19:11
 17348       6   4,335      26,010       491.0      30.0      00:19:06
 17629       6   4,335      26,010       499.5      30.5      00:19:01
 17971      10   4,335      43,350       509.2      31.1      00:18:52
 18289       8   4,335      34,680       518.5      31.7      00:18:44
 18601      10   4,335      43,350       527.3      32.2      00:18:37
 18859       8   4,335      34,680       535.0      32.7      00:18:34
 19157       9   4,335      39,015       544.1      33.2      00:18:27
 19518       7   4,335      30,345       554.8      33.9      00:18:14
 19976       7   4,335      30,345       568.8      34.8      00:17:52
 20450      10   4,335      43,350       582.9      35.6      00:17:31
 20740      10   4,335      43,350       591.4      36.1      00:17:25
 21087       8   4,335      34,680       601.5      36.7      00:17:15
 21466       8   4,335      34,680       611.5      37.4      00:17:05
 21800       8   4,335      34,680       620.5      37.9      00:16:57
 22102       9   4,335      39,015       628.8      38.4      00:16:52
 22442       6   4,335      26,010       638.0      39.0      00:16:44
 22794       5   4,335      21,675       647.5      39.6      00:16:35
 23154      10   4,335      43,350       657.6      40.2      00:16:25
 23522       1   4,335       4,335       667.9      40.8      00:16:14
 23903       6   4,335      26,010       678.8      41.5      00:16:01
 24336      10   4,335      43,350       690.5      42.2      00:15:47
 24819       4   4,335      17,340       704.4      43.0      00:15:28
 25156       9   4,335      39,015       714.1      43.6      00:15:19
 25509       8   4,335      34,680       724.3      44.2      00:15:09
 25784      10   4,335      43,350       732.1      44.7      00:15:04
 26096       8   4,335      34,680       741.1      45.3      00:14:56
 26498       6   4,335      26,010       752.4      46.0      00:14:43
 26899       6   4,335      26,010       763.7      46.7      00:14:31
 27213      10   4,335      43,350       772.7      47.2      00:14:23
 27503       7   4,335      30,345       780.9      47.7      00:14:17
 27784       7   4,335      30,345       789.1      48.2      00:14:10
 28142      10   4,335      43,350       799.7      48.9      00:13:59
 28561       9   4,335      39,015       812.3      49.6      00:13:44
 28827       8   4,335      34,680       820.2      50.1      00:13:38
 29154       9   4,335      39,015       829.8      50.7      00:13:29
 29544       3   4,335      13,005       841.1      51.4      00:13:16
 29900       5   4,335      21,675       851.4      52.0      00:13:06
 30187       8   4,335      34,680       859.8      52.5      00:12:59
 30539       8   4,335      34,680       870.4      53.2      00:12:48
 30949       9   4,335      39,015       882.4      53.9      00:12:34
 31364       7   4,335      30,345       894.6      54.7      00:12:20
 31779       8   4,335      34,680       907.1      55.4      00:12:05
 32209       9   4,335      39,015       920.3      56.2      00:11:50
 32553       6   4,335      26,010       930.8      56.9      00:11:39
 32795       9   4,335      39,015       938.0      57.3      00:11:34
 33027       8   4,335      34,680       945.0      57.7      00:11:29
 33314       6   4,335      26,010       953.6      58.3      00:11:22
 33647       7   4,335      30,345       963.8      58.9      00:11:12
 33964       3   4,335      13,005       973.2      59.5      00:11:03
 34307       8   4,335      34,680       983.8      60.1      00:10:52
 34748      10   4,335      43,350       997.1      60.9      00:10:36
 35187       6   4,335      26,010     1,010.3      61.7      00:10:21
 35631       3   4,335      13,005     1,023.6      62.5      00:10:06
 36076       6   4,335      26,010     1,036.8      63.3      00:09:51
 36535       6   4,335      26,010     1,050.6      64.2      00:09:36
 36899       3   4,335      13,005     1,061.2      64.8      00:09:25
 37250       7   4,335      30,345     1,070.8      65.4      00:09:16
 37590       5   4,335      21,675     1,080.4      66.0      00:09:07
 37892       9   4,335      39,015     1,088.9      66.5      00:08:59
 38215       4   4,335      17,340     1,098.4      67.1      00:08:50
 38537       7   4,335      30,345     1,108.1      67.7      00:08:41
 38859      10   4,335      43,350     1,117.5      68.3      00:08:32
 39152       3   4,335      13,005     1,126.1      68.8      00:08:24
 39457       8   4,335      34,680     1,134.5      69.3      00:08:17
 39760      10   4,335      43,350     1,143.2      69.8      00:08:09
 40137       8   4,335      34,680     1,154.1      70.5      00:07:58
 40559       7   4,335      30,345     1,166.5      71.3      00:07:45
 40968      10   4,335      43,350     1,178.6      72.0      00:07:32
 41233      10   4,335      43,350     1,186.4      72.5      00:07:25
 41553       9   4,335      39,015     1,195.7      73.0      00:07:16
 41846       7   4,335      30,345     1,204.3      73.6      00:07:08
 42131       8   4,335      34,680     1,212.4      74.1      00:07:01
 42423      10   4,335      43,350     1,220.7      74.6      00:06:53
 42723       7   4,335      30,345     1,229.3      75.1      00:06:45
 43030       6   4,335      26,010     1,238.2      75.6      00:06:37
 43356       8   4,335      34,680     1,248.1      76.2      00:06:27
 43670       8   4,335      34,680     1,257.0      76.8      00:06:18
 44000       7   4,335      30,345     1,266.6      77.4      00:06:09
 44330       6   4,335      26,010     1,276.0      78.0      00:05:60
 44717       8   4,335      34,680     1,287.0      78.6      00:05:49
 45104       9   4,335      39,015     1,298.1      79.3      00:05:37
 45489       9   4,335      39,015     1,308.7      79.9      00:05:27
 45846       9   4,335      39,015     1,318.4      80.5      00:05:17
 46155       7   4,335      30,345     1,327.5      81.1      00:05:08
 46480      10   4,335      43,350     1,336.9      81.7      00:04:59
 46886       6   4,335      26,010     1,349.0      82.4      00:04:46
 47180       9   4,335      39,015     1,356.8      82.9      00:04:39
 47534       7   4,335      30,345     1,366.5      83.5      00:04:30
 47875       6   4,335      26,010     1,376.2      84.1      00:04:20
 48173       6   4,335      26,010     1,384.8      84.6      00:04:12
 48556       9   4,335      39,015     1,396.0      85.3      00:04:00
 48975       5   4,335      21,675     1,408.0      86.0      00:03:48
 49344       8   4,335      34,680     1,418.8      86.7      00:03:37
 49868       6   4,335      26,010     1,432.8      87.5      00:03:23
 50297       8   4,335      34,680     1,444.9      88.3      00:03:10
 50640       9   4,335      39,015     1,454.5      88.9      00:03:01
 50993       4   4,335      17,340     1,465.0      89.5      00:02:50
 51365       3   4,335      13,005     1,475.8      90.2      00:02:40
 51713      10   4,335      43,350     1,486.3      90.8      00:02:29
 52027      10   4,335      43,350     1,495.6      91.4      00:02:20
 52386       8   4,335      34,680     1,506.8      92.1      00:02:09
 52746       5   4,335      21,675     1,518.3      92.8      00:01:57
 53125       5   4,335      21,675     1,529.9      93.5      00:01:46
 53559      10   4,335      43,350     1,543.0      94.3      00:01:33
 53916      10   4,335      43,350     1,553.5      94.9      00:01:22
 54258       8   4,335      34,680     1,563.4      95.5      00:01:13
 54652       7   4,335      30,345     1,574.1      96.2      00:01:02
 55041       5   4,335      21,675     1,585.2      96.8      00:00:51
 55399       3   4,335      13,005     1,595.1      97.4      00:00:41
 55721       5   4,335      21,675     1,604.1      98.0      00:00:32
 55986       7   4,335      30,345     1,611.9      98.5      00:00:25
 56276       4   4,335      17,340     1,620.5      99.0      00:00:16
 56610       6   4,335      26,010     1,630.6      99.6      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1625.78
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
