
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A400.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/output_log/Stata/geonear.log
  log type:  text
 opened on:  12 Apr 2024, 11:54:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   366       8   4,435      35,480         9.2       0.6      00:30:02
   764       7   4,435      31,045        19.9       1.2      00:27:40
  1143       9   4,435      39,915        30.5       1.8      00:27:01
  1506      10   4,435      44,350        41.1       2.5      00:26:31
  1903       4   4,435      17,740        52.3       3.1      00:25:53
  2288       4   4,435      17,740        63.2       3.8      00:25:31
  2683       8   4,435      35,480        74.3       4.4      00:25:09
  3065       7   4,435      31,045        85.3       5.1      00:24:53
  3448      10   4,435      44,350        96.9       5.8      00:24:27
  3862       4   4,435      17,740       108.9       6.5      00:23:60
  4192       9   4,435      39,915       118.0       7.0      00:24:13
  4523       4   4,435      17,740       127.1       7.6      00:24:23
  4817      10   4,435      44,350       135.8       8.1      00:24:36
  5135       7   4,435      31,045       144.8       8.6      00:24:41
  5447       9   4,435      39,915       153.9       9.2      00:24:44
  5790       4   4,435      17,740       163.0       9.7      00:24:46
  6103       8   4,435      35,480       172.1      10.3      00:24:46
  6419       7   4,435      31,045       180.8      10.8      00:24:49
  6718       9   4,435      39,915       189.2      11.3      00:24:54
  7015       3   4,435      13,305       197.7      11.8      00:24:56
  7364       8   4,435      35,480       207.5      12.4      00:24:47
  7714       4   4,435      17,740       217.6      13.0      00:24:35
  8044       7   4,435      31,045       227.7      13.6      00:24:23
  8391      10   4,435      44,350       238.3      14.2      00:24:09
  8737       9   4,435      39,915       248.7      14.9      00:23:56
  9068       9   4,435      39,915       258.7      15.4      00:23:45
  9372      10   4,435      44,350       268.0      16.0      00:23:40
  9659       8   4,435      35,480       276.9      16.5      00:23:36
  9950       6   4,435      26,610       285.5      17.0      00:23:33
 10246       3   4,435      13,305       293.4      17.5      00:23:34
 10538      10   4,435      44,350       301.8      18.0      00:23:32
 10877       7   4,435      31,045       311.4      18.6      00:23:23
 11198       7   4,435      31,045       320.7      19.1      00:23:16
 11451       4   4,435      17,740       328.1      19.6      00:23:18
 11741       8   4,435      35,480       336.3      20.1      00:23:15
 12042       9   4,435      39,915       345.1      20.6      00:23:09
 12336       5   4,435      22,175       353.6      21.1      00:23:05
 12702       6   4,435      26,610       364.2      21.8      00:22:49
 13075       8   4,435      35,480       374.8      22.4      00:22:35
 13434       8   4,435      35,480       385.3      23.0      00:22:21
 13716       6   4,435      26,610       394.0      23.5      00:22:15
 13987       5   4,435      22,175       401.7      24.0      00:22:13
 14295       6   4,435      26,610       410.9      24.5      00:22:05
 14604       8   4,435      35,480       420.1      25.1      00:21:56
 14926       8   4,435      35,480       429.5      25.6      00:21:47
 15283      10   4,435      44,350       440.4      26.3      00:21:31
 15654      10   4,435      44,350       451.2      26.9      00:21:16
 16023       8   4,435      35,480       462.5      27.6      00:21:00
 16383       8   4,435      35,480       473.6      28.3      00:20:45
 16716       6   4,435      26,610       483.5      28.9      00:20:34
 17014       8   4,435      35,480       492.3      29.4      00:20:27
 17306       5   4,435      22,175       500.9      29.9      00:20:20
 17587      10   4,435      44,350       509.8      30.4      00:20:13
 17933      10   4,435      44,350       519.8      31.0      00:20:02
 18288       5   4,435      22,175       530.5      31.7      00:19:48
 18610       7   4,435      31,045       539.7      32.2      00:19:39
 18899       9   4,435      39,915       548.6      32.8      00:19:32
 19196      10   4,435      44,350       557.8      33.3      00:19:23
 19565      10   4,435      44,350       569.1      34.0      00:19:08
 19935       6   4,435      26,610       580.6      34.7      00:18:52
 20294      10   4,435      44,350       591.6      35.3      00:18:39
 20618       9   4,435      39,915       601.4      35.9      00:18:28
 20892       6   4,435      26,610       609.7      36.4      00:18:22
 21187       1   4,435       4,435       618.1      36.9      00:18:16
 21510       7   4,435      31,045       627.0      37.4      00:18:08
 21838       7   4,435      31,045       635.9      38.0      00:17:60
 22169      10   4,435      44,350       645.1      38.5      00:17:51
 22495       6   4,435      26,610       654.2      39.1      00:17:43
 22824       4   4,435      17,740       663.2      39.6      00:17:34
 23149       4   4,435      17,740       672.6      40.2      00:17:25
 23468       3   4,435      13,305       682.0      40.7      00:17:15
 23798      10   4,435      44,350       691.4      41.3      00:17:06
 24096       7   4,435      31,045       700.0      41.8      00:16:58
 24471       6   4,435      26,610       710.3      42.4      00:16:46
 24848       4   4,435      17,740       721.4      43.1      00:16:33
 25234       8   4,435      35,480       732.9      43.8      00:16:18
 25601      10   4,435      44,350       743.5      44.4      00:16:06
 25890       6   4,435      26,610       752.1      44.9      00:15:58
 26183      10   4,435      44,350       760.7      45.4      00:15:51
 26534       9   4,435      39,915       770.7      46.0      00:15:40
 26883       4   4,435      17,740       780.8      46.6      00:15:29
 27190       9   4,435      39,915       789.9      47.2      00:15:20
 27478      10   4,435      44,350       798.2      47.7      00:15:13
 27792       6   4,435      26,610       807.6      48.2      00:15:03
 28144       8   4,435      35,480       818.2      48.9      00:14:51
 28513       8   4,435      35,480       829.5      49.5      00:14:38
 28853       6   4,435      26,610       839.8      50.2      00:14:26
 29131       8   4,435      35,480       848.3      50.7      00:14:19
 29452      10   4,435      44,350       857.8      51.2      00:14:09
 29762      10   4,435      44,350       867.0      51.8      00:13:60
 30024      10   4,435      44,350       874.8      52.2      00:13:54
 30299       9   4,435      39,915       883.0      52.7      00:13:46
 30591       9   4,435      39,915       892.0      53.3      00:13:37
 30951       4   4,435      17,740       902.8      53.9      00:13:25
 31339       5   4,435      22,175       914.5      54.6      00:13:11
 31721       8   4,435      35,480       926.2      55.3      00:12:57
 32095       9   4,435      39,915       938.0      56.0      00:12:43
 32462       8   4,435      35,480       949.6      56.7      00:12:30
 32744       5   4,435      22,175       958.0      57.2      00:12:22
 33026       9   4,435      39,915       966.8      57.7      00:12:13
 33329       5   4,435      22,175       976.1      58.3      00:12:04
 33653       7   4,435      31,045       986.2      58.9      00:11:53
 33975       7   4,435      31,045       996.1      59.5      00:11:43
 34285       6   4,435      26,610     1,005.8      60.1      00:11:33
 34669       5   4,435      22,175     1,017.5      60.8      00:11:19
 35053       7   4,435      31,045     1,029.5      61.5      00:11:05
 35442       6   4,435      26,610     1,041.5      62.2      00:10:52
 35836       8   4,435      35,480     1,053.4      62.9      00:10:38
 36212       2   4,435       8,870     1,065.0      63.6      00:10:25
 36580       9   4,435      39,915     1,076.2      64.3      00:10:13
 36890       6   4,435      26,610     1,085.4      64.8      00:10:04
 37224       3   4,435      13,305     1,094.8      65.4      00:09:54
 37534       9   4,435      39,915     1,103.6      65.9      00:09:46
 37832       7   4,435      31,045     1,112.2      66.4      00:09:37
 38138       8   4,435      35,480     1,121.4      67.0      00:09:28
 38435       5   4,435      22,175     1,130.6      67.5      00:09:19
 38801      10   4,435      44,350     1,141.6      68.2      00:09:07
 39143       9   4,435      39,915     1,151.8      68.8      00:08:57
 39467       7   4,435      31,045     1,161.0      69.3      00:08:47
 39816       9   4,435      39,915     1,171.2      69.9      00:08:37
 40211       5   4,435      22,175     1,182.9      70.6      00:08:24
 40617       4   4,435      17,740     1,195.1      71.4      00:08:10
 40998      10   4,435      44,350     1,206.8      72.1      00:07:58
 41328       9   4,435      39,915     1,216.5      72.6      00:07:48
 41671       3   4,435      13,305     1,226.9      73.3      00:07:37
 41988       1   4,435       4,435     1,236.5      73.8      00:07:27
 42334       6   4,435      26,610     1,246.0      74.4      00:07:18
 42656       9   4,435      39,915     1,255.5      75.0      00:07:08
 42974       9   4,435      39,915     1,265.0      75.5      00:06:58
 43289       5   4,435      22,175     1,274.8      76.1      00:06:48
 43610       5   4,435      22,175     1,284.3      76.7      00:06:39
 43904      10   4,435      44,350     1,292.9      77.2      00:06:30
 44206      10   4,435      44,350     1,301.8      77.7      00:06:22
 44546       6   4,435      26,610     1,311.6      78.3      00:06:12
 44897       6   4,435      26,610     1,322.1      78.9      00:06:01
 45265       9   4,435      39,915     1,332.7      79.6      00:05:50
 45557      10   4,435      44,350     1,340.8      80.1      00:05:42
 45850       6   4,435      26,610     1,349.0      80.6      00:05:34
 46144      10   4,435      44,350     1,357.7      81.1      00:05:25
 46430       7   4,435      31,045     1,366.4      81.6      00:05:16
 46770       8   4,435      35,480     1,376.6      82.2      00:05:06
 47118       5   4,435      22,175     1,386.5      82.8      00:04:56
 47415       6   4,435      26,610     1,394.8      83.3      00:04:47
 47706       4   4,435      17,740     1,403.1      83.8      00:04:39
 48003       8   4,435      35,480     1,411.8      84.3      00:04:30
 48291       8   4,435      35,480     1,420.3      84.8      00:04:22
 48585       8   4,435      35,480     1,429.1      85.3      00:04:13
 48879      10   4,435      44,350     1,437.6      85.8      00:04:04
 49168       8   4,435      35,480     1,446.3      86.4      00:03:56
 49465      10   4,435      44,350     1,454.8      86.9      00:03:47
 49758       3   4,435      13,305     1,462.7      87.3      00:03:39
 50042       7   4,435      31,045     1,470.9      87.8      00:03:31
 50350      10   4,435      44,350     1,479.6      88.4      00:03:22
 50671       6   4,435      26,610     1,488.9      88.9      00:03:12
 50980       7   4,435      31,045     1,498.4      89.5      00:03:03
 51291       8   4,435      35,480     1,507.6      90.0      00:02:53
 51586       9   4,435      39,915     1,516.6      90.6      00:02:44
 51867       9   4,435      39,915     1,525.3      91.1      00:02:35
 52158       9   4,435      39,915     1,534.4      91.6      00:02:26
 52490       6   4,435      26,610     1,544.9      92.3      00:02:15
 52848       9   4,435      39,915     1,556.6      93.0      00:02:02
 53221       9   4,435      39,915     1,568.2      93.6      00:01:50
 53593       6   4,435      26,610     1,579.6      94.3      00:01:38
 53895       8   4,435      35,480     1,588.7      94.9      00:01:29
 54183       8   4,435      35,480     1,597.2      95.4      00:01:20
 54480       7   4,435      31,045     1,605.6      95.9      00:01:11
 54820       7   4,435      31,045     1,615.4      96.5      00:01:01
 55134      10   4,435      44,350     1,624.5      97.0      00:00:52
 55448       7   4,435      31,045     1,633.2      97.5      00:00:43
 55744       7   4,435      31,045     1,641.8      98.0      00:00:34
 56041       6   4,435      26,610     1,650.8      98.6      00:00:25
 56369       4   4,435      17,740     1,660.7      99.2      00:00:14
 56682       8   4,435      35,480     1,670.5      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1743.272
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400.csv saved

. 
. cap log close

. 
end of do-file
