-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  17 Apr 2024, 23:11:01

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   369       6   4,835      29,010        10.2       0.6      00:29:50
   788       8   4,835      38,680        22.6       1.2      00:26:42
  1159       2   4,835       9,670        33.7       1.8      00:26:38
  1530       6   4,835      29,010        45.6       2.5      00:26:04
  1941       3   4,835      14,505        58.1       3.2      00:25:22
  2385       9   4,835      43,515        71.9       3.9      00:24:26
  2805       6   4,835      29,010        85.1       4.7      00:23:54
  3237       7   4,835      33,845        98.7       5.4      00:23:22
  3672      10   4,835      48,350       112.7       6.2      00:22:50
  4053       9   4,835      43,515       124.4       6.8      00:22:50
  4396       5   4,835      24,175       134.5       7.4      00:23:05
  4696       4   4,835      19,340       144.2       7.9      00:23:21
  4977      10   4,835      48,350       153.1       8.4      00:23:43
  5264      10   4,835      48,350       161.9       8.9      00:24:02
  5513       6   4,835      29,010       169.5       9.3      00:24:29
  5774       9   4,835      43,515       177.3       9.7      00:24:51
  6057       8   4,835      38,680       186.2      10.2      00:25:00
  6315       9   4,835      43,515       194.0      10.6      00:25:17
  6579       8   4,835      38,680       202.1      11.1      00:25:30
  6862       8   4,835      38,680       210.7      11.5      00:25:36
  7268       8   4,835      38,680       223.0      12.2      00:25:12
  7645       7   4,835      33,845       235.1      12.9      00:24:51
  7968       9   4,835      43,515       245.7      13.5      00:24:42
  8334       3   4,835      14,505       257.9      14.1      00:24:22
  8697       8   4,835      38,680       269.8      14.8      00:24:04
  9064       9   4,835      43,515       281.9      15.4      00:23:46
  9333       7   4,835      33,845       290.8      15.9      00:23:47
  9604       6   4,835      29,010       299.9      16.4      00:23:47
  9913       7   4,835      33,845       310.1      17.0      00:23:40
 10226       8   4,835      38,680       319.4      17.5      00:23:38
 10524       3   4,835      14,505       328.6      18.0      00:23:35
 10870       5   4,835      24,175       339.3      18.6      00:23:24
 11201       9   4,835      43,515       349.7      19.2      00:23:15
 11481       5   4,835      24,175       358.6      19.6      00:23:14
 11789       8   4,835      38,680       368.2      20.2      00:23:08
 12071       5   4,835      24,175       377.2      20.7      00:23:05
 12363       6   4,835      29,010       386.4      21.2      00:23:01
 12746       8   4,835      38,680       398.4      21.8      00:22:44
 13153       6   4,835      29,010       411.0      22.5      00:22:25
 13549       8   4,835      38,680       424.1      23.2      00:22:04
 13823       4   4,835      19,340       432.8      23.7      00:22:02
 14127       7   4,835      33,845       442.3      24.2      00:21:56
 14434       3   4,835      14,505       452.4      24.8      00:21:47
 14784       5   4,835      24,175       463.7      25.4      00:21:34
 15166      10   4,835      48,350       476.3      26.1      00:21:17
 15580       9   4,835      43,515       489.6      26.8      00:20:58
 16008       7   4,835      33,845       503.7      27.6      00:20:36
 16459       7   4,835      33,845       519.0      28.4      00:20:11
 16783       4   4,835      19,340       529.3      29.0      00:20:02
 17109      10   4,835      48,350       539.7      29.6      00:19:53
 17429       9   4,835      43,515       550.2      30.1      00:19:44
 17746       9   4,835      43,515       560.9      30.7      00:19:35
 18105      10   4,835      48,350       572.4      31.4      00:19:22
 18419       9   4,835      43,515       582.4      31.9      00:19:15
 18695       7   4,835      33,845       591.4      32.4      00:19:10
 18993       7   4,835      33,845       601.3      32.9      00:19:02
 19330       7   4,835      33,845       612.5      33.6      00:18:51
 19768       6   4,835      29,010       627.4      34.4      00:18:30
 20153       2   4,835       9,670       640.4      35.1      00:18:14
 20524       9   4,835      43,515       652.5      35.7      00:18:01
 20786       8   4,835      38,680       661.1      36.2      00:17:56
 21065       7   4,835      33,845       670.1      36.7      00:17:51
 21399      10   4,835      48,350       680.0      37.2      00:17:43
 21686      10   4,835      48,350       688.9      37.7      00:17:38
 21946      10   4,835      48,350       696.7      38.2      00:17:35
 22206       9   4,835      43,515       704.4      38.6      00:17:32
 22484       7   4,835      33,845       712.8      39.0      00:17:28
 22783       6   4,835      29,010       721.9      39.5      00:17:22
 23047       7   4,835      33,845       730.0      40.0      00:17:17
 23325       6   4,835      29,010       739.2      40.5      00:17:11
 23599       9   4,835      43,515       747.2      40.9      00:17:06
 23917       7   4,835      33,845       757.6      41.5      00:16:57
 24237       8   4,835      38,680       767.3      42.0      00:16:49
 24610       7   4,835      33,845       779.0      42.7      00:16:36
 25027      10   4,835      48,350       792.2      43.4      00:16:20
 25403       8   4,835      38,680       804.3      44.1      00:16:07
 25708       7   4,835      33,845       813.9      44.6      00:15:59
 25982       3   4,835      14,505       822.8      45.1      00:15:52
 26263       9   4,835      43,515       832.1      45.6      00:15:45
 26638       6   4,835      29,010       843.5      46.2      00:15:33
 26980       2   4,835       9,670       854.4      46.8      00:15:22
 27272       9   4,835      43,515       863.6      47.3      00:15:15
 27543       9   4,835      43,515       872.4      47.8      00:15:08
 27851       6   4,835      29,010       882.4      48.3      00:14:59
 28251       8   4,835      38,680       895.4      49.0      00:14:45
 28566      10   4,835      48,350       906.1      49.6      00:14:34
 28788      10   4,835      48,350       913.4      50.0      00:14:30
 28993       7   4,835      33,845       920.2      50.4      00:14:27
 29311       9   4,835      43,515       930.4      51.0      00:14:18
 29651       7   4,835      33,845       941.4      51.6      00:14:07
 29931       9   4,835      43,515       950.6      52.1      00:13:59
 30194       9   4,835      43,515       959.3      52.5      00:13:52
 30512       4   4,835      19,340       969.9      53.1      00:13:42
 30887      10   4,835      48,350       982.2      53.8      00:13:29
 31272       8   4,835      38,680       994.8      54.5      00:13:15
 31683       8   4,835      38,680     1,008.5      55.2      00:12:59
 32074       8   4,835      38,680     1,021.9      56.0      00:12:44
 32459       7   4,835      33,845     1,035.1      56.7      00:12:30
 32723       6   4,835      29,010     1,043.8      57.2      00:12:23
 32981       7   4,835      33,845     1,052.5      57.6      00:12:16
 33210       8   4,835      38,680     1,060.2      58.1      00:12:10
 33561       7   4,835      33,845     1,071.9      58.7      00:11:58
 33879       7   4,835      33,845     1,082.6      59.3      00:11:48
 34209       5   4,835      24,175     1,094.0      59.9      00:11:37
 34609       4   4,835      19,340     1,107.3      60.7      00:11:22
 35019       8   4,835      38,680     1,121.2      61.4      00:11:07
 35437       5   4,835      24,175     1,135.3      62.2      00:10:52
 35882      10   4,835      48,350     1,150.0      63.0      00:10:36
 36335       5   4,835      24,175     1,165.3      63.8      00:10:19
 36629      10   4,835      48,350     1,174.8      64.4      00:10:10
 36852      10   4,835      48,350     1,182.0      64.7      00:10:06
 37110       7   4,835      33,845     1,190.3      65.2      00:09:59
 37382       5   4,835      24,175     1,198.4      65.6      00:09:52
 37638       5   4,835      24,175     1,206.6      66.1      00:09:46
 37939       5   4,835      24,175     1,216.0      66.6      00:09:38
 38225       5   4,835      24,175     1,225.4      67.1      00:09:29
 38468       7   4,835      33,845     1,233.6      67.6      00:09:23
 38829       8   4,835      38,680     1,245.4      68.2      00:09:11
 39138       6   4,835      29,010     1,255.5      68.8      00:09:01
 39462       9   4,835      43,515     1,265.6      69.3      00:08:52
 39815       3   4,835      14,505     1,276.7      69.9      00:08:41
 40209       8   4,835      38,680     1,289.5      70.6      00:08:28
 40610       8   4,835      38,680     1,302.6      71.4      00:08:15
 40998      10   4,835      48,350     1,315.6      72.1      00:08:02
 41300      10   4,835      48,350     1,325.4      72.6      00:07:53
 41651       7   4,835      33,845     1,336.9      73.2      00:07:41
 41957       6   4,835      29,010     1,347.1      73.8      00:07:32
 42232       7   4,835      33,845     1,355.3      74.2      00:07:25
 42485       8   4,835      38,680     1,363.5      74.7      00:07:18
 42776       8   4,835      38,680     1,372.6      75.2      00:07:10
 43091       8   4,835      38,680     1,383.1      75.8      00:06:60
 43369       7   4,835      33,845     1,392.5      76.3      00:06:51
 43665       7   4,835      33,845     1,401.9      76.8      00:06:43
 43948       9   4,835      43,515     1,411.0      77.3      00:06:34
 44250       7   4,835      33,845     1,420.7      77.8      00:06:25
 44563       8   4,835      38,680     1,430.5      78.4      00:06:16
 44864       3   4,835      14,505     1,440.2      78.9      00:06:07
 45193       5   4,835      24,175     1,450.7      79.5      00:05:57
 45502      10   4,835      48,350     1,460.0      80.0      00:05:49
 45821       8   4,835      38,680     1,469.7      80.5      00:05:40
 46132       9   4,835      43,515     1,479.8      81.1      00:05:30
 46434       7   4,835      33,845     1,489.7      81.6      00:05:21
 46790       6   4,835      29,010     1,501.4      82.2      00:05:09
 47097       9   4,835      43,515     1,510.8      82.8      00:05:01
 47371      10   4,835      48,350     1,519.1      83.2      00:04:53
 47661       8   4,835      38,680     1,528.1      83.7      00:04:45
 47948       7   4,835      33,845     1,537.3      84.2      00:04:36
 48249       9   4,835      43,515     1,546.9      84.7      00:04:27
 48573       6   4,835      29,010     1,557.6      85.3      00:04:17
 48891       7   4,835      33,845     1,567.7      85.9      00:04:07
 49216      10   4,835      48,350     1,578.5      86.5      00:03:57
 49514       7   4,835      33,845     1,587.4      86.9      00:03:49
 49794      10   4,835      48,350     1,595.8      87.4      00:03:41
 50065       7   4,835      33,845     1,604.3      87.9      00:03:33
 50330       8   4,835      38,680     1,612.5      88.3      00:03:25
 50642       5   4,835      24,175     1,622.4      88.9      00:03:16
 50943       5   4,835      24,175     1,632.3      89.4      00:03:06
 51229       7   4,835      33,845     1,641.6      89.9      00:02:57
 51551       7   4,835      33,845     1,652.1      90.5      00:02:47
 51841       9   4,835      43,515     1,662.0      91.0      00:02:38
 52158       9   4,835      43,515     1,672.8      91.6      00:02:27
 52525       9   4,835      43,515     1,685.6      92.3      00:02:15
 52925       7   4,835      33,845     1,699.6      93.1      00:02:01
 53331       9   4,835      43,515     1,713.2      93.8      00:01:48
 53722       7   4,835      33,845     1,726.3      94.6      00:01:35
 54020       2   4,835       9,670     1,735.9      95.1      00:01:26
 54306       7   4,835      33,845     1,745.2      95.6      00:01:17
 54621       7   4,835      33,845     1,754.6      96.1      00:01:08
 54978      10   4,835      48,350     1,766.1      96.7      00:00:57
 55222       6   4,835      29,010     1,773.7      97.2      00:00:50
 55461       8   4,835      38,680     1,781.0      97.6      00:00:43
 55685       8   4,835      38,680     1,787.9      97.9      00:00:36
 55954       9   4,835      43,515     1,796.9      98.4      00:00:28
 56243       5   4,835      24,175     1,806.3      98.9      00:00:19
 56545      10   4,835      48,350     1,816.6      99.5      00:00:09
