
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A500.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   332       8   4,535      36,280         8.8       0.5      00:32:22
   735       6   4,535      27,210        19.7       1.2      00:28:40
  1139       8   4,535      36,280        31.2       1.8      00:26:58
  1521       8   4,535      36,280        42.7       2.5      00:26:05
  1920       9   4,535      40,815        54.1       3.2      00:25:33
  2307       5   4,535      22,675        65.5       3.8      00:25:11
  2696       9   4,535      40,815        76.6       4.5      00:24:56
  3074      10   4,535      45,350        87.6       5.1      00:24:45
  3397       6   4,535      27,210        97.7       5.7      00:24:49
  3717       6   4,535      27,210       107.3       6.3      00:24:57
  4003       9   4,535      40,815       115.3       6.7      00:25:24
  4267       5   4,535      22,675       122.8       7.2      00:25:55
  4525       7   4,535      31,745       130.2       7.6      00:26:21
  4774      10   4,535      45,350       137.8       8.1      00:26:41
  5037       8   4,535      36,280       145.5       8.5      00:26:57
  5315       3   4,535      13,605       153.6       9.0      00:27:05
  5549       6   4,535      27,210       160.1       9.4      00:27:30
  5788      10   4,535      45,350       166.8       9.8      00:27:49
  6079       6   4,535      27,210       175.5      10.3      00:27:46
  6367      10   4,535      45,350       183.6      10.7      00:27:46
  6638      10   4,535      45,350       191.4      11.2      00:27:51
  6897       5   4,535      22,675       198.9      11.6      00:27:56
  7213      10   4,535      45,350       207.7      12.1      00:27:47
  7521      10   4,535      45,350       217.0      12.7      00:27:35
  7836       6   4,535      27,210       226.5      13.2      00:27:22
  8138       9   4,535      40,815       236.0      13.8      00:27:08
  8445       6   4,535      27,210       245.6      14.4      00:26:54
  8736       6   4,535      27,210       254.4      14.9      00:26:46
  9038       3   4,535      13,605       263.8      15.4      00:26:34
  9285       6   4,535      27,210       271.6      15.9      00:26:33
  9511       6   4,535      27,210       278.6      16.3      00:26:37
  9762       6   4,535      27,210       286.6      16.7      00:26:33
 10001       3   4,535      13,605       293.5      17.2      00:26:36
 10259       7   4,535      31,745       300.6      17.6      00:26:38
 10510       3   4,535      13,605       308.0      18.0      00:26:37
 10813       7   4,535      31,745       316.6      18.5      00:26:28
 11107       5   4,535      22,675       325.4      19.0      00:26:19
 11333       9   4,535      40,815       332.0      19.4      00:26:21
 11561       6   4,535      27,210       338.7      19.8      00:26:23
 11811       8   4,535      36,280       346.3      20.2      00:26:19
 12056       9   4,535      40,815       353.6      20.7      00:26:17
 12310       3   4,535      13,605       361.0      21.1      00:26:14
 12632      10   4,535      45,350       370.6      21.7      00:25:58
 12979       8   4,535      36,280       380.5      22.2      00:25:42
 13292       8   4,535      36,280       389.8      22.8      00:25:28
 13578      10   4,535      45,350       398.9      23.3      00:25:16
 13806       8   4,535      36,280       405.7      23.7      00:25:15
 14053       8   4,535      36,280       412.9      24.1      00:25:12
 14327       9   4,535      40,815       421.4      24.6      00:25:02
 14601       6   4,535      27,210       429.7      25.1      00:24:54
 14889       2   4,535       9,070       438.3      25.6      00:24:44
 15226       5   4,535      22,675       448.8      26.2      00:24:25
 15569       4   4,535      18,140       459.0      26.8      00:24:08
 15910       6   4,535      27,210       469.6      27.4      00:23:50
 16250       4   4,535      18,140       480.3      28.1      00:23:32
 16549       5   4,535      22,675       489.6      28.6      00:23:20
 16807       8   4,535      36,280       497.3      29.1      00:23:13
 17031       6   4,535      27,210       504.2      29.5      00:23:11
 17252       9   4,535      40,815       510.8      29.9      00:23:09
 17471       9   4,535      40,815       517.8      30.3      00:23:05
 17682       8   4,535      36,280       524.4      30.6      00:23:03
 17967       6   4,535      27,210       532.8      31.1      00:22:54
 18290       4   4,535      18,140       542.7      31.7      00:22:39
 18570       5   4,535      22,675       550.9      32.2      00:22:30
 18793      10   4,535      45,350       557.9      32.6      00:22:26
 19046       5   4,535      22,675       565.9      33.1      00:22:18
 19299       6   4,535      27,210       573.8      33.5      00:22:10
 19614       4   4,535      18,140       583.7      34.1      00:21:56
 19934       6   4,535      27,210       594.0      34.7      00:21:40
 20267       6   4,535      27,210       604.3      35.3      00:21:24
 20553       7   4,535      31,745       613.2      35.8      00:21:13
 20789       6   4,535      27,210       620.4      36.3      00:21:08
 21030       5   4,535      22,675       627.7      36.7      00:21:02
 21305      10   4,535      45,350       635.2      37.1      00:20:56
 21549       7   4,535      31,745       642.6      37.6      00:20:49
 21812       9   4,535      40,815       649.8      38.0      00:20:43
 22082       6   4,535      27,210       657.5      38.4      00:20:36
 22342       4   4,535      18,140       664.8      38.9      00:20:30
 22609       9   4,535      40,815       672.6      39.3      00:20:22
 22882       8   4,535      36,280       680.0      39.7      00:20:15
 23116       4   4,535      18,140       687.1      40.2      00:20:09
 23361       4   4,535      18,140       694.5      40.6      00:20:02
 23634       8   4,535      36,280       702.1      41.0      00:19:55
 23879       6   4,535      27,210       709.6      41.5      00:19:48
 24145       2   4,535       9,070       717.1      41.9      00:19:40
 24461       6   4,535      27,210       726.3      42.4      00:19:28
 24784       7   4,535      31,745       736.1      43.0      00:19:15
 25101       9   4,535      40,815       745.6      43.6      00:19:02
 25404       4   4,535      18,140       754.7      44.1      00:18:50
 25649       8   4,535      36,280       761.9      44.5      00:18:43
 25848       7   4,535      31,745       768.1      44.9      00:18:39
 26085       3   4,535      13,605       775.3      45.3      00:18:33
 26345       8   4,535      36,280       783.1      45.8      00:18:24
 26607      10   4,535      45,350       790.6      46.2      00:18:17
 26812       8   4,535      36,280       796.6      46.6      00:18:13
 27071      10   4,535      45,350       804.4      47.0      00:18:04
 27280       9   4,535      40,815       810.6      47.4      00:17:60
 27507       6   4,535      27,210       817.5      47.8      00:17:53
 27746       9   4,535      40,815       824.7      48.2      00:17:46
 28043       9   4,535      40,815       833.9      48.7      00:17:34
 28370       7   4,535      31,745       844.0      49.3      00:17:20
 28642       5   4,535      22,675       852.6      49.8      00:17:09
 28830       5   4,535      22,675       858.5      50.2      00:17:05
 29044      10   4,535      45,350       865.1      50.6      00:16:59
 29311       9   4,535      40,815       873.1      51.0      00:16:50
 29572       5   4,535      22,675       881.0      51.5      00:16:41
 29789       8   4,535      36,280       887.6      51.9      00:16:35
 29981       8   4,535      36,280       893.5      52.2      00:16:30
 30193       6   4,535      27,210       900.1      52.6      00:16:24
 30426       8   4,535      36,280       907.3      53.0      00:16:16
 30680       9   4,535      40,815       915.1      53.5      00:16:07
 31001       7   4,535      31,745       925.0      54.1      00:15:54
 31312       6   4,535      27,210       934.7      54.6      00:15:41
 31618       7   4,535      31,745       944.3      55.2      00:15:28
 31924       9   4,535      40,815       954.1      55.8      00:15:14
 32226      10   4,535      45,350       963.8      56.3      00:15:01
 32496       5   4,535      22,675       972.4      56.8      00:14:51
 32683       3   4,535      13,605       978.1      57.2      00:14:46
 32878      10   4,535      45,350       984.3      57.5      00:14:41
 33074       6   4,535      27,210       990.5      57.9      00:14:35
 33301       8   4,535      36,280       997.6      58.3      00:14:27
 33561      10   4,535      45,350     1,005.9      58.8      00:14:17
 33826       7   4,535      31,745     1,014.2      59.3      00:14:07
 34078       8   4,535      36,280     1,022.2      59.7      00:13:57
 34347       9   4,535      40,815     1,030.9      60.2      00:13:47
 34661       9   4,535      40,815     1,040.7      60.8      00:13:33
 34977       7   4,535      31,745     1,050.7      61.4      00:13:20
 35286       7   4,535      31,745     1,060.5      62.0      00:13:07
 35610       9   4,535      40,815     1,070.6      62.6      00:12:53
 35922       7   4,535      31,745     1,080.3      63.1      00:12:41
 36240       6   4,535      27,210     1,090.3      63.7      00:12:27
 36537       5   4,535      22,675     1,099.5      64.3      00:12:16
 36763      10   4,535      45,350     1,106.3      64.7      00:12:09
 36979       4   4,535      18,140     1,112.8      65.0      00:12:02
 37212       7   4,535      31,745     1,119.5      65.4      00:11:55
 37445      10   4,535      45,350     1,126.3      65.8      00:11:48
 37679       8   4,535      36,280     1,133.1      66.2      00:11:41
 37897       5   4,535      22,675     1,139.7      66.6      00:11:34
 38131       6   4,535      27,210     1,146.9      67.0      00:11:25
 38371       8   4,535      36,280     1,154.4      67.5      00:11:17
 38632       7   4,535      31,745     1,162.5      67.9      00:11:07
 38929       5   4,535      22,675     1,171.6      68.5      00:10:55
 39163      10   4,535      45,350     1,178.6      68.9      00:10:48
 39411       6   4,535      27,210     1,185.9      69.3      00:10:39
 39644       6   4,535      27,210     1,192.9      69.7      00:10:31
 39902       5   4,535      22,675     1,200.7      70.2      00:10:22
 40234       8   4,535      36,280     1,210.5      70.7      00:10:09
 40551       8   4,535      36,280     1,220.3      71.3      00:09:57
 40877       6   4,535      27,210     1,230.4      71.9      00:09:43
 41089       5   4,535      22,675     1,237.1      72.3      00:09:36
 41306       7   4,535      31,745     1,243.7      72.7      00:09:29
 41550       9   4,535      40,815     1,251.2      73.1      00:09:20
 41789      10   4,535      45,350     1,258.5      73.5      00:09:12
 41976       7   4,535      31,745     1,264.3      73.9      00:09:06
 42214       9   4,535      40,815     1,271.0      74.3      00:08:58
 42425       7   4,535      31,745     1,277.5      74.7      00:08:51
 42653      10   4,535      45,350     1,284.1      75.0      00:08:43
 42869       9   4,535      40,815     1,290.7      75.4      00:08:36
 43067       7   4,535      31,745     1,297.0      75.8      00:08:29
 43286       6   4,535      27,210     1,303.9      76.2      00:08:21
 43512       5   4,535      22,675     1,310.7      76.6      00:08:13
 43841       5   4,535      22,675     1,320.5      77.2      00:08:00
 44134       5   4,535      22,675     1,329.2      77.7      00:07:49
 44347       3   4,535      13,605     1,335.6      78.1      00:07:42
 44594      10   4,535      45,350     1,343.1      78.5      00:07:33
 44848       3   4,535      13,605     1,350.8      78.9      00:07:24
 45114       8   4,535      36,280     1,358.7      79.4      00:07:14
 45398       5   4,535      22,675     1,366.6      79.9      00:07:04
 45619       8   4,535      36,280     1,372.9      80.2      00:06:57
 45869       6   4,535      27,210     1,380.1      80.7      00:06:49
 46084       9   4,535      40,815     1,386.8      81.0      00:06:41
 46318       5   4,535      22,675     1,394.1      81.5      00:06:32
 46552       9   4,535      40,815     1,401.3      81.9      00:06:23
 46849       7   4,535      31,745     1,410.4      82.4      00:06:12
 47079       3   4,535      13,605     1,416.8      82.8      00:06:04
 47308       7   4,535      31,745     1,423.3      83.2      00:05:57
 47520       8   4,535      36,280     1,429.3      83.5      00:05:50
 47736      10   4,535      45,350     1,435.9      83.9      00:05:42
 47949       6   4,535      27,210     1,442.3      84.3      00:05:34
 48173       8   4,535      36,280     1,449.0      84.7      00:05:26
 48414       5   4,535      22,675     1,456.4      85.1      00:05:17
 48659       8   4,535      36,280     1,463.8      85.5      00:05:08
 48901       8   4,535      36,280     1,471.0      86.0      00:04:59
 49112      10   4,535      45,350     1,477.5      86.3      00:04:52
 49335       2   4,535       9,070     1,484.1      86.7      00:04:44
 49558       6   4,535      27,210     1,490.4      87.1      00:04:36
 49793       8   4,535      36,280     1,497.0      87.5      00:04:28
 50024       9   4,535      40,815     1,503.9      87.9      00:04:20
 50269       1   4,535       4,535     1,511.0      88.3      00:04:11
 50495       3   4,535      13,605     1,517.6      88.7      00:04:03
 50723      10   4,535      45,350     1,524.6      89.1      00:03:54
 50917       8   4,535      36,280     1,530.7      89.5      00:03:47
 51130       6   4,535      27,210     1,537.2      89.8      00:03:39
 51337       6   4,535      27,210     1,543.5      90.2      00:03:31
 51558       6   4,535      27,210     1,550.3      90.6      00:03:23
 51779       4   4,535      18,140     1,557.4      91.0      00:03:14
 52035       7   4,535      31,745     1,565.5      91.5      00:03:04
 52331       8   4,535      36,280     1,575.1      92.0      00:02:51
 52616       7   4,535      31,745     1,584.6      92.6      00:02:39
 52918       9   4,535      40,815     1,594.4      93.2      00:02:27
 53215       9   4,535      40,815     1,603.8      93.7      00:02:15
 53498       8   4,535      36,280     1,612.7      94.2      00:02:04
 53748       8   4,535      36,280     1,620.5      94.7      00:01:54
 53964       3   4,535      13,605     1,626.9      95.1      00:01:46
 54193       9   4,535      40,815     1,633.9      95.5      00:01:37
 54434       8   4,535      36,280     1,640.8      95.9      00:01:29
 54690       6   4,535      27,210     1,648.3      96.3      00:01:19
 54949       5   4,535      22,675     1,656.0      96.8      00:01:09
 55175      10   4,535      45,350     1,662.6      97.2      00:01:01
 55391       4   4,535      18,140     1,668.8      97.5      00:00:53
 55608       6   4,535      27,210     1,675.0      97.9      00:00:46
 55798       6   4,535      27,210     1,680.8      98.2      00:00:38
 56020       6   4,535      27,210     1,687.7      98.6      00:00:30
 56255      10   4,535      45,350     1,695.1      99.1      00:00:20
 56486       9   4,535      40,815     1,702.5      99.5      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 2171.137
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
