
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A1000.dta /export/storage_covidvaccine/Result/MN
> L_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_
> 5_4q_mnl_A1000.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A1000.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A1000.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   434       2   5,035      10,070        12.5       0.7      00:25:17
   879       6   5,035      30,210        26.0       1.4      00:24:04
  1352       7   5,035      35,245        41.5       2.2      00:22:26
  1826       5   5,035      25,175        57.0       3.0      00:21:36
  2286       3   5,035      15,105        71.7       3.8      00:21:17
  2778       8   5,035      40,280        87.7       4.6      00:20:43
  3223       4   5,035      20,140       102.3       5.4      00:20:33
  3673       7   5,035      35,245       117.4       6.2      00:20:17
  4081       7   5,035      35,245       130.4       6.9      00:20:24
  4415       8   5,035      40,280       140.7       7.4      00:20:53
  4737       5   5,035      25,175       151.6       8.0      00:21:11
  5064       8   5,035      40,280       162.3       8.5      00:21:27
  5427       3   5,035      15,105       174.2       9.2      00:21:31
  5800      10   5,035      50,350       185.4       9.7      00:21:37
  6145       7   5,035      35,245       196.7      10.3      00:21:41
  6497       6   5,035      30,210       207.9      10.9      00:21:45
  6852       6   5,035      30,210       219.1      11.5      00:21:46
  7283       3   5,035      15,105       232.7      12.2      00:21:32
  7723       5   5,035      25,175       247.3      13.0      00:21:12
  8126       5   5,035      25,175       261.3      13.7      00:20:56
  8549       8   5,035      40,280       276.0      14.5      00:20:38
  8967       9   5,035      45,315       290.3      15.3      00:20:22
  9358       6   5,035      30,210       303.7      16.0      00:20:11
  9686       5   5,035      25,175       315.3      16.6      00:20:08
 10038       4   5,035      20,140       326.9      17.2      00:20:06
 10346       9   5,035      45,315       336.3      17.7      00:20:11
 10713       8   5,035      40,280       348.3      18.3      00:20:05
 11121       7   5,035      35,245       361.5      19.0      00:19:54
 11407       7   5,035      35,245       370.9      19.5      00:19:58
 11688      10   5,035      50,350       380.1      20.0      00:20:02
 12024       8   5,035      40,280       391.2      20.6      00:19:58
 12332       4   5,035      20,140       401.3      21.1      00:19:58
 12779       2   5,035      10,070       415.8      21.9      00:19:41
 13213       8   5,035      40,280       430.0      22.6      00:19:25
 13606       9   5,035      45,315       443.6      23.3      00:19:11
 13876       9   5,035      45,315       452.5      23.8      00:19:14
 14165       8   5,035      40,280       462.0      24.3      00:19:14
 14477       9   5,035      45,315       472.7      24.9      00:19:10
 14798       9   5,035      45,315       483.4      25.4      00:19:05
 15195       8   5,035      40,280       497.1      26.1      00:18:51
 15649      10   5,035      50,350       512.1      26.9      00:18:34
 16088       8   5,035      40,280       527.5      27.7      00:18:15
 16523       6   5,035      30,210       542.6      28.5      00:17:58
 16882       4   5,035      20,140       554.3      29.2      00:17:51
 17197       9   5,035      45,315       565.0      29.7      00:17:46
 17480       8   5,035      40,280       574.8      30.2      00:17:43
 17790       7   5,035      35,245       585.3      30.8      00:17:38
 18153       9   5,035      45,315       597.7      31.4      00:17:28
 18551       9   5,035      45,315       610.7      32.1      00:17:17
 18994       6   5,035      30,210       626.2      32.9      00:16:59
 19443       8   5,035      40,280       641.8      33.8      00:16:42
 19882       9   5,035      45,315       657.2      34.6      00:16:26
 20308       8   5,035      40,280       672.1      35.4      00:16:11
 20644       6   5,035      30,210       683.7      36.0      00:16:03
 20908      10   5,035      50,350       692.8      36.4      00:16:01
 21254      10   5,035      50,350       703.7      37.0      00:15:54
 21619       7   5,035      35,245       715.3      37.6      00:15:46
 21957       9   5,035      45,315       725.9      38.2      00:15:40
 22315       8   5,035      40,280       737.0      38.8      00:15:33
 22677       3   5,035      15,105       748.7      39.4      00:15:25
 23026       8   5,035      40,280       759.5      39.9      00:15:18
 23342      10   5,035      50,350       770.2      40.5      00:15:12
 23733       3   5,035      15,105       782.6      41.2      00:15:02
 24110       8   5,035      40,280       795.2      41.8      00:14:51
 24538       8   5,035      40,280       808.7      42.5      00:14:39
 24975       9   5,035      45,315       823.1      43.3      00:14:26
 25402       8   5,035      40,280       837.5      44.1      00:14:12
 25774       7   5,035      35,245       849.9      44.7      00:14:02
 26101       5   5,035      25,175       860.9      45.3      00:13:55
 26471       2   5,035      10,070       873.0      45.9      00:13:46
 26864       8   5,035      40,280       885.7      46.6      00:13:35
 27242       5   5,035      25,175       898.3      47.3      00:13:25
 27576       5   5,035      25,175       909.5      47.8      00:13:17
 27945       8   5,035      40,280       922.2      48.5      00:13:07
 28392       4   5,035      20,140       937.3      49.3      00:12:52
 28768       5   5,035      25,175       950.6      50.0      00:12:41
 29059       5   5,035      25,175       960.6      50.5      00:12:35
 29405       7   5,035      35,245       972.2      51.1      00:12:26
 29756       9   5,035      45,315       984.0      51.8      00:12:17
 30027       9   5,035      45,315       993.2      52.2      00:12:12
 30315       5   5,035      25,175     1,003.1      52.8      00:12:06
 30678       5   5,035      25,175     1,015.6      53.4      00:11:56
 31137       6   5,035      30,210     1,031.1      54.2      00:11:41
 31575       3   5,035      15,105     1,046.5      55.0      00:11:27
 32004       7   5,035      35,245     1,061.7      55.8      00:11:13
 32425      10   5,035      50,350     1,076.7      56.6      00:10:59
 32749       9   5,035      45,315     1,087.8      57.2      00:10:51
 33049       8   5,035      40,280     1,098.4      57.8      00:10:44
 33387       6   5,035      30,210     1,110.1      58.4      00:10:35
 33751       6   5,035      30,210     1,122.9      59.1      00:10:25
 34123       7   5,035      35,245     1,136.0      59.8      00:10:14
 34558       8   5,035      40,280     1,151.4      60.6      00:09:60
 35015       6   5,035      30,210     1,167.5      61.4      00:09:45
 35462       7   5,035      35,245     1,183.2      62.2      00:09:31
 35922       5   5,035      25,175     1,199.0      63.1      00:09:17
 36387       8   5,035      40,280     1,215.2      63.9      00:09:03
 36755       8   5,035      40,280     1,227.7      64.6      00:08:53
 37096       9   5,035      45,315     1,239.1      65.2      00:08:44
 37410       9   5,035      45,315     1,248.9      65.7      00:08:38
 37718       4   5,035      20,140     1,258.9      66.2      00:08:31
 38029       9   5,035      45,315     1,269.3      66.8      00:08:24
 38320      10   5,035      50,350     1,279.3      67.3      00:08:17
 38654       8   5,035      40,280     1,290.9      67.9      00:08:08
 39053       9   5,035      45,315     1,304.6      68.6      00:07:56
 39384       4   5,035      20,140     1,315.5      69.2      00:07:48
 39723       9   5,035      45,315     1,326.6      69.8      00:07:40
 40135       4   5,035      20,140     1,340.3      70.5      00:07:28
 40582       5   5,035      25,175     1,355.6      71.3      00:07:15
 40998      10   5,035      50,350     1,370.0      72.1      00:07:03
 41340       5   5,035      25,175     1,381.6      72.7      00:06:54
 41715       9   5,035      45,315     1,394.3      73.3      00:06:44
 42048       4   5,035      20,140     1,405.6      73.9      00:06:35
 42402      10   5,035      50,350     1,416.9      74.5      00:06:27
 42720       9   5,035      45,315     1,427.7      75.1      00:06:19
 43045       3   5,035      15,105     1,438.6      75.7      00:06:10
 43359       8   5,035      40,280     1,449.7      76.3      00:06:02
 43672       6   5,035      30,210     1,460.1      76.8      00:05:54
 43991      10   5,035      50,350     1,470.8      77.4      00:05:46
 44322       4   5,035      20,140     1,481.8      77.9      00:05:37
 44680       7   5,035      35,245     1,493.5      78.6      00:05:28
 45056       1   5,035       5,035     1,506.2      79.2      00:05:18
 45418       5   5,035      25,175     1,517.6      79.8      00:05:09
 45685       5   5,035      25,175     1,526.1      80.3      00:05:03
 46016       5   5,035      25,175     1,537.1      80.9      00:04:54
 46319       8   5,035      40,280     1,547.6      81.4      00:04:46
 46654       7   5,035      35,245     1,558.9      82.0      00:04:37
 47031       8   5,035      40,280     1,571.3      82.6      00:04:27
 47381       7   5,035      35,245     1,582.3      83.2      00:04:18
 47705      10   5,035      50,350     1,592.9      83.8      00:04:10
 47994       8   5,035      40,280     1,602.5      84.3      00:04:03
 48296       2   5,035      10,070     1,612.6      84.8      00:03:55
 48639       6   5,035      30,210     1,624.2      85.4      00:03:45
 49004       7   5,035      35,245     1,636.3      86.1      00:03:36
 49360       7   5,035      35,245     1,648.3      86.7      00:03:26
 49693       5   5,035      25,175     1,658.5      87.2      00:03:18
 50002       8   5,035      40,280     1,668.6      87.8      00:03:10
 50343      10   5,035      50,350     1,679.6      88.3      00:03:01
 50700       8   5,035      40,280     1,691.4      89.0      00:02:51
 51038       7   5,035      35,245     1,703.2      89.6      00:02:42
 51394       9   5,035      45,315     1,715.1      90.2      00:02:32
 51755       1   5,035       5,035     1,727.7      90.9      00:02:22
 52098       9   5,035      45,315     1,739.7      91.5      00:02:12
 52431      10   5,035      50,350     1,751.8      92.1      00:02:02
 52769      10   5,035      50,350     1,764.3      92.8      00:01:52
 53115      10   5,035      50,350     1,776.6      93.4      00:01:42
 53522       7   5,035      35,245     1,790.8      94.2      00:01:30
 53902       7   5,035      35,245     1,803.8      94.9      00:01:19
 54219      10   5,035      50,350     1,814.4      95.4      00:01:11
 54562       5   5,035      25,175     1,825.2      96.0      00:01:02
 54948       7   5,035      35,245     1,838.1      96.7      00:00:52
 55241      10   5,035      50,350     1,847.8      97.2      00:00:44
 55505       6   5,035      30,210     1,856.1      97.6      00:00:37
 55750       8   5,035      40,280     1,864.1      98.1      00:00:30
 56002      10   5,035      50,350     1,872.7      98.5      00:00:23
 56290       9   5,035      45,315     1,882.7      99.0      00:00:15
 56615       8   5,035      40,280     1,894.1      99.6      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1575.047
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A1000.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A1000.csv saved

. 
. cap log close

. 
end of do-file
