
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A100_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Apr 2024, 11:57:31

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   416       5   4,135      20,675         9.8       0.6      00:26:19
   884       7   4,135      28,945        21.5       1.4      00:23:56
  1302       8   4,135      33,080        32.7       2.1      00:23:25
  1698       2   4,135       8,270        43.6       2.8      00:23:15
  2117       8   4,135      33,080        54.5       3.5      00:23:04
  2560       5   4,135      20,675        66.0       4.2      00:22:41
  2994       7   4,135      28,945        77.5       5.0      00:22:22
  3360       6   4,135      24,810        87.9       5.6      00:22:24
  3780       8   4,135      33,080        99.4       6.4      00:22:06
  4160      10   4,135      41,350       109.1       7.0      00:22:13
  4551       9   4,135      37,215       119.3       7.6      00:22:13
  4909       7   4,135      28,945       129.1       8.3      00:22:14
  5280       9   4,135      37,215       138.9       8.9      00:22:14
  5642       7   4,135      28,945       148.1       9.5      00:22:19
  5979       7   4,135      28,945       157.0      10.1      00:22:24
  6385      10   4,135      41,350       167.7      10.7      00:22:12
  6797       6   4,135      24,810       178.5      11.4      00:21:60
  7215       9   4,135      37,215       189.4      12.1      00:21:47
  7655       9   4,135      37,215       201.4      12.9      00:21:26
  8073       9   4,135      37,215       213.1      13.6      00:21:08
  8436       8   4,135      33,080       223.5      14.3      00:20:60
  8854       7   4,135      28,945       235.2      15.1      00:20:43
  9226       6   4,135      24,810       245.7      15.7      00:20:34
  9514       5   4,135      20,675       253.9      16.3      00:20:38
  9843       4   4,135      16,540       263.3      16.9      00:20:35
 10168      10   4,135      41,350       271.6      17.4      00:20:37
 10482       5   4,135      20,675       280.0      17.9      00:20:38
 10851       9   4,135      37,215       289.6      18.6      00:20:32
 11227       8   4,135      33,080       299.8      19.2      00:20:23
 11552       4   4,135      16,540       308.5      19.8      00:20:21
 11896      10   4,135      41,350       317.8      20.4      00:20:15
 12255       6   4,135      24,810       327.6      21.0      00:20:07
 12719       8   4,135      33,080       340.0      21.8      00:19:47
 13205       8   4,135      33,080       352.9      22.6      00:19:26
 13625      10   4,135      41,350       364.9      23.4      00:19:09
 13974       1   4,135       4,135       374.2      24.0      00:19:04
 14395       8   4,135      33,080       386.0      24.7      00:18:49
 14802       5   4,135      20,675       397.1      25.4      00:18:36
 15248       8   4,135      33,080       409.7      26.2      00:18:18
 15742       8   4,135      33,080       423.1      27.1      00:17:58
 16205       9   4,135      37,215       436.5      28.0      00:17:38
 16628       8   4,135      33,080       448.3      28.7      00:17:25
 16970       6   4,135      24,810       457.8      29.3      00:17:18
 17313       9   4,135      37,215       467.2      29.9      00:17:12
 17640       9   4,135      37,215       476.8      30.5      00:17:05
 18033       9   4,135      37,215       487.4      31.2      00:16:55
 18447      10   4,135      41,350       498.8      31.9      00:16:43
 18925       7   4,135      28,945       512.3      32.8      00:16:25
 19387       7   4,135      28,945       525.4      33.6      00:16:08
 19815       8   4,135      33,080       537.9      34.5      00:15:53
 20210       9   4,135      37,215       549.4      35.2      00:15:41
 20550       9   4,135      37,215       558.7      35.8      00:15:35
 20799       5   4,135      20,675       565.8      36.2      00:15:34
 21053       8   4,135      33,080       572.8      36.7      00:15:33
 21431       7   4,135      28,945       582.3      37.3      00:15:26
 21809       9   4,135      37,215       592.1      37.9      00:15:18
 22177       9   4,135      37,215       601.7      38.5      00:15:11
 22555       8   4,135      33,080       611.6      39.2      00:15:02
 22929       4   4,135      16,540       621.0      39.8      00:14:55
 23314       7   4,135      28,945       631.8      40.5      00:14:44
 23752       7   4,135      28,945       643.2      41.2      00:14:32
 24191       8   4,135      33,080       654.9      41.9      00:14:19
 24661       6   4,135      24,810       667.7      42.8      00:14:05
 25132       1   4,135       4,135       680.5      43.6      00:13:50
 25577      10   4,135      41,350       692.7      44.4      00:13:37
 25926       6   4,135      24,810       702.2      45.0      00:13:29
 26283       5   4,135      20,675       712.2      45.6      00:13:20
 26716       5   4,135      20,675       723.4      46.3      00:13:09
 27139       9   4,135      37,215       735.0      47.1      00:12:57
 27515       7   4,135      28,945       745.2      47.7      00:12:48
 27919      10   4,135      41,350       756.6      48.5      00:12:36
 28322       4   4,135      16,540       767.8      49.2      00:12:25
 28702      10   4,135      41,350       778.7      49.9      00:12:15
 29022      10   4,135      41,350       787.8      50.5      00:12:08
 29422       8   4,135      33,080       798.9      51.2      00:11:57
 29819       3   4,135      12,405       809.8      51.9      00:11:46
 30129       8   4,135      33,080       818.5      52.4      00:11:40
 30456       5   4,135      20,675       827.7      53.0      00:11:32
 30819       9   4,135      37,215       838.1      53.7      00:11:23
 31235       8   4,135      33,080       849.7      54.4      00:11:11
 31655       6   4,135      24,810       861.7      55.2      00:10:59
 32047       7   4,135      28,945       873.2      55.9      00:10:47
 32436       4   4,135      16,540       884.6      56.7      00:10:36
 32727       3   4,135      12,405       892.7      57.2      00:10:30
 33054       6   4,135      24,810       902.2      57.8      00:10:22
 33440      10   4,135      41,350       913.2      58.5      00:10:11
 33818       8   4,135      33,080       924.1      59.2      00:10:01
 34096       6   4,135      24,810       932.2      59.7      00:09:55
 34430      10   4,135      41,350       941.9      60.3      00:09:46
 34889      10   4,135      41,350       955.2      61.2      00:09:32
 35364      10   4,135      41,350       968.8      62.1      00:09:17
 35832       6   4,135      24,810       982.0      62.9      00:09:04
 36290       9   4,135      37,215       995.2      63.7      00:08:50
 36693       9   4,135      37,215     1,006.6      64.5      00:08:39
 37068       7   4,135      28,945     1,016.8      65.1      00:08:30
 37440       8   4,135      33,080     1,026.5      65.7      00:08:21
 37732       5   4,135      20,675     1,034.2      66.2      00:08:15
 38027       8   4,135      33,080     1,042.4      66.8      00:08:09
 38306       8   4,135      33,080     1,050.3      67.3      00:08:03
 38607       8   4,135      33,080     1,059.0      67.8      00:07:55
 38987       7   4,135      28,945     1,069.5      68.5      00:07:45
 39256      10   4,135      41,350     1,076.8      69.0      00:07:40
 39550      10   4,135      41,350     1,084.8      69.5      00:07:33
 39876       8   4,135      33,080     1,093.7      70.1      00:07:25
 40235      10   4,135      41,350     1,103.6      70.7      00:07:16
 40621       5   4,135      20,675     1,114.3      71.4      00:07:06
 41011      10   4,135      41,350     1,125.5      72.1      00:06:55
 41287       6   4,135      24,810     1,133.1      72.6      00:06:49
 41602       9   4,135      37,215     1,141.9      73.1      00:06:41
 41953       3   4,135      12,405     1,151.9      73.8      00:06:32
 42264       5   4,135      20,675     1,160.0      74.3      00:06:25
 42591       8   4,135      33,080     1,168.9      74.9      00:06:17
 42930       9   4,135      37,215     1,178.2      75.5      00:06:08
 43288       9   4,135      37,215     1,188.6      76.1      00:05:58
 43681       9   4,135      37,215     1,199.3      76.8      00:05:48
 44044       3   4,135      12,405     1,209.3      77.5      00:05:38
 44379       9   4,135      37,215     1,218.3      78.0      00:05:30
 44787       5   4,135      20,675     1,229.5      78.7      00:05:19
 45179      10   4,135      41,350     1,240.3      79.4      00:05:09
 45533       8   4,135      33,080     1,249.5      80.0      00:05:00
 45818       7   4,135      28,945     1,256.9      80.5      00:04:54
 46130       5   4,135      20,675     1,265.5      81.1      00:04:46
 46429       8   4,135      33,080     1,273.9      81.6      00:04:38
 46769       4   4,135      16,540     1,283.4      82.2      00:04:29
 47095       4   4,135      16,540     1,292.0      82.8      00:04:21
 47435       8   4,135      33,080     1,300.9      83.3      00:04:13
 47779       4   4,135      16,540     1,310.2      83.9      00:04:04
 48116       1   4,135       4,135     1,319.4      84.5      00:03:55
 48479       8   4,135      33,080     1,329.4      85.1      00:03:45
 48849       4   4,135      16,540     1,339.6      85.8      00:03:36
 49215       7   4,135      28,945     1,349.9      86.5      00:03:26
 49716       9   4,135      37,215     1,362.7      87.3      00:03:13
 50229       7   4,135      28,945     1,376.4      88.2      00:02:59
 50551      10   4,135      41,350     1,385.0      88.7      00:02:51
 50854       7   4,135      28,945     1,393.4      89.2      00:02:43
 51142       7   4,135      28,945     1,401.6      89.8      00:02:35
 51504       7   4,135      28,945     1,411.6      90.4      00:02:26
 51894       7   4,135      28,945     1,422.9      91.1      00:02:14
 52154       9   4,135      37,215     1,430.5      91.6      00:02:07
 52460       8   4,135      33,080     1,439.5      92.2      00:01:59
 52804       9   4,135      37,215     1,450.0      92.9      00:01:48
 53182       6   4,135      24,810     1,460.9      93.6      00:01:38
 53585       6   4,135      24,810     1,472.5      94.3      00:01:26
 53915       5   4,135      20,675     1,481.7      94.9      00:01:17
 54215      10   4,135      41,350     1,490.0      95.4      00:01:10
 54508       6   4,135      24,810     1,497.7      95.9      00:01:02
 54891       9   4,135      37,215     1,508.0      96.6      00:00:52
 55262       8   4,135      33,080     1,518.1      97.2      00:00:42
 55605       9   4,135      37,215     1,526.8      97.8      00:00:34
 55879       6   4,135      24,810     1,534.5      98.3      00:00:26
 56188      10   4,135      41,350     1,543.2      98.8      00:00:18
 56507       8   4,135      33,080     1,552.5      99.4      00:00:09
 56815       5   4,135      20,675     1,561.2     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1538.936
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
