
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K12000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_12000_5_4q_mnl_A500.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K12000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_12000_5
> _4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_12000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_12000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   352       8   4,535      36,280         9.2       0.5      00:30:46
   723       7   4,535      31,745        19.3       1.1      00:29:16
  1008       8   4,535      36,280        27.3       1.6      00:30:55
  1305       4   4,535      18,140        36.1       2.1      00:30:59
  1637       7   4,535      31,745        46.1       2.7      00:30:09
  1997       7   4,535      31,745        56.3       3.3      00:29:25
  2351       7   4,535      31,745        66.6       3.9      00:28:51
  2719       8   4,535      36,280        77.3       4.5      00:28:14
  3070       9   4,535      40,815        87.5       5.1      00:27:53
  3379       6   4,535      27,210        97.2       5.7      00:27:44
  3688      10   4,535      45,350       106.4       6.2      00:27:41
  3925       7   4,535      31,745       113.2       6.6      00:28:16
  4113      10   4,535      45,350       118.5       6.9      00:29:10
  4350       2   4,535       9,070       125.0       7.3      00:29:39
  4620       9   4,535      40,815       133.2       7.8      00:29:40
  4900       7   4,535      31,745       141.5       8.3      00:29:38
  5127       8   4,535      36,280       148.0       8.7      00:29:58
  5352       6   4,535      27,210       154.8       9.0      00:30:13
  5533       6   4,535      27,210       159.7       9.3      00:30:50
  5752      10   4,535      45,350       165.9       9.7      00:31:07
  5982       3   4,535      13,605       172.5      10.1      00:31:17
  6204       7   4,535      31,745       179.1      10.5      00:31:27
  6454       9   4,535      40,815       186.2      10.9      00:31:28
  6703       7   4,535      31,745       193.2      11.3      00:31:30
  6859       7   4,535      31,745       197.8      11.6      00:31:58
  7042       7   4,535      31,745       203.0      11.9      00:32:16
  7276       7   4,535      31,745       209.6      12.3      00:32:19
  7522       1   4,535       4,535       217.0      12.7      00:32:12
  7720       4   4,535      18,140       222.9      13.0      00:32:21
  7978       4   4,535      18,140       231.0      13.5      00:32:06
  8277       6   4,535      27,210       240.2      14.0      00:31:42
  8562       3   4,535      13,605       249.2      14.6      00:31:22
  8862      10   4,535      45,350       258.4      15.1      00:30:60
  9153      10   4,535      45,350       267.5      15.6      00:30:39
  9326      10   4,535      45,350       272.8      15.9      00:30:50
  9491       9   4,535      40,815       277.9      16.2      00:31:01
  9694       4   4,535      18,140       284.5      16.6      00:31:00
  9923       4   4,535      18,140       291.3      17.0      00:30:56
 10125       3   4,535      13,605       296.8      17.3      00:31:03
 10304       6   4,535      27,210       301.8      17.6      00:31:12
 10475      10   4,535      45,350       307.0      17.9      00:31:20
 10735      10   4,535      45,350       314.4      18.4      00:31:10
 11004       5   4,535      22,675       322.5      18.8      00:30:56
 11183       7   4,535      31,745       327.7      19.1      00:31:02
 11382       8   4,535      36,280       333.5      19.5      00:31:04
 11583       7   4,535      31,745       339.4      19.8      00:31:04
 11796      10   4,535      45,350       345.8      20.2      00:31:01
 12035       7   4,535      31,745       352.9      20.6      00:30:52
 12285       6   4,535      27,210       360.3      21.1      00:30:42
 12597       8   4,535      36,280       369.5      21.6      00:30:20
 12959       6   4,535      27,210       379.8      22.2      00:29:52
 13331       7   4,535      31,745       391.0      22.8      00:29:20
 13643       8   4,535      36,280       400.9      23.4      00:28:56
 13878       7   4,535      31,745       407.9      23.8      00:28:50
 14076      10   4,535      45,350       413.6      24.2      00:28:50
 14289       9   4,535      40,815       420.2      24.6      00:28:45
 14490       7   4,535      31,745       426.4      24.9      00:28:41
 14748       7   4,535      31,745       434.0      25.4      00:28:31
 15034      10   4,535      45,350       442.9      25.9      00:28:14
 15373       9   4,535      40,815       453.3      26.5      00:27:49
 15709       9   4,535      40,815       463.3      27.1      00:27:27
 16028       7   4,535      31,745       473.4      27.7      00:27:05
 16341       9   4,535      40,815       483.2      28.2      00:26:45
 16555      10   4,535      45,350       489.8      28.6      00:26:40
 16796       4   4,535      18,140       497.0      29.0      00:26:32
 17029       4   4,535      18,140       504.2      29.5      00:26:24
 17224       8   4,535      36,280       509.9      29.8      00:26:22
 17386       6   4,535      27,210       515.0      30.1      00:26:23
 17555       8   4,535      36,280       520.5      30.4      00:26:22
 17778       9   4,535      40,815       527.1      30.8      00:26:16
 18020       9   4,535      40,815       534.4      31.2      00:26:07
 18356       7   4,535      31,745       544.7      31.8      00:25:45
 18605       7   4,535      31,745       552.0      32.3      00:25:36
 18752       9   4,535      40,815       556.7      32.5      00:25:38
 18978       6   4,535      27,210       563.8      33.0      00:25:30
 19298       6   4,535      27,210       573.8      33.5      00:25:10
 19683       8   4,535      36,280       586.0      34.2      00:24:42
 20065      10   4,535      45,350       598.3      35.0      00:24:14
 20444       7   4,535      31,745       609.8      35.6      00:23:50
 20722       7   4,535      31,745       618.4      36.1      00:23:37
 20985       5   4,535      22,675       626.5      36.6      00:23:26
 21302       6   4,535      27,210       635.1      37.1      00:23:12
 21614       5   4,535      22,675       644.3      37.7      00:22:58
 21914      10   4,535      45,350       652.9      38.2      00:22:45
 22257       4   4,535      18,140       662.4      38.7      00:22:29
 22552      10   4,535      45,350       670.9      39.2      00:22:17
 22857       9   4,535      40,815       679.4      39.7      00:22:04
 23142       5   4,535      22,675       687.9      40.2      00:21:52
 23430       6   4,535      27,210       696.5      40.7      00:21:40
 23729       7   4,535      31,745       705.0      41.2      00:21:27
 24025       5   4,535      22,675       713.9      41.7      00:21:14
 24372       8   4,535      36,280       723.5      42.3      00:20:59
 24744       9   4,535      40,815       734.9      42.9      00:20:38
 25132      10   4,535      45,350       746.6      43.6      00:20:17
 25496       9   4,535      40,815       757.6      44.3      00:19:58
 25713       8   4,535      36,280       763.9      44.6      00:19:53
 25939       6   4,535      27,210       770.8      45.0      00:19:46
 26255       7   4,535      31,745       780.5      45.6      00:19:31
 26664      10   4,535      45,350       792.2      46.3      00:19:11
 27073       6   4,535      27,210       804.4      47.0      00:18:50
 27371       6   4,535      27,210       813.3      47.5      00:18:37
 27582       8   4,535      36,280       819.8      47.9      00:18:32
 27850       6   4,535      27,210       828.0      48.4      00:18:21
 28291       6   4,535      27,210       841.6      49.2      00:17:57
 28702       9   4,535      40,815       854.5      49.9      00:17:35
 28972       6   4,535      27,210       862.9      50.4      00:17:24
 29337       6   4,535      27,210       873.9      51.1      00:17:07
 29737       6   4,535      27,210       886.1      51.8      00:16:48
 30058       6   4,535      27,210       895.9      52.4      00:16:34
 30410       9   4,535      40,815       906.8      53.0      00:16:18
 30862      10   4,535      45,350       920.9      53.8      00:15:55
 31344       7   4,535      31,745       935.6      54.7      00:15:30
 31670       9   4,535      40,815       945.9      55.3      00:15:16
 31980       8   4,535      36,280       955.9      55.9      00:15:03
 32367       7   4,535      31,745       968.4      56.6      00:14:44
 32720       7   4,535      31,745       979.4      57.2      00:14:29
 33080       7   4,535      31,745       990.8      57.9      00:14:13
 33456       7   4,535      31,745     1,002.4      58.6      00:13:56
 33809      10   4,535      45,350     1,013.7      59.2      00:13:41
 34210       7   4,535      31,745     1,026.6      60.0      00:13:22
 34674       9   4,535      40,815     1,041.1      60.8      00:13:00
 35150       8   4,535      36,280     1,056.2      61.7      00:12:38
 35629      10   4,535      45,350     1,071.3      62.6      00:12:16
 36090       7   4,535      31,745     1,085.6      63.4      00:11:56
 36543       8   4,535      36,280     1,099.7      64.3      00:11:37
 36874       8   4,535      36,280     1,109.8      64.9      00:11:24
 37231       6   4,535      27,210     1,120.1      65.5      00:11:12
 37552       9   4,535      40,815     1,129.5      66.0      00:11:01
 37864       5   4,535      22,675     1,138.7      66.5      00:10:50
 38175       7   4,535      31,745     1,148.3      67.1      00:10:39
 38468       5   4,535      22,675     1,157.5      67.6      00:10:28
 38908       7   4,535      31,745     1,171.0      68.4      00:10:10
 39226       6   4,535      27,210     1,180.4      69.0      00:09:59
 39603       9   4,535      40,815     1,191.8      69.6      00:09:45
 39998       6   4,535      27,210     1,203.6      70.3      00:09:31
 40414      10   4,535      45,350     1,216.1      71.1      00:09:15
 40843       3   4,535      13,605     1,229.4      71.8      00:08:58
 41175       7   4,535      31,745     1,239.7      72.4      00:08:46
 41556       9   4,535      40,815     1,251.4      73.1      00:08:32
 41946       1   4,535       4,535     1,263.5      73.8      00:08:17
 42327       7   4,535      31,745     1,274.3      74.5      00:08:05
 42688       9   4,535      40,815     1,285.2      75.1      00:07:52
 43036      10   4,535      45,350     1,295.9      75.7      00:07:39
 43364      10   4,535      45,350     1,306.4      76.3      00:07:27
 43647       9   4,535      40,815     1,314.6      76.8      00:07:18
 43887       8   4,535      36,280     1,322.0      77.3      00:07:11
 44112       4   4,535      18,140     1,328.6      77.6      00:07:04
 44303       8   4,535      36,280     1,334.4      78.0      00:06:59
 44621       4   4,535      18,140     1,343.8      78.5      00:06:48
 44980       6   4,535      27,210     1,354.8      79.2      00:06:36
 45296       7   4,535      31,745     1,363.7      79.7      00:06:26
 45527       3   4,535      13,605     1,370.4      80.1      00:06:19
 45856       6   4,535      27,210     1,379.8      80.6      00:06:08
 46206       6   4,535      27,210     1,390.7      81.3      00:05:56
 46555       7   4,535      31,745     1,401.4      81.9      00:05:44
 46905      10   4,535      45,350     1,412.1      82.5      00:05:31
 47260       1   4,535       4,535     1,421.8      83.1      00:05:20
 47519      10   4,535      45,350     1,429.3      83.5      00:05:12
 47706       9   4,535      40,815     1,435.0      83.9      00:05:07
 47920       6   4,535      27,210     1,441.4      84.2      00:05:00
 48135       6   4,535      27,210     1,447.8      84.6      00:04:54
 48414       5   4,535      22,675     1,456.4      85.1      00:04:44
 48787       8   4,535      36,280     1,467.6      85.8      00:04:31
 49070       5   4,535      22,675     1,476.1      86.3      00:04:22
 49372       8   4,535      36,280     1,485.1      86.8      00:04:12
 49642       8   4,535      36,280     1,492.6      87.2      00:04:04
 49890       7   4,535      31,745     1,499.8      87.7      00:03:56
 50198      10   4,535      45,350     1,509.0      88.2      00:03:46
 50476       9   4,535      40,815     1,516.9      88.7      00:03:37
 50735       7   4,535      31,745     1,524.9      89.1      00:03:28
 50939       6   4,535      27,210     1,531.4      89.5      00:03:21
 51176       7   4,535      31,745     1,538.6      89.9      00:03:13
 51467      10   4,535      45,350     1,547.5      90.4      00:03:03
 51744       6   4,535      27,210     1,556.3      91.0      00:02:54
 52076       8   4,535      36,280     1,566.8      91.6      00:02:42
 52519       7   4,535      31,745     1,581.3      92.4      00:02:25
 52940       9   4,535      40,815     1,595.1      93.2      00:02:09
 53406       7   4,535      31,745     1,609.8      94.1      00:01:52
 53770      10   4,535      45,350     1,621.1      94.7      00:01:40
 54027       9   4,535      40,815     1,628.9      95.2      00:01:31
 54307       8   4,535      36,280     1,637.4      95.7      00:01:22
 54687       2   4,535       9,070     1,648.2      96.3      00:01:10
 55072      10   4,535      45,350     1,659.6      97.0      00:00:57
 55437       7   4,535      31,745     1,670.2      97.6      00:00:45
 55788      10   4,535      45,350     1,680.6      98.2      00:00:34
 56060       5   4,535      22,675     1,689.0      98.7      00:00:24
 56402       8   4,535      36,280     1,699.8      99.3      00:00:13
 56724      10   4,535      45,350     1,709.9      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 1892.082
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_12000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
