
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A400_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   221       9   4,435      39,915         5.6       0.3      00:49:37
   458      10   4,435      44,350        11.7       0.7      00:47:26
   706       5   4,435      22,175        18.4       1.1      00:45:12
   927       9   4,435      39,915        24.4       1.5      00:45:18
  1129       9   4,435      39,915        30.2       1.8      00:45:27
  1316       8   4,435      35,480        35.7       2.1      00:46:06
  1515       3   4,435      13,305        41.6       2.5      00:45:57
  1725       7   4,435      31,045        47.6       2.8      00:45:40
  1937       9   4,435      39,915        53.4       3.2      00:45:38
  2142       3   4,435      13,305        59.3       3.5      00:45:32
  2353       8   4,435      35,480        65.2       3.9      00:45:21
  2571       3   4,435      13,305        71.3       4.3      00:45:04
  2796      10   4,435      44,350        78.0       4.7      00:44:27
  3029       7   4,435      31,045        84.4       5.0      00:44:02
  3233       8   4,435      35,480        90.7       5.4      00:43:46
  3402       9   4,435      39,915        95.7       5.7      00:44:05
  3611       8   4,435      35,480       101.7       6.1      00:43:53
  3786       7   4,435      31,045       107.0       6.4      00:44:03
  3954      10   4,435      44,350       111.5       6.7      00:44:30
  4100       6   4,435      26,610       115.5       6.9      00:45:04
  4295       8   4,435      35,480       120.8       7.2      00:45:08
  4438      10   4,435      44,350       124.8       7.5      00:45:38
  4568      10   4,435      44,350       128.6       7.7      00:46:11
  4702      10   4,435      44,350       132.7       7.9      00:46:35
  4855       6   4,435      26,610       137.0       8.2      00:46:52
  4997       8   4,435      35,480       141.1       8.4      00:47:11
  5136       7   4,435      31,045       145.0       8.7      00:47:34
  5278       6   4,435      26,610       149.1       8.9      00:47:52
  5407       7   4,435      31,045       153.1       9.1      00:48:09
  5571       4   4,435      17,740       157.2       9.4      00:48:23
  5725       2   4,435       8,870       161.3       9.6      00:48:35
  5880       7   4,435      31,045       165.7       9.9      00:48:41
  6041       7   4,435      31,045       170.5      10.2      00:48:37
  6143       4   4,435      17,740       173.4      10.4      00:49:10
  6280       4   4,435      17,740       177.2      10.6      00:49:23
  6424       8   4,435      35,480       181.2      10.8      00:49:33
  6574       7   4,435      31,045       185.5      11.1      00:49:37
  6731       6   4,435      26,610       189.7      11.3      00:49:40
  6860       9   4,435      39,915       193.5      11.6      00:49:53
  6976      10   4,435      44,350       196.7      11.8      00:50:13
  7150       9   4,435      39,915       201.4      12.0      00:50:06
  7342       4   4,435      17,740       207.0      12.4      00:49:44
  7527       8   4,435      35,480       212.4      12.7      00:49:27
  7706      10   4,435      44,350       217.6      13.0      00:49:14
  7845       7   4,435      31,045       221.7      13.3      00:49:16
  7992      10   4,435      44,350       226.3      13.5      00:49:11
  8150       8   4,435      35,480       231.2      13.8      00:49:02
  8332       8   4,435      35,480       236.7      14.1      00:48:43
  8516       4   4,435      17,740       242.3      14.5      00:48:23
  8684       6   4,435      26,610       247.2      14.8      00:48:13
  8860      10   4,435      44,350       252.6      15.1      00:47:58
  8993       6   4,435      26,610       256.7      15.3      00:47:59
  9150       7   4,435      31,045       261.5      15.6      00:47:51
  9277      10   4,435      44,350       265.4      15.9      00:47:54
  9413       9   4,435      39,915       269.4      16.1      00:47:55
  9526       8   4,435      35,480       272.9      16.3      00:48:03
  9647       7   4,435      31,045       276.7      16.5      00:48:06
  9784       5   4,435      22,175       280.9      16.8      00:48:04
  9930       6   4,435      26,610       285.1      17.0      00:48:02
 10070       3   4,435      13,305       289.0      17.3      00:48:03
 10208       9   4,435      39,915       292.6      17.5      00:48:08
 10351       6   4,435      26,610       296.6      17.7      00:48:07
 10479       5   4,435      22,175       300.4      17.9      00:48:09
 10659       7   4,435      31,045       305.4      18.2      00:47:56
 10806       8   4,435      35,480       309.5      18.5      00:47:54
 10954       5   4,435      22,175       313.9      18.8      00:47:48
 11093       9   4,435      39,915       317.8      19.0      00:47:47
 11188       7   4,435      31,045       320.6      19.2      00:47:59
 11288       7   4,435      31,045       323.3      19.3      00:48:11
 11395      10   4,435      44,350       326.6      19.5      00:48:17
 11506       5   4,435      22,175       329.8      19.7      00:48:22
 11629       6   4,435      26,610       333.3      19.9      00:48:25
 11749       7   4,435      31,045       336.7      20.1      00:48:28
 11833       8   4,435      35,480       339.3      20.3      00:48:40
 11956       9   4,435      39,915       342.7      20.5      00:48:42
 12085       5   4,435      22,175       346.7      20.7      00:48:39
 12203       8   4,435      35,480       350.1      20.9      00:48:40
 12375       6   4,435      26,610       355.0      21.2      00:48:27
 12590       7   4,435      31,045       361.2      21.6      00:48:00
 12799       3   4,435      13,305       367.0      21.9      00:47:38
 13025       7   4,435      31,045       373.5      22.3      00:47:09
 13265       9   4,435      39,915       380.4      22.7      00:46:36
 13477       7   4,435      31,045       387.0      23.1      00:46:08
 13608       7   4,435      31,045       391.1      23.4      00:46:03
 13742       5   4,435      22,175       394.9      23.6      00:46:01
 13861       3   4,435      13,305       398.3      23.8      00:46:02
 14003      10   4,435      44,350       402.3      24.0      00:45:58
 14147       9   4,435      39,915       406.6      24.3      00:45:51
 14279       6   4,435      26,610       410.6      24.5      00:45:46
 14387       5   4,435      22,175       413.9      24.7      00:45:48
 14527       8   4,435      35,480       418.1      25.0      00:45:42
 14653       8   4,435      35,480       421.7      25.2      00:45:40
 14783       5   4,435      22,175       425.6      25.4      00:45:36
 14958       8   4,435      35,480       430.8      25.7      00:45:21
 15156       9   4,435      39,915       436.9      26.1      00:44:58
 15349       7   4,435      31,045       442.6      26.4      00:44:39
 15564       6   4,435      26,610       448.8      26.8      00:44:16
 15774       8   4,435      35,480       455.1      27.2      00:43:52
 16013       6   4,435      26,610       462.5      27.6      00:43:21
 16248       5   4,435      22,175       469.7      28.1      00:42:52
 16460       8   4,435      35,480       476.3      28.5      00:42:27
 16631       6   4,435      26,610       481.1      28.7      00:42:17
 16795       8   4,435      35,480       486.0      29.0      00:42:05
 16942       7   4,435      31,045       490.4      29.3      00:41:57
 17066       6   4,435      26,610       494.1      29.5      00:41:55
 17185       9   4,435      39,915       497.5      29.7      00:41:54
 17311       6   4,435      26,610       501.4      30.0      00:41:50
 17433       7   4,435      31,045       505.1      30.2      00:41:46
 17566       6   4,435      26,610       509.4      30.4      00:41:39
 17705      10   4,435      44,350       513.4      30.7      00:41:33
 17863      10   4,435      44,350       518.0      31.0      00:41:24
 17997       3   4,435      13,305       521.9      31.2      00:41:19
 18175       8   4,435      35,480       527.4      31.5      00:41:04
 18387       5   4,435      22,175       533.5      31.9      00:40:44
 18538       5   4,435      22,175       537.8      32.1      00:40:36
 18655       9   4,435      39,915       541.5      32.4      00:40:33
 18754       8   4,435      35,480       544.5      32.5      00:40:34
 18855       5   4,435      22,175       547.5      32.7      00:40:35
 18985       6   4,435      26,610       551.6      33.0      00:40:28
 19181       9   4,435      39,915       557.6      33.3      00:40:09
 19370      10   4,435      44,350       563.3      33.7      00:39:52
 19555      10   4,435      44,350       569.1      34.0      00:39:36
 19730      10   4,435      44,350       574.6      34.3      00:39:20
 19928       9   4,435      39,915       580.7      34.7      00:39:01
 20129      10   4,435      44,350       587.0      35.1      00:38:42
 20310       6   4,435      26,610       592.3      35.4      00:38:28
 20481       7   4,435      31,045       597.5      35.7      00:38:15
 20601       9   4,435      39,915       601.2      35.9      00:38:11
 20705       9   4,435      39,915       604.3      36.1      00:38:10
 20800       5   4,435      22,175       607.1      36.3      00:38:11
 20882      10   4,435      44,350       609.7      36.4      00:38:13
 21034       5   4,435      22,175       614.1      36.7      00:38:05
 21186      10   4,435      44,350       618.2      36.9      00:37:58
 21305      10   4,435      44,350       621.2      37.1      00:37:58
 21425       9   4,435      39,915       624.7      37.3      00:37:54
 21573       8   4,435      35,480       629.0      37.6      00:37:46
 21721      10   4,435      44,350       632.9      37.8      00:37:40
 21840       7   4,435      31,045       636.4      38.0      00:37:37
 21973       9   4,435      39,915       640.1      38.3      00:37:32
 22078       5   4,435      22,175       642.9      38.4      00:37:32
 22211       9   4,435      39,915       646.6      38.6      00:37:27
 22335      10   4,435      44,350       649.9      38.8      00:37:24
 22467      10   4,435      44,350       653.7      39.1      00:37:19
 22592       9   4,435      39,915       657.3      39.3      00:37:14
 22758       8   4,435      35,480       661.7      39.5      00:37:05
 22957       4   4,435      17,740       667.2      39.9      00:36:50
 23153      10   4,435      44,350       673.1      40.2      00:36:33
 23369       5   4,435      22,175       679.4      40.6      00:36:13
 23600       9   4,435      39,915       685.7      41.0      00:35:54
 23808       5   4,435      22,175       691.9      41.3      00:35:35
 24021       5   4,435      22,175       698.0      41.7      00:35:18
 24245       8   4,435      35,480       704.3      42.1      00:34:59
 24451      10   4,435      44,350       710.0      42.4      00:34:43
 24652      10   4,435      44,350       716.1      42.8      00:34:26
 24854       8   4,435      35,480       721.9      43.1      00:34:10
 25060       6   4,435      26,610       727.9      43.5      00:33:53
 25227       6   4,435      26,610       732.9      43.8      00:33:42
 25392       6   4,435      26,610       737.7      44.1      00:33:31
 25573      10   4,435      44,350       742.9      44.4      00:33:19
 25701       5   4,435      22,175       746.6      44.6      00:33:13
 25805       8   4,435      35,480       749.9      44.8      00:33:10
 25916       8   4,435      35,480       753.2      45.0      00:33:06
 26040       8   4,435      35,480       756.8      45.2      00:33:01
 26152       8   4,435      35,480       760.1      45.4      00:32:58
 26267       8   4,435      35,480       763.6      45.6      00:32:53
 26491       6   4,435      26,610       769.8      46.0      00:32:36
 26710       4   4,435      17,740       776.0      46.4      00:32:18
 26938       9   4,435      39,915       782.9      46.8      00:31:58
 27153       3   4,435      13,305       789.1      47.2      00:31:41
 27342       6   4,435      26,610       794.6      47.5      00:31:27
 27516       9   4,435      39,915       799.8      47.8      00:31:15
 27676       5   4,435      22,175       804.5      48.1      00:31:05
 27837      10   4,435      44,350       809.4      48.4      00:30:53
 28043       9   4,435      39,915       815.5      48.7      00:30:37
 28273       8   4,435      35,480       822.4      49.1      00:30:17
 28444       8   4,435      35,480       827.7      49.5      00:30:05
 28611       6   4,435      26,610       832.9      49.8      00:29:53
 28730       7   4,435      31,045       836.5      50.0      00:29:47
 28844       7   4,435      31,045       840.0      50.2      00:29:42
 28982      10   4,435      44,350       844.1      50.4      00:29:35
 29118       8   4,435      35,480       848.3      50.7      00:29:27
 29307       3   4,435      13,305       853.7      51.0      00:29:14
 29478       7   4,435      31,045       858.9      51.3      00:29:02
 29627       8   4,435      35,480       863.1      51.6      00:28:54
 29766       5   4,435      22,175       867.4      51.8      00:28:45
 29899       7   4,435      31,045       871.3      52.1      00:28:38
 30006       7   4,435      31,045       874.6      52.3      00:28:34
 30121       8   4,435      35,480       878.0      52.5      00:28:29
 30289       5   4,435      22,175       883.1      52.8      00:28:17
 30465      10   4,435      44,350       888.6      53.1      00:28:04
 30636       8   4,435      35,480       893.7      53.4      00:27:52
 30816      10   4,435      44,350       899.2      53.7      00:27:39
 31022       7   4,435      31,045       905.1      54.1      00:27:24
 31255       7   4,435      31,045       912.3      54.5      00:27:04
 31470       9   4,435      39,915       919.0      54.9      00:26:46
 31690      10   4,435      44,350       925.7      55.3      00:26:29
 31901       8   4,435      35,480       932.3      55.7      00:26:11
 32111       5   4,435      22,175       938.8      56.1      00:25:55
 32297       8   4,435      35,480       944.7      56.5      00:25:40
 32479       6   4,435      26,610       950.5      56.8      00:25:26
 32563       7   4,435      31,045       953.0      56.9      00:25:25
 32640      10   4,435      44,350       955.3      57.1      00:25:24
 32740       7   4,435      31,045       958.4      57.3      00:25:20
 32875       6   4,435      26,610       962.5      57.5      00:25:12
 33000      10   4,435      44,350       966.4      57.8      00:25:05
 33131       5   4,435      22,175       970.5      58.0      00:24:57
 33291       8   4,435      35,480       975.3      58.3      00:24:47
 33437       7   4,435      31,045       979.7      58.5      00:24:38
 33590       5   4,435      22,175       984.6      58.8      00:24:27
 33763       9   4,435      39,915       989.9      59.2      00:24:15
 33959       6   4,435      26,610       996.0      59.5      00:24:00
 34114      10   4,435      44,350     1,000.9      59.8      00:23:50
 34261       8   4,435      35,480     1,005.4      60.1      00:23:40
 34460      10   4,435      44,350     1,011.6      60.5      00:23:25
 34667      10   4,435      44,350     1,017.9      60.8      00:23:09
 34869      10   4,435      44,350     1,024.3      61.2      00:22:54
 35101       6   4,435      26,610     1,031.3      61.6      00:22:36
 35324       4   4,435      17,740     1,038.3      62.0      00:22:18
 35563       6   4,435      26,610     1,045.6      62.5      00:21:60
 35811       8   4,435      35,480     1,053.1      62.9      00:21:41
 36026       5   4,435      22,175     1,059.6      63.3      00:21:25
 36255       7   4,435      31,045     1,066.7      63.7      00:21:07
 36491       9   4,435      39,915     1,073.9      64.2      00:20:49
 36641       8   4,435      35,480     1,078.5      64.4      00:20:40
 36782       8   4,435      35,480     1,082.5      64.7      00:20:33
 36926      10   4,435      44,350     1,086.9      65.0      00:20:24
 37071       8   4,435      35,480     1,091.0      65.2      00:20:16
 37198       8   4,435      35,480     1,094.4      65.4      00:20:11
 37326       4   4,435      17,740     1,098.0      65.6      00:20:04
 37481       4   4,435      17,740     1,102.4      65.9      00:19:55
 37626       7   4,435      31,045     1,106.7      66.1      00:19:47
 37812       8   4,435      35,480     1,112.0      66.5      00:19:35
 37996       5   4,435      22,175     1,117.5      66.8      00:19:23
 38160       6   4,435      26,610     1,122.5      67.1      00:19:12
 38354       6   4,435      26,610     1,128.4      67.4      00:18:59
 38537       6   4,435      26,610     1,134.1      67.8      00:18:46
 38766      10   4,435      44,350     1,140.9      68.2      00:18:30
 38958       9   4,435      39,915     1,146.6      68.5      00:18:17
 39089       7   4,435      31,045     1,150.5      68.8      00:18:10
 39207       9   4,435      39,915     1,153.8      69.0      00:18:05
 39335       7   4,435      31,045     1,157.7      69.2      00:17:57
 39516       8   4,435      35,480     1,162.9      69.5      00:17:46
 39678       9   4,435      39,915     1,167.6      69.8      00:17:37
 39868       8   4,435      35,480     1,173.1      70.1      00:17:24
 40085       5   4,435      22,175     1,179.5      70.5      00:17:09
 40301       7   4,435      31,045     1,185.8      70.9      00:16:55
 40511       8   4,435      35,480     1,192.3      71.2      00:16:40
 40733       9   4,435      39,915     1,198.9      71.6      00:16:25
 40930       7   4,435      31,045     1,205.1      72.0      00:16:11
 41079      10   4,435      44,350     1,209.5      72.3      00:16:02
 41237       9   4,435      39,915     1,214.2      72.6      00:15:53
 41370       6   4,435      26,610     1,218.1      72.8      00:15:45
 41536       4   4,435      17,740     1,223.1      73.1      00:15:35
 41712       6   4,435      26,610     1,228.4      73.4      00:15:23
 41876      10   4,435      44,350     1,233.5      73.7      00:15:13
 41984       4   4,435      17,740     1,236.6      73.9      00:15:07
 42144       2   4,435       8,870     1,241.0      74.2      00:14:59
 42289       6   4,435      26,610     1,245.0      74.4      00:14:51
 42442       8   4,435      35,480     1,249.8      74.7      00:14:41
 42600      10   4,435      44,350     1,254.3      75.0      00:14:32
 42753       6   4,435      26,610     1,258.8      75.2      00:14:23
 42853       9   4,435      39,915     1,261.8      75.4      00:14:18
 42973       5   4,435      22,175     1,265.4      75.6      00:14:11
 43086      10   4,435      44,350     1,269.0      75.8      00:14:04
 43187       7   4,435      31,045     1,272.2      76.0      00:13:59
 43295       6   4,435      26,610     1,275.4      76.2      00:13:53
 43398       8   4,435      35,480     1,278.6      76.4      00:13:47
 43508       8   4,435      35,480     1,281.7      76.6      00:13:42
 43730      10   4,435      44,350     1,288.1      77.0      00:13:28
 43928       5   4,435      22,175     1,294.1      77.3      00:13:14
 44117       8   4,435      35,480     1,299.4      77.7      00:13:03
 44251       7   4,435      31,045     1,303.5      77.9      00:12:55
 44412       5   4,435      22,175     1,307.9      78.2      00:12:46
 44594      10   4,435      44,350     1,313.5      78.5      00:12:34
 44774       5   4,435      22,175     1,318.7      78.8      00:12:22
 44939      10   4,435      44,350     1,323.7      79.1      00:12:12
 45139       4   4,435      17,740     1,329.4      79.4      00:11:59
 45357       9   4,435      39,915     1,335.3      79.8      00:11:46
 45540       9   4,435      39,915     1,340.6      80.1      00:11:35
 45726      10   4,435      44,350     1,345.7      80.4      00:11:24
 45876       8   4,435      35,480     1,349.9      80.7      00:11:16
 46025       9   4,435      39,915     1,354.5      80.9      00:11:06
 46172       9   4,435      39,915     1,358.9      81.2      00:10:57
 46303       9   4,435      39,915     1,363.0      81.5      00:10:49
 46440      10   4,435      44,350     1,366.9      81.7      00:10:41
 46542      10   4,435      44,350     1,370.1      81.9      00:10:36
 46686       6   4,435      26,610     1,374.3      82.1      00:10:27
 46859       8   4,435      35,480     1,379.6      82.4      00:10:16
 47012       7   4,435      31,045     1,383.7      82.7      00:10:07
 47166       5   4,435      22,175     1,387.8      82.9      00:09:59
 47297       8   4,435      35,480     1,391.6      83.2      00:09:51
 47436      10   4,435      44,350     1,395.5      83.4      00:09:44
 47573       7   4,435      31,045     1,399.4      83.6      00:09:36
 47688       2   4,435       8,870     1,402.9      83.8      00:09:29
 47823       8   4,435      35,480     1,406.7      84.1      00:09:21
 47945       6   4,435      26,610     1,410.4      84.3      00:09:14
 48059       7   4,435      31,045     1,413.8      84.5      00:09:07
 48223       8   4,435      35,480     1,418.5      84.8      00:08:58
 48405       5   4,435      22,175     1,424.0      85.1      00:08:46
 48547       5   4,435      22,175     1,428.2      85.3      00:08:37
 48691       8   4,435      35,480     1,432.5      85.6      00:08:28
 48826      10   4,435      44,350     1,436.3      85.8      00:08:20
 48923       7   4,435      31,045     1,439.3      86.0      00:08:15
 49031       7   4,435      31,045     1,442.4      86.2      00:08:09
 49179      10   4,435      44,350     1,447.1      86.5      00:07:59
 49311       5   4,435      22,175     1,450.7      86.7      00:07:51
 49471       6   4,435      26,610     1,455.1      87.0      00:07:42
 49572       3   4,435      13,305     1,457.9      87.1      00:07:37
 49687      10   4,435      44,350     1,461.0      87.3      00:07:31
 49813      10   4,435      44,350     1,464.6      87.5      00:07:24
 49899       7   4,435      31,045     1,467.0      87.7      00:07:19
 49994       4   4,435      17,740     1,469.8      87.8      00:07:14
 50100       7   4,435      31,045     1,473.0      88.0      00:07:07
 50236       7   4,435      31,045     1,476.8      88.3      00:06:60
 50375      10   4,435      44,350     1,480.5      88.5      00:06:52
 50501      10   4,435      44,350     1,484.3      88.7      00:06:44
 50617       5   4,435      22,175     1,487.7      88.9      00:06:37
 50734       8   4,435      35,480     1,491.3      89.1      00:06:30
 50853      10   4,435      44,350     1,494.9      89.3      00:06:22
 50944       9   4,435      39,915     1,497.8      89.5      00:06:17
 51038       4   4,435      17,740     1,500.7      89.7      00:06:11
 51198       6   4,435      26,610     1,505.3      90.0      00:06:01
 51336       7   4,435      31,045     1,509.4      90.2      00:05:52
 51518       8   4,435      35,480     1,515.0      90.5      00:05:40
 51700      10   4,435      44,350     1,520.7      90.9      00:05:28
 51897      10   4,435      44,350     1,526.7      91.2      00:05:15
 52090       6   4,435      26,610     1,532.7      91.6      00:05:01
 52251       9   4,435      39,915     1,537.8      91.9      00:04:50
 52449       7   4,435      31,045     1,544.2      92.3      00:04:36
 52583      10   4,435      44,350     1,548.5      92.5      00:04:27
 52763       9   4,435      39,915     1,554.4      92.9      00:04:14
 52943       5   4,435      22,175     1,560.0      93.2      00:04:02
 53143       7   4,435      31,045     1,566.2      93.6      00:03:49
 53340       7   4,435      31,045     1,572.2      94.0      00:03:36
 53527       6   4,435      26,610     1,578.0      94.3      00:03:23
 53703       7   4,435      31,045     1,583.3      94.6      00:03:12
 53825       4   4,435      17,740     1,587.0      94.8      00:03:04
 53927       4   4,435      17,740     1,589.9      95.0      00:02:58
 54018       9   4,435      39,915     1,592.7      95.2      00:02:53
 54119       8   4,435      35,480     1,595.7      95.4      00:02:46
 54240      10   4,435      44,350     1,599.2      95.6      00:02:39
 54376       7   4,435      31,045     1,603.1      95.8      00:02:31
 54531      10   4,435      44,350     1,607.2      96.0      00:02:22
 54692       8   4,435      35,480     1,612.0      96.3      00:02:11
 54852       6   4,435      26,610     1,616.6      96.6      00:02:02
 55004      10   4,435      44,350     1,621.0      96.9      00:01:52
 55127       6   4,435      26,610     1,624.7      97.1      00:01:45
 55265      10   4,435      44,350     1,628.6      97.3      00:01:36
 55404       5   4,435      22,175     1,632.4      97.5      00:01:28
 55546       6   4,435      26,610     1,636.2      97.8      00:01:20
 55675       7   4,435      31,045     1,640.2      98.0      00:01:11
 55773       8   4,435      35,480     1,643.0      98.2      00:01:05
 55898       6   4,435      26,610     1,646.9      98.4      00:00:57
 56026      10   4,435      44,350     1,650.7      98.6      00:00:49
 56160       7   4,435      31,045     1,654.8      98.9      00:00:40
 56264       4   4,435      17,740     1,658.0      99.1      00:00:33
 56417       7   4,435      31,045     1,662.8      99.4      00:00:23
 56576       9   4,435      39,915     1,667.6      99.7      00:00:13
 56689      10   4,435      44,350     1,671.1      99.9      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 3624.636
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
