
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A700_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   430      10   4,735      47,350        11.7       0.7      00:25:27
   926       7   4,735      33,145        25.8       1.4      00:22:48
  1394      10   4,735      47,350        40.4       2.3      00:21:41
  1872       6   4,735      28,410        55.0       3.1      00:21:03
  2369       6   4,735      28,410        69.9       3.9      00:20:31
  2843       7   4,735      33,145        84.5       4.7      00:20:11
  3292       6   4,735      28,410        98.5       5.5      00:20:02
  3727       9   4,735      42,615       112.1       6.3      00:19:58
  4082       9   4,735      42,615       122.7       6.9      00:20:24
  4379       8   4,735      37,880       131.2       7.3      00:21:05
  4672       3   4,735      14,205       140.5       7.9      00:21:32
  4975       6   4,735      28,410       149.8       8.4      00:21:54
  5272      10   4,735      47,350       158.8       8.9      00:22:16
  5577       9   4,735      42,615       167.8       9.4      00:22:34
  5904      10   4,735      47,350       177.4       9.9      00:22:44
  6273       9   4,735      42,615       188.8      10.6      00:22:37
  6600       6   4,735      28,410       198.5      11.1      00:22:43
  6889       7   4,735      33,145       207.2      11.6      00:22:55
  7223      10   4,735      47,350       217.1      12.1      00:22:57
  7573       5   4,735      23,675       228.0      12.8      00:22:50
  7923       8   4,735      37,880       239.1      13.4      00:22:42
  8276       9   4,735      42,615       250.6      14.0      00:22:32
  8616       4   4,735      18,940       261.7      14.6      00:22:24
  8943      10   4,735      47,350       272.2      15.2      00:22:18
  9237       5   4,735      23,675       281.7      15.8      00:22:19
  9446       6   4,735      28,410       288.5      16.1      00:22:34
  9726       8   4,735      37,880       297.8      16.7      00:22:33
 10010       9   4,735      42,615       306.5      17.1      00:22:35
 10303       3   4,735      14,205       314.9      17.6      00:22:39
 10626       5   4,735      23,675       324.7      18.2      00:22:34
 10935      10   4,735      47,350       334.3      18.7      00:22:30
 11232       7   4,735      33,145       343.4      19.2      00:22:28
 11471       6   4,735      28,410       350.8      19.6      00:22:34
 11737       6   4,735      28,410       358.9      20.1      00:22:36
 12016       6   4,735      28,410       367.6      20.6      00:22:35
 12310       4   4,735      18,940       376.8      21.1      00:22:31
 12723       7   4,735      33,145       389.5      21.8      00:22:11
 13115       8   4,735      37,880       401.3      22.4      00:21:55
 13490      10   4,735      47,350       413.3      23.1      00:21:39
 13771      10   4,735      47,350       422.3      23.6      00:21:36
 14065       9   4,735      42,615       431.2      24.1      00:21:32
 14362       6   4,735      28,410       440.8      24.7      00:21:26
 14710       5   4,735      23,675       451.8      25.3      00:21:14
 15071      10   4,735      47,350       463.4      25.9      00:20:60
 15466       9   4,735      42,615       475.9      26.6      00:20:43
 15862       8   4,735      37,880       488.5      27.3      00:20:26
 16249      10   4,735      47,350       501.2      28.0      00:20:09
 16594       3   4,735      14,205       512.4      28.7      00:19:57
 16859       8   4,735      37,880       520.7      29.1      00:19:55
 17144       9   4,735      42,615       529.7      29.6      00:19:50
 17389      10   4,735      47,350       537.6      30.1      00:19:48
 17606      10   4,735      47,350       544.9      30.5      00:19:48
 17881       5   4,735      23,675       553.3      30.9      00:19:45
 18164      10   4,735      47,350       562.5      31.5      00:19:39
 18483       6   4,735      28,410       572.1      32.0      00:19:31
 18725       8   4,735      37,880       580.1      32.4      00:19:28
 19037       7   4,735      33,145       590.3      33.0      00:19:18
 19337       8   4,735      37,880       600.1      33.6      00:19:10
 19755      10   4,735      47,350       614.0      34.3      00:18:50
 20182       6   4,735      28,410       628.1      35.1      00:18:30
 20555       7   4,735      33,145       640.0      35.8      00:18:16
 20839      10   4,735      47,350       649.1      36.3      00:18:10
 21156       7   4,735      33,145       659.0      36.9      00:18:01
 21491       3   4,735      14,205       668.8      37.4      00:17:53
 21793      10   4,735      47,350       677.6      37.9      00:17:47
 22078       8   4,735      37,880       686.2      38.4      00:17:41
 22368      10   4,735      47,350       694.6      38.8      00:17:37
 22664       4   4,735      18,940       703.7      39.4      00:17:30
 23026       8   4,735      37,880       714.3      39.9      00:17:19
 23362      10   4,735      47,350       725.0      40.5      00:17:08
 23675       7   4,735      33,145       734.1      41.1      00:17:01
 23959       9   4,735      42,615       743.1      41.6      00:16:54
 24301       2   4,735       9,470       753.3      42.1      00:16:44
 24712       7   4,735      33,145       766.2      42.9      00:16:28
 25098       8   4,735      37,880       778.1      43.5      00:16:15
 25476       8   4,735      37,880       790.1      44.2      00:16:02
 25795       7   4,735      33,145       800.0      44.7      00:15:53
 26127       9   4,735      42,615       810.5      45.3      00:15:42
 26532       6   4,735      28,410       822.7      46.0      00:15:28
 26907      10   4,735      47,350       834.4      46.7      00:15:16
 27202       9   4,735      42,615       843.6      47.2      00:15:08
 27503       7   4,735      33,145       853.0      47.7      00:15:00
 27839      10   4,735      47,350       863.8      48.3      00:14:50
 28266       6   4,735      28,410       877.3      49.1      00:14:33
 28667       5   4,735      23,675       890.6      49.8      00:14:18
 28945       8   4,735      37,880       899.7      50.3      00:14:11
 29259       7   4,735      33,145       909.4      50.9      00:14:02
 29597       6   4,735      28,410       920.2      51.5      00:13:51
 29913       7   4,735      33,145       930.4      52.0      00:13:42
 30214       7   4,735      33,145       940.1      52.6      00:13:33
 30585       3   4,735      14,205       952.1      53.3      00:13:20
 31032       7   4,735      33,145       966.4      54.1      00:13:03
 31455       8   4,735      37,880       980.2      54.8      00:12:48
 31882       7   4,735      33,145       994.3      55.6      00:12:32
 32330       4   4,735      18,940     1,009.3      56.4      00:12:14
 32687       7   4,735      33,145     1,021.0      57.1      00:12:02
 32999       5   4,735      23,675     1,031.3      57.7      00:11:53
 33355       5   4,735      23,675     1,043.0      58.3      00:11:41
 33733       9   4,735      42,615     1,055.4      59.0      00:11:28
 34102       7   4,735      33,145     1,067.6      59.7      00:11:16
 34523       3   4,735      14,205     1,081.7      60.5      00:11:01
 34974       9   4,735      42,615     1,096.6      61.3      00:10:44
 35427      10   4,735      47,350     1,111.5      62.2      00:10:28
 35897       6   4,735      28,410     1,126.7      63.0      00:10:11
 36374       9   4,735      42,615     1,142.4      63.9      00:09:54
 36784       9   4,735      42,615     1,155.3      64.6      00:09:41
 37141       9   4,735      42,615     1,166.6      65.3      00:09:31
 37492       8   4,735      37,880     1,177.0      65.8      00:09:21
 37803       9   4,735      42,615     1,186.5      66.4      00:09:13
 38118       8   4,735      37,880     1,196.6      66.9      00:09:04
 38434      10   4,735      47,350     1,207.0      67.5      00:08:55
 38743       7   4,735      33,145     1,217.0      68.1      00:08:46
 39051       7   4,735      33,145     1,226.8      68.6      00:08:38
 39347      10   4,735      47,350     1,236.0      69.1      00:08:30
 39737       8   4,735      37,880     1,248.0      69.8      00:08:18
 40185       9   4,735      42,615     1,262.1      70.6      00:08:04
 40634       5   4,735      23,675     1,276.5      71.4      00:07:50
 41028       5   4,735      23,675     1,289.3      72.1      00:07:37
 41348       7   4,735      33,145     1,299.5      72.7      00:07:28
 41735       5   4,735      23,675     1,311.8      73.4      00:07:16
 42113       5   4,735      23,675     1,323.8      74.0      00:07:05
 42477       7   4,735      33,145     1,335.1      74.7      00:06:54
 42835       8   4,735      37,880     1,346.1      75.3      00:06:44
 43163      10   4,735      47,350     1,357.0      75.9      00:06:34
 43498       5   4,735      23,675     1,367.8      76.5      00:06:25
 43813       6   4,735      28,410     1,377.4      77.0      00:06:16
 44119       6   4,735      28,410     1,387.2      77.6      00:06:08
 44435       6   4,735      28,410     1,396.7      78.1      00:05:59
 44783       8   4,735      37,880     1,407.8      78.7      00:05:49
 45141       6   4,735      28,410     1,419.1      79.4      00:05:38
 45504      10   4,735      47,350     1,429.9      80.0      00:05:29
 45855       7   4,735      33,145     1,440.4      80.6      00:05:19
 46206       7   4,735      33,145     1,451.6      81.2      00:05:09
 46549       6   4,735      28,410     1,462.6      81.8      00:04:59
 46960       8   4,735      37,880     1,475.7      82.5      00:04:46
 47283       4   4,735      18,940     1,485.0      83.1      00:04:38
 47621       8   4,735      37,880     1,495.3      83.6      00:04:29
 47912       7   4,735      33,145     1,504.3      84.1      00:04:21
 48253       5   4,735      23,675     1,515.1      84.7      00:04:11
 48568       4   4,735      18,940     1,525.2      85.3      00:04:02
 48886       9   4,735      42,615     1,535.1      85.9      00:03:53
 49210       9   4,735      42,615     1,545.6      86.4      00:03:43
 49531       5   4,735      23,675     1,555.1      87.0      00:03:34
 49846       7   4,735      33,145     1,564.3      87.5      00:03:26
 50153       6   4,735      28,410     1,573.9      88.0      00:03:17
 50500       7   4,735      33,145     1,584.2      88.6      00:03:08
 50820      10   4,735      47,350     1,594.6      89.2      00:02:59
 51180       8   4,735      37,880     1,606.1      89.8      00:02:48
 51553       2   4,735       9,470     1,618.0      90.5      00:02:37
 51908       7   4,735      33,145     1,629.8      91.2      00:02:26
 52274       9   4,735      42,615     1,642.2      91.8      00:02:14
 52639      10   4,735      47,350     1,654.6      92.5      00:02:03
 52997       6   4,735      28,410     1,666.7      93.2      00:01:51
 53305       3   4,735      14,205     1,677.0      93.8      00:01:42
 53720      10   4,735      47,350     1,690.6      94.6      00:01:29
 54042       8   4,735      37,880     1,700.7      95.1      00:01:20
 54373       8   4,735      37,880     1,711.2      95.7      00:01:10
 54770       6   4,735      28,410     1,723.1      96.4      00:00:60
 55146       6   4,735      28,410     1,734.8      97.0      00:00:49
 55471       5   4,735      23,675     1,744.4      97.6      00:00:40
 55755       8   4,735      37,880     1,753.2      98.1      00:00:32
 56067       5   4,735      23,675     1,763.3      98.6      00:00:23
 56421       8   4,735      37,880     1,774.9      99.3      00:00:12
 56784       8   4,735      37,880     1,786.8      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1648.726
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
