
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A200_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   210       4   4,235      16,940         5.1       0.3      00:52:07
   459       6   4,235      25,410        11.2       0.7      00:47:11
   698       2   4,235       8,470        17.3       1.1      00:45:41
   929       3   4,235      12,705        23.3       1.5      00:45:04
  1145       7   4,235      29,645        29.3       1.8      00:44:38
  1365       6   4,235      25,410        35.4       2.2      00:44:09
  1596       8   4,235      33,880        41.9       2.6      00:43:21
  1846       6   4,235      25,410        48.7       3.0      00:42:30
  2103      10   4,235      42,350        55.6       3.5      00:41:42
  2353       8   4,235      33,880        62.3       3.9      00:41:10
  2576      10   4,235      42,350        68.2       4.3      00:41:10
  2782       7   4,235      29,645        74.1       4.6      00:41:12
  3031       8   4,235      33,880        80.7       5.0      00:40:50
  3267       6   4,235      25,410        87.6       5.5      00:40:17
  3500       9   4,235      38,115        94.2       5.9      00:39:60
  3736       5   4,235      21,175       100.7       6.3      00:39:42
  3933      10   4,235      42,350       105.9       6.6      00:39:59
  4100       6   4,235      25,410       110.3       6.9      00:40:33
  4276       5   4,235      21,175       114.9       7.2      00:40:59
  4453      10   4,235      42,350       119.6       7.5      00:41:18
  4575       5   4,235      21,175       123.0       7.7      00:42:03
  4701       9   4,235      38,115       126.7       7.9      00:42:41
  4829       7   4,235      29,645       130.1       8.1      00:43:21
  4980       2   4,235       8,470       134.3       8.4      00:43:41
  5114       8   4,235      33,880       137.9       8.6      00:44:13
  5253       9   4,235      38,115       141.6       8.9      00:44:39
  5377       6   4,235      25,410       145.3       9.1      00:45:05
  5521       3   4,235      12,705       148.8       9.3      00:45:33
  5623      10   4,235      42,350       151.4       9.5      00:46:17
  5743       7   4,235      29,645       154.6       9.7      00:46:47
  5874       4   4,235      16,940       158.0       9.9      00:47:11
  6036      10   4,235      42,350       162.7      10.2      00:47:09
  6189       6   4,235      25,410       166.8      10.4      00:47:18
  6354       9   4,235      38,115       171.1      10.7      00:47:22
  6509       7   4,235      29,645       175.3      11.0      00:47:26
  6673       7   4,235      29,645       179.7      11.2      00:47:29
  6793       3   4,235      12,705       182.9      11.4      00:47:50
  6947       5   4,235      21,175       187.0      11.7      00:47:54
  7127       6   4,235      25,410       191.8      12.0      00:47:46
  7320       8   4,235      33,880       197.1      12.3      00:47:31
  7512       8   4,235      33,880       202.4      12.7      00:47:14
  7700       7   4,235      29,645       207.5      13.0      00:47:01
  7849       7   4,235      29,645       211.9      13.3      00:46:60
  8009       8   4,235      33,880       216.6      13.6      00:46:53
  8192       7   4,235      29,645       222.0      13.9      00:46:36
  8416       3   4,235      12,705       228.5      14.3      00:46:04
  8671       5   4,235      21,175       235.7      14.8      00:45:23
  8940       7   4,235      29,645       243.6      15.2      00:44:35
  9190       4   4,235      16,940       250.8      15.7      00:43:59
  9351      10   4,235      42,350       255.4      16.0      00:43:55
  9554       6   4,235      25,410       261.4      16.4      00:43:34
  9788       7   4,235      29,645       268.4      16.8      00:43:03
 10039       9   4,235      38,115       275.2      17.2      00:42:34
 10294       9   4,235      38,115       281.6      17.6      00:42:11
 10538       4   4,235      16,940       288.3      18.0      00:41:45
 10823       7   4,235      29,645       296.0      18.5      00:41:10
 11104       8   4,235      33,880       303.8      19.0      00:40:35
 11315       4   4,235      16,940       309.6      19.4      00:40:20
 11542       9   4,235      38,115       315.8      19.8      00:40:01
 11754       8   4,235      33,880       321.6      20.1      00:39:47
 11984       8   4,235      33,880       328.1      20.5      00:39:28
 12211       8   4,235      33,880       334.6      20.9      00:39:08
 12490       5   4,235      21,175       342.1      21.4      00:38:39
 12802      10   4,235      42,350       350.5      21.9      00:38:04
 13112       7   4,235      29,645       359.1      22.5      00:37:28
 13434       8   4,235      33,880       368.2      23.0      00:36:50
 13698       8   4,235      33,880       376.0      23.5      00:36:23
 13969       6   4,235      25,410       383.3      24.0      00:36:01
 14240      10   4,235      42,350       391.0      24.5      00:35:36
 14490       7   4,235      29,645       398.2      24.9      00:35:14
 14766       8   4,235      33,880       405.9      25.4      00:34:51
 15082       7   4,235      29,645       415.0      26.0      00:34:18
 15388       8   4,235      33,880       423.7      26.5      00:33:48
 15715       6   4,235      25,410       432.8      27.1      00:33:17
 16012       5   4,235      21,175       441.6      27.6      00:32:49
 16312       9   4,235      38,115       450.4      28.2      00:32:21
 16580       2   4,235       8,470       458.0      28.7      00:32:01
 16825       9   4,235      38,115       465.0      29.1      00:31:45
 17050       9   4,235      38,115       471.4      29.5      00:31:33
 17262       7   4,235      29,645       477.3      29.9      00:31:23
 17467      10   4,235      42,350       483.4      30.3      00:31:12
 17664      10   4,235      42,350       489.2      30.6      00:31:03
 17945       7   4,235      29,645       496.9      31.1      00:30:44
 18240       5   4,235      21,175       505.4      31.6      00:30:20
 18530       7   4,235      29,645       513.3      32.1      00:30:00
 18771       9   4,235      38,115       520.5      32.6      00:29:45
 18963       4   4,235      16,940       526.1      32.9      00:29:37
 19149       6   4,235      25,410       531.6      33.3      00:29:30
 19377       9   4,235      38,115       538.2      33.7      00:29:17
 19642       8   4,235      33,880       545.9      34.2      00:28:59
 19928       9   4,235      38,115       554.5      34.7      00:28:37
 20232       7   4,235      29,645       563.4      35.3      00:28:13
 20523       7   4,235      29,645       571.7      35.8      00:27:53
 20764       7   4,235      29,645       578.7      36.2      00:27:40
 20989       8   4,235      33,880       585.2      36.6      00:27:28
 21240       7   4,235      29,645       591.7      37.0      00:27:16
 21499       8   4,235      33,880       598.7      37.5      00:27:03
 21750       4   4,235      16,940       605.1      37.9      00:26:52
 21991       4   4,235      16,940       611.7      38.3      00:26:40
 22252       8   4,235      33,880       618.5      38.7      00:26:27
 22510       6   4,235      25,410       625.4      39.1      00:26:15
 22774       3   4,235      12,705       632.3      39.6      00:26:02
 23084       5   4,235      21,175       640.8      40.1      00:25:42
 23398       8   4,235      33,880       649.6      40.7      00:25:22
 23730       7   4,235      29,645       658.4      41.2      00:25:02
 24042       7   4,235      29,645       667.1      41.7      00:24:43
 24353       5   4,235      21,175       675.1      42.2      00:24:26
 24686       6   4,235      25,410       684.8      42.9      00:24:04
 25030      10   4,235      42,350       694.2      43.4      00:23:42
 25331       9   4,235      38,115       702.7      44.0      00:23:25
 25607       3   4,235      12,705       710.2      44.4      00:23:11
 25825       9   4,235      38,115       716.7      44.8      00:23:00
 26040       8   4,235      33,880       722.7      45.2      00:22:52
 26284       8   4,235      33,880       729.6      45.7      00:22:40
 26586       5   4,235      21,175       737.7      46.2      00:22:24
 26870       9   4,235      38,115       745.6      46.7      00:22:09
 27142       8   4,235      33,880       753.2      47.1      00:21:55
 27406       8   4,235      33,880       760.5      47.6      00:21:42
 27670       6   4,235      25,410       768.0      48.1      00:21:29
 27944       8   4,235      33,880       775.9      48.6      00:21:14
 28248       8   4,235      33,880       784.6      49.1      00:20:57
 28547       5   4,235      21,175       793.5      49.7      00:20:40
 28803       8   4,235      33,880       800.9      50.1      00:20:27
 29000      10   4,235      42,350       806.6      50.5      00:20:19
 29261       7   4,235      29,645       813.9      50.9      00:20:07
 29539       8   4,235      33,880       821.8      51.4      00:19:53
 29781       9   4,235      38,115       828.7      51.9      00:19:42
 29971       7   4,235      29,645       834.1      52.2      00:19:35
 30185       7   4,235      29,645       840.3      52.6      00:19:26
 30410       9   4,235      38,115       846.8      53.0      00:19:16
 30665       5   4,235      21,175       854.1      53.5      00:19:03
 30987       7   4,235      29,645       863.4      54.0      00:18:46
 31304       7   4,235      29,645       872.6      54.6      00:18:28
 31622      10   4,235      42,350       881.9      55.2      00:18:11
 31951      10   4,235      42,350       891.8      55.8      00:17:51
 32273       7   4,235      29,645       901.4      56.4      00:17:33
 32543       7   4,235      29,645       909.4      56.9      00:17:20
 32736       7   4,235      29,645       915.1      57.3      00:17:12
 32945       9   4,235      38,115       921.2      57.6      00:17:03
 33149      10   4,235      42,350       927.2      58.0      00:16:55
 33410       5   4,235      21,175       934.8      58.5      00:16:43
 33650       5   4,235      21,175       942.0      58.9      00:16:31
 33911       7   4,235      29,645       949.6      59.4      00:16:19
 34171       6   4,235      25,410       957.5      59.9      00:16:05
 34489       8   4,235      33,880       966.9      60.5      00:15:49
 34824       8   4,235      33,880       976.8      61.1      00:15:31
 35154       9   4,235      38,115       986.5      61.7      00:15:13
 35475       7   4,235      29,645       996.0      62.3      00:14:57
 35805       6   4,235      25,410     1,005.4      62.9      00:14:40
 36125       7   4,235      29,645     1,014.9      63.5      00:14:24
 36462       5   4,235      21,175     1,024.7      64.1      00:14:07
 36714       8   4,235      33,880     1,031.8      64.6      00:13:56
 36944       6   4,235      25,410     1,038.3      65.0      00:13:47
 37206       8   4,235      33,880     1,045.2      65.4      00:13:36
 37447       8   4,235      33,880     1,051.8      65.8      00:13:27
 37668       6   4,235      25,410     1,057.8      66.2      00:13:18
 37886       5   4,235      21,175     1,064.0      66.6      00:13:10
 38117      10   4,235      42,350     1,070.6      67.0      00:13:00
 38344       6   4,235      25,410     1,077.2      67.4      00:12:50
 38617      10   4,235      42,350     1,085.1      67.9      00:12:38
 38927       8   4,235      33,880     1,094.1      68.5      00:12:23
 39189       5   4,235      21,175     1,101.3      68.9      00:12:12
 39445       8   4,235      33,880     1,108.4      69.4      00:12:02
 39695       8   4,235      33,880     1,115.4      69.8      00:11:51
 39978      10   4,235      42,350     1,123.4      70.3      00:11:39
 40305       9   4,235      38,115     1,132.4      70.9      00:11:24
 40549       6   4,235      25,410     1,139.6      71.3      00:11:13
 40803       4   4,235      16,940     1,146.9      71.8      00:11:02
 41020       9   4,235      38,115     1,153.3      72.2      00:10:53
 41200       7   4,235      29,645     1,158.4      72.5      00:10:46
 41431       7   4,235      29,645     1,165.0      72.9      00:10:37
 41668       8   4,235      33,880     1,171.7      73.3      00:10:27
 41893       9   4,235      38,115     1,178.4      73.7      00:10:17
 42096       5   4,235      21,175     1,183.8      74.1      00:10:10
 42318       9   4,235      38,115     1,189.7      74.5      00:10:02
 42502       7   4,235      29,645     1,195.1      74.8      00:09:55
 42726       7   4,235      29,645     1,201.2      75.2      00:09:46
 42943       8   4,235      33,880     1,207.4      75.6      00:09:37
 43143       7   4,235      29,645     1,213.5      75.9      00:09:28
 43366       8   4,235      33,880     1,220.0      76.3      00:09:19
 43607       6   4,235      25,410     1,226.6      76.8      00:09:09
 43904       9   4,235      38,115     1,235.0      77.3      00:08:56
 44155       9   4,235      38,115     1,242.0      77.7      00:08:46
 44327       7   4,235      29,645     1,246.7      78.0      00:08:40
 44554       6   4,235      25,410     1,253.0      78.4      00:08:30
 44830       9   4,235      38,115     1,260.8      78.9      00:08:18
 45090       9   4,235      38,115     1,268.2      79.4      00:08:07
 45388       8   4,235      33,880     1,275.9      79.8      00:07:56
 45639       4   4,235      16,940     1,282.6      80.3      00:07:46
 45889       6   4,235      25,410     1,289.4      80.7      00:07:36
 46122       2   4,235       8,470     1,296.2      81.1      00:07:26
 46369       8   4,235      33,880     1,303.3      81.6      00:07:15
 46615       8   4,235      33,880     1,310.3      82.0      00:07:05
 46892      10   4,235      42,350     1,318.3      82.5      00:06:52
 47095       6   4,235      25,410     1,323.4      82.8      00:06:45
 47306       6   4,235      25,410     1,329.1      83.2      00:06:37
 47533       4   4,235      16,940     1,335.2      83.6      00:06:29
 47737       7   4,235      29,645     1,341.0      83.9      00:06:20
 47947      10   4,235      42,350     1,346.9      84.3      00:06:12
 48204       6   4,235      25,410     1,354.0      84.7      00:06:01
 48470       3   4,235      12,705     1,361.7      85.2      00:05:50
 48728      10   4,235      42,350     1,368.9      85.7      00:05:39
 48979       3   4,235      12,705     1,375.8      86.1      00:05:28
 49227       3   4,235      12,705     1,383.0      86.6      00:05:18
 49483       5   4,235      21,175     1,389.8      87.0      00:05:08
 49745      10   4,235      42,350     1,396.7      87.4      00:04:58
 50000       9   4,235      38,115     1,403.7      87.8      00:04:47
 50258       3   4,235      12,705     1,410.7      88.3      00:04:37
 50495       3   4,235      12,705     1,417.2      88.7      00:04:27
 50713       9   4,235      38,115     1,423.4      89.1      00:04:18
 50938       5   4,235      21,175     1,430.1      89.5      00:04:08
 51207       9   4,235      38,115     1,437.6      90.0      00:03:57
 51452       5   4,235      21,175     1,444.7      90.4      00:03:46
 51688       7   4,235      29,645     1,451.8      90.9      00:03:36
 51925       8   4,235      33,880     1,458.6      91.3      00:03:26
 52232       5   4,235      21,175     1,467.9      91.9      00:03:12
 52525       7   4,235      29,645     1,476.9      92.4      00:02:58
 52823      10   4,235      42,350     1,486.2      93.0      00:02:44
 53126       9   4,235      38,115     1,495.1      93.6      00:02:31
 53418      10   4,235      42,350     1,503.6      94.1      00:02:18
 53701       5   4,235      21,175     1,511.9      94.6      00:02:06
 53915       4   4,235      16,940     1,517.9      95.0      00:01:57
 54143       6   4,235      25,410     1,524.4      95.4      00:01:48
 54378       2   4,235       8,470     1,530.9      95.8      00:01:38
 54657       8   4,235      33,880     1,538.3      96.3      00:01:27
 54945       5   4,235      21,175     1,546.4      96.8      00:01:16
 55222       9   4,235      38,115     1,554.0      97.2      00:01:04
 55482       3   4,235      12,705     1,560.9      97.7      00:00:54
 55703       8   4,235      33,880     1,567.0      98.1      00:00:45
 55930       7   4,235      29,645     1,573.6      98.5      00:00:36
 56204       7   4,235      29,645     1,581.5      99.0      00:00:24
 56458       5   4,235      21,175     1,589.1      99.4      00:00:13
 56757       9   4,235      38,115     1,597.8     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 2343.662
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
