
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_logdistabove1.6_A500.dta /export/storage_covidva
> ccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_logdistabove1.6_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove1.6_A500.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6_A500.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   422      10   4,535      45,350        11.1       0.6      00:25:39
   909       5   4,535      22,675        24.4       1.4      00:23:05
  1381       8   4,535      36,280        38.4       2.2      00:21:49
  1850       8   4,535      36,280        52.2       3.1      00:21:12
  2350       5   4,535      22,675        66.6       3.9      00:20:37
  2763       9   4,535      40,815        78.7       4.6      00:20:46
  3194       8   4,535      36,280        91.5       5.3      00:20:41
  3653       7   4,535      31,745       105.3       6.2      00:20:21
  4096       6   4,535      27,210       118.0       6.9      00:20:16
  4470       8   4,535      36,280       128.6       7.5      00:20:32
  4833      10   4,535      45,350       139.4       8.1      00:20:42
  5237       4   4,535      18,140       151.3       8.8      00:20:39
  5587       7   4,535      31,745       161.2       9.4      00:20:52
  5962       7   4,535      31,745       171.9      10.0      00:20:55
  6361       6   4,535      27,210       183.4      10.7      00:20:51
  6733       8   4,535      36,280       194.1      11.3      00:20:52
  7078       6   4,535      27,210       204.1      11.9      00:20:57
  7528       5   4,535      22,675       217.2      12.7      00:20:39
  7882       5   4,535      22,675       227.9      13.3      00:20:38
  8281      10   4,535      45,350       240.4      14.0      00:20:25
  8698       6   4,535      27,210       253.3      14.8      00:20:10
  9103       4   4,535      18,140       265.8      15.5      00:19:58
  9392      10   4,535      45,350       274.8      16.1      00:20:04
  9729       6   4,535      27,210       285.5      16.7      00:20:00
 10099       2   4,535       9,070       296.2      17.3      00:19:56
 10454       8   4,535      36,280       306.4      17.9      00:19:54
 10720       9   4,535      40,815       314.1      18.4      00:20:03
 11102       5   4,535      22,675       325.2      19.0      00:19:55
 11408      10   4,535      45,350       334.4      19.5      00:19:56
 11714       6   4,535      27,210       343.3      20.1      00:19:57
 12001       8   4,535      36,280       351.8      20.6      00:19:59
 12282       6   4,535      27,210       360.2      21.1      00:20:02
 12680       7   4,535      31,745       372.0      21.7      00:19:50
 13092       7   4,535      31,745       383.9      22.4      00:19:37
 13480      10   4,535      45,350       395.9      23.1      00:19:25
 13796       9   4,535      40,815       405.4      23.7      00:19:21
 14128       3   4,535      13,605       415.2      24.3      00:19:17
 14452       9   4,535      40,815       425.2      24.9      00:19:11
 14845       6   4,535      27,210       437.0      25.5      00:18:59
 15275       6   4,535      27,210       450.3      26.3      00:18:42
 15761       9   4,535      40,815       465.0      27.2      00:18:20
 16212       7   4,535      31,745       479.1      28.0      00:18:02
 16626       7   4,535      31,745       491.8      28.7      00:17:48
 16951       9   4,535      40,815       501.8      29.3      00:17:42
 17278       6   4,535      27,210       511.6      29.9      00:17:37
 17498       8   4,535      36,280       518.8      30.3      00:17:39
 17794       6   4,535      27,210       527.5      30.8      00:17:36
 18157       5   4,535      22,675       538.8      31.5      00:17:26
 18506       9   4,535      40,815       548.9      32.1      00:17:19
 18780       1   4,535       4,535       557.6      32.6      00:17:16
 19141       8   4,535      36,280       569.0      33.3      00:17:05
 19569      10   4,535      45,350       582.3      34.0      00:16:49
 19981       6   4,535      27,210       595.4      34.8      00:16:35
 20436       7   4,535      31,745       609.6      35.6      00:16:17
 20760       8   4,535      36,280       619.6      36.2      00:16:10
 21046       7   4,535      31,745       628.3      36.7      00:16:07
 21364       8   4,535      36,280       637.1      37.2      00:16:02
 21683       4   4,535      18,140       646.2      37.8      00:15:57
 21982      10   4,535      45,350       654.8      38.3      00:15:53
 22301       7   4,535      31,745       663.7      38.8      00:15:48
 22630      10   4,535      45,350       673.3      39.3      00:15:42
 22908       7   4,535      31,745       680.8      39.8      00:15:40
 23173       8   4,535      36,280       688.9      40.3      00:15:36
 23463       6   4,535      27,210       697.3      40.7      00:15:32
 23740       9   4,535      40,815       705.4      41.2      00:15:28
 24089       7   4,535      31,745       715.7      41.8      00:15:19
 24554      10   4,535      45,350       729.2      42.6      00:15:04
 25015       9   4,535      40,815       742.9      43.4      00:14:48
 25450      10   4,535      45,350       756.1      44.2      00:14:33
 25736       9   4,535      40,815       764.7      44.7      00:14:28
 26015       6   4,535      27,210       773.1      45.2      00:14:23
 26398       9   4,535      40,815       784.5      45.8      00:14:12
 26804      10   4,535      45,350       796.4      46.5      00:13:60
 27148       5   4,535      22,675       806.8      47.1      00:13:51
 27466       5   4,535      22,675       816.2      47.7      00:13:44
 27799      10   4,535      45,350       826.4      48.3      00:13:35
 28104       8   4,535      36,280       835.8      48.8      00:13:28
 28547       5   4,535      22,675       849.7      49.7      00:13:12
 28868       3   4,535      13,605       859.6      50.2      00:13:04
 29130       9   4,535      40,815       867.7      50.7      00:12:59
 29455       6   4,535      27,210       877.6      51.3      00:12:51
 29769       6   4,535      27,210       887.0      51.8      00:12:43
 29976       8   4,535      36,280       893.3      52.2      00:12:41
 30185       7   4,535      31,745       899.9      52.6      00:12:39
 30465      10   4,535      45,350       908.6      53.1      00:12:32
 30807      10   4,535      45,350       919.2      53.7      00:12:22
 31172       7   4,535      31,745       930.3      54.4      00:12:12
 31565       8   4,535      36,280       942.6      55.1      00:11:59
 31956       8   4,535      36,280       955.1      55.8      00:11:46
 32341       6   4,535      27,210       967.5      56.5      00:11:33
 32655      10   4,535      45,350       977.3      57.1      00:11:24
 32889       7   4,535      31,745       984.6      57.5      00:11:20
 33144       6   4,535      27,210       992.7      58.0      00:11:14
 33463      10   4,535      45,350     1,002.6      58.6      00:11:05
 33759       8   4,535      36,280     1,012.1      59.1      00:10:57
 34075       9   4,535      40,815     1,022.1      59.7      00:10:48
 34434       9   4,535      40,815     1,033.5      60.4      00:10:37
 34872       9   4,535      40,815     1,047.5      61.2      00:10:22
 35318       6   4,535      27,210     1,061.5      62.0      00:10:07
 35798       5   4,535      22,675     1,076.4      62.9      00:09:51
 36202       8   4,535      36,280     1,089.1      63.6      00:09:38
 36504       5   4,535      22,675     1,098.5      64.2      00:09:30
 36687       7   4,535      31,745     1,104.1      64.5      00:09:27
 36928       6   4,535      27,210     1,111.5      65.0      00:09:22
 37184       9   4,535      40,815     1,118.7      65.4      00:09:17
 37454       8   4,535      36,280     1,126.5      65.8      00:09:11
 37725       9   4,535      40,815     1,134.5      66.3      00:09:05
 38004       6   4,535      27,210     1,142.8      66.8      00:08:58
 38256       7   4,535      31,745     1,150.7      67.2      00:08:52
 38565       8   4,535      36,280     1,160.5      67.8      00:08:43
 38947       8   4,535      36,280     1,172.2      68.5      00:08:31
 39158      10   4,535      45,350     1,178.4      68.9      00:08:27
 39419      10   4,535      45,350     1,186.1      69.3      00:08:21
 39727       3   4,535      13,605     1,195.3      69.9      00:08:13
 40057      10   4,535      45,350     1,205.3      70.4      00:08:04
 40468       7   4,535      31,745     1,217.8      71.2      00:07:51
 40899       6   4,535      27,210     1,231.1      71.9      00:07:37
 41206       7   4,535      31,745     1,240.7      72.5      00:07:28
 41557       3   4,535      13,605     1,251.4      73.1      00:07:18
 41944       7   4,535      31,745     1,263.4      73.8      00:07:06
 42301       9   4,535      40,815     1,273.5      74.4      00:06:57
 42644       5   4,535      22,675     1,283.8      75.0      00:06:47
 43005       7   4,535      31,745     1,294.9      75.7      00:06:36
 43346       9   4,535      40,815     1,305.8      76.3      00:06:26
 43708       7   4,535      31,745     1,316.5      76.9      00:06:15
 44043       9   4,535      40,815     1,326.7      77.5      00:06:06
 44346       7   4,535      31,745     1,335.6      78.1      00:05:58
 44737       6   4,535      27,210     1,347.3      78.7      00:05:46
 45099      10   4,535      45,350     1,358.3      79.4      00:05:36
 45475       5   4,535      22,675     1,369.0      80.0      00:05:25
 45855       5   4,535      22,675     1,379.8      80.6      00:05:15
 46236       8   4,535      36,280     1,391.7      81.3      00:05:04
 46646      10   4,535      45,350     1,404.1      82.1      00:04:51
 47026       4   4,535      18,140     1,415.2      82.7      00:04:41
 47345       8   4,535      36,280     1,424.4      83.2      00:04:32
 47677       6   4,535      27,210     1,434.2      83.8      00:04:23
 48026       9   4,535      40,815     1,444.6      84.4      00:04:13
 48328       6   4,535      27,210     1,453.8      85.0      00:04:05
 48719      10   4,535      45,350     1,465.6      85.6      00:03:53
 49052       7   4,535      31,745     1,475.5      86.2      00:03:44
 49378       9   4,535      40,815     1,485.3      86.8      00:03:35
 49723       8   4,535      36,280     1,495.0      87.4      00:03:26
 50085      10   4,535      45,350     1,505.8      88.0      00:03:15
 50446       6   4,535      27,210     1,516.0      88.6      00:03:06
 50809       6   4,535      27,210     1,527.2      89.2      00:02:55
 51172       7   4,535      31,745     1,538.4      89.9      00:02:44
 51520       8   4,535      36,280     1,549.2      90.5      00:02:34
 51852       3   4,535      13,605     1,559.7      91.1      00:02:24
 52176       6   4,535      27,210     1,570.2      91.8      00:02:14
 52504       9   4,535      40,815     1,580.9      92.4      00:02:04
 52850       6   4,535      27,210     1,592.3      93.1      00:01:53
 53258       4   4,535      18,140     1,605.1      93.8      00:01:41
 53704      10   4,535      45,350     1,619.1      94.6      00:01:27
 54030       7   4,535      31,745     1,629.0      95.2      00:01:18
 54384       7   4,535      31,745     1,639.5      95.8      00:01:08
 54796       6   4,535      27,210     1,651.4      96.5      00:00:57
 55056       8   4,535      36,280     1,659.2      97.0      00:00:49
 55262       7   4,535      31,745     1,665.2      97.3      00:00:44
 55559       9   4,535      40,815     1,673.5      97.8      00:00:36
 55825       6   4,535      27,210     1,681.7      98.3      00:00:28
 56164       8   4,535      36,280     1,692.2      98.9      00:00:18
 56511       8   4,535      36,280     1,703.3      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 1637.279
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6_A500.csv sa
> ved

. 
. cap log close

. 
end of do-file
