
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A300.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A300.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A300.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A300.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   392       9   4,335      39,015         9.9       0.6      00:27:43
   470       5   4,335      21,675        11.8       0.7      00:46:24
   663       6   4,335      26,010        16.8       1.0      00:48:27
  1032       9   4,335      39,015        26.8       1.6      00:40:14
  1412       9   4,335      39,015        37.6       2.3      00:35:34
  1782       5   4,335      21,675        48.1       2.9      00:33:10
  2184       5   4,335      21,675        59.1       3.6      00:31:13
  2594       4   4,335      17,340        70.3       4.3      00:29:46
  2996       6   4,335      26,010        81.5       5.0      00:28:41
  3354       9   4,335      39,015        92.2       5.6      00:27:59
  3740       7   4,335      30,345       103.2       6.3      00:27:18
  4067       7   4,335      30,345       112.1       6.9      00:27:16
  4376       3   4,335      13,005       120.2       7.3      00:27:23
  4662       3   4,335      13,005       128.5       7.9      00:27:26
  4975       5   4,335      21,675       137.3       8.4      00:27:21
  5272      10   4,335      43,350       145.6       8.9      00:27:22
  5567       8   4,335      34,680       153.5       9.4      00:27:25
  5842       6   4,335      26,010       160.9       9.8      00:27:34
  6164       8   4,335      34,680       170.0      10.4      00:27:22
  6505       7   4,335      30,345       179.4      11.0      00:27:08
  6814       1   4,335       4,335       187.8      11.5      00:27:02
  7165       9   4,335      39,015       197.3      12.1      00:26:47
  7532       6   4,335      26,010       207.8      12.7      00:26:24
  7896       7   4,335      30,345       218.3      13.3      00:26:01
  8232       7   4,335      30,345       228.3      14.0      00:25:44
  8572       8   4,335      34,680       238.5      14.6      00:25:26
  8898       6   4,335      26,010       248.1      15.2      00:25:13
  9206       9   4,335      39,015       257.2      15.7      00:25:04
  9463       9   4,335      39,015       264.8      16.2      00:25:05
  9740       5   4,335      21,675       273.3      16.7      00:24:59
  9960      10   4,335      43,350       279.5      17.1      00:25:07
 10142       5   4,335      21,675       284.2      17.4      00:25:25
 10287       8   4,335      34,680       288.0      17.6      00:25:47
 10405       6   4,335      26,010       291.4      17.8      00:26:12
 10552       7   4,335      30,345       295.6      18.1      00:26:31
 10693       9   4,335      39,015       299.5      18.3      00:26:50
 10869      10   4,335      43,350       304.4      18.6      00:27:02
 11001       7   4,335      30,345       308.2      18.8      00:27:21
 11145       8   4,335      34,680       312.1      19.1      00:27:38
 11283       4   4,335      17,340       315.9      19.3      00:27:55
 11442       7   4,335      30,345       320.6      19.6      00:28:06
 11588       9   4,335      39,015       324.5      19.8      00:28:21
 11741       9   4,335      39,015       328.8      20.1      00:28:33
 11916       6   4,335      26,010       333.9      20.4      00:28:40
 12070       9   4,335      39,015       338.4      20.7      00:28:49
 12207       5   4,335      21,675       342.3      20.9      00:29:02
 12365       8   4,335      34,680       346.7      21.2      00:29:12
 12612       6   4,335      26,010       353.7      21.6      00:29:04
 12862       6   4,335      26,010       360.5      22.0      00:28:58
 13090       8   4,335      34,680       366.9      22.4      00:28:54
 13349       8   4,335      34,680       374.3      22.9      00:28:43
 13533       6   4,335      26,010       380.0      23.2      00:28:43
 13653       9   4,335      39,015       383.5      23.4      00:28:55
 13777       5   4,335      21,675       387.0      23.7      00:29:07
 13907       6   4,335      26,010       390.6      23.9      00:29:18
 14050       6   4,335      26,010       394.6      24.1      00:29:26
 14202       7   4,335      30,345       399.1      24.4      00:29:31
 14325       5   4,335      21,675       402.8      24.6      00:29:41
 14489       7   4,335      30,345       407.6      24.9      00:29:43
 14610       6   4,335      26,010       411.0      25.1      00:29:53
 14774       9   4,335      39,015       415.7      25.4      00:29:55
 14997       6   4,335      26,010       422.2      25.8      00:29:47
 15219       8   4,335      34,680       428.9      26.2      00:29:38
 15456       7   4,335      30,345       435.6      26.6      00:29:28
 15665       6   4,335      26,010       441.6      27.0      00:29:23
 15926       9   4,335      39,015       449.4      27.5      00:29:07
 16138       9   4,335      39,015       455.9      27.9      00:28:59
 16340       7   4,335      30,345       461.9      28.2      00:28:53
 16518       5   4,335      21,675       467.2      28.6      00:28:50
 16690       7   4,335      30,345       472.1      28.9      00:28:50
 16821       6   4,335      26,010       475.8      29.1      00:28:55
 16929      10   4,335      43,350       478.9      29.3      00:29:04
 17033       6   4,335      26,010       482.1      29.5      00:29:12
 17157      10   4,335      43,350       485.5      29.7      00:29:18
 17266      10   4,335      43,350       488.7      29.9      00:29:26
 17402       6   4,335      26,010       492.8      30.1      00:29:28
 17507       9   4,335      39,015       496.2      30.3      00:29:34
 17603       6   4,335      26,010       499.0      30.5      00:29:43
 17731       4   4,335      17,340       502.6      30.7      00:29:47
 17923       9   4,335      39,015       508.0      31.1      00:29:42
 18091       8   4,335      34,680       513.0      31.4      00:29:38
 18322       8   4,335      34,680       519.8      31.8      00:29:26
 18523       8   4,335      34,680       525.3      32.1      00:29:20
 18664       9   4,335      39,015       529.5      32.4      00:29:20
 18822       8   4,335      34,680       534.1      32.7      00:29:18
 18961       7   4,335      30,345       538.5      32.9      00:29:18
 19124       9   4,335      39,015       543.3      33.2      00:29:15
 19241       6   4,335      26,010       546.8      33.4      00:29:18
 19403       6   4,335      26,010       551.6      33.7      00:29:14
 19620      10   4,335      43,350       558.1      34.1      00:29:03
 19843       5   4,335      21,675       565.0      34.5      00:28:50
 20025       7   4,335      30,345       570.7      34.9      00:28:42
 20227       7   4,335      30,345       576.6      35.3      00:28:33
 20436       7   4,335      30,345       582.7      35.6      00:28:24
 20585      10   4,335      43,350       587.1      35.9      00:28:22
 20700       3   4,335      13,005       590.5      36.1      00:28:24
 20810       5   4,335      21,675       593.7      36.3      00:28:28
 20903      10   4,335      43,350       596.6      36.5      00:28:32
 21052       9   4,335      39,015       600.8      36.7      00:28:31
 21226       7   4,335      30,345       605.3      37.0      00:28:27
 21404      10   4,335      43,350       610.0      37.3      00:28:23
 21583       6   4,335      26,010       615.1      37.6      00:28:18
 21745       8   4,335      34,680       619.3      37.9      00:28:16
 21925       9   4,335      39,015       624.4      38.2      00:28:10
 22091       7   4,335      30,345       628.7      38.4      00:28:07
 22252       8   4,335      34,680       633.1      38.7      00:28:04
 22442       5   4,335      21,675       638.2      39.0      00:27:58
 22598      10   4,335      43,350       642.6      39.3      00:27:54
 22801       3   4,335      13,005       647.8      39.6      00:27:47
 23014       7   4,335      30,345       653.9      40.0      00:27:37
 23217       6   4,335      26,010       659.8      40.3      00:27:27
 23405       4   4,335      17,340       665.1      40.7      00:27:19
 23624       2   4,335       8,670       670.8      41.0      00:27:10
 23839       8   4,335      34,680       677.2      41.4      00:26:58
 24052       9   4,335      39,015       683.2      41.8      00:26:48
 24274       8   4,335      34,680       689.1      42.1      00:26:38
 24491      10   4,335      43,350       695.2      42.5      00:26:28
 24700       8   4,335      34,680       701.3      42.9      00:26:17
 24934       8   4,335      34,680       707.7      43.3      00:26:05
 25159       9   4,335      39,015       714.4      43.7      00:25:52
 25379       5   4,335      21,675       720.7      44.1      00:25:41
 25562       6   4,335      26,010       725.8      44.4      00:25:34
 25663       5   4,335      21,675       728.7      44.5      00:25:36
 25764       6   4,335      26,010       731.8      44.7      00:25:36
 25899       4   4,335      17,340       735.7      45.0      00:25:34
 26046       6   4,335      26,010       739.9      45.2      00:25:30
 26189       5   4,335      21,675       744.0      45.5      00:25:27
 26395       6   4,335      26,010       749.8      45.8      00:25:17
 26550       4   4,335      17,340       754.2      46.1      00:25:12
 26698       4   4,335      17,340       758.2      46.4      00:25:09
 26853      10   4,335      43,350       762.7      46.6      00:25:04
 26996       8   4,335      34,680       766.9      46.9      00:25:00
 27150       9   4,335      39,015       771.3      47.2      00:24:55
 27282       8   4,335      34,680       775.0      47.4      00:24:53
 27436       7   4,335      30,345       779.3      47.6      00:24:48
 27592       8   4,335      34,680       783.9      47.9      00:24:43
 27765       9   4,335      39,015       788.9      48.2      00:24:35
 27938       8   4,335      34,680       794.1      48.5      00:24:27
 28136       8   4,335      34,680       799.9      48.9      00:24:17
 28322       8   4,335      34,680       805.3      49.2      00:24:08
 28500       9   4,335      39,015       810.8      49.6      00:23:59
 28661       9   4,335      39,015       815.5      49.9      00:23:53
 28756       7   4,335      30,345       818.4      50.0      00:23:52
 28860       7   4,335      30,345       821.5      50.2      00:23:52
 28989       8   4,335      34,680       825.3      50.5      00:23:48
 29140       8   4,335      34,680       829.7      50.7      00:23:43
 29343       6   4,335      26,010       835.6      51.1      00:23:32
 29503      10   4,335      43,350       840.3      51.4      00:23:25
 29711       9   4,335      39,015       846.2      51.7      00:23:15
 29860       5   4,335      21,675       850.6      52.0      00:23:09
 29979      10   4,335      43,350       854.0      52.2      00:23:06
 30108       6   4,335      26,010       857.8      52.4      00:23:03
 30257       6   4,335      26,010       862.2      52.7      00:22:57
 30408      10   4,335      43,350       866.7      53.0      00:22:51
 30558       8   4,335      34,680       871.2      53.3      00:22:44
 30762      10   4,335      43,350       877.3      53.6      00:22:33
 30964       9   4,335      39,015       883.2      54.0      00:22:22
 31195       8   4,335      34,680       890.0      54.4      00:22:08
 31427       7   4,335      30,345       897.0      54.8      00:21:54
 31653       7   4,335      30,345       903.6      55.2      00:21:40
 31862       9   4,335      39,015       910.1      55.6      00:21:28
 32055       9   4,335      39,015       916.0      56.0      00:21:17
 32258       7   4,335      30,345       922.2      56.4      00:21:05
 32435       6   4,335      26,010       927.8      56.7      00:20:55
 32559       9   4,335      39,015       931.4      56.9      00:20:52
 32656       5   4,335      21,675       934.2      57.1      00:20:50
 32799       9   4,335      39,015       938.6      57.4      00:20:44
 32926       6   4,335      26,010       942.4      57.6      00:20:40
 33070       9   4,335      39,015       946.7      57.9      00:20:34
 33217      10   4,335      43,350       951.1      58.1      00:20:28
 33401       6   4,335      26,010       956.6      58.5      00:20:18
 33564       6   4,335      26,010       961.6      58.8      00:20:10
 33703       8   4,335      34,680       965.8      59.0      00:20:04
 33829       6   4,335      26,010       969.6      59.3      00:19:59
 33996       9   4,335      39,015       974.6      59.6      00:19:51
 34145      10   4,335      43,350       979.3      59.9      00:19:43
 34342       8   4,335      34,680       985.3      60.2      00:19:32
 34560       3   4,335      13,005       991.7      60.6      00:19:20
 34794       4   4,335      17,340       998.9      61.1      00:19:05
 34998       6   4,335      26,010     1,005.1      61.4      00:18:53
 35225      10   4,335      43,350     1,011.9      61.9      00:18:39
 35440       5   4,335      21,675     1,018.4      62.3      00:18:27
 35658       3   4,335      13,005     1,024.8      62.7      00:18:14
 35858       6   4,335      26,010     1,030.8      63.0      00:18:03
 36087       9   4,335      39,015     1,037.6      63.4      00:17:50
 36308       8   4,335      34,680     1,044.4      63.8      00:17:37
 36537       5   4,335      21,675     1,051.0      64.3      00:17:24
 36670       8   4,335      34,680     1,054.9      64.5      00:17:19
 36812       6   4,335      26,010     1,058.9      64.7      00:17:13
 36951       9   4,335      39,015     1,063.0      65.0      00:17:07
 37082       5   4,335      21,675     1,066.8      65.2      00:17:02
 37246       8   4,335      34,680     1,071.1      65.5      00:16:56
 37390       3   4,335      13,005     1,075.1      65.7      00:16:50
 37520      10   4,335      43,350     1,078.7      65.9      00:16:45
 37685      10   4,335      43,350     1,083.3      66.2      00:16:38
 37840       5   4,335      21,675     1,087.7      66.5      00:16:31
 37982       8   4,335      34,680     1,091.8      66.8      00:16:25
 38138       9   4,335      39,015     1,096.5      67.0      00:16:17
 38287       9   4,335      39,015     1,100.9      67.3      00:16:10
 38485       9   4,335      39,015     1,107.0      67.7      00:15:59
 38726       6   4,335      26,010     1,114.1      68.1      00:15:45
 38958       9   4,335      39,015     1,120.8      68.5      00:15:31
 39112       7   4,335      30,345     1,125.3      68.8      00:15:24
 39236       2   4,335       8,670     1,128.6      69.0      00:15:20
 39372       8   4,335      34,680     1,132.5      69.2      00:15:14
 39518       9   4,335      39,015     1,136.7      69.5      00:15:08
 39673       7   4,335      30,345     1,141.1      69.8      00:15:00
 39851       8   4,335      34,680     1,146.2      70.1      00:14:51
 40083       8   4,335      34,680     1,152.9      70.5      00:14:38
 40306       7   4,335      30,345     1,159.2      70.9      00:14:26
 40522       8   4,335      34,680     1,165.7      71.3      00:14:14
 40752       7   4,335      30,345     1,172.5      71.7      00:14:01
 40957       5   4,335      21,675     1,178.7      72.1      00:13:49
 41083      10   4,335      43,350     1,182.3      72.3      00:13:44
 41220       8   4,335      34,680     1,186.4      72.5      00:13:37
 41383       5   4,335      21,675     1,191.0      72.8      00:13:29
 41537       5   4,335      21,675     1,195.6      73.1      00:13:22
 41725       9   4,335      39,015     1,201.1      73.4      00:13:12
 41890       8   4,335      34,680     1,206.1      73.7      00:13:03
 42053       2   4,335       8,670     1,210.6      74.0      00:12:55
 42214       9   4,335      39,015     1,215.0      74.3      00:12:48
 42356       9   4,335      39,015     1,219.0      74.5      00:12:42
 42482       7   4,335      30,345     1,222.8      74.8      00:12:36
 42652       9   4,335      39,015     1,227.5      75.0      00:12:28
 42795       8   4,335      34,680     1,231.6      75.3      00:12:21
 42936       9   4,335      39,015     1,235.7      75.5      00:12:14
 43045       6   4,335      26,010     1,239.1      75.8      00:12:09
 43146       6   4,335      26,010     1,242.2      75.9      00:12:05
 43281       5   4,335      21,675     1,246.2      76.2      00:11:58
 43417       6   4,335      26,010     1,250.4      76.4      00:11:51
 43667       8   4,335      34,680     1,257.2      76.9      00:11:38
 43931      10   4,335      43,350     1,265.0      77.3      00:11:22
 44144       8   4,335      34,680     1,271.0      77.7      00:11:11
 44233      10   4,335      43,350     1,273.6      77.9      00:11:08
 44389       7   4,335      30,345     1,277.8      78.1      00:11:01
 44553       5   4,335      21,675     1,282.6      78.4      00:10:52
 44705       3   4,335      13,005     1,286.9      78.7      00:10:45
 44886       9   4,335      39,015     1,292.3      79.0      00:10:35
 45088      10   4,335      43,350     1,298.1      79.4      00:10:24
 45311       9   4,335      39,015     1,303.9      79.7      00:10:13
 45437      10   4,335      43,350     1,307.5      79.9      00:10:07
 45549       5   4,335      21,675     1,310.6      80.1      00:10:03
 45673       9   4,335      39,015     1,313.8      80.3      00:09:57
 45816       9   4,335      39,015     1,317.9      80.6      00:09:51
 45951       9   4,335      39,015     1,321.7      80.8      00:09:44
 46102      10   4,335      43,350     1,326.2      81.1      00:09:36
 46236       8   4,335      34,680     1,330.3      81.3      00:09:29
 46465      10   4,335      43,350     1,336.8      81.7      00:09:17
 46707       7   4,335      30,345     1,344.0      82.2      00:09:02
 46882       9   4,335      39,015     1,349.2      82.5      00:08:53
 47010       6   4,335      26,010     1,352.4      82.7      00:08:48
 47195       7   4,335      30,345     1,357.4      83.0      00:08:39
 47331       7   4,335      30,345     1,361.2      83.2      00:08:32
 47515       6   4,335      26,010     1,366.1      83.5      00:08:23
 47686      10   4,335      43,350     1,371.2      83.8      00:08:14
 47849       7   4,335      30,345     1,375.7      84.1      00:08:06
 48020       2   4,335       8,670     1,380.7      84.4      00:07:56
 48166      10   4,335      43,350     1,384.9      84.7      00:07:49
 48269       7   4,335      30,345     1,387.9      84.9      00:07:44
 48475       4   4,335      17,340     1,393.9      85.2      00:07:33
 48716       9   4,335      39,015     1,400.9      85.6      00:07:19
 48939       9   4,335      39,015     1,407.3      86.0      00:07:07
 49110       7   4,335      30,345     1,412.2      86.3      00:06:58
 49258       7   4,335      30,345     1,416.6      86.6      00:06:50
 49427       6   4,335      26,010     1,421.2      86.9      00:06:41
 49631       4   4,335      17,340     1,426.5      87.2      00:06:32
 49795       6   4,335      26,010     1,431.0      87.5      00:06:23
 49945       7   4,335      30,345     1,435.3      87.8      00:06:15
 50104       6   4,335      26,010     1,439.9      88.0      00:06:07
 50289       7   4,335      30,345     1,444.9      88.3      00:05:58
 50469       8   4,335      34,680     1,449.8      88.6      00:05:49
 50611       9   4,335      39,015     1,454.0      88.9      00:05:41
 50734       8   4,335      34,680     1,457.7      89.1      00:05:35
 50892       5   4,335      21,675     1,462.4      89.4      00:05:26
 51032       9   4,335      39,015     1,466.8      89.7      00:05:18
 51161       6   4,335      26,010     1,470.3      89.9      00:05:12
 51293       4   4,335      17,340     1,474.1      90.1      00:05:05
 51496       6   4,335      26,010     1,480.1      90.5      00:04:53
 51772       9   4,335      39,015     1,488.6      91.0      00:04:37
 52007       8   4,335      34,680     1,495.5      91.4      00:04:23
 52213      10   4,335      43,350     1,502.0      91.8      00:04:11
 52461       7   4,335      30,345     1,509.7      92.3      00:03:56
 52682       7   4,335      30,345     1,516.9      92.7      00:03:43
 52879       8   4,335      34,680     1,522.9      93.1      00:03:31
 53140      10   4,335      43,350     1,530.8      93.6      00:03:16
 53419       7   4,335      30,345     1,539.2      94.1      00:02:60
 53688       4   4,335      17,340     1,547.2      94.6      00:02:45
 53855       7   4,335      30,345     1,552.1      94.9      00:02:36
 54025       6   4,335      26,010     1,557.0      95.2      00:02:27
 54181      10   4,335      43,350     1,561.5      95.5      00:02:18
 54336       8   4,335      34,680     1,566.0      95.7      00:02:10
 54549       7   4,335      30,345     1,571.5      96.1      00:01:60
 54699       7   4,335      30,345     1,575.9      96.3      00:01:52
 54863       5   4,335      21,675     1,580.5      96.6      00:01:43
 55054       5   4,335      21,675     1,585.9      97.0      00:01:33
 55229       5   4,335      21,675     1,590.9      97.3      00:01:24
 55422       8   4,335      34,680     1,596.1      97.6      00:01:14
 55614      10   4,335      43,350     1,601.4      97.9      00:01:04
 55800       5   4,335      21,675     1,606.8      98.2      00:00:54
 56008       7   4,335      30,345     1,613.0      98.6      00:00:42
 56241       5   4,335      21,675     1,619.9      99.0      00:00:29
 56425       8   4,335      34,680     1,625.6      99.4      00:00:19
 56600      10   4,335      43,350     1,630.8      99.7      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 3057.725
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A300.csv saved

. 
. cap log close

. 
end of do-file
