
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A900_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   220       5   4,935      24,675         6.2       0.3      00:50:01
   477       9   4,935      44,415        13.6       0.7      00:45:27
   705       5   4,935      24,675        20.4       1.1      00:45:16
   930       6   4,935      29,610        27.2       1.5      00:45:08
  1129       9   4,935      44,415        33.6       1.8      00:45:26
  1338       6   4,935      29,610        40.4       2.2      00:45:13
  1541       2   4,935       9,870        47.0       2.5      00:45:11
  1737       3   4,935      14,805        53.3       2.9      00:45:20
  1947       5   4,935      24,675        59.7       3.2      00:45:22
  2190       8   4,935      39,480        67.5       3.6      00:44:24
  2437       6   4,935      29,610        75.2       4.0      00:43:41
  2683       8   4,935      39,480        82.9       4.5      00:43:01
  2924       4   4,935      19,740        90.7       4.9      00:42:24
  3166       6   4,935      29,610        98.6       5.3      00:41:51
  3394       7   4,935      34,545       106.2       5.7      00:41:26
  3607       6   4,935      29,610       113.1       6.1      00:41:21
  3808       7   4,935      34,545       119.7       6.4      00:41:20
  4017       3   4,935      14,805       125.9       6.8      00:41:28
  4193      10   4,935      49,350       131.6       7.1      00:41:46
  4399       8   4,935      39,480       137.6       7.4      00:41:54
  4601       7   4,935      34,545       144.2       7.7      00:41:48
  4785       3   4,935      14,805       150.3       8.1      00:41:53
  4984       6   4,935      29,610       156.6       8.4      00:41:51
  5174      10   4,935      49,350       162.7       8.7      00:41:55
  5344       9   4,935      44,415       168.2       9.0      00:42:06
  5548       6   4,935      29,610       174.2       9.4      00:42:06
  5774       7   4,935      34,545       181.1       9.7      00:41:53
  5970      10   4,935      49,350       187.4      10.1      00:41:50
  6169       4   4,935      19,740       193.6      10.4      00:41:46
  6354       9   4,935      44,415       199.4      10.7      00:41:49
  6532       8   4,935      39,480       205.0      11.0      00:41:53
  6716       8   4,935      39,480       210.6      11.3      00:41:56
  6888       7   4,935      34,545       216.2      11.6      00:41:60
  7091       8   4,935      39,480       222.5      11.9      00:41:52
  7302       8   4,935      39,480       229.0      12.3      00:41:43
  7501       9   4,935      44,415       235.5      12.6      00:41:34
  7685      10   4,935      49,350       241.4      13.0      00:41:31
  7880      10   4,935      49,350       248.0      13.3      00:41:20
  8062       7   4,935      34,545       254.1      13.6      00:41:14
  8266       7   4,935      34,545       261.0      14.0      00:40:60
  8425       6   4,935      29,610       266.5      14.3      00:41:01
  8605      10   4,935      49,350       272.6      14.6      00:40:55
  8788       9   4,935      44,415       278.7      15.0      00:40:50
  8984       6   4,935      29,610       285.3      15.3      00:40:38
  9170       8   4,935      39,480       291.6      15.7      00:40:30
  9289      10   4,935      49,350       295.7      15.9      00:40:44
  9414       6   4,935      29,610       299.8      16.1      00:40:56
  9570       6   4,935      29,610       305.2      16.4      00:40:56
  9711       6   4,935      29,610       310.1      16.7      00:40:59
  9871      10   4,935      49,350       315.4      16.9      00:40:59
 10028       2   4,935       9,870       320.3      17.2      00:41:02
 10201      10   4,935      49,350       325.4      17.5      00:41:03
 10384       9   4,935      44,415       331.1      17.8      00:40:58
 10565      10   4,935      49,350       336.8      18.1      00:40:52
 10733       6   4,935      29,610       342.1      18.4      00:40:51
 10886       9   4,935      44,415       347.0      18.6      00:40:52
 11068       9   4,935      44,415       352.8      18.9      00:40:45
 11183       7   4,935      34,545       356.6      19.1      00:40:56
 11297      10   4,935      49,350       360.1      19.3      00:41:08
 11394       9   4,935      44,415       363.3      19.5      00:41:22
 11529       4   4,935      19,740       367.7      19.7      00:41:27
 11697       6   4,935      29,610       373.1      20.0      00:41:22
 11844       2   4,935       9,870       377.9      20.3      00:41:22
 12017       7   4,935      34,545       383.4      20.6      00:41:16
 12175       7   4,935      34,545       388.7      20.9      00:41:11
 12343       5   4,935      24,675       394.0      21.2      00:41:07
 12551       8   4,935      39,480       400.7      21.5      00:40:51
 12796       4   4,935      19,740       408.3      21.9      00:40:29
 13018       9   4,935      44,415       415.3      22.3      00:40:11
 13218       8   4,935      39,480       421.9      22.7      00:39:57
 13437      10   4,935      49,350       429.2      23.0      00:39:38
 13625       5   4,935      24,675       435.7      23.4      00:39:24
 13791       2   4,935       9,870       441.0      23.7      00:39:20
 13960      10   4,935      49,350       446.4      24.0      00:39:14
 14108       7   4,935      34,545       451.1      24.2      00:39:13
 14235       5   4,935      24,675       455.4      24.5      00:39:15
 14367       8   4,935      39,480       459.9      24.7      00:39:15
 14511      10   4,935      49,350       464.7      25.0      00:39:13
 14665       7   4,935      34,545       469.7      25.2      00:39:09
 14811       7   4,935      34,545       474.5      25.5      00:39:07
 14993       6   4,935      29,610       480.5      25.8      00:38:56
 15196       7   4,935      34,545       487.5      26.2      00:38:39
 15433       6   4,935      29,610       495.1      26.6      00:38:19
 15618       9   4,935      44,415       501.1      26.9      00:38:08
 15831      10   4,935      49,350       508.3      27.3      00:37:51
 16041       8   4,935      39,480       515.6      27.7      00:37:33
 16248       5   4,935      24,675       522.6      28.1      00:37:17
 16450       7   4,935      34,545       529.7      28.4      00:37:01
 16632       9   4,935      44,415       535.3      28.7      00:36:53
 16781       7   4,935      34,545       540.4      29.0      00:36:48
 16932       5   4,935      24,675       545.3      29.3      00:36:44
 17052       9   4,935      44,415       549.4      29.5      00:36:45
 17184       9   4,935      44,415       553.5      29.7      00:36:46
 17332       6   4,935      29,610       558.7      30.0      00:36:40
 17471       9   4,935      44,415       563.5      30.3      00:36:36
 17612       5   4,935      24,675       568.3      30.5      00:36:32
 17778       9   4,935      44,415       573.6      30.8      00:36:26
 17951       5   4,935      24,675       579.2      31.1      00:36:17
 18148      10   4,935      49,350       586.0      31.5      00:36:03
 18379       5   4,935      24,675       593.5      31.9      00:35:44
 18573       6   4,935      29,610       599.6      32.2      00:35:33
 18754       8   4,935      39,480       605.9      32.5      00:35:22
 18920       4   4,935      19,740       611.5      32.8      00:35:13
 19063       5   4,935      24,675       616.5      33.1      00:35:08
 19190       8   4,935      39,480       620.8      33.3      00:35:06
 19372      10   4,935      49,350       626.9      33.7      00:34:55
 19608      10   4,935      49,350       635.0      34.1      00:34:34
 19829       6   4,935      29,610       642.7      34.5      00:34:16
 20054       6   4,935      29,610       650.6      34.9      00:33:56
 20287       6   4,935      29,610       658.3      35.4      00:33:38
 20498       9   4,935      44,415       665.4      35.7      00:33:23
 20652       5   4,935      24,675       670.7      36.0      00:33:16
 20814      10   4,935      49,350       676.0      36.3      00:33:09
 20948       5   4,935      24,675       680.6      36.6      00:33:05
 21110       9   4,935      44,415       685.7      36.8      00:32:59
 21237       2   4,935       9,870       689.4      37.0      00:32:59
 21419       5   4,935      24,675       694.9      37.3      00:32:51
 21574       5   4,935      24,675       700.0      37.6      00:32:45
 21762      10   4,935      49,350       705.6      37.9      00:32:37
 21881      10   4,935      49,350       709.4      38.1      00:32:36
 22035       9   4,935      44,415       714.3      38.4      00:32:31
 22203       7   4,935      34,545       719.2      38.6      00:32:25
 22390      10   4,935      49,350       725.0      38.9      00:32:15
 22585       8   4,935      39,480       731.2      39.3      00:32:04
 22760       6   4,935      29,610       736.4      39.5      00:31:57
 22940       5   4,935      24,675       741.9      39.8      00:31:48
 23105       6   4,935      29,610       747.4      40.1      00:31:40
 23278       5   4,935      24,675       753.2      40.4      00:31:31
 23471      10   4,935      49,350       759.0      40.8      00:31:21
 23641       5   4,935      24,675       764.2      41.0      00:31:13
 23833       9   4,935      44,415       770.8      41.4      00:31:01
 24041       6   4,935      29,610       777.3      41.7      00:30:48
 24244       3   4,935      14,805       783.6      42.1      00:30:36
 24452      10   4,935      49,350       790.1      42.4      00:30:24
 24634       9   4,935      44,415       796.2      42.8      00:30:13
 24811       7   4,935      34,545       801.8      43.1      00:30:04
 24988      10   4,935      49,350       807.5      43.4      00:29:55
 25168       9   4,935      44,415       813.5      43.7      00:29:44
 25372       7   4,935      34,545       820.2      44.0      00:29:31
 25538      10   4,935      49,350       825.7      44.3      00:29:23
 25674       3   4,935      14,805       829.9      44.6      00:29:19
 25842       5   4,935      24,675       835.7      44.9      00:29:09
 26002       8   4,935      39,480       840.9      45.2      00:29:02
 26190       7   4,935      34,545       847.1      45.5      00:28:51
 26396       5   4,935      24,675       853.7      45.8      00:28:38
 26616       6   4,935      29,610       860.6      46.2      00:28:24
 26797       7   4,935      34,545       866.4      46.5      00:28:15
 26988       8   4,935      39,480       872.8      46.9      00:28:03
 27155       8   4,935      39,480       878.2      47.2      00:27:55
 27307       6   4,935      29,610       883.0      47.4      00:27:49
 27478      10   4,935      49,350       888.6      47.7      00:27:40
 27646       9   4,935      44,415       894.2      48.0      00:27:31
 27805       7   4,935      34,545       899.5      48.3      00:27:23
 28002      10   4,935      49,350       906.1      48.7      00:27:10
 28240       7   4,935      34,545       914.0      49.1      00:26:53
 28446      10   4,935      49,350       921.1      49.5      00:26:39
 28643       7   4,935      34,545       927.8      49.8      00:26:26
 28793       8   4,935      39,480       933.0      50.1      00:26:19
 28935       2   4,935       9,870       937.7      50.4      00:26:12
 29080       5   4,935      24,675       942.6      50.6      00:26:06
 29243      10   4,935      49,350       947.8      50.9      00:25:58
 29396       4   4,935      19,740       953.1      51.2      00:25:50
 29566      10   4,935      49,350       958.5      51.5      00:25:42
 29745       9   4,935      44,415       964.5      51.8      00:25:31
 29896       9   4,935      44,415       969.5      52.1      00:25:24
 30053       8   4,935      39,480       974.7      52.3      00:25:16
 30220       4   4,935      19,740       980.4      52.6      00:25:07
 30417       9   4,935      44,415       987.0      53.0      00:24:54
 30605       6   4,935      29,610       993.4      53.3      00:24:43
 30849       8   4,935      39,480     1,001.7      53.8      00:24:25
 31116       6   4,935      29,610     1,010.3      54.3      00:24:06
 31370       9   4,935      44,415     1,019.0      54.7      00:23:48
 31621       6   4,935      29,610     1,027.6      55.2      00:23:29
 31883       8   4,935      39,480     1,036.8      55.7      00:23:10
 32123       3   4,935      14,805     1,045.1      56.1      00:22:52
 32351       8   4,935      39,480     1,053.2      56.6      00:22:36
 32521      10   4,935      49,350     1,059.0      56.9      00:22:27
 32649       6   4,935      29,610     1,063.3      57.1      00:22:22
 32782       7   4,935      34,545     1,067.9      57.4      00:22:15
 32948       9   4,935      44,415     1,073.6      57.7      00:22:06
 33121       5   4,935      24,675     1,079.6      58.0      00:21:56
 33295       7   4,935      34,545     1,085.4      58.3      00:21:46
 33482       9   4,935      44,415     1,091.7      58.6      00:21:36
 33644       9   4,935      44,415     1,097.5      58.9      00:21:26
 33846      10   4,935      49,350     1,104.4      59.3      00:21:13
 34020       9   4,935      44,415     1,110.3      59.6      00:21:04
 34215       9   4,935      44,415     1,117.3      60.0      00:20:51
 34443       9   4,935      44,415     1,125.0      60.4      00:20:36
 34661       9   4,935      44,415     1,132.5      60.8      00:20:22
 34872       9   4,935      44,415     1,139.9      61.2      00:20:08
 35052       9   4,935      44,415     1,145.9      61.5      00:19:57
 35246       5   4,935      24,675     1,152.7      61.9      00:19:46
 35473      10   4,935      49,350     1,160.5      62.3      00:19:30
 35692       6   4,935      29,610     1,167.9      62.7      00:19:17
 35917       8   4,935      39,480     1,175.4      63.1      00:19:03
 36140       8   4,935      39,480     1,183.1      63.5      00:18:48
 36343       7   4,935      34,545     1,190.1      63.9      00:18:36
 36541       9   4,935      44,415     1,196.6      64.3      00:18:25
 36703       3   4,935      14,805     1,202.0      64.5      00:18:16
 36864       6   4,935      29,610     1,207.3      64.8      00:18:08
 37042      10   4,935      49,350     1,213.1      65.1      00:17:59
 37213       8   4,935      39,480     1,218.3      65.4      00:17:51
 37359       7   4,935      34,545     1,222.9      65.7      00:17:45
 37503       7   4,935      34,545     1,227.4      65.9      00:17:38
 37642       9   4,935      44,415     1,232.0      66.2      00:17:32
 37801       8   4,935      39,480     1,237.0      66.4      00:17:24
 37982       8   4,935      39,480     1,242.9      66.8      00:17:14
 38169       4   4,935      19,740     1,249.4      67.1      00:17:03
 38375       8   4,935      39,480     1,256.4      67.5      00:16:51
 38606       6   4,935      29,610     1,264.1      67.9      00:16:37
 38821       8   4,935      39,480     1,271.4      68.3      00:16:24
 39006       4   4,935      19,740     1,277.6      68.6      00:16:13
 39144       7   4,935      34,545     1,282.0      68.8      00:16:07
 39318       9   4,935      44,415     1,287.6      69.2      00:15:58
 39463       4   4,935      19,740     1,292.2      69.4      00:15:51
 39637       7   4,935      34,545     1,297.9      69.7      00:15:42
 39825       9   4,935      44,415     1,304.1      70.0      00:15:32
 40090      10   4,935      49,350     1,312.7      70.5      00:15:15
 40337       8   4,935      39,480     1,320.6      70.9      00:15:01
 40587       6   4,935      29,610     1,329.3      71.4      00:14:45
 40836       9   4,935      44,415     1,337.6      71.8      00:14:29
 41039      10   4,935      49,350     1,344.6      72.2      00:14:17
 41237       9   4,935      44,415     1,351.1      72.6      00:14:06
 41420       8   4,935      39,480     1,357.1      72.9      00:13:56
 41582       8   4,935      39,480     1,362.6      73.2      00:13:47
 41743       7   4,935      34,545     1,368.0      73.5      00:13:39
 41883       9   4,935      44,415     1,372.8      73.7      00:13:32
 42042       8   4,935      39,480     1,377.8      74.0      00:13:24
 42228       8   4,935      39,480     1,383.6      74.3      00:13:14
 42424       9   4,935      44,415     1,390.1      74.7      00:13:03
 42603       7   4,935      34,545     1,395.8      75.0      00:12:54
 42769      10   4,935      49,350     1,401.2      75.3      00:12:46
 42912      10   4,935      49,350     1,406.0      75.5      00:12:38
 43056       6   4,935      29,610     1,411.0      75.8      00:12:31
 43166       7   4,935      34,545     1,414.8      76.0      00:12:25
 43292       9   4,935      44,415     1,419.1      76.2      00:12:19
 43414       6   4,935      29,610     1,423.3      76.4      00:12:13
 43577      10   4,935      49,350     1,428.4      76.7      00:12:05
 43750       9   4,935      44,415     1,433.9      77.0      00:11:56
 43911      10   4,935      49,350     1,439.4      77.3      00:11:47
 44073       6   4,935      29,610     1,444.7      77.6      00:11:39
 44202       8   4,935      39,480     1,448.9      77.8      00:11:32
 44366       9   4,935      44,415     1,453.9      78.1      00:11:24
 44467      10   4,935      49,350     1,457.4      78.3      00:11:20
 44615       6   4,935      29,610     1,462.2      78.5      00:11:12
 44757       5   4,935      24,675     1,466.8      78.8      00:11:05
 44878       6   4,935      29,610     1,470.9      79.0      00:10:59
 45043       6   4,935      29,610     1,476.3      79.3      00:10:50
 45245      10   4,935      49,350     1,482.6      79.6      00:10:39
 45397       8   4,935      39,480     1,487.1      79.9      00:10:32
 45552       8   4,935      39,480     1,492.0      80.1      00:10:25
 45701       7   4,935      34,545     1,496.6      80.4      00:10:17
 45858       9   4,935      44,415     1,501.6      80.6      00:10:09
 45998       8   4,935      39,480     1,506.3      80.9      00:10:02
 46088       8   4,935      39,480     1,509.3      81.1      00:09:58
 46215      10   4,935      49,350     1,513.7      81.3      00:09:51
 46300       2   4,935       9,870     1,516.5      81.4      00:09:47
 46387       7   4,935      34,545     1,519.3      81.6      00:09:44
 46521       8   4,935      39,480     1,523.8      81.8      00:09:37
 46702      10   4,935      49,350     1,529.8      82.2      00:09:27
 46859       8   4,935      39,480     1,535.1      82.4      00:09:18
 46948       6   4,935      29,610     1,537.7      82.6      00:09:14
 47039       5   4,935      24,675     1,540.5      82.7      00:09:11
 47145       8   4,935      39,480     1,543.7      82.9      00:09:06
 47236       4   4,935      19,740     1,546.5      83.1      00:09:03
 47337       6   4,935      29,610     1,549.7      83.2      00:08:58
 47432       3   4,935      14,805     1,552.6      83.4      00:08:54
 47567       9   4,935      44,415     1,557.0      83.6      00:08:47
 47698       8   4,935      39,480     1,561.3      83.8      00:08:40
 47845       9   4,935      44,415     1,566.0      84.1      00:08:32
 47993       7   4,935      34,545     1,571.0      84.4      00:08:24
 48150       7   4,935      34,545     1,576.0      84.6      00:08:15
 48299       6   4,935      29,610     1,581.1      84.9      00:08:07
 48468      10   4,935      49,350     1,586.7      85.2      00:07:57
 48650       5   4,935      24,675     1,592.6      85.5      00:07:47
 48828       2   4,935       9,870     1,598.3      85.8      00:07:37
 48960       6   4,935      29,610     1,602.7      86.1      00:07:30
 49103      10   4,935      49,350     1,607.4      86.3      00:07:22
 49270       4   4,935      19,740     1,613.0      86.6      00:07:12
 49408       7   4,935      34,545     1,617.2      86.9      00:07:05
 49536       6   4,935      29,610     1,621.2      87.1      00:06:59
 49642       8   4,935      39,480     1,624.3      87.2      00:06:54
 49757       8   4,935      39,480     1,627.9      87.4      00:06:49
 49869       7   4,935      34,545     1,631.4      87.6      00:06:43
 50000       9   4,935      44,415     1,635.8      87.8      00:06:36
 50155       5   4,935      24,675     1,640.7      88.1      00:06:27
 50290       4   4,935      19,740     1,644.9      88.3      00:06:20
 50435       6   4,935      29,610     1,649.4      88.6      00:06:13
 50579       9   4,935      44,415     1,654.2      88.8      00:06:04
 50714      10   4,935      49,350     1,658.8      89.1      00:05:57
 50850       8   4,935      39,480     1,663.3      89.3      00:05:49
 50978       7   4,935      34,545     1,667.8      89.6      00:05:41
 51178       8   4,935      39,480     1,674.4      89.9      00:05:30
 51369       9   4,935      44,415     1,680.7      90.3      00:05:18
 51548       5   4,935      24,675     1,686.8      90.6      00:05:08
 51715       6   4,935      29,610     1,692.6      90.9      00:04:57
 51930       7   4,935      34,545     1,699.8      91.3      00:04:44
 52150      10   4,935      49,350     1,707.8      91.7      00:04:30
 52361       9   4,935      44,415     1,715.1      92.1      00:04:17
 52553       9   4,935      44,415     1,722.0      92.5      00:04:05
 52749       5   4,935      24,675     1,729.1      92.9      00:03:52
 52939       9   4,935      44,415     1,735.7      93.2      00:03:41
 53120      10   4,935      49,350     1,742.0      93.5      00:03:30
 53300      10   4,935      49,350     1,748.2      93.9      00:03:19
 53517       9   4,935      44,415     1,755.6      94.3      00:03:06
 53704      10   4,935      49,350     1,761.9      94.6      00:02:55
 53810       5   4,935      24,675     1,765.4      94.8      00:02:49
 53898       6   4,935      29,610     1,768.3      95.0      00:02:44
 53998       7   4,935      34,545     1,771.6      95.1      00:02:38
 54099      10   4,935      49,350     1,774.9      95.3      00:02:33
 54188       5   4,935      24,675     1,777.8      95.5      00:02:28
 54294      10   4,935      49,350     1,781.3      95.7      00:02:22
 54412       6   4,935      29,610     1,784.9      95.9      00:02:16
 54594       8   4,935      39,480     1,790.5      96.2      00:02:06
 54801       7   4,935      34,545     1,797.2      96.5      00:01:54
 54965       5   4,935      24,675     1,802.6      96.8      00:01:45
 55079       7   4,935      34,545     1,806.3      97.0      00:01:38
 55213       9   4,935      44,415     1,810.6      97.2      00:01:31
 55338       9   4,935      44,415     1,814.3      97.4      00:01:24
 55474       9   4,935      44,415     1,818.7      97.7      00:01:17
 55644       6   4,935      29,610     1,824.1      98.0      00:01:07
 55784       8   4,935      39,480     1,828.7      98.2      00:00:59
 55900       9   4,935      44,415     1,832.7      98.4      00:00:52
 56026      10   4,935      49,350     1,836.8      98.6      00:00:45
 56132      10   4,935      49,350     1,840.4      98.8      00:00:39
 56270       8   4,935      39,480     1,845.1      99.1      00:00:30
 56416       8   4,935      39,480     1,850.3      99.4      00:00:21
 56555       8   4,935      39,480     1,855.0      99.6      00:00:13
 56682       7   4,935      34,545     1,859.2      99.8      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 3324.913
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
