
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A800_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   277       8   4,835      38,680         7.7       0.4      00:39:24
   607      10   4,835      48,350        17.2       0.9      00:35:10
   907       8   4,835      38,680        26.0       1.4      00:34:43
  1193       6   4,835      29,010        34.9       1.9      00:34:14
  1468      10   4,835      48,350        43.8       2.4      00:33:58
  1718       9   4,835      43,515        51.8       2.8      00:34:19
  1958      10   4,835      48,350        59.0       3.2      00:35:01
  2196       8   4,835      38,680        66.4       3.6      00:35:25
  2443       9   4,835      43,515        73.9       4.0      00:35:38
  2672       9   4,835      43,515        80.9       4.4      00:35:59
  2910       6   4,835      29,010        88.5       4.9      00:36:02
  3162       6   4,835      29,010        96.5       5.3      00:35:54
  3403       9   4,835      43,515       104.4       5.7      00:35:47
  3673       9   4,835      43,515       113.0       6.2      00:35:25
  3920      10   4,835      48,350       120.6       6.6      00:35:25
  4127       4   4,835      19,340       126.8       6.9      00:35:48
  4361       8   4,835      38,680       133.6       7.3      00:35:57
  4571       9   4,835      43,515       140.3       7.7      00:36:05
  4767       8   4,835      38,680       146.7       8.0      00:36:18
  4986       5   4,835      24,175       153.5       8.4      00:36:22
  5191      10   4,835      48,350       159.9       8.8      00:36:31
  5408       4   4,835      19,340       166.9       9.1      00:36:31
  5582       4   4,835      19,340       171.7       9.4      00:36:60
  5772       4   4,835      19,340       177.4       9.7      00:37:14
  5982       3   4,835      14,505       183.9      10.1      00:37:15
  6215      10   4,835      48,350       191.3      10.5      00:37:05
  6427       3   4,835      14,505       197.6      10.8      00:37:09
  6664       8   4,835      38,680       204.8      11.2      00:36:60
  6890       6   4,835      29,010       211.8      11.6      00:36:53
  7163       8   4,835      38,680       220.0      12.1      00:36:33
  7438       3   4,835      14,505       228.7      12.5      00:36:08
  7703       7   4,835      33,845       237.1      13.0      00:35:47
  7961       6   4,835      29,010       245.7      13.5      00:35:25
  8199       9   4,835      43,515       253.6      13.9      00:35:10
  8457       7   4,835      33,845       262.2      14.4      00:34:50
  8734       7   4,835      33,845       271.2      14.9      00:34:26
  8988       5   4,835      24,175       279.6      15.3      00:34:09
  9213      10   4,835      48,350       287.2      15.7      00:33:60
  9357       9   4,835      43,515       291.9      16.0      00:34:13
  9511       6   4,835      29,010       297.0      16.3      00:34:22
  9696       8   4,835      38,680       303.4      16.6      00:34:21
  9885       9   4,835      43,515       309.4      17.0      00:34:22
 10071       3   4,835      14,505       315.1      17.3      00:34:25
 10272       3   4,835      14,505       320.9      17.6      00:34:27
 10483       4   4,835      19,340       327.6      18.0      00:34:21
 10719       6   4,835      29,010       334.8      18.4      00:34:11
 10948      10   4,835      48,350       342.0      18.7      00:34:02
 11167       8   4,835      38,680       348.8      19.1      00:33:56
 11352       9   4,835      43,515       354.6      19.4      00:33:56
 11531       8   4,835      38,680       360.3      19.7      00:33:57
 11744       4   4,835      19,340       366.9      20.1      00:33:51
 11926       7   4,835      33,845       372.7      20.4      00:33:50
 12139       5   4,835      24,175       379.6      20.8      00:33:42
 12373       9   4,835      43,515       386.9      21.2      00:33:31
 12671       7   4,835      33,845       396.4      21.7      00:33:06
 12974       5   4,835      24,175       405.4      22.2      00:32:44
 13267       9   4,835      43,515       414.8      22.7      00:32:22
 13544       4   4,835      19,340       424.1      23.2      00:31:60
 13722       6   4,835      29,010       429.9      23.6      00:31:58
 13916       9   4,835      43,515       435.9      23.9      00:31:55
 14152      10   4,835      48,350       443.5      24.3      00:31:44
 14385       4   4,835      19,340       451.2      24.7      00:31:31
 14627       7   4,835      33,845       459.0      25.2      00:31:19
 14865       6   4,835      29,010       466.6      25.6      00:31:07
 15158       7   4,835      33,845       476.3      26.1      00:30:44
 15453       7   4,835      33,845       485.8      26.6      00:30:23
 15755       6   4,835      29,010       495.5      27.2      00:30:01
 16036       4   4,835      19,340       505.0      27.7      00:29:41
 16318       6   4,835      29,010       514.4      28.2      00:29:21
 16588       9   4,835      43,515       523.1      28.7      00:29:05
 16790       9   4,835      43,515       529.8      29.0      00:28:59
 17011       9   4,835      43,515       536.9      29.4      00:28:50
 17228       5   4,835      24,175       543.8      29.8      00:28:43
 17431       5   4,835      24,175       550.6      30.2      00:28:36
 17646       8   4,835      38,680       558.0      30.6      00:28:26
 17909       7   4,835      33,845       566.2      31.0      00:28:13
 18195       8   4,835      38,680       575.7      31.6      00:27:54
 18500       5   4,835      24,175       585.0      32.1      00:27:36
 18692       6   4,835      29,010       591.6      32.4      00:27:30
 18901       7   4,835      33,845       598.5      32.8      00:27:23
 19131       9   4,835      43,515       606.3      33.2      00:27:11
 19359       4   4,835      19,340       613.7      33.6      00:27:02
 19635       9   4,835      43,515       623.1      34.2      00:26:44
 19918       7   4,835      33,845       632.7      34.7      00:26:26
 20240       9   4,835      43,515       643.4      35.3      00:26:04
 20513       4   4,835      19,340       652.4      35.8      00:25:49
 20719      10   4,835      48,350       659.2      36.1      00:25:41
 20905       5   4,835      24,175       665.5      36.5      00:25:36
 21136       8   4,835      38,680       672.6      36.9      00:25:28
 21325       5   4,835      24,175       677.9      37.2      00:25:26
 21514       9   4,835      43,515       684.0      37.5      00:25:21
 21720       3   4,835      14,505       690.0      37.8      00:25:16
 21909       6   4,835      29,010       695.9      38.1      00:25:12
 22077       7   4,835      33,845       700.8      38.4      00:25:10
 22231       3   4,835      14,505       705.6      38.7      00:25:10
 22408       9   4,835      43,515       710.8      39.0      00:25:08
 22586       6   4,835      29,010       716.4      39.3      00:25:04
 22823       5   4,835      24,175       723.2      39.6      00:24:56
 23042       8   4,835      38,680       730.2      40.0      00:24:47
 23251       9   4,835      43,515       737.0      40.4      00:24:39
 23519       5   4,835      24,175       744.9      40.8      00:24:27
 23764       3   4,835      14,505       752.8      41.3      00:24:15
 24010       8   4,835      38,680       760.6      41.7      00:24:04
 24298       4   4,835      19,340       769.2      42.2      00:23:50
 24570       4   4,835      19,340       778.0      42.6      00:23:36
 24835       7   4,835      33,845       786.4      43.1      00:23:22
 25097       8   4,835      38,680       794.8      43.6      00:23:09
 25346       8   4,835      38,680       802.7      44.0      00:22:58
 25573      10   4,835      48,350       809.9      44.4      00:22:49
 25749       9   4,835      43,515       815.7      44.7      00:22:43
 25924       4   4,835      19,340       821.3      45.0      00:22:39
 26112       8   4,835      38,680       827.4      45.4      00:22:32
 26357       4   4,835      19,340       835.2      45.8      00:22:21
 26598       6   4,835      29,010       842.6      46.2      00:22:11
 26856       5   4,835      24,175       850.8      46.6      00:21:59
 27090      10   4,835      48,350       858.2      47.0      00:21:49
 27268       6   4,835      29,010       863.8      47.4      00:21:44
 27438      10   4,835      48,350       869.3      47.7      00:21:39
 27667      10   4,835      48,350       876.8      48.1      00:21:29
 27900       9   4,835      43,515       884.4      48.5      00:21:18
 28191       3   4,835      14,505       893.8      49.0      00:21:02
 28474       9   4,835      43,515       903.4      49.5      00:20:46
 28695       9   4,835      43,515       910.7      49.9      00:20:37
 28905       8   4,835      38,680       917.7      50.3      00:20:28
 29081      10   4,835      48,350       923.5      50.6      00:20:22
 29358       7   4,835      33,845       932.5      51.1      00:20:08
 29625       4   4,835      19,340       940.9      51.6      00:19:55
 29819       8   4,835      38,680       947.4      51.9      00:19:47
 30000       8   4,835      38,680       953.3      52.3      00:19:41
 30183       5   4,835      24,175       959.3      52.6      00:19:35
 30403       4   4,835      19,340       966.5      53.0      00:19:25
 30668       5   4,835      24,175       975.2      53.5      00:19:12
 30935       8   4,835      38,680       984.1      53.9      00:18:58
 31198       6   4,835      29,010       992.7      54.4      00:18:45
 31463       9   4,835      43,515     1,001.6      54.9      00:18:31
 31752      10   4,835      48,350     1,011.3      55.4      00:18:16
 32041       6   4,835      29,010     1,021.2      56.0      00:17:60
 32314       9   4,835      43,515     1,030.6      56.5      00:17:45
 32541       7   4,835      33,845     1,038.2      56.9      00:17:35
 32720       7   4,835      33,845     1,044.2      57.2      00:17:28
 32902      10   4,835      48,350     1,050.2      57.6      00:17:22
 33089       7   4,835      33,845     1,056.7      57.9      00:17:14
 33288       5   4,835      24,175     1,063.2      58.3      00:17:06
 33538      10   4,835      48,350     1,071.6      58.7      00:16:54
 33783       8   4,835      38,680     1,079.9      59.2      00:16:42
 34035       9   4,835      43,515     1,088.3      59.7      00:16:30
 34305       8   4,835      38,680     1,097.7      60.2      00:16:15
 34629       6   4,835      29,010     1,108.4      60.8      00:15:58
 34938       9   4,835      43,515     1,119.0      61.3      00:15:41
 35241      10   4,835      48,350     1,129.2      61.9      00:15:26
 35550       6   4,835      29,010     1,139.4      62.5      00:15:10
 35833       6   4,835      29,010     1,148.8      63.0      00:14:56
 36134       9   4,835      43,515     1,159.0      63.5      00:14:40
 36445       6   4,835      29,010     1,169.3      64.1      00:14:25
 36636      10   4,835      48,350     1,175.6      64.4      00:14:17
 36845      10   4,835      48,350     1,182.2      64.8      00:14:09
 37085       8   4,835      38,680     1,189.9      65.2      00:13:59
 37306       9   4,835      43,515     1,196.4      65.6      00:13:51
 37517      10   4,835      48,350     1,203.0      65.9      00:13:43
 37711       8   4,835      38,680     1,209.0      66.3      00:13:36
 37912       5   4,835      24,175     1,215.6      66.6      00:13:28
 38097       9   4,835      43,515     1,221.6      67.0      00:13:21
 38310      10   4,835      48,350     1,228.7      67.3      00:13:12
 38570       5   4,835      24,175     1,237.5      67.8      00:12:60
 38837      10   4,835      48,350     1,246.1      68.3      00:12:47
 39054       8   4,835      38,680     1,253.2      68.7      00:12:38
 39240       9   4,835      43,515     1,258.9      69.0      00:12:32
 39486       8   4,835      38,680     1,266.8      69.4      00:12:21
 39751       9   4,835      43,515     1,275.2      69.9      00:12:10
 40049       7   4,835      33,845     1,284.8      70.4      00:11:56
 40317       7   4,835      33,845     1,293.3      70.9      00:11:44
 40639       6   4,835      29,010     1,304.0      71.5      00:11:28
 40924       8   4,835      38,680     1,313.5      72.0      00:11:14
 41085       7   4,835      33,845     1,318.8      72.3      00:11:09
 41278      10   4,835      48,350     1,325.1      72.6      00:11:01
 41530       8   4,835      38,680     1,333.3      73.1      00:10:50
 41789      10   4,835      48,350     1,341.8      73.5      00:10:38
 42019       9   4,835      43,515     1,349.2      74.0      00:10:29
 42259       6   4,835      29,010     1,356.4      74.4      00:10:19
 42446       6   4,835      29,010     1,362.6      74.7      00:10:11
 42659       7   4,835      33,845     1,369.3      75.1      00:10:03
 42842       6   4,835      29,010     1,375.3      75.4      00:09:56
 43043       9   4,835      43,515     1,381.9      75.7      00:09:47
 43240       5   4,835      24,175     1,388.6      76.1      00:09:39
 43454       7   4,835      33,845     1,395.7      76.5      00:09:30
 43768       7   4,835      33,845     1,405.4      77.0      00:09:16
 44045       8   4,835      38,680     1,414.5      77.5      00:09:03
 44249      10   4,835      48,350     1,421.0      77.9      00:08:55
 44427       9   4,835      43,515     1,426.4      78.2      00:08:49
 44618       8   4,835      38,680     1,432.7      78.5      00:08:41
 44840       9   4,835      43,515     1,439.8      78.9      00:08:31
 45046       3   4,835      14,505     1,446.4      79.3      00:08:23
 45277       6   4,835      29,010     1,453.4      79.7      00:08:14
 45432       6   4,835      29,010     1,458.1      79.9      00:08:09
 45617       6   4,835      29,010     1,463.7      80.2      00:08:02
 45846      10   4,835      48,350     1,470.8      80.6      00:07:52
 46053       5   4,835      24,175     1,477.5      81.0      00:07:44
 46235       9   4,835      43,515     1,483.7      81.3      00:07:36
 46459       9   4,835      43,515     1,490.8      81.7      00:07:26
 46705       3   4,835      14,505     1,498.9      82.2      00:07:15
 46922       7   4,835      33,845     1,505.9      82.5      00:07:06
 47120      10   4,835      48,350     1,511.7      82.9      00:06:59
 47343       7   4,835      33,845     1,518.5      83.2      00:06:50
 47543       5   4,835      24,175     1,524.6      83.6      00:06:42
 47773      10   4,835      48,350     1,532.0      84.0      00:06:32
 47979       7   4,835      33,845     1,538.7      84.3      00:06:23
 48183       8   4,835      38,680     1,545.1      84.7      00:06:15
 48414       5   4,835      24,175     1,552.7      85.1      00:06:05
 48656       8   4,835      38,680     1,560.5      85.5      00:05:54
 48880       6   4,835      29,010     1,567.7      85.9      00:05:45
 49105       8   4,835      38,680     1,574.9      86.3      00:05:35
 49329       8   4,835      38,680     1,582.2      86.7      00:05:25
 49568       5   4,835      24,175     1,589.3      87.1      00:05:16
 49776       7   4,835      33,845     1,595.5      87.5      00:05:08
 50003       3   4,835      14,505     1,602.7      87.9      00:04:58
 50187      10   4,835      48,350     1,608.5      88.2      00:04:51
 50394       6   4,835      29,010     1,614.7      88.5      00:04:43
 50621       6   4,835      29,010     1,622.0      88.9      00:04:33
 50837       9   4,835      43,515     1,629.2      89.3      00:04:23
 51069       6   4,835      29,010     1,637.0      89.7      00:04:12
 51343       7   4,835      33,845     1,645.8      90.2      00:04:00
 51602       8   4,835      38,680     1,654.5      90.7      00:03:49
 51860       6   4,835      29,010     1,663.1      91.2      00:03:37
 52141       9   4,835      43,515     1,672.8      91.7      00:03:23
 52413       9   4,835      43,515     1,682.2      92.2      00:03:11
 52721      10   4,835      48,350     1,693.1      92.8      00:02:56
 53039       3   4,835      14,505     1,704.0      93.4      00:02:41
 53340       7   4,835      33,845     1,714.0      94.0      00:02:27
 53648       8   4,835      38,680     1,724.3      94.5      00:02:13
 53925       7   4,835      33,845     1,733.3      95.0      00:02:01
 54159       5   4,835      24,175     1,740.8      95.4      00:01:51
 54424       8   4,835      38,680     1,749.1      95.9      00:01:40
 54725      10   4,835      48,350     1,758.5      96.4      00:01:28
 54968       2   4,835       9,670     1,766.2      96.8      00:01:17
 55169       6   4,835      29,010     1,772.4      97.2      00:01:09
 55427       7   4,835      33,845     1,780.3      97.6      00:00:59
 55646       5   4,835      24,175     1,787.2      98.0      00:00:49
 55840       8   4,835      38,680     1,793.6      98.3      00:00:41
 56029       7   4,835      33,845     1,799.7      98.6      00:00:33
 56256       4   4,835      19,340     1,807.2      99.1      00:00:23
 56507       5   4,835      24,175     1,815.8      99.5      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 2430.866
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
