
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A500_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   197       7   4,535      31,745         5.0       0.3      00:56:33
   425      10   4,535      45,350        11.1       0.7      00:50:58
   639       9   4,535      40,815        16.9       1.0      00:50:02
   859      10   4,535      45,350        23.1       1.3      00:48:47
  1077      10   4,535      45,350        29.4       1.7      00:47:41
  1263       9   4,535      40,815        34.9       2.0      00:48:09
  1467       9   4,535      40,815        41.0       2.4      00:47:35
  1670       7   4,535      31,745        47.2       2.8      00:47:09
  1891       7   4,535      31,745        53.3       3.1      00:46:46
  2109       3   4,535      13,605        59.7       3.5      00:46:16
  2305       8   4,535      36,280        65.4       3.8      00:46:15
  2507       6   4,535      27,210        71.0       4.2      00:46:18
  2719       8   4,535      36,280        77.3       4.5      00:45:55
  2915       7   4,535      31,745        83.2       4.9      00:45:48
  3119       8   4,535      36,280        89.1       5.2      00:45:38
  3292       9   4,535      40,815        94.6       5.5      00:45:44
  3487       9   4,535      40,815       100.4       5.9      00:45:36
  3681       4   4,535      18,140       106.2       6.2      00:45:29
  3878       9   4,535      40,815       112.0       6.5      00:45:22
  4029       8   4,535      36,280       116.1       6.8      00:45:57
  4147       9   4,535      40,815       119.5       7.0      00:46:47
  4295       8   4,535      36,280       123.5       7.2      00:47:19
  4438      10   4,535      45,350       127.6       7.5      00:47:46
  4543       7   4,535      31,745       130.8       7.6      00:48:32
  4666      10   4,535      45,350       134.6       7.9      00:49:00
  4764       7   4,535      31,745       137.5       8.0      00:49:47
  4886       9   4,535      40,815       141.1       8.2      00:50:17
  5020      10   4,535      45,350       145.0       8.5      00:50:36
  5137       7   4,535      31,745       148.3       8.7      00:51:07
  5259      10   4,535      45,350       151.9       8.9      00:51:32
  5393       6   4,535      27,210       156.1       9.1      00:51:40
  5491       7   4,535      31,745       158.5       9.3      00:52:27
  5586       8   4,535      36,280       161.1       9.4      00:53:08
  5716       2   4,535       9,070       164.7       9.6      00:53:25
  5847       4   4,535      18,140       168.5       9.8      00:53:38
  6000       6   4,535      27,210       173.1      10.1      00:53:31
  6111       7   4,535      31,745       176.4      10.3      00:53:52
  6244       7   4,535      31,745       180.3      10.5      00:53:60
  6376       6   4,535      27,210       183.9      10.7      00:54:12
  6499      10   4,535      45,350       187.4      11.0      00:54:24
  6629       8   4,535      36,280       191.1      11.2      00:54:35
  6739      10   4,535      45,350       194.2      11.4      00:54:53
  6893       8   4,535      36,280       198.8      11.6      00:54:44
  7031       4   4,535      18,140       202.6      11.8      00:54:49
  7204      10   4,535      45,350       207.5      12.1      00:54:34
  7380       9   4,535      40,815       212.9      12.4      00:54:10
  7548       8   4,535      36,280       217.9      12.7      00:53:54
  7710       9   4,535      40,815       222.6      13.0      00:53:43
  7875       9   4,535      40,815       227.7      13.3      00:53:25
  8036       6   4,535      27,210       232.8      13.6      00:53:08
  8202       8   4,535      36,280       238.0      13.9      00:52:50
  8390      10   4,535      45,350       243.9      14.3      00:52:22
  8577      10   4,535      45,350       249.6      14.6      00:51:56
  8749       6   4,535      27,210       254.8      14.9      00:51:39
  8927       6   4,535      27,210       260.4      15.2      00:51:16
  9109       6   4,535      27,210       266.0      15.5      00:50:54
  9245       4   4,535      18,140       270.3      15.8      00:50:51
  9343       7   4,535      31,745       273.2      16.0      00:51:05
  9454       6   4,535      27,210       276.7      16.2      00:51:11
  9590      10   4,535      45,350       281.1      16.4      00:51:06
  9700       8   4,535      36,280       284.7      16.6      00:51:10
  9860       9   4,535      40,815       289.4      16.9      00:50:59
 10004       9   4,535      40,815       293.6      17.2      00:50:54
 10148       8   4,535      36,280       297.5      17.4      00:50:54
 10264       7   4,535      31,745       300.7      17.6      00:51:01
 10377       5   4,535      22,675       304.0      17.8      00:51:07
 10481       9   4,535      40,815       307.2      18.0      00:51:15
 10635      10   4,535      45,350       311.5      18.2      00:51:09
 10762       9   4,535      40,815       315.2      18.4      00:51:08
 10891       7   4,535      31,745       319.1      18.6      00:51:06
 11025       7   4,535      31,745       323.0      18.9      00:51:04
 11160       5   4,535      22,675       326.9      19.1      00:51:01
 11262       2   4,535       9,070       329.9      19.3      00:51:08
 11363       7   4,535      31,745       333.0      19.5      00:51:15
 11465       6   4,535      27,210       336.0      19.6      00:51:21
 11568       9   4,535      40,815       338.9      19.8      00:51:29
 11697       6   4,535      27,210       342.8      20.0      00:51:26
 11801       6   4,535      27,210       346.0      20.2      00:51:30
 11927       7   4,535      31,745       349.6      20.4      00:51:29
 12061       8   4,535      36,280       353.7      20.7      00:51:22
 12192       6   4,535      27,210       357.7      20.9      00:51:17
 12363       7   4,535      31,745       362.6      21.2      00:51:02
 12611       7   4,535      31,745       370.0      21.6      00:50:21
 12858       9   4,535      40,815       377.0      22.0      00:49:44
 13092       7   4,535      31,745       383.9      22.4      00:49:10
 13302       6   4,535      27,210       390.2      22.8      00:48:43
 13513       7   4,535      31,745       396.9      23.2      00:48:12
 13615      10   4,535      45,350       400.1      23.4      00:48:15
 13731       9   4,535      40,815       403.5      23.6      00:48:16
 13837       7   4,535      31,745       406.6      23.8      00:48:19
 13959      10   4,535      45,350       410.1      24.0      00:48:18
 14112       7   4,535      31,745       414.7      24.2      00:48:08
 14252      10   4,535      45,350       419.1      24.5      00:47:59
 14397       2   4,535       9,070       423.5      24.7      00:47:49
 14528       8   4,535      36,280       427.5      25.0      00:47:43
 14677       5   4,535      22,675       431.9      25.2      00:47:34
 14802       7   4,535      31,745       435.7      25.5      00:47:30
 14999       6   4,535      27,210       441.8      25.8      00:47:07
 15169       7   4,535      31,745       447.1      26.1      00:46:49
 15385       3   4,535      13,605       453.6      26.5      00:46:23
 15600       6   4,535      27,210       460.0      26.9      00:45:58
 15813       9   4,535      40,815       466.6      27.3      00:45:31
 16010      10   4,535      45,350       472.8      27.6      00:45:08
 16212       7   4,535      31,745       479.1      28.0      00:44:44
 16384      10   4,535      45,350       484.6      28.3      00:44:28
 16581       5   4,535      22,675       490.5      28.7      00:44:08
 16779       7   4,535      31,745       496.6      29.0      00:43:47
 16924       7   4,535      31,745       500.8      29.3      00:43:40
 17057       6   4,535      27,210       504.9      29.5      00:43:34
 17201       6   4,535      27,210       509.2      29.8      00:43:26
 17319       9   4,535      40,815       513.0      30.0      00:43:23
 17437       8   4,535      36,280       516.6      30.2      00:43:19
 17533       8   4,535      36,280       519.8      30.4      00:43:19
 17634       6   4,535      27,210       523.0      30.6      00:43:20
 17745       6   4,535      27,210       526.1      30.7      00:43:20
 17891       9   4,535      40,815       530.5      31.0      00:43:11
 18000       6   4,535      27,210       533.8      31.2      00:43:11
 18181       6   4,535      27,210       539.5      31.5      00:42:52
 18354       4   4,535      18,140       544.7      31.8      00:42:38
 18505       8   4,535      36,280       548.9      32.1      00:42:31
 18613      10   4,535      45,350       552.3      32.3      00:42:28
 18716       7   4,535      31,745       555.6      32.5      00:42:27
 18839       4   4,535      18,140       559.3      32.7      00:42:23
 18965       7   4,535      31,745       563.4      32.9      00:42:16
 19085      10   4,535      45,350       567.2      33.1      00:42:11
 19212       8   4,535      36,280       571.2      33.4      00:42:04
 19331       6   4,535      27,210       574.8      33.6      00:42:00
 19515       7   4,535      31,745       580.7      33.9      00:41:41
 19691       5   4,535      22,675       586.3      34.3      00:41:24
 19896       6   4,535      27,210       592.7      34.6      00:41:02
 20066      10   4,535      45,350       598.3      35.0      00:40:45
 20276       6   4,535      27,210       604.6      35.3      00:40:25
 20456       2   4,535       9,070       610.1      35.7      00:40:09
 20560       5   4,535      22,675       613.4      35.9      00:40:07
 20662       9   4,535      40,815       616.6      36.0      00:40:05
 20762       4   4,535      18,140       619.6      36.2      00:40:05
 20877      10   4,535      45,350       623.3      36.4      00:40:00
 20979       8   4,535      36,280       626.3      36.6      00:39:59
 21135       3   4,535      13,605       630.8      36.9      00:39:50
 21242       8   4,535      36,280       633.7      37.0      00:39:49
 21385       4   4,535      18,140       637.7      37.3      00:39:43
 21523       8   4,535      36,280       641.9      37.5      00:39:34
 21681       7   4,535      31,745       646.2      37.8      00:39:26
 21832       7   4,535      31,745       650.5      38.0      00:39:17
 21969       8   4,535      36,280       654.5      38.2      00:39:10
 22133       7   4,535      31,745       658.9      38.5      00:39:01
 22284      10   4,535      45,350       663.2      38.8      00:38:51
 22422      10   4,535      45,350       667.1      39.0      00:38:45
 22543       9   4,535      40,815       670.6      39.2      00:38:41
 22669       9   4,535      40,815       674.4      39.4      00:38:35
 22845       5   4,535      22,675       679.0      39.7      00:38:24
 23057       4   4,535      18,140       685.4      40.1      00:38:04
 23251       9   4,535      40,815       691.3      40.4      00:37:46
 23449       5   4,535      22,675       696.9      40.7      00:37:30
 23652       9   4,535      40,815       702.7      41.1      00:37:13
 23849       8   4,535      36,280       708.7      41.4      00:36:55
 24043      10   4,535      45,350       714.4      41.8      00:36:39
 24258       3   4,535      13,605       720.5      42.1      00:36:21
 24471       7   4,535      31,745       726.6      42.5      00:36:03
 24639       7   4,535      31,745       731.8      42.8      00:35:49
 24823       8   4,535      36,280       737.2      43.1      00:35:35
 24907       7   4,535      31,745       739.6      43.2      00:35:36
 25068       4   4,535      18,140       744.6      43.5      00:35:24
 25150       5   4,535      22,675       747.1      43.7      00:35:24
 25325       5   4,535      22,675       752.3      44.0      00:35:11
 25528       6   4,535      27,210       758.5      44.3      00:34:53
 25677       5   4,535      22,675       762.7      44.6      00:34:44
 25786       5   4,535      22,675       766.2      44.8      00:34:40
 25928       7   4,535      31,745       770.5      45.0      00:34:31
 26035      10   4,535      45,350       773.8      45.2      00:34:27
 26155       6   4,535      27,210       777.3      45.4      00:34:22
 26309       6   4,535      27,210       782.0      45.7      00:34:11
 26492       6   4,535      27,210       787.2      46.0      00:33:58
 26629       6   4,535      27,210       791.2      46.2      00:33:51
 26767       6   4,535      27,210       795.4      46.5      00:33:42
 26926      10   4,535      45,350       800.1      46.8      00:33:32
 27067       5   4,535      22,675       804.2      47.0      00:33:24
 27198       1   4,535       4,535       808.2      47.2      00:33:16
 27293       6   4,535      27,210       811.0      47.4      00:33:14
 27419       5   4,535      22,675       814.8      47.6      00:33:08
 27542       7   4,535      31,745       818.5      47.8      00:33:01
 27687      10   4,535      45,350       823.0      48.1      00:32:52
 27812       8   4,535      36,280       826.8      48.3      00:32:45
 27961       5   4,535      22,675       831.4      48.6      00:32:34
 28159       5   4,535      22,675       837.4      48.9      00:32:17
 28335      10   4,535      45,350       842.9      49.3      00:32:03
 28524      10   4,535      45,350       849.0      49.6      00:31:46
 28672       8   4,535      36,280       853.5      49.9      00:31:36
 28782       8   4,535      36,280       857.0      50.1      00:31:31
 28910       6   4,535      27,210       861.0      50.3      00:31:23
 29016       6   4,535      27,210       864.3      50.5      00:31:19
 29124       9   4,535      40,815       867.6      50.7      00:31:14
 29268       8   4,535      36,280       871.7      50.9      00:31:06
 29356      10   4,535      45,350       874.5      51.1      00:31:03
 29474       6   4,535      27,210       878.2      51.3      00:30:57
 29646       9   4,535      40,815       883.1      51.6      00:30:45
 29756      10   4,535      45,350       886.6      51.8      00:30:39
 29875       5   4,535      22,675       890.3      52.0      00:30:33
 29996       9   4,535      40,815       894.0      52.2      00:30:26
 30113       6   4,535      27,210       897.5      52.5      00:30:20
 30254       8   4,535      36,280       901.9      52.7      00:30:11
 30386       8   4,535      36,280       905.9      52.9      00:30:03
 30514       7   4,535      31,745       910.1      53.2      00:29:54
 30635      10   4,535      45,350       913.8      53.4      00:29:47
 30808       6   4,535      27,210       919.2      53.7      00:29:33
 31010       6   4,535      27,210       925.2      54.1      00:29:17
 31188      10   4,535      45,350       930.8      54.4      00:29:02
 31347       4   4,535      18,140       935.7      54.7      00:28:51
 31492       7   4,535      31,745       940.4      55.0      00:28:40
 31695       8   4,535      36,280       946.7      55.3      00:28:22
 31874       5   4,535      22,675       952.5      55.7      00:28:07
 32037       7   4,535      31,745       957.8      56.0      00:27:54
 32182       4   4,535      18,140       962.3      56.2      00:27:44
 32337       6   4,535      27,210       967.4      56.5      00:27:32
 32486       8   4,535      36,280       972.1      56.8      00:27:21
 32558      10   4,535      45,350       974.3      56.9      00:27:20
 32668       9   4,535      40,815       977.7      57.1      00:27:14
 32750       8   4,535      36,280       980.3      57.3      00:27:11
 32860      10   4,535      45,350       983.7      57.5      00:27:06
 32954      10   4,535      45,350       986.8      57.7      00:27:01
 33052       6   4,535      27,210       989.9      57.8      00:26:57
 33190       6   4,535      27,210       994.1      58.1      00:26:48
 33345       7   4,535      31,745       999.0      58.4      00:26:36
 33471       7   4,535      31,745     1,002.8      58.6      00:26:28
 33594       9   4,535      40,815     1,007.0      58.8      00:26:20
 33713       4   4,535      18,140     1,010.7      59.1      00:26:13
 33822       8   4,535      36,280     1,014.1      59.3      00:26:07
 33946       9   4,535      40,815     1,018.1      59.5      00:25:58
 34079       8   4,535      36,280     1,022.2      59.7      00:25:49
 34193       3   4,535      13,605     1,026.0      60.0      00:25:42
 34361       6   4,535      27,210     1,031.3      60.3      00:25:29
 34581       9   4,535      40,815     1,038.2      60.7      00:25:10
 34795       7   4,535      31,745     1,045.1      61.1      00:24:51
 35021       7   4,535      31,745     1,052.1      61.5      00:24:32
 35233       6   4,535      27,210     1,058.8      61.9      00:24:14
 35463       4   4,535      18,140     1,066.1      62.3      00:23:54
 35670       8   4,535      36,280     1,072.4      62.7      00:23:37
 35878       7   4,535      31,745     1,078.9      63.1      00:23:20
 36078       8   4,535      36,280     1,085.2      63.4      00:23:04
 36239       6   4,535      27,210     1,090.3      63.7      00:22:52
 36436       8   4,535      36,280     1,096.5      64.1      00:22:36
 36591       8   4,535      36,280     1,101.2      64.4      00:22:26
 36709      10   4,535      45,350     1,104.7      64.6      00:22:19
 36835       7   4,535      31,745     1,108.5      64.8      00:22:12
 36976       7   4,535      31,745     1,112.7      65.0      00:22:03
 37081       8   4,535      36,280     1,116.0      65.2      00:21:57
 37211       7   4,535      31,745     1,119.5      65.4      00:21:51
 37330      10   4,535      45,350     1,122.8      65.6      00:21:45
 37453       9   4,535      40,815     1,126.5      65.8      00:21:37
 37578       5   4,535      22,675     1,130.2      66.1      00:21:30
 37720       7   4,535      31,745     1,134.3      66.3      00:21:22
 37887       5   4,535      22,675     1,139.4      66.6      00:21:10
 38046       8   4,535      36,280     1,144.3      66.9      00:20:58
 38170       6   4,535      27,210     1,148.1      67.1      00:20:51
 38286       8   4,535      36,280     1,151.7      67.3      00:20:44
 38430       7   4,535      31,745     1,156.3      67.6      00:20:33
 38599       9   4,535      40,815     1,161.5      67.9      00:20:21
 38792       5   4,535      22,675     1,167.4      68.2      00:20:07
 38973       5   4,535      22,675     1,173.0      68.5      00:19:53
 39113       4   4,535      18,140     1,177.2      68.8      00:19:44
 39244       8   4,535      36,280     1,180.9      69.0      00:19:37
 39343       8   4,535      36,280     1,184.0      69.2      00:19:31
 39500       9   4,535      40,815     1,188.6      69.5      00:19:21
 39650       5   4,535      22,675     1,193.1      69.7      00:19:11
 39794       6   4,535      27,210     1,197.4      70.0      00:19:02
 39984       8   4,535      36,280     1,203.1      70.3      00:18:48
 40178       6   4,535      27,210     1,209.0      70.7      00:18:34
 40380      10   4,535      45,350     1,215.0      71.0      00:18:19
 40586       6   4,535      27,210     1,221.5      71.4      00:18:03
 40780       7   4,535      31,745     1,227.5      71.7      00:17:48
 40926      10   4,535      45,350     1,232.1      72.0      00:17:38
 41034       7   4,535      31,745     1,235.5      72.2      00:17:31
 41142       7   4,535      31,745     1,238.6      72.4      00:17:26
 41261       6   4,535      27,210     1,242.3      72.6      00:17:18
 41436       7   4,535      31,745     1,247.7      72.9      00:17:06
 41549       6   4,535      27,210     1,251.1      73.1      00:16:59
 41698       7   4,535      31,745     1,255.7      73.4      00:16:49
 41833       4   4,535      18,140     1,259.9      73.6      00:16:40
 41963       9   4,535      40,815     1,263.9      73.9      00:16:31
 42093       5   4,535      22,675     1,267.6      74.1      00:16:24
 42201       6   4,535      27,210     1,270.6      74.3      00:16:18
 42296       8   4,535      36,280     1,273.3      74.4      00:16:14
 42397       6   4,535      27,210     1,276.6      74.6      00:16:07
 42510       8   4,535      36,280     1,280.0      74.8      00:16:00
 42627       6   4,535      27,210     1,283.3      75.0      00:15:54
 42733       8   4,535      36,280     1,286.5      75.2      00:15:48
 42855      10   4,535      45,350     1,290.4      75.4      00:15:40
 43001       9   4,535      40,815     1,294.8      75.7      00:15:30
 43161       9   4,535      40,815     1,300.0      76.0      00:15:18
 43293       9   4,535      40,815     1,304.1      76.2      00:15:09
 43447       6   4,535      27,210     1,308.9      76.5      00:14:58
 43643      10   4,535      45,350     1,314.6      76.8      00:14:45
 43830       9   4,535      40,815     1,320.2      77.2      00:14:31
 44002       6   4,535      27,210     1,325.4      77.5      00:14:19
 44151       8   4,535      36,280     1,329.8      77.7      00:14:09
 44279       7   4,535      31,745     1,333.8      77.9      00:14:01
 44433       6   4,535      27,210     1,338.1      78.2      00:13:51
 44614       6   4,535      27,210     1,343.6      78.5      00:13:38
 44778       5   4,535      22,675     1,348.6      78.8      00:13:27
 44945       7   4,535      31,745     1,353.7      79.1      00:13:15
 45114       8   4,535      36,280     1,358.7      79.4      00:13:04
 45304      10   4,535      45,350     1,363.9      79.7      00:12:52
 45418       4   4,535      18,140     1,367.2      79.9      00:12:45
 45557       8   4,535      36,280     1,371.2      80.1      00:12:37
 45702       4   4,535      18,140     1,375.3      80.4      00:12:28
 45875       8   4,535      36,280     1,380.3      80.7      00:12:16
 46043       7   4,535      31,745     1,385.6      81.0      00:12:04
 46189       7   4,535      31,745     1,390.1      81.2      00:11:54
 46317       6   4,535      27,210     1,394.1      81.5      00:11:46
 46458       9   4,535      40,815     1,398.3      81.7      00:11:37
 46607       4   4,535      18,140     1,402.9      82.0      00:11:26
 46803       9   4,535      40,815     1,409.0      82.3      00:11:12
 46978       9   4,535      40,815     1,413.9      82.6      00:11:01
 47165       6   4,535      27,210     1,419.0      82.9      00:10:49
 47321       5   4,535      22,675     1,423.7      83.2      00:10:39
 47480       3   4,535      13,605     1,428.2      83.5      00:10:29
 47611       9   4,535      40,815     1,432.1      83.7      00:10:20
 47730       7   4,535      31,745     1,435.7      83.9      00:10:12
 47875       8   4,535      36,280     1,440.0      84.2      00:10:03
 48002       8   4,535      36,280     1,443.9      84.4      00:09:55
 48110      10   4,535      45,350     1,447.1      84.6      00:09:48
 48225       8   4,535      36,280     1,450.5      84.8      00:09:41
 48379       7   4,535      31,745     1,455.3      85.1      00:09:30
 48559       8   4,535      36,280     1,460.8      85.4      00:09:17
 48772       9   4,535      40,815     1,467.2      85.7      00:09:03
 48904       4   4,535      18,140     1,471.1      86.0      00:08:54
 49069       9   4,535      40,815     1,476.1      86.3      00:08:43
 49199       6   4,535      27,210     1,480.3      86.5      00:08:34
 49340      10   4,535      45,350     1,484.3      86.7      00:08:25
 49494       5   4,535      22,675     1,488.6      87.0      00:08:15
 49625       6   4,535      27,210     1,492.2      87.2      00:08:08
 49753       4   4,535      18,140     1,495.8      87.4      00:07:60
 49900       7   4,535      31,745     1,500.1      87.7      00:07:50
 50019       1   4,535       4,535     1,503.7      87.9      00:07:43
 50175       8   4,535      36,280     1,508.3      88.1      00:07:32
 50314       7   4,535      31,745     1,512.2      88.4      00:07:24
 50450       7   4,535      31,745     1,516.1      88.6      00:07:15
 50558       8   4,535      36,280     1,519.5      88.8      00:07:08
 50713       9   4,535      40,815     1,524.3      89.1      00:06:57
 50858       8   4,535      36,280     1,528.8      89.3      00:06:47
 50995       7   4,535      31,745     1,533.2      89.6      00:06:37
 51147       5   4,535      22,675     1,537.7      89.9      00:06:27
 51320       7   4,535      31,745     1,542.9      90.2      00:06:15
 51546       9   4,535      40,815     1,550.0      90.6      00:05:59
 51776      10   4,535      45,350     1,557.4      91.0      00:05:42
 51968       4   4,535      18,140     1,563.2      91.4      00:05:29
 52155       7   4,535      31,745     1,569.5      91.7      00:05:14
 52370       9   4,535      40,815     1,576.4      92.1      00:04:59
 52563       7   4,535      31,745     1,582.8      92.5      00:04:44
 52764       9   4,535      40,815     1,589.5      92.9      00:04:29
 52952       8   4,535      36,280     1,595.5      93.2      00:04:16
 53159       9   4,535      40,815     1,602.0      93.6      00:04:01
 53346       6   4,535      27,210     1,607.8      94.0      00:03:48
 53509       8   4,535      36,280     1,613.1      94.3      00:03:36
 53674       6   4,535      27,210     1,618.1      94.6      00:03:25
 53781       9   4,535      40,815     1,621.5      94.8      00:03:18
 53854       4   4,535      18,140     1,623.7      94.9      00:03:13
 53929       7   4,535      31,745     1,625.8      95.0      00:03:09
 54013      10   4,535      45,350     1,628.4      95.2      00:03:03
 54113       8   4,535      36,280     1,631.5      95.3      00:02:56
 54220      10   4,535      45,350     1,634.7      95.5      00:02:49
 54342       7   4,535      31,745     1,638.4      95.7      00:02:41
 54491       3   4,535      13,605     1,642.3      96.0      00:02:33
 54617      10   4,535      45,350     1,646.1      96.2      00:02:24
 54762       7   4,535      31,745     1,650.4      96.5      00:02:15
 54906       5   4,535      22,675     1,654.7      96.7      00:02:05
 55027       7   4,535      31,745     1,658.3      96.9      00:01:57
 55134      10   4,535      45,350     1,661.5      97.1      00:01:50
 55250       9   4,535      40,815     1,664.9      97.3      00:01:43
 55363       8   4,535      36,280     1,668.0      97.5      00:01:36
 55470       7   4,535      31,745     1,671.1      97.7      00:01:29
 55620       7   4,535      31,745     1,675.4      97.9      00:01:20
 55748       9   4,535      40,815     1,679.4      98.1      00:01:11
 55954       9   4,535      40,815     1,685.7      98.5      00:00:57
 56107       9   4,535      40,815     1,690.4      98.8      00:00:46
 56223       8   4,535      36,280     1,694.1      99.0      00:00:38
 56314       8   4,535      36,280     1,696.9      99.2      00:00:32
 56413       8   4,535      36,280     1,700.2      99.4      00:00:24
 56566       8   4,535      36,280     1,704.9      99.6      00:00:14
 56749       9   4,535      40,815     1,710.7     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 3827.654
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
