. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_logdistabove0.5_R100.dta /export/storage_covidva
> ccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_logdistabove0.5_R100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  20 Jan 2024, 22:10:25

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove0.5_R100.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
 15876       6   4,035      24,210       416.6      27.3      00:19:04
 17869       6   4,035      24,210       471.2      30.9      00:16:02
 16002       8   4,030      32,240       419.7      27.6      00:18:51
 16041       6   4,035      24,210       421.3      27.7      00:18:47
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   444       9   4,035      36,315        10.2       0.7      00:24:47
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   471       7   4,035      28,245        10.9       0.7      00:23:14
 16294       4   4,035      16,140       428.4      28.1      00:18:46
 18245       4   4,035      16,140       481.6      31.6      00:15:54
 16465       8   4,035      32,280       433.3      28.4      00:18:29
 16423       9   4,030      36,270       431.5      28.4      00:18:33
   911       7   4,035      28,245        21.6       1.4      00:23:14
   962      10   4,035      40,350        22.9       1.5      00:21:52
 16665      10   4,035      40,350       438.4      28.8      00:18:35
 16793       5   4,035      20,175       442.0      29.0      00:18:23
 18664       8   4,035      32,280       492.6      32.3      00:15:43
 16762      10   4,030      40,300       440.6      29.0      00:18:26
  1363       9   4,035      36,315        33.6       2.2      00:22:13
  1429       9   4,035      36,315        35.3       2.3      00:21:06
 16964       5   4,035      20,175       446.6      29.3      00:18:31
 17058       6   4,030      24,180       448.6      29.5      00:18:22
 19095       7   4,035      28,245       504.7      33.1      00:15:30
 17077       9   4,035      36,315       449.6      29.5      00:18:20
  1829       7   4,035      28,245        45.7       3.0      00:21:34
  1922       6   4,035      24,210        48.0       3.1      00:20:32
 17240       5   4,035      20,175       453.9      29.8      00:18:29
 19531       7   4,035      28,245       516.8      33.9      00:15:17
 17353       7   4,030      28,210       456.6      30.0      00:18:18
 17351       9   4,035      36,315       457.1      30.0      00:18:18
  2291      10   4,035      40,350        57.6       3.8      00:21:13
  2414       4   4,035      16,140        60.8       4.0      00:20:05
 17501       8   4,035      32,280       461.4      30.3      00:18:27
 19946       7   4,035      28,245       528.6      34.7      00:15:05
 17626       8   4,030      32,240       464.3      30.5      00:18:15
 17617      10   4,035      40,350       464.6      30.5      00:18:16
  2748      10   4,035      40,350        69.5       4.6      00:20:58
  2907       4   4,035      16,140        73.6       4.8      00:19:43
 17797       6   4,035      24,210       469.2      30.8      00:18:23
 20367       7   4,035      28,245       540.2      35.5      00:14:53
 17970       7   4,030      28,210       473.3      31.1      00:18:07
 17948       9   4,035      36,315       473.3      31.1      00:18:09
  3389       6   4,035      24,210        86.5       5.7      00:19:24
  3206       8   4,035      32,280        81.5       5.4      00:20:40
 18129       6   4,035      24,210       478.4      31.4      00:18:14
 20702       7   4,035      28,245       549.4      36.1      00:14:48
 18308       7   4,030      28,210       482.6      31.7      00:17:58
 18290      10   4,035      40,350       482.7      31.7      00:17:60
  3877      10   4,035      40,350        99.4       6.5      00:19:07
  3656       7   4,035      28,245        93.6       6.1      00:20:24
 18486       5   4,035      20,175       487.6      32.0      00:18:05
 18651       9   4,030      36,270       491.6      32.3      00:17:50
 21011       5   4,035      20,175       557.9      36.6      00:14:44
 18608       9   4,035      36,315       491.0      32.2      00:17:54
  4248       7   4,035      28,245       108.7       7.1      00:19:33
  4048       9   4,035      36,315       103.6       6.8      00:20:35
 18767       8   4,035      32,280       495.5      32.5      00:18:00
 21422       1   4,035       4,035       568.1      37.3      00:14:36
 18961       9   4,030      36,270       500.3      32.9      00:17:43
 18885       7   4,035      28,245       498.7      32.7      00:17:50
  4625       7   4,035      28,245       118.4       7.8      00:19:48
  4385       9   4,035      36,315       112.0       7.3      00:21:03
 19096       7   4,035      28,245       504.7      33.1      00:17:52
 21824       7   4,035      28,245       578.2      37.9      00:14:28
 19278      10   4,030      40,300       509.1      33.5      00:17:36
 19186       6   4,035      24,210       507.2      33.3      00:17:44
  5024       7   4,035      28,245       129.0       8.5      00:19:51
  4700       7   4,035      28,245       120.5       7.9      00:21:23
 19413       6   4,035      24,210       513.5      33.7      00:17:44
 22219       5   4,035      20,175       588.2      38.6      00:14:20
 19695       9   4,030      36,270       520.8      34.2      00:17:19
 19545      10   4,035      40,350       517.2      33.9      00:17:32
  5364      10   4,035      40,350       137.9       9.1      00:20:07
  5015       7   4,035      28,245       128.7       8.4      00:21:42
 19831       9   4,035      36,315       525.3      34.5      00:17:27
 22610      10   4,035      40,350       598.2      39.3      00:14:12
 19963       4   4,035      16,140       529.1      34.7      00:17:16
 20105       9   4,030      36,270       532.6      35.0      00:17:03
  5698       6   4,035      24,210       146.0       9.6      00:20:28
  5328       8   4,035      32,280       136.8       9.0      00:21:60
 20252       9   4,035      36,315       537.1      35.3      00:17:10
 23007      10   4,035      40,350       608.2      39.9      00:14:04
 20516       8   4,030      32,240       543.6      35.7      00:16:49
 20395       9   4,035      36,315       540.9      35.5      00:16:59
  6067       9   4,035      36,315       155.6      10.2      00:20:32
  5596      10   4,035      40,350       143.5       9.4      00:22:29
 20599       1   4,035       4,035       546.6      35.9      00:17:00
 23381       6   4,035      24,210       618.3      40.6      00:13:56
 20680       7   4,035      28,245       548.9      36.0      00:16:54
 20832       7   4,030      28,210       552.3      36.3      00:16:42
  6452      10   4,035      40,350       165.4      10.9      00:20:33
  5868      10   4,035      40,350       150.3       9.9      00:22:53
 20863      10   4,035      40,350       553.9      36.4      00:16:57
 23775       6   4,035      24,210       628.3      41.2      00:13:48
 21170       8   4,030      32,240       561.2      36.9      00:16:34
 20955       4   4,035      16,140       556.5      36.5      00:16:50
  6827       7   4,035      28,245       175.0      11.5      00:20:34
  6204       8   4,035      32,280       159.1      10.4      00:22:55
 21182       4   4,035      16,140       562.3      36.9      00:16:50
 24179       8   4,035      32,280       638.8      41.9      00:13:38
 21262       9   4,035      36,315       564.1      37.0      00:16:45
 21487      10   4,030      40,300       569.1      37.4      00:16:29
  7232      10   4,035      40,350       185.2      12.2      00:20:30
  6508       6   4,035      24,210       166.8      10.9      00:23:05
 21498      10   4,035      40,350       570.1      37.4      00:16:45
 24650       7   4,035      28,245       651.2      42.7      00:13:25
 21585       9   4,035      36,315       572.4      37.6      00:16:39
 21817       8   4,030      32,240       577.3      37.9      00:16:23
  7666       4   4,035      16,140       196.8      12.9      00:20:15
  6840       7   4,035      28,245       175.3      11.5      00:23:07
 21824       7   4,035      28,245       578.2      37.9      00:16:39
 25105       5   4,035      20,175       663.3      43.5      00:13:12
 21902       8   4,035      32,280       580.3      38.1      00:16:33
 22142       6   4,030      24,180       585.5      38.5      00:16:17
  8086       6   4,035      24,210       208.3      13.7      00:20:01
  7207       5   4,035      20,175       184.6      12.1      00:23:01
 22156       7   4,035      28,245       586.5      38.5      00:16:32
 25558       7   4,035      28,245       675.5      44.3      00:12:60
 22238       8   4,035      32,280       588.7      38.6      00:16:26
 22477       6   4,030      24,180       593.9      39.0      00:16:10
  8501       8   4,035      32,280       219.9      14.4      00:19:47
  7585       9   4,035      36,315       194.6      12.8      00:22:48
 22479      10   4,035      40,350       594.7      39.0      00:16:25
 25905       9   4,035      36,315       684.7      44.9      00:12:53
 22570       8   4,035      32,280       597.1      39.2      00:16:19
 22803       6   4,030      24,180       602.2      39.6      00:16:04
  8910       7   4,035      28,245       231.1      15.2      00:19:36
  7955       8   4,035      32,280       204.7      13.4      00:22:35
 26270       7   4,035      28,245       694.6      45.6      00:12:45
 22786       6   4,035      24,210       602.5      39.5      00:16:20
 22893       1   4,035       4,035       605.1      39.7      00:16:13
 23127       6   4,030      24,180       610.7      40.1      00:15:56
  9272       4   4,035      16,140       241.0      15.8      00:19:32
  8325       6   4,035      24,210       215.0      14.1      00:22:22
 26706       8   4,035      32,280       705.6      46.3      00:12:35
 23080       7   4,035      28,245       610.2      40.0      00:16:15
 23184       4   4,035      16,140       613.0      40.2      00:16:07
 23428      10   4,030      40,300       618.8      40.7      00:15:50
  9568       7   4,035      28,245       249.3      16.4      00:19:37
  8688       9   4,035      36,315       224.9      14.8      00:22:10
 27122       7   4,035      28,245       716.7      47.0      00:12:24
 23389       5   4,035      20,175       618.5      40.6      00:16:07
 23513       5   4,035      20,175       621.5      40.8      00:15:60
 23769      10   4,030      40,300       627.4      41.2      00:15:43
  9918       6   4,035      24,210       258.9      17.0      00:19:34
  9057       3   4,035      12,105       235.0      15.4      00:21:58
 27457       8   4,035      32,280       725.6      47.6      00:12:18
 23727       5   4,035      20,175       627.0      41.2      00:15:60
 23840       8   4,035      32,280       630.2      41.4      00:15:51
 24073       6   4,030      24,180       635.5      41.8      00:15:36
 10296       8   4,035      32,280       268.2      17.6      00:19:31
  9346       7   4,035      28,245       243.1      16.0      00:21:59
 27834       9   4,035      36,315       735.9      48.3      00:12:09
 24051       9   4,035      36,315       635.7      41.7      00:15:51
 24159       9   4,035      36,315       638.3      41.9      00:15:45
 24472       8   4,030      32,240       645.5      42.4      00:15:25
 10699       8   4,035      32,280       278.7      18.3      00:19:23
  9621       7   4,035      28,245       250.8      16.5      00:22:01
 28270       8   4,035      32,280       747.7      49.1      00:11:57
 24467       7   4,035      28,245       646.1      42.4      00:15:39
 24577       8   4,035      32,280       649.2      42.6      00:15:31
 24877      10   4,030      40,300       656.4      43.1      00:15:11
 11113       2   4,035       8,070       289.5      19.0      00:19:12
  9934       8   4,035      32,280       259.3      17.0      00:21:59
 28692       3   4,035      12,105       759.6      49.9      00:11:45
 24890       3   4,035      12,105       657.5      43.2      00:15:23
 24978       5   4,035      20,175       659.7      43.3      00:15:18
 25291       9   4,030      36,270       667.4      43.9      00:14:58
 11415       4   4,035      16,140       297.4      19.5      00:19:16
 10259       8   4,035      32,280       267.3      17.5      00:21:58
 28987       5   4,035      20,175       767.8      50.4      00:11:40
 25302       7   4,035      28,245       668.6      43.9      00:15:09
 25364       4   4,035      16,140       670.2      44.0      00:15:06
 25677      10   4,030      40,300       677.5      44.5      00:14:46
 11758       9   4,035      36,315       306.4      20.1      00:19:14
 10597       7   4,035      28,245       276.0      18.1      00:21:53
 29383       6   4,035      24,210       778.5      51.1      00:11:30
 25669      10   4,035      40,350       678.1      44.5      00:14:59
 25697       8   4,035      32,280       678.9      44.6      00:14:57
 25974       6   4,030      24,180       685.6      45.1      00:14:40
 12099       8   4,035      32,280       315.6      20.7      00:19:10
 10962       9   4,035      36,315       285.6      18.7      00:21:42
 25950       9   4,035      36,315       685.9      45.0      00:14:53
 29786       7   4,035      28,245       789.4      51.8      00:11:20
 25976       6   4,035      24,210       686.5      45.1      00:14:51
 26292       9   4,030      36,270       694.3      45.6      00:14:31
 12490      10   4,035      40,350       325.8      21.4      00:19:01
 11277       9   4,035      36,315       293.8      19.3      00:21:40
 26273       7   4,035      28,245       694.7      45.6      00:14:44
 30114       6   4,035      24,210       798.3      52.4      00:11:13
 26287       4   4,035      16,140       695.0      45.6      00:14:44
 26680       6   4,030      24,180       704.1      46.3      00:14:21
 12978       7   4,035      28,245       338.3      22.2      00:18:43
 11530       8   4,035      32,280       300.5      19.7      00:21:45
 26652       8   4,035      32,280       704.3      46.2      00:14:34
 30490       7   4,035      28,245       808.7      53.1      00:11:04
 26675       7   4,035      28,245       704.8      46.3      00:14:33
 27051       2   4,030       8,060       714.1      46.9      00:14:10
 13435       6   4,035      24,210       350.6      23.0      00:18:25
 11811      10   4,035      40,350       307.9      20.2      00:21:45
 27022       6   4,035      24,210       714.2      46.9      00:14:22
 30939       4   4,035      16,140       821.1      53.9      00:10:51
 27056       8   4,035      32,280       715.1      46.9      00:14:21
 27406       5   4,030      20,150       723.4      47.5      00:14:00
 13798       8   4,035      32,280       360.6      23.7      00:18:18
 12098       5   4,035      20,175       315.5      20.7      00:21:44
 27321       8   4,035      32,280       722.1      47.4      00:14:16
 31414       9   4,035      36,315       834.1      54.7      00:10:37
 27326       9   4,035      36,315       722.2      47.4      00:14:16
 27743       6   4,030      24,180       732.5      48.1      00:13:51
 14172       2   4,035       8,070       370.4      24.3      00:18:11
 12435       8   4,035      32,280       324.4      21.3      00:21:36
 27606       8   4,035      32,280       729.8      47.9      00:14:10
 31875       5   4,035      20,175       847.1      55.6      00:10:24
 27582       7   4,035      28,245       729.0      47.8      00:14:12
 28123       8   4,030      32,240       742.9      48.8      00:13:39
 14539       4   4,035      16,140       380.5      25.0      00:18:03
 12857       8   4,035      32,280       335.2      22.0      00:21:18
 27935       2   4,035       8,070       738.7      48.5      00:14:01
 32331       6   4,035      24,210       860.1      56.5      00:10:10
 27906       7   4,035      28,245       738.0      48.4      00:14:02
 28527      10   4,030      40,300       754.1      49.6      00:13:26
 14954       4   4,035      16,140       391.6      25.7      00:17:51
 13276       9   4,035      36,315       346.2      22.7      00:21:00
 28334       6   4,035      24,210       749.6      49.2      00:13:47
 32695       4   4,035      16,140       870.3      57.1      00:10:01
 28291       6   4,035      24,210       748.3      49.1      00:13:50
 28821       8   4,030      32,240       762.3      50.1      00:13:18
 15417      10   4,035      40,350       404.3      26.5      00:17:33
 13636       2   4,035       8,070       356.4      23.4      00:20:47
 28701       9   4,035      36,315       759.8      49.9      00:13:35
 33016       4   4,035      16,140       879.3      57.7      00:09:54
 28662      10   4,035      40,350       758.8      49.8      00:13:38
 29091       8   4,030      32,240       769.7      50.6      00:13:13
 15887       9   4,035      36,315       417.0      27.4      00:17:16
 13933       6   4,035      24,210       364.0      23.9      00:20:44
 28945       8   4,035      32,280       766.7      50.3      00:13:31
 33401       8   4,035      32,280       890.0      58.4      00:09:45
 28923       9   4,035      36,315       766.0      50.3      00:13:32
 29443       9   4,030      36,270       779.3      51.2      00:13:03
 16353       8   4,035      32,280       430.0      28.2      00:16:58
 14265       6   4,035      24,210       373.0      24.5      00:20:36
 29249       8   4,035      32,280       774.7      50.8      00:13:23
 33794       8   4,035      32,280       901.1      59.1      00:09:34
 29247       7   4,035      28,245       774.7      50.8      00:13:24
 29789       4   4,030      16,120       788.5      51.8      00:12:53
 16764       6   4,035      24,210       441.2      29.0      00:16:47
 14601       6   4,035      24,210       382.1      25.1      00:20:27
 29594       8   4,035      32,280       784.1      51.5      00:13:13
 34174       7   4,035      28,245       912.0      59.9      00:09:24
 29599       5   4,035      20,175       784.2      51.5      00:13:13
 30073       6   4,030      24,180       796.2      52.3      00:12:47
 17114       4   4,035      16,140       450.5      29.6      00:16:41
 14962       9   4,035      36,315       391.8      25.7      00:20:15
 34633       8   4,035      32,280       924.8      60.7      00:09:11
 29888      10   4,035      40,350       792.2      52.0      00:13:06
 29901       7   4,035      28,245       792.5      52.0      00:13:05
 30373       7   4,030      28,210       804.4      52.9      00:12:39
 17454      10   4,035      40,350       459.9      30.2      00:16:36
 15390       5   4,035      20,175       403.6      26.5      00:19:55
 35108       5   4,035      20,175       938.1      61.6      00:08:57
 30167       9   4,035      36,315       799.7      52.5      00:12:60
 30172       9   4,035      36,315       799.9      52.5      00:12:59
 30702       5   4,030      20,150       813.5      53.5      00:12:30
 17805       4   4,035      16,140       469.4      30.8      00:16:29
 15840      10   4,035      40,350       415.7      27.3      00:19:35
 30466       8   4,035      32,280       808.1      53.0      00:12:52
 35575       6   4,035      24,210       951.3      62.4      00:08:44
 30486       8   4,035      32,280       808.6      53.1      00:12:51
 31132      10   4,030      40,300       825.2      54.2      00:12:16
 18199       6   4,035      24,210       480.3      31.5      00:16:19
 16260       9   4,035      36,315       427.4      28.1      00:19:16
 30833       9   4,035      36,315       818.2      53.7      00:12:40
 36051       7   4,035      28,245       964.4      63.3      00:08:31
 30870      10   4,035      40,350       819.3      53.8      00:12:38
 31552       8   4,030      32,240       837.0      55.0      00:12:01
 18629       7   4,035      28,245       491.6      32.3      00:16:07
 16640       6   4,035      24,210       437.8      28.7      00:19:03
 31255       6   4,035      24,210       829.7      54.5      00:12:25
 36528       4   4,035      16,140       977.7      64.2      00:08:18
 31311      10   4,035      40,350       831.3      54.6      00:12:22
 31975       8   4,030      32,240       848.9      55.8      00:11:47
 19080       8   4,035      32,280       504.2      33.1      00:15:51
 16932       9   4,035      36,315       445.6      29.2      00:18:59
 31674      10   4,035      40,350       841.3      55.2      00:12:11
 36896      10   4,035      40,350       987.7      64.8      00:08:09
 31743       7   4,035      28,245       843.4      55.4      00:12:07
 32387       8   4,030      32,240       860.7      56.6      00:11:32
 19542       6   4,035      24,210       517.2      33.9      00:15:35
 17227       6   4,035      24,210       453.6      29.8      00:18:54
 32106       7   4,035      28,245       853.7      56.0      00:11:55
 37284       9   4,035      36,315       997.7      65.5      00:08:00
 32151       5   4,035      20,175       854.9      56.1      00:11:53
 32693       8   4,030      32,240       869.2      57.1      00:11:24
 20007       6   4,035      24,210       530.3      34.8      00:15:19
 17501       8   4,035      32,280       461.4      30.3      00:18:50
 32523       5   4,035      20,175       865.6      56.8      00:11:40
 37639       6   4,035      24,210     1,006.9      66.1      00:07:53
 32562      10   4,035      40,350       866.6      56.9      00:11:39
 32949      10   4,030      40,300       876.3      57.6      00:11:19
 20488       6   4,035      24,210       543.5      35.7      00:15:03
 17798       9   4,035      36,315       469.2      30.8      00:18:45
 32782       7   4,035      28,245       872.8      57.3      00:11:35
 37971       6   4,035      24,210     1,015.6      66.7      00:07:46
 32805       9   4,035      36,315       873.4      57.3      00:11:33
 33233       6   4,030      24,180       884.3      58.1      00:11:12
 20814       5   4,035      20,175       552.5      36.3      00:14:57
 18126      10   4,035      40,350       478.3      31.4      00:18:36
 33047       5   4,035      20,175       880.2      57.8      00:11:28
 38307       8   4,035      32,280     1,024.9      67.3      00:07:38
 33078      10   4,035      40,350       881.1      57.8      00:11:27
 33555      10   4,030      40,300       893.3      58.7      00:11:02
 18481      10   4,035      40,350       487.5      32.0      00:18:27
 21187       1   4,035       4,035       562.4      36.9      00:14:51
 33338       7   4,035      28,245       888.3      58.3      00:11:20
 38640       3   4,035      12,105     1,034.2      67.9      00:07:30
 33386       7   4,035      28,245       889.6      58.4      00:11:18
 33887      10   4,030      40,300       902.6      59.3      00:10:53
 18738       8   4,035      32,280       494.7      32.5      00:18:24
 21592       8   4,035      32,280       572.5      37.6      00:14:42
 33682       7   4,035      28,245       898.0      58.9      00:11:10
 38979       5   4,035      20,175     1,043.4      68.5      00:07:22
 33725       8   4,035      32,280       899.2      59.0      00:11:08
 34226       9   4,030      36,270       912.3      60.0      00:10:42
 19014       7   4,035      28,245       502.4      33.0      00:18:19
 22000       8   4,035      32,280       582.8      38.3      00:14:33
 34032       9   4,035      36,315       907.8      59.6      00:10:59
 39331       7   4,035      28,245     1,052.8      69.1      00:07:14
 34078       9   4,035      36,315       909.1      59.7      00:10:57
 34666       8   4,030      32,240       924.6      60.8      00:10:28
 19299      10   4,035      40,350       510.3      33.5      00:18:14
 22396       3   4,035      12,105       592.6      38.9      00:14:26
 34406       8   4,035      32,280       918.5      60.3      00:10:47
 39740       4   4,035      16,140     1,063.6      69.8      00:07:04
 34463       4   4,035      16,140       920.0      60.4      00:10:44
 35096       8   4,030      32,240       936.7      61.6      00:10:13
 19714       9   4,035      36,315       522.0      34.3      00:17:56
 22780       6   4,035      24,210       602.4      39.5      00:14:18
 34851      10   4,035      40,350       931.1      61.1      00:10:31
 40198       8   4,035      32,280     1,075.8      70.6      00:06:53
 34887       6   4,035      24,210       932.1      61.2      00:10:29
 35530       5   4,030      20,150       949.0      62.4      00:09:59
 20144       8   4,035      32,280       534.3      35.1      00:17:37
 23160       9   4,035      36,315       612.3      40.2      00:14:10
 35284       6   4,035      24,210       943.1      61.9      00:10:16
 40675       4   4,035      16,140     1,088.9      71.5      00:06:40
 35332       7   4,035      28,245       944.5      62.0      00:10:14
 35983       6   4,030      24,180       961.3      63.2      00:09:44
 20553       9   4,035      36,315       545.3      35.8      00:17:22
 23538      10   4,035      40,350       622.0      40.8      00:14:02
 35721       9   4,035      36,315       955.3      62.7      00:10:02
 41091      10   4,035      40,350     1,100.4      72.2      00:06:29
 35784       9   4,035      36,315       957.0      62.8      00:09:59
 36412       6   4,030      24,180       973.4      64.0      00:09:30
 20832       7   4,035      28,245       553.0      36.3      00:17:17
 23910       5   4,035      20,175       632.0      41.5      00:13:54
 36163       7   4,035      28,245       967.6      63.5      00:09:47
 41468       3   4,035      12,105     1,110.6      72.9      00:06:20
 36226       7   4,035      28,245       969.3      63.6      00:09:44
 36744       3   4,030      12,090       982.3      64.6      00:09:21
 21139       9   4,035      36,315       561.2      36.8      00:17:11
 24326       3   4,035      12,105       642.5      42.2      00:13:45
 36585       7   4,035      28,245       979.3      64.3      00:09:33
 41880       9   4,035      36,315     1,121.9      73.6      00:06:09
 36639      10   4,035      40,350       980.8      64.4      00:09:31
 37045       7   4,030      28,210       990.3      65.1      00:09:14
 21480      10   4,035      40,350       569.6      37.4      00:17:03
 24781       6   4,035      24,210       654.6      43.0      00:13:31
 36907       9   4,035      36,315       987.9      64.8      00:09:25
 42259       7   4,035      28,245     1,131.8      74.3      00:06:01
 36966       9   4,035      36,315       989.6      65.0      00:09:22
 37358       8   4,030      32,240       998.3      65.6      00:09:06
 21810       3   4,035      12,105       577.8      37.9      00:16:57
 25223      10   4,035      40,350       666.5      43.7      00:13:19
 37247       8   4,035      32,280       996.6      65.4      00:09:16
 42647       9   4,035      36,315     1,142.1      75.0      00:05:51
 37299      10   4,035      40,350       998.1      65.5      00:09:14
 37654       6   4,030      24,180     1,006.1      66.1      00:08:59
 22154       3   4,035      12,105       586.5      38.5      00:16:48
 25653      10   4,035      40,350       677.7      44.5      00:13:08
 37547       8   4,035      32,280     1,004.4      65.9      00:09:09
 43023       8   4,035      32,280     1,152.3      75.6      00:05:42
 37590       5   4,035      20,175     1,005.6      66.0      00:09:07
 37963       8   4,030      32,240     1,014.2      66.6      00:08:51
 22478       5   4,035      20,175       594.7      39.0      00:16:41
 25978       8   4,035      32,280       686.6      45.1      00:13:02
 37849       9   4,035      36,315     1,012.4      66.4      00:09:01
 43403       9   4,035      36,315     1,163.0      76.3      00:05:32
 37882       5   4,035      20,175     1,013.3      66.5      00:08:60
 38261      10   4,030      40,300     1,022.4      67.2      00:08:44
 22793       6   4,035      24,210       602.7      39.6      00:16:35
 26350       9   4,035      36,315       696.6      45.7      00:12:53
 38129       9   4,035      36,315     1,020.0      66.9      00:08:54
 43764       6   4,035      24,210     1,172.5      77.0      00:05:24
 38170       8   4,035      32,280     1,021.2      67.0      00:08:52
 38542      10   4,030      40,300     1,030.3      67.7      00:08:36
 23115       9   4,035      36,315       611.1      40.1      00:16:27
 26784       5   4,035      20,175       707.7      46.5      00:12:42
 38399       9   4,035      36,315     1,027.5      67.4      00:08:47
 44106       7   4,035      28,245     1,181.8      77.6      00:05:16
 38444       4   4,035      16,140     1,028.9      67.5      00:08:45
 38967       7   4,030      28,210     1,041.8      68.5      00:08:23
 23440       2   4,035       8,070       619.8      40.7      00:16:19
 27176       8   4,035      32,280       718.3      47.1      00:12:33
 38764       6   4,035      24,210     1,037.6      68.1      00:08:36
 44528       5   4,035      20,175     1,192.8      78.3      00:05:05
 38844       7   4,035      28,245     1,039.7      68.2      00:08:33
 39307      10   4,030      40,300     1,050.8      69.1      00:08:14
 23776       5   4,035      20,175       628.4      41.2      00:16:10
 27526       7   4,035      28,245       727.5      47.8      00:12:26
 39116       6   4,035      24,210     1,047.2      68.7      00:08:26
 44926       7   4,035      28,245     1,203.6      79.0      00:04:55
 39169       7   4,035      28,245     1,048.6      68.8      00:08:24
 39651       7   4,030      28,210     1,060.0      69.7      00:08:04
 24091       8   4,035      32,280       636.8      41.8      00:16:03
 27917       6   4,035      24,210       738.2      48.5      00:12:15
 39426       9   4,035      36,315     1,055.2      69.3      00:08:18
 45355      10   4,035      40,350     1,214.6      79.7      00:04:45
 39492       6   4,035      24,210     1,056.9      69.4      00:08:15
 40056       7   4,030      28,210     1,070.8      70.4      00:07:53
 24507       5   4,035      20,175       647.2      42.5      00:15:49
 28358       6   4,035      24,210       750.2      49.2      00:12:03
 39762       5   4,035      20,175     1,064.1      69.8      00:08:09
 45707       9   4,035      36,315     1,223.5      80.3      00:04:38
 39840       9   4,035      36,315     1,066.3      70.0      00:08:05
 40516       7   4,030      28,210     1,083.2      71.2      00:07:38
 24907       8   4,035      32,280       658.0      43.2      00:15:36
 28746       4   4,035      16,140       761.1      50.0      00:11:53
 40178       9   4,035      36,315     1,075.3      70.6      00:07:56
 46082       7   4,035      28,245     1,233.6      81.0      00:04:28
 40287      10   4,035      40,350     1,078.2      70.8      00:07:52
 40963       5   4,030      20,150     1,095.5      72.0      00:07:24
 25296       5   4,035      20,175       668.4      43.9      00:15:23
 29059       5   4,035      20,175       769.8      50.5      00:11:46
 40614       9   4,035      36,315     1,087.2      71.4      00:07:42
 46446       5   4,035      20,175     1,243.5      81.6      00:04:19
 40734       9   4,035      36,315     1,090.5      71.6      00:07:37
 41303       6   4,030      24,180     1,104.8      72.6      00:07:15
 25669      10   4,035      40,350       678.1      44.5      00:15:12
 29437       8   4,035      32,280       780.1      51.2      00:11:37
 41008       4   4,035      16,140     1,098.2      72.1      00:07:30
 46860      10   4,035      40,350     1,254.9      82.4      00:04:09
 41082       2   4,035       8,070     1,100.2      72.2      00:07:27
 41642       7   4,030      28,210     1,114.0      73.2      00:07:05
 25952       8   4,035      32,280       686.0      45.0      00:15:05
 29819       3   4,035      12,105       790.2      51.9      00:11:28
 41275       6   4,035      24,210     1,105.4      72.6      00:07:23
 47223       2   4,035       8,070     1,263.9      83.0      00:04:01
 41401       7   4,035      28,245     1,108.7      72.8      00:07:19
 41977       5   4,030      20,150     1,123.3      73.8      00:06:56
 26276       8   4,035      32,280       694.8      45.6      00:14:56
 30149       9   4,035      36,315       799.2      52.5      00:11:21
 41613       7   4,035      28,245     1,114.6      73.2      00:07:14
 47602       8   4,035      32,280     1,273.7      83.6      00:03:52
 41740       7   4,035      28,245     1,118.0      73.4      00:07:09
 42295       4   4,030      16,120     1,131.2      74.3      00:06:48
 26641       7   4,035      28,245       704.0      46.2      00:14:46
 30508      10   4,035      40,350       809.3      53.1      00:11:12
 41952       3   4,035      12,105     1,124.0      73.8      00:07:04
 47926       7   4,035      28,245     1,282.3      84.2      00:03:44
 42039       6   4,035      24,210     1,126.2      73.9      00:07:01
 42604       7   4,030      28,210     1,139.6      74.9      00:06:40
 26994       9   4,035      36,315       713.4      46.8      00:14:36
 30934       9   4,035      36,315       820.9      53.9      00:11:00
 42263      10   4,035      40,350     1,131.9      74.3      00:06:56
 48269       8   4,035      32,280     1,291.5      84.8      00:03:36
 42363       5   4,035      20,175     1,134.4      74.5      00:06:52
 42896       9   4,030      36,270     1,147.4      75.4      00:06:32
 27299       8   4,035      32,280       721.4      47.4      00:14:29
 31375       7   4,035      28,245       833.0      54.7      00:10:48
 42570       8   4,035      32,280     1,140.1      74.8      00:06:48
 48636       3   4,035      12,105     1,301.5      85.4      00:03:27
 42647       9   4,035      36,315     1,142.1      75.0      00:06:45
 43172       8   4,030      32,240     1,155.2      75.9      00:06:25
 27570       3   4,035      12,105       728.7      47.8      00:14:23
 31820       8   4,035      32,280       845.5      55.5      00:10:35
 42897       7   4,035      28,245     1,148.9      75.4      00:06:38
 49012       9   4,035      36,315     1,311.5      86.1      00:03:18
 42952       7   4,035      28,245     1,150.3      75.5      00:06:37
 43477       7   4,030      28,210     1,163.7      76.5      00:06:16
 27900       6   4,035      24,210       737.8      48.4      00:14:14
 32254       6   4,035      24,210       857.9      56.3      00:10:22
 43219      10   4,035      40,350     1,157.9      76.0      00:06:29
 49380       2   4,035       8,070     1,321.5      86.7      00:03:08
 43254       7   4,035      28,245     1,158.9      76.1      00:06:28
 43765       6   4,030      24,180     1,171.0      77.0      00:06:09
 28274      10   4,035      40,350       747.9      49.1      00:14:02
 32629       9   4,035      36,315       868.5      57.0      00:10:12
 43525       8   4,035      32,280     1,166.4      76.6      00:06:20
 49900       8   4,035      32,280     1,334.4      87.6      00:02:56
 44063       6   4,030      24,180     1,179.1      77.5      00:06:01
 43565       9   4,035      36,315     1,167.3      76.6      00:06:19
 28642       8   4,035      32,280       758.3      49.8      00:13:49
 32941       6   4,035      24,210       877.1      57.6      00:10:05
 43821      10   4,035      40,350     1,174.0      77.1      00:06:13
 50345       6   4,035      24,210     1,346.1      88.3      00:02:45
 44340       5   4,030      20,150     1,186.4      78.0      00:05:54
 43850       4   4,035      16,140     1,174.9      77.1      00:06:12
 28902       6   4,035      24,210       765.5      50.2      00:13:43
 33287      10   4,035      40,350       886.9      58.2      00:09:57
 44109       4   4,035      16,140     1,181.9      77.6      00:06:05
 50704       7   4,035      28,245     1,355.6      89.0      00:02:36
 44660       4   4,030      16,120     1,194.9      78.5      00:05:45
 44152       9   4,035      36,315     1,182.9      77.6      00:06:04
 29205       9   4,035      36,315       773.7      50.8      00:13:36
 33665       7   4,035      28,245       897.5      58.9      00:09:47
 44387       7   4,035      28,245     1,189.1      78.0      00:05:58
 51069       7   4,035      28,245     1,365.8      89.6      00:02:27
 45016      10   4,030      40,300     1,204.5      79.2      00:05:35
 44427      10   4,035      40,350     1,190.0      78.1      00:05:57
 29556       7   4,035      28,245       783.2      51.4      00:13:25
 34051       6   4,035      24,210       908.3      59.6      00:09:37
 44712       7   4,035      28,245     1,197.8      78.6      00:05:49
 51441       8   4,035      32,280     1,375.8      90.3      00:02:18
 45412       9   4,030      36,270     1,214.5      79.8      00:05:24
 44781       6   4,035      24,210     1,199.6      78.7      00:05:46
 29867       9   4,035      36,315       791.6      52.0      00:13:17
 34483       7   4,035      28,245       920.6      60.4      00:09:24
 45036      10   4,035      40,350     1,206.6      79.2      00:05:39
 51812       5   4,035      20,175     1,386.2      91.0      00:02:08
 45751       6   4,030      24,180     1,223.1      80.4      00:05:15
 45128       7   4,035      28,245     1,209.0      79.4      00:05:36
 30141      10   4,035      40,350       799.0      52.4      00:13:10
 34939       5   4,035      20,175       933.5      61.3      00:09:11
 45403       3   4,035      12,105     1,215.8      79.8      00:05:30
 52177      10   4,035      40,350     1,396.6      91.7      00:01:58
 45476       6   4,035      24,210     1,217.7      79.9      00:05:27
 46053       9   4,030      36,270     1,231.3      80.9      00:05:07
 30460       9   4,035      36,315       807.9      53.0      00:13:01
 35420       8   4,035      32,280       947.0      62.2      00:08:57
 45679       5   4,035      20,175     1,222.9      80.3      00:05:23
 52538      10   4,035      40,350     1,407.1      92.4      00:01:49
 45761       7   4,035      28,245     1,224.9      80.4      00:05:20
 46352       9   4,030      36,270     1,239.6      81.5      00:04:59
 30815       9   4,035      36,315       817.7      53.7      00:12:50
 35882      10   4,035      40,350       959.7      63.0      00:08:44
 45990       7   4,035      28,245     1,231.0      80.8      00:05:14
 52892       6   4,035      24,210     1,417.5      93.0      00:01:39
 46066       8   4,035      32,280     1,233.2      80.9      00:05:11
 46671      10   4,030      40,300     1,248.1      82.0      00:04:50
 31233       6   4,035      24,210       829.1      54.4      00:12:35
 36348       8   4,035      32,280       972.8      63.9      00:08:30
 46286       6   4,035      24,210     1,239.3      81.3      00:05:05
 53265       8   4,035      32,280     1,428.0      93.7      00:01:29
 46361       5   4,035      20,175     1,241.3      81.5      00:05:03
 46997       6   4,030      24,180     1,256.8      82.6      00:04:41
 31630       7   4,035      28,245       840.1      55.1      00:12:22
 36750      10   4,035      40,350       983.7      64.6      00:08:20
 46597      10   4,035      40,350     1,247.7      81.9      00:04:57
 53721       8   4,035      32,280     1,440.7      94.6      00:01:17
 46693       9   4,035      36,315     1,250.3      82.1      00:04:53
 47248       8   4,030      32,240     1,263.0      83.0      00:04:35
 32040       9   4,035      36,315       851.8      55.9      00:12:07
 37110       7   4,035      28,245       993.3      65.2      00:08:12
 46959      10   4,035      40,350     1,257.5      82.5      00:04:46
 54052       2   4,035       8,070     1,449.6      95.1      00:01:09
 47550       6   4,030      24,180     1,270.7      83.5      00:04:27
 47034       9   4,035      36,315     1,259.3      82.7      00:04:44
 32447      10   4,035      40,350       863.5      56.7      00:11:52
 37446       8   4,035      32,280     1,001.8      65.8      00:08:05
 47216       7   4,035      28,245     1,263.7      82.9      00:04:40
 54402       7   4,035      28,245     1,459.0      95.8      00:01:00
 47807       5   4,030      20,150     1,277.6      84.0      00:04:20
 47337       4   4,035      16,140     1,266.9      83.2      00:04:36
 32718       9   4,035      36,315       870.9      57.2      00:11:46
 37802       7   4,035      28,245     1,011.1      66.4      00:07:57
 47488       5   4,035      20,175     1,270.7      83.4      00:04:33
 54806       7   4,035      28,245     1,469.3      96.4      00:00:51
 48072       9   4,030      36,270     1,284.7      84.4      00:04:13
 47646       8   4,035      32,280     1,274.9      83.7      00:04:28
 32992       8   4,035      32,280       878.7      57.7      00:11:39
 38137       5   4,035      20,175     1,020.2      67.0      00:07:50
 47762       7   4,035      28,245     1,278.1      83.9      00:04:25
 55210       6   4,035      24,210     1,479.9      97.1      00:00:41
 47925       6   4,035      24,210     1,282.3      84.2      00:04:20
 48351       6   4,030      24,180     1,292.3      84.9      00:04:05
 33280      10   4,035      40,350       886.7      58.2      00:11:31
 38472       7   4,035      28,245     1,029.6      67.6      00:07:41
 48043       8   4,035      32,280     1,285.6      84.4      00:04:18
 55564       4   4,035      16,140     1,488.9      97.7      00:00:32
 48659      10   4,030      40,300     1,300.6      85.5      00:03:57
 48174       4   4,035      16,140     1,289.0      84.6      00:04:13
 33609       8   4,035      32,280       895.9      58.8      00:11:21
 38790       2   4,035       8,070     1,038.3      68.1      00:07:34
 48312       8   4,035      32,280     1,292.8      84.9      00:04:10
 55893       8   4,035      32,280     1,497.8      98.3      00:00:24
 48972       6   4,030      24,180     1,308.8      86.0      00:03:48
 48457       9   4,035      36,315     1,296.7      85.1      00:04:05
 33945       7   4,035      28,245       905.4      59.4      00:11:10
 39116       6   4,035      24,210     1,047.2      68.7      00:07:27
 48613       5   4,035      20,175     1,301.0      85.4      00:04:02
 56262       3   4,035      12,105     1,508.0      99.0      00:00:15
 49282       7   4,030      28,210     1,317.3      86.6      00:03:39
 48763       5   4,035      20,175     1,304.9      85.6      00:03:57
 34289       6   4,035      24,210       915.2      60.1      00:10:59
 39499       7   4,035      28,245     1,057.2      69.4      00:07:18
 48941       5   4,035      20,175     1,309.6      86.0      00:03:52
 56651       8   4,035      32,280     1,518.9      99.7      00:00:04
 49616       3   4,030      12,090     1,325.7      87.1      00:03:30
 49080       5   4,035      20,175     1,313.3      86.2      00:03:48
 34717       8   4,035      32,280       927.2      60.9      00:10:44
 39923       6   4,035      24,210     1,068.5      70.1      00:07:07
 49236       3   4,035      12,105     1,317.8      86.5      00:03:44
 49944       9   4,030      36,270     1,334.0      87.7      00:03:22
 49375       9   4,035      36,315     1,321.3      86.7      00:03:39

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1435.376
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
 35140       8   4,035      32,280       939.0      61.6      00:10:30
. gen logdist = log(dist)

. 
 40388       9   4,035      36,315     1,080.9      70.9      00:06:54
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 49541       7   4,035      28,245     1,325.5      87.0      00:03:36
 50252       6   4,030      24,180     1,342.1      88.2      00:03:13
 49662       2   4,035       8,070     1,328.4      87.2      00:03:32
 35577       7   4,035      28,245       951.3      62.4      00:10:15
 40845       4   4,035      16,140     1,093.6      71.8      00:06:42
 49841       8   4,035      32,280     1,332.9      87.5      00:03:28
 50584       8   4,030      32,240     1,350.7      88.8      00:03:04
 49941      10   4,035      40,350     1,335.5      87.7      00:03:25
 36014      10   4,035      40,350       963.4      63.2      00:09:60
 41198       9   4,035      36,315     1,103.3      72.4      00:06:33
 50138       9   4,035      36,315     1,340.8      88.0      00:03:19
 50906       8   4,030      32,240     1,359.5      89.3      00:02:55
 50235       9   4,035      36,315     1,343.3      88.2      00:03:16
 36453       5   4,035      20,175       975.7      64.0      00:09:45
 41596       5   4,035      20,175     1,114.1      73.1      00:06:23
 50472       4   4,035      16,140     1,349.3      88.6      00:03:10
 51228       9   4,030      36,270     1,368.3      89.9      00:02:45
 50553       9   4,035      36,315     1,351.5      88.7      00:03:07
 36785       7   4,035      28,245       984.5      64.6      00:09:36
 41988       1   4,035       4,035     1,125.0      73.8      00:06:13
 50784       6   4,035      24,210     1,357.8      89.1      00:03:01
 51539      10   4,030      40,300     1,376.7      90.5      00:02:36
 50857       7   4,035      28,245     1,359.8      89.2      00:02:59
 37058       9   4,035      36,315       991.9      65.1      00:09:29
 42401       6   4,035      24,210     1,135.5      74.5      00:06:03
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5.csv not
    found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5.csv saved

. 
. cap log close

. 
end of do-file
 51094       8   4,035      32,280     1,366.5      89.7      00:02:51
 51851       9   4,030      36,270     1,385.6      91.1      00:02:27
 51162       7   4,035      28,245     1,368.2      89.8      00:02:50
 37351       2   4,035       8,070       999.3      65.6      00:09:22
 42790      10   4,035      40,350     1,145.9      75.2      00:05:53
 51414       8   4,035      32,280     1,375.0      90.2      00:02:42
 52161      10   4,030      40,300     1,394.4      91.6      00:02:17
 51471      10   4,035      40,350     1,376.6      90.4      00:02:40
 37648       8   4,035      32,280     1,007.2      66.1      00:09:15
 43154       8   4,035      32,280     1,156.1      75.9      00:05:44
 51720       9   4,035      36,315     1,383.6      90.8      00:02:33
 52524       9   4,030      36,270     1,404.9      92.3      00:02:06
 51767       9   4,035      36,315     1,384.9      90.9      00:02:31
 37928       5   4,035      20,175     1,014.6      66.6      00:09:08
 43540       8   4,035      32,280     1,166.7      76.6      00:05:34
 52034       9   4,035      36,315     1,392.3      91.4      00:02:24
 52954       5   4,030      20,150     1,417.4      93.1      00:01:52
 52074       5   4,035      20,175     1,393.5      91.5      00:02:22
 38193       9   4,035      36,315     1,021.9      67.1      00:09:01
 43902       4   4,035      16,140     1,176.2      77.2      00:05:25
 52358       6   4,035      24,210     1,401.7      92.0      00:02:13
 53393       7   4,030      28,210     1,429.7      94.0      00:01:39
 52394       8   4,035      32,280     1,402.8      92.1      00:02:12
 38471       8   4,035      32,280     1,029.5      67.6      00:08:54
 44285       7   4,035      28,245     1,186.5      77.9      00:05:16
 52766       7   4,035      28,245     1,413.8      92.8      00:01:60
 53791       7   4,030      28,210     1,440.8      94.7      00:01:27
 52805      10   4,035      40,350     1,415.0      92.9      00:01:58
 38855       8   4,035      32,280     1,040.1      68.3      00:08:42
 44690       8   4,035      32,280     1,197.2      78.6      00:05:06
 53196       7   4,035      28,245     1,426.0      93.6      00:01:46
 54094       3   4,030      12,090     1,448.9      95.2      00:01:18
 53249       4   4,035      16,140     1,427.5      93.7      00:01:44
 39167       9   4,035      36,315     1,048.5      68.8      00:08:33
 45100       7   4,035      28,245     1,208.2      79.3      00:04:56
 53619       6   4,035      24,210     1,437.9      94.4      00:01:33
 54375       8   4,030      32,240     1,456.5      95.7      00:01:10
 53680       7   4,035      28,245     1,439.5      94.5      00:01:31
 39478       8   4,035      32,280     1,056.6      69.4      00:08:25
 45518       8   4,035      32,280     1,218.9      80.0      00:04:45
 53926       2   4,035       8,070     1,446.1      94.9      00:01:24
 54703       9   4,030      36,270     1,464.7      96.3      00:01:01
 53974       9   4,035      36,315     1,447.4      95.0      00:01:23
 39812       6   4,035      24,210     1,065.4      69.9      00:08:15
 45937       6   4,035      24,210     1,229.5      80.7      00:04:36
 54213       7   4,035      28,245     1,453.9      95.4      00:01:16
 55038       5   4,030      20,150     1,473.6      96.8      00:00:52
 54269       7   4,035      28,245     1,455.4      95.5      00:01:14
 40240       7   4,035      28,245     1,077.0      70.7      00:08:02
 46313       3   4,035      12,105     1,240.1      81.4      00:04:26
 54497       6   4,035      24,210     1,461.2      95.9      00:01:08
 55361       7   4,030      28,210     1,481.9      97.4      00:00:43
 54573       7   4,035      28,245     1,463.0      96.0      00:01:06
 40687      10   4,035      40,350     1,089.2      71.5      00:07:47
 46734       9   4,035      36,315     1,251.4      82.1      00:04:15
 54866       5   4,035      20,175     1,470.8      96.5      00:00:57
 55647       5   4,030      20,150     1,489.1      97.9      00:00:35
 54915       7   4,035      28,245     1,472.2      96.6      00:00:56
 41054       7   4,035      28,245     1,099.4      72.2      00:07:36
 47135       3   4,035      12,105     1,261.8      82.8      00:04:05
 55189       7   4,035      28,245     1,479.4      97.1      00:00:48
 55909      10   4,030      40,300     1,496.4      98.3      00:00:27
 55232      10   4,035      40,350     1,480.5      97.2      00:00:47
 41333       9   4,035      36,315     1,107.0      72.7      00:07:29
 47524       7   4,035      28,245     1,271.6      83.5      00:03:56
 55498       7   4,035      28,245     1,487.3      97.6      00:00:40
 56224       7   4,030      28,210     1,505.1      98.9      00:00:18
 55524       7   4,035      28,245     1,488.0      97.7      00:00:39
 41681       8   4,035      32,280     1,116.5      73.3      00:07:18
 47896       8   4,035      32,280     1,281.5      84.1      00:03:47
 55769       3   4,035      12,105     1,494.4      98.1      00:00:32
 56548       6   4,030      24,180     1,514.2      99.5      00:00:08
 55794       8   4,035      32,280     1,495.1      98.1      00:00:31
 41998       3   4,035      12,105     1,125.2      73.9      00:07:09
 48270       4   4,035      16,140     1,291.5      84.8      00:03:38
 56045       5   4,035      20,175     1,502.0      98.6      00:00:24
 56100       5   4,035      20,175     1,503.4      98.7      00:00:22
 42305       4   4,035      16,140     1,132.9      74.4      00:07:01
 48683       6   4,035      24,210     1,302.8      85.5      00:03:27

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,030     
Bases * Neighbors  (M)  = 1,521.7        Number of regions         = 56,821    
Computed distances (M)  = 1,521.69       Total run time (seconds)  = 1648.836
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 56362       7   4,035      28,245     1,510.7      99.2      00:00:14
 56420       9   4,035      36,315     1,512.4      99.3      00:00:12
 42576       5   4,035      20,175     1,140.3      74.8      00:06:54
 49108       7   4,035      28,245     1,314.1      86.3      00:03:16
 56670       9   4,035      36,315     1,519.5      99.7      00:00:04
 56748       5   4,035      20,175     1,521.6      99.9      00:00:02
 42866      10   4,035      40,350     1,148.1      75.4      00:06:46
 49566       8   4,035      32,280     1,326.1      87.0      00:03:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1673.122
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1675.06
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 43152       9   4,035      36,315     1,156.0      75.9      00:06:38
 50093       9   4,035      36,315     1,339.6      87.9      00:02:52
 43451       9   4,035      36,315     1,164.4      76.4      00:06:29
 50541       3   4,035      12,105     1,351.2      88.7      00:02:41
 43758       3   4,035      12,105     1,172.3      76.9      00:06:21
 50937       8   4,035      32,280     1,362.1      89.4      00:02:31
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100.csv saved

. 
. cap log close

. 
end of do-file
 44056      10   4,035      40,350     1,180.4      77.5      00:06:13
 51358       4   4,035      16,140     1,373.4      90.1      00:02:20
 44345       7   4,035      28,245     1,188.0      78.0      00:06:05
 51742       9   4,035      36,315     1,384.3      90.9      00:02:10
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100
    > .csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100.csv sa
> ved

. 
. cap log close

. 
end of do-file
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5.csv
    not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5.csv saved

. 
. cap log close

. 
end of do-file
 44695       6   4,035      24,210     1,197.3      78.6      00:05:55
 52136       9   4,035      36,315     1,395.3      91.6      00:01:60
 45066       9   4,035      36,315     1,207.4      79.2      00:05:44
 52526       9   4,035      36,315     1,406.7      92.3      00:01:49
 45435       7   4,035      28,245     1,216.6      79.9      00:05:34
 52906      10   4,035      40,350     1,417.9      93.1      00:01:39
 45739       7   4,035      28,245     1,224.4      80.4      00:05:26
 53302      10   4,035      40,350     1,429.0      93.8      00:01:28
 46057       8   4,035      32,280     1,233.0      80.9      00:05:16
 53788       5   4,035      20,175     1,442.5      94.7      00:01:15
 46379       6   4,035      24,210     1,241.8      81.5      00:05:07
 54164       7   4,035      28,245     1,452.6      95.3      00:01:06
 46728       6   4,035      24,210     1,251.3      82.1      00:04:56
 54582       5   4,035      20,175     1,463.2      96.0      00:00:56
 47062       8   4,035      32,280     1,259.9      82.7      00:04:47
 54997      10   4,035      40,350     1,474.4      96.8      00:00:46
 47386       8   4,035      32,280     1,268.2      83.2      00:04:38
 55411       2   4,035       8,070     1,485.0      97.5      00:00:36
 47701       9   4,035      36,315     1,276.4      83.8      00:04:30
 55780       7   4,035      28,245     1,494.7      98.1      00:00:27
 47988       7   4,035      28,245     1,284.1      84.3      00:04:22
 56163       9   4,035      36,315     1,505.2      98.8      00:00:17
 48277       9   4,035      36,315     1,291.7      84.8      00:04:14
 56566       6   4,035      24,210     1,516.6      99.5      00:00:07
 48654      10   4,035      40,350     1,302.0      85.5      00:04:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1426.562
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 49031      10   4,035      40,350     1,312.0      86.1      00:03:51
 49405       4   4,035      16,140     1,322.0      86.8      00:03:40
 49790       6   4,035      24,210     1,331.6      87.4      00:03:29
 50148       8   4,035      32,280     1,341.1      88.0      00:03:19
 50550       5   4,035      20,175     1,351.4      88.7      00:03:08
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100
    > .csv not found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5_R100.csv sa
> ved

. 
. cap log close

. 
end of do-file
 50943       5   4,035      20,175     1,362.2      89.4      00:02:56
 51348       4   4,035      16,140     1,373.2      90.1      00:02:43
 51728       9   4,035      36,315     1,383.9      90.8      00:02:32
 52127       6   4,035      24,210     1,395.0      91.6      00:02:19
 52504       7   4,035      28,245     1,406.0      92.3      00:02:07
 52887       9   4,035      36,315     1,417.3      93.0      00:01:55
 53301       7   4,035      28,245     1,429.0      93.8      00:01:42
 53755       6   4,035      24,210     1,441.6      94.6      00:01:28
 54054       3   4,035      12,105     1,449.6      95.1      00:01:20
 54399      10   4,035      40,350     1,458.9      95.8      00:01:10
 54802       2   4,035       8,070     1,469.2      96.4      00:00:59
 55239       7   4,035      28,245     1,480.7      97.2      00:00:46
 55653       8   4,035      32,280     1,491.1      97.9      00:00:35
 56004       5   4,035      20,175     1,500.8      98.5      00:00:24
 56396       4   4,035      16,140     1,511.8      99.2      00:00:13
 56748       5   4,035      20,175     1,521.6      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1642.977
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5.csv
    not found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.5.csv saved

. 
. cap log close

. 
end of do-file
