
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A700_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   207      10   4,735      47,350         5.6       0.3      00:52:56
   449       6   4,735      28,410        12.2       0.7      00:48:30
   653       6   4,735      28,410        18.0       1.0      00:49:07
   857      10   4,735      47,350        24.1       1.3      00:48:59
  1058      10   4,735      47,350        30.1       1.7      00:48:44
  1245      10   4,735      47,350        35.9       2.0      00:48:57
  1449       7   4,735      33,145        42.3       2.4      00:48:13
  1642       8   4,735      37,880        48.3       2.7      00:48:10
  1850       8   4,735      37,880        54.5       3.1      00:47:46
  2082      10   4,735      47,350        61.4       3.4      00:46:56
  2277      10   4,735      47,350        67.4       3.8      00:46:54
  2488       8   4,735      37,880        73.6       4.1      00:46:41
  2681       4   4,735      18,940        79.5       4.4      00:46:39
  2867       6   4,735      28,410        85.4       4.8      00:46:35
  3094       7   4,735      33,145        92.2       5.2      00:46:05
  3283       8   4,735      37,880        98.5       5.5      00:45:50
  3459       8   4,735      37,880       104.1       5.8      00:45:57
  3665      10   4,735      47,350       110.4       6.2      00:45:41
  3881       6   4,735      28,410       117.0       6.6      00:45:18
  4039       9   4,735      42,615       121.6       6.8      00:45:47
  4172       7   4,735      33,145       125.6       7.0      00:46:26
  4309       7   4,735      33,145       129.4       7.2      00:47:07
  4458       6   4,735      28,410       133.8       7.5      00:47:29
  4606       8   4,735      37,880       138.6       7.8      00:47:44
  4736       8   4,735      37,880       142.7       8.0      00:48:09
  4868       9   4,735      42,615       146.7       8.2      00:48:36
  4972       7   4,735      33,145       149.9       8.4      00:49:18
  5132       6   4,735      28,410       154.7       8.7      00:49:23
  5268       6   4,735      28,410       158.9       8.9      00:49:42
  5376       5   4,735      23,675       162.5       9.1      00:50:10
  5475       3   4,735      14,205       165.1       9.2      00:50:55
  5596       9   4,735      42,615       168.5       9.4      00:51:24
  5720       9   4,735      42,615       172.1       9.6      00:51:48
  5854       4   4,735      18,940       176.1       9.9      00:52:00
  6002      10   4,735      47,350       180.8      10.1      00:51:60
  6133       6   4,735      28,410       184.8      10.3      00:52:11
  6236       9   4,735      42,615       188.0      10.5      00:52:39
  6375       9   4,735      42,615       192.0      10.7      00:52:48
  6495      10   4,735      47,350       195.6      10.9      00:53:04
  6615       7   4,735      33,145       199.1      11.1      00:53:21
  6716       8   4,735      37,880       202.1      11.3      00:53:47
  6815       2   4,735       9,470       205.2      11.5      00:54:09
  6929       7   4,735      33,145       208.7      11.7      00:54:23
  7076       9   4,735      42,615       213.0      11.9      00:54:22
  7265       9   4,735      42,615       218.5      12.2      00:54:01
  7406       7   4,735      33,145       223.1      12.5      00:53:56
  7548       8   4,735      37,880       227.5      12.7      00:53:53
  7694       9   4,735      42,615       231.9      13.0      00:53:50
  7847      10   4,735      47,350       236.8      13.3      00:53:38
  8000       7   4,735      33,145       241.9      13.5      00:53:24
  8123       7   4,735      33,145       245.9      13.8      00:53:27
  8282       8   4,735      37,880       251.0      14.0      00:53:13
  8442       8   4,735      37,880       256.3      14.3      00:52:56
  8589      10   4,735      47,350       261.0      14.6      00:52:48
  8737       8   4,735      37,880       265.7      14.9      00:52:40
  8895       6   4,735      28,410       270.9      15.2      00:52:25
  9050       7   4,735      33,145       275.8      15.4      00:52:14
  9180       9   4,735      42,615       280.1      15.7      00:52:12
  9289      10   4,735      47,350       283.7      15.9      00:52:18
  9368       8   4,735      37,880       286.2      16.0      00:52:38
  9485       7   4,735      33,145       290.0      16.2      00:52:41
  9595      10   4,735      47,350       293.7      16.4      00:52:44
  9733       8   4,735      37,880       298.2      16.7      00:52:37
  9866       6   4,735      28,410       302.4      16.9      00:52:34
  9995       5   4,735      23,675       306.3      17.1      00:52:34
 10120       3   4,735      14,205       309.8      17.3      00:52:39
 10241       6   4,735      28,410       313.3      17.5      00:52:44
 10355       9   4,735      42,615       316.8      17.7      00:52:48
 10498       4   4,735      18,940       321.2      18.0      00:52:40
 10652       9   4,735      42,615       325.8      18.2      00:52:31
 10786       5   4,735      23,675       329.8      18.5      00:52:29
 10932       8   4,735      37,880       334.4      18.7      00:52:19
 11080       9   4,735      42,615       338.9      19.0      00:52:11
 11187       5   4,735      23,675       342.2      19.2      00:52:15
 11291       6   4,735      28,410       345.3      19.3      00:52:23
 11401       8   4,735      37,880       348.8      19.5      00:52:25
 11493       4   4,735      18,940       351.8      19.7      00:52:33
 11608       8   4,735      37,880       355.1      19.9      00:52:37
 11716       9   4,735      42,615       358.5      20.1      00:52:40
 11837       6   4,735      28,410       362.3      20.3      00:52:37
 11952       7   4,735      33,145       365.8      20.5      00:52:39
 12051       9   4,735      42,615       369.0      20.7      00:52:43
 12164       9   4,735      42,615       372.6      20.9      00:52:42
 12268       6   4,735      28,410       375.7      21.0      00:52:47
 12469       5   4,735      23,675       381.8      21.4      00:52:19
 12681       5   4,735      23,675       388.4      21.7      00:51:48
 12875       9   4,735      42,615       394.1      22.1      00:51:26
 13089       6   4,735      28,410       400.7      22.4      00:50:56
 13305       7   4,735      33,145       407.4      22.8      00:50:24
 13480      10   4,735      47,350       413.3      23.1      00:50:02
 13582       9   4,735      42,615       416.7      23.3      00:50:03
 13688       9   4,735      42,615       420.0      23.5      00:50:05
 13798       9   4,735      42,615       423.3      23.7      00:50:07
 13911       9   4,735      42,615       426.7      23.9      00:50:07
 14058      10   4,735      47,350       431.3      24.1      00:49:57
 14212       7   4,735      33,145       436.2      24.4      00:49:43
 14358       7   4,735      33,145       441.0      24.7      00:49:31
 14484       7   4,735      33,145       445.0      24.9      00:49:26
 14575      10   4,735      47,350       447.8      25.1      00:49:31
 14711       7   4,735      33,145       452.0      25.3      00:49:24
 14855       8   4,735      37,880       456.6      25.6      00:49:14
 15045       8   4,735      37,880       462.8      25.9      00:48:49
 15264       5   4,735      23,675       469.8      26.3      00:48:18
 15457       6   4,735      28,410       475.9      26.6      00:47:56
 15657       7   4,735      33,145       482.1      27.0      00:47:32
 15813       9   4,735      42,615       487.1      27.3      00:47:19
 15985       8   4,735      37,880       492.8      27.6      00:47:00
 16172       7   4,735      33,145       499.0      27.9      00:46:38
 16341       9   4,735      42,615       504.6      28.2      00:46:20
 16477       2   4,735       9,470       509.1      28.5      00:46:12
 16628       5   4,735      23,675       513.5      28.7      00:46:03
 16754       9   4,735      42,615       517.6      29.0      00:45:57
 16888       8   4,735      37,880       521.8      29.2      00:45:50
 17001       8   4,735      37,880       525.5      29.4      00:45:47
 17143       7   4,735      33,145       529.8      29.7      00:45:39
 17254       7   4,735      33,145       533.4      29.9      00:45:37
 17345       8   4,735      37,880       536.4      30.0      00:45:38
 17441       7   4,735      33,145       539.6      30.2      00:45:39
 17548       6   4,735      28,410       543.2      30.4      00:45:35
 17660       9   4,735      42,615       546.9      30.6      00:45:32
 17804       6   4,735      28,410       551.1      30.8      00:45:24
 17929       7   4,735      33,145       555.0      31.1      00:45:18
 18080      10   4,735      47,350       560.0      31.3      00:45:06
 18279       7   4,735      33,145       566.3      31.7      00:44:43
 18464       8   4,735      37,880       571.8      32.0      00:44:27
 18554       4   4,735      18,940       574.7      32.2      00:44:28
 18657       8   4,735      37,880       578.2      32.4      00:44:26
 18750       5   4,735      23,675       581.2      32.5      00:44:26
 18846       9   4,735      42,615       584.2      32.7      00:44:26
 18973       8   4,735      37,880       588.5      32.9      00:44:18
 19111       2   4,735       9,470       593.0      33.2      00:44:08
 19213      10   4,735      47,350       596.4      33.4      00:44:05
 19327       4   4,735      18,940       600.0      33.6      00:44:01
 19482       9   4,735      42,615       605.2      33.9      00:43:47
 19652       7   4,735      33,145       610.8      34.2      00:43:30
 19804       6   4,735      28,410       615.9      34.5      00:43:17
 19955       7   4,735      33,145       620.9      34.8      00:43:03
 20087       7   4,735      33,145       625.4      35.0      00:42:53
 20286       5   4,735      23,675       631.6      35.4      00:42:33
 20465       8   4,735      37,880       637.3      35.7      00:42:15
 20562      10   4,735      47,350       640.6      35.9      00:42:14
 20664       6   4,735      28,410       643.8      36.0      00:42:11
 20760       8   4,735      37,880       646.9      36.2      00:42:10
 20869       7   4,735      33,145       650.5      36.4      00:42:06
 20982       9   4,735      42,615       654.1      36.6      00:42:02
 21114       6   4,735      28,410       658.0      36.8      00:41:55
 21225      10   4,735      47,350       661.2      37.0      00:41:53
 21369      10   4,735      47,350       665.3      37.2      00:41:45
 21491       5   4,735      23,675       669.1      37.5      00:41:39
 21616       6   4,735      28,410       672.8      37.7      00:41:34
 21739       8   4,735      37,880       676.3      37.9      00:41:30
 21856       8   4,735      37,880       679.9      38.1      00:41:25
 22002      10   4,735      47,350       684.3      38.3      00:41:15
 22140       7   4,735      33,145       688.2      38.5      00:41:09
 22270       7   4,735      33,145       692.0      38.7      00:41:03
 22378       7   4,735      33,145       695.2      38.9      00:41:00
 22492       2   4,735       9,470       698.7      39.1      00:40:55
 22587       7   4,735      33,145       701.6      39.3      00:40:54
 22681       6   4,735      28,410       704.5      39.4      00:40:53
 22814       4   4,735      18,940       707.9      39.6      00:40:49
 22958       4   4,735      18,940       712.4      39.9      00:40:38
 23128       5   4,735      23,675       717.8      40.2      00:40:23
 23277       5   4,735      23,675       722.6      40.4      00:40:11
 23439       8   4,735      37,880       727.4      40.7      00:39:59
 23641       5   4,735      23,675       733.3      41.0      00:39:41
 23828       9   4,735      42,615       739.3      41.4      00:39:21
 24035      10   4,735      47,350       745.7      41.7      00:39:01
 24226       4   4,735      18,940       751.3      42.1      00:38:45
 24400       5   4,735      23,675       756.3      42.3      00:38:32
 24575       9   4,735      42,615       762.0      42.7      00:38:15
 24746       4   4,735      18,940       767.3      42.9      00:38:01
 24929       8   4,735      37,880       772.9      43.3      00:37:46
 25113      10   4,735      47,350       778.9      43.6      00:37:28
 25288       5   4,735      23,675       784.3      43.9      00:37:13
 25469       4   4,735      18,940       790.1      44.2      00:36:57
 25609       8   4,735      37,880       794.1      44.4      00:36:49
 25709       9   4,735      42,615       797.4      44.6      00:36:45
 25820       7   4,735      33,145       801.1      44.8      00:36:39
 25922       9   4,735      42,615       804.3      45.0      00:36:36
 26030       7   4,735      33,145       807.7      45.2      00:36:31
 26161       5   4,735      23,675       811.8      45.4      00:36:23
 26279       6   4,735      28,410       815.6      45.7      00:36:16
 26450       8   4,735      37,880       820.7      45.9      00:36:03
 26610       7   4,735      33,145       825.5      46.2      00:35:51
 26768       7   4,735      33,145       830.5      46.5      00:35:39
 26931       4   4,735      18,940       835.6      46.8      00:35:26
 27045       9   4,735      42,615       839.1      47.0      00:35:20
 27138       9   4,735      42,615       842.1      47.1      00:35:18
 27261       4   4,735      18,940       845.8      47.3      00:35:11
 27372       7   4,735      33,145       849.2      47.5      00:35:06
 27461       6   4,735      28,410       852.0      47.7      00:35:04
 27547       6   4,735      28,410       854.7      47.8      00:35:02
 27670       6   4,735      28,410       858.7      48.1      00:34:54
 27824       8   4,735      37,880       863.7      48.3      00:34:42
 28011       6   4,735      28,410       869.6      48.7      00:34:25
 28223       8   4,735      37,880       876.3      49.0      00:34:04
 28413      10   4,735      47,350       882.6      49.4      00:33:46
 28605       7   4,735      33,145       889.1      49.8      00:33:27
 28708       8   4,735      37,880       892.3      49.9      00:33:23
 28819      10   4,735      47,350       896.0      50.1      00:33:16
 28934       9   4,735      42,615       899.7      50.4      00:33:10
 29037       4   4,735      18,940       903.0      50.5      00:33:05
 29142       7   4,735      33,145       906.4      50.7      00:32:60
 29292       8   4,735      37,880       911.0      51.0      00:32:49
 29430       9   4,735      42,615       915.6      51.2      00:32:38
 29565       5   4,735      23,675       919.6      51.5      00:32:30
 29700       5   4,735      23,675       923.9      51.7      00:32:21
 29790       6   4,735      28,410       926.8      51.9      00:32:18
 29894       7   4,735      33,145       930.1      52.1      00:32:13
 29980      10   4,735      47,350       932.9      52.2      00:32:10
 30061       7   4,735      33,145       935.5      52.4      00:32:08
 30160       9   4,735      42,615       938.8      52.5      00:32:03
 30274      10   4,735      47,350       942.4      52.7      00:31:56
 30397      10   4,735      47,350       946.3      53.0      00:31:49
 30529       6   4,735      28,410       950.7      53.2      00:31:39
 30719       5   4,735      23,675       956.7      53.6      00:31:22
 30915      10   4,735      47,350       963.1      53.9      00:31:04
 31106       9   4,735      42,615       969.1      54.2      00:30:47
 31308      10   4,735      47,350       975.8      54.6      00:30:28
 31465       6   4,735      28,410       981.0      54.9      00:30:15
 31616       7   4,735      33,145       985.8      55.2      00:30:03
 31795      10   4,735      47,350       991.8      55.5      00:29:47
 31939       7   4,735      33,145       996.7      55.8      00:29:35
 32122       8   4,735      37,880     1,002.7      56.1      00:29:19
 32308       9   4,735      42,615     1,009.0      56.5      00:29:01
 32489       4   4,735      18,940     1,015.1      56.8      00:28:45
 32595       8   4,735      37,880     1,018.5      57.0      00:28:40
 32682       6   4,735      28,410     1,021.3      57.2      00:28:36
 32767       6   4,735      28,410     1,024.1      57.3      00:28:33
 32869       7   4,735      33,145     1,027.4      57.5      00:28:27
 32987       7   4,735      33,145     1,031.3      57.7      00:28:19
 33101       9   4,735      42,615     1,035.1      57.9      00:28:12
 33242      10   4,735      47,350     1,039.7      58.2      00:28:01
 33361      10   4,735      47,350     1,043.5      58.4      00:27:54
 33489       8   4,735      37,880     1,047.7      58.6      00:27:45
 33604      10   4,735      47,350     1,051.7      58.9      00:27:36
 33725       6   4,735      28,410     1,055.6      59.1      00:27:29
 33854       7   4,735      33,145     1,059.9      59.3      00:27:19
 33984       8   4,735      37,880     1,064.1      59.6      00:27:10
 34083       8   4,735      37,880     1,067.5      59.7      00:27:04
 34193       3   4,735      14,205     1,071.3      60.0      00:26:56
 34396      10   4,735      47,350     1,077.9      60.3      00:26:38
 34586       4   4,735      18,940     1,084.1      60.7      00:26:22
 34743      10   4,735      47,350     1,089.4      61.0      00:26:08
 34937      10   4,735      47,350     1,095.8      61.3      00:25:51
 35145       7   4,735      33,145     1,102.6      61.7      00:25:33
 35351       5   4,735      23,675     1,109.4      62.1      00:25:15
 35549       6   4,735      28,410     1,115.9      62.5      00:24:57
 35759       9   4,735      42,615     1,122.6      62.8      00:24:39
 35964       7   4,735      33,145     1,129.3      63.2      00:24:21
 36134       9   4,735      42,615     1,135.0      63.5      00:24:07
 36320       8   4,735      37,880     1,141.1      63.9      00:23:52
 36494       6   4,735      28,410     1,146.6      64.2      00:23:38
 36591       8   4,735      37,880     1,149.8      64.4      00:23:33
 36683       1   4,735       4,735     1,152.6      64.5      00:23:29
 36781       9   4,735      42,615     1,155.7      64.7      00:23:24
 36882       7   4,735      33,145     1,159.0      64.9      00:23:18
 36982       7   4,735      33,145     1,162.0      65.0      00:23:13
 37125       2   4,735       9,470     1,166.5      65.3      00:23:03
 37238       9   4,735      42,615     1,169.7      65.5      00:22:57
 37357       6   4,735      28,410     1,173.3      65.7      00:22:50
 37472      10   4,735      47,350     1,176.8      65.9      00:22:44
 37573       5   4,735      23,675     1,179.9      66.0      00:22:38
 37693       9   4,735      42,615     1,183.5      66.2      00:22:31
 37791      10   4,735      47,350     1,186.6      66.4      00:22:26
 37920       4   4,735      18,940     1,190.7      66.6      00:22:17
 38041      10   4,735      47,350     1,194.6      66.9      00:22:09
 38165       4   4,735      18,940     1,198.6      67.1      00:22:01
 38300       5   4,735      23,675     1,202.9      67.3      00:21:51
 38427       7   4,735      33,145     1,207.2      67.6      00:21:42
 38569       8   4,735      37,880     1,211.8      67.8      00:21:31
 38752      10   4,735      47,350     1,217.6      68.2      00:21:17
 38919       9   4,735      42,615     1,222.9      68.4      00:21:04
 39028       5   4,735      23,675     1,226.5      68.6      00:20:57
 39152       7   4,735      33,145     1,230.3      68.9      00:20:49
 39288       9   4,735      42,615     1,234.5      69.1      00:20:40
 39465       5   4,735      23,675     1,239.9      69.4      00:20:27
 39578       8   4,735      37,880     1,243.5      69.6      00:20:19
 39686       6   4,735      28,410     1,246.8      69.8      00:20:13
 39826       5   4,735      23,675     1,251.2      70.0      00:20:03
 40007       6   4,735      28,410     1,256.9      70.4      00:19:49
 40206       8   4,735      37,880     1,263.1      70.7      00:19:34
 40382       7   4,735      33,145     1,268.7      71.0      00:19:20
 40590       6   4,735      28,410     1,275.5      71.4      00:19:03
 40771      10   4,735      47,350     1,281.3      71.7      00:18:49
 40924       8   4,735      37,880     1,286.4      72.0      00:18:37
 41002      10   4,735      47,350     1,288.9      72.1      00:18:33
 41111       9   4,735      42,615     1,292.3      72.3      00:18:26
 41241      10   4,735      47,350     1,296.5      72.6      00:18:17
 41386      10   4,735      47,350     1,301.0      72.8      00:18:07
 41526       7   4,735      33,145     1,305.6      73.1      00:17:57
 41675       7   4,735      33,145     1,310.3      73.3      00:17:46
 41832       8   4,735      37,880     1,315.4      73.6      00:17:34
 41946       1   4,735       4,735     1,319.2      73.8      00:17:26
 42074       8   4,735      37,880     1,322.9      74.0      00:17:19
 42209       8   4,735      37,880     1,326.9      74.3      00:17:10
 42343       5   4,735      23,675     1,331.0      74.5      00:17:01
 42432       8   4,735      37,880     1,334.0      74.7      00:16:55
 42538      10   4,735      47,350     1,337.3      74.8      00:16:49
 42654      10   4,735      47,350     1,340.8      75.0      00:16:42
 42808       9   4,735      42,615     1,345.7      75.3      00:16:31
 42986       8   4,735      37,880     1,351.4      75.6      00:16:17
 43136       4   4,735      18,940     1,356.5      75.9      00:16:05
 43302       9   4,735      42,615     1,361.9      76.2      00:15:52
 43503       3   4,735      14,205     1,368.3      76.6      00:15:37
 43764       6   4,735      28,410     1,376.3      77.0      00:15:16
 44055       6   4,735      28,410     1,385.6      77.6      00:14:53
 44143      10   4,735      47,350     1,388.2      77.7      00:14:48
 44209       9   4,735      42,615     1,390.4      77.8      00:14:44
 44313       4   4,735      18,940     1,393.5      78.0      00:14:38
 44500       8   4,735      37,880     1,399.3      78.3      00:14:25
 44742       9   4,735      42,615     1,406.9      78.7      00:14:06
 44965       8   4,735      37,880     1,414.1      79.1      00:13:48
 45194       9   4,735      42,615     1,421.0      79.5      00:13:32
 45355       8   4,735      37,880     1,425.5      79.8      00:13:21
 45485       4   4,735      18,940     1,429.6      80.0      00:13:13
 45585      10   4,735      47,350     1,432.5      80.2      00:13:07
 45707       6   4,735      28,410     1,436.1      80.4      00:12:60
 45872       8   4,735      37,880     1,441.1      80.7      00:12:48
 46045       4   4,735      18,940     1,446.7      81.0      00:12:35
 46206       6   4,735      28,410     1,452.0      81.3      00:12:23
 46364       8   4,735      37,880     1,457.0      81.6      00:12:12
 46531      10   4,735      47,350     1,462.3      81.8      00:11:59
 46725       7   4,735      33,145     1,468.6      82.2      00:11:45
 46901       7   4,735      33,145     1,474.2      82.5      00:11:32
 47053       9   4,735      42,615     1,478.5      82.8      00:11:22
 47205       9   4,735      42,615     1,482.9      83.0      00:11:13
 47337       6   4,735      28,410     1,486.9      83.2      00:11:04
 47472       9   4,735      42,615     1,490.9      83.5      00:10:55
 47600       8   4,735      37,880     1,494.9      83.7      00:10:47
 47706       9   4,735      42,615     1,498.3      83.9      00:10:40
 47808       8   4,735      37,880     1,501.4      84.0      00:10:34
 47926       6   4,735      28,410     1,505.2      84.3      00:10:25
 48057      10   4,735      47,350     1,509.3      84.5      00:10:16
 48243       9   4,735      42,615     1,515.1      84.8      00:10:03
 48431       8   4,735      37,880     1,521.1      85.1      00:09:49
 48615       6   4,735      28,410     1,527.0      85.5      00:09:36
 48805       7   4,735      33,145     1,532.9      85.8      00:09:22
 48978      10   4,735      47,350     1,538.3      86.1      00:09:10
 49133       6   4,735      28,410     1,543.4      86.4      00:08:58
 49290      10   4,735      47,350     1,548.3      86.7      00:08:47
 49421       2   4,735       9,470     1,552.1      86.9      00:08:39
 49544       5   4,735      23,675     1,555.7      87.1      00:08:31
 49658       7   4,735      33,145     1,559.0      87.3      00:08:25
 49772       8   4,735      37,880     1,562.4      87.4      00:08:17
 49879      10   4,735      47,350     1,565.6      87.6      00:08:11
 49970       8   4,735      37,880     1,568.6      87.8      00:08:04
 50094      10   4,735      47,350     1,572.4      88.0      00:07:56
 50276       5   4,735      23,675     1,577.8      88.3      00:07:44
 50405       9   4,735      42,615     1,581.6      88.5      00:07:36
 50503       9   4,735      42,615     1,584.8      88.7      00:07:29
 50655       5   4,735      23,675     1,589.5      89.0      00:07:18
 50804       4   4,735      18,940     1,594.4      89.2      00:07:07
 50932       8   4,735      37,880     1,598.7      89.5      00:06:58
 51040       9   4,735      42,615     1,602.4      89.7      00:06:50
 51274       9   4,735      42,615     1,609.6      90.1      00:06:33
 51489       5   4,735      23,675     1,616.5      90.5      00:06:17
 51662       7   4,735      33,145     1,622.3      90.8      00:06:04
 51861       7   4,735      33,145     1,628.8      91.2      00:05:49
 52053       6   4,735      28,410     1,635.1      91.5      00:05:35
 52299       9   4,735      42,615     1,643.4      92.0      00:05:16
 52505       4   4,735      18,940     1,650.6      92.4      00:04:60
 52711      10   4,735      47,350     1,657.8      92.8      00:04:43
 52893       4   4,735      18,940     1,663.9      93.1      00:04:30
 53123       9   4,735      42,615     1,671.5      93.6      00:04:13
 53320       6   4,735      28,410     1,678.0      93.9      00:03:58
 53502       4   4,735      18,940     1,683.9      94.3      00:03:45
 53704      10   4,735      47,350     1,690.5      94.6      00:03:30
 53826       8   4,735      37,880     1,694.4      94.8      00:03:22
 53951       6   4,735      28,410     1,698.3      95.1      00:03:13
 54122       9   4,735      42,615     1,703.8      95.4      00:03:01
 54245       7   4,735      33,145     1,707.6      95.6      00:02:53
 54358       8   4,735      37,880     1,711.1      95.8      00:02:45
 54555       8   4,735      37,880     1,716.7      96.1      00:02:33
 54807       4   4,735      18,940     1,724.5      96.5      00:02:16
 54989       9   4,735      42,615     1,730.3      96.8      00:02:03
 55108       4   4,735      18,940     1,734.0      97.1      00:01:55
 55239       6   4,735      28,410     1,738.0      97.3      00:01:46
 55422       8   4,735      37,880     1,743.3      97.6      00:01:35
 55615       8   4,735      37,880     1,749.2      97.9      00:01:22
 55804       6   4,735      28,410     1,755.2      98.2      00:01:09
 55967      10   4,735      47,350     1,760.5      98.5      00:00:57
 56156      10   4,735      47,350     1,766.6      98.9      00:00:44
 56299       6   4,735      28,410     1,771.2      99.1      00:00:33
 56421       7   4,735      33,145     1,775.4      99.4      00:00:24
 56604       9   4,735      42,615     1,781.4      99.7      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 3898.408
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
