
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A900.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A900.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A900.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A900.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   307       8   4,935      39,480         8.5       0.5      00:36:12
   667       6   4,935      29,610        19.1       1.0      00:32:15
  1004       6   4,935      29,610        29.4       1.6      00:31:15
  1360       7   4,935      34,545        41.0       2.2      00:29:42
  1696       7   4,935      34,545        52.0       2.8      00:29:06
  2029       8   4,935      39,480        62.1       3.3      00:29:03
  2392       9   4,935      44,415        73.6       4.0      00:28:24
  2735      10   4,935      49,350        84.5       4.5      00:28:08
  3092      10   4,935      49,350        95.7       5.1      00:27:45
  3392       6   4,935      29,610       105.9       5.7      00:27:42
  3727       9   4,935      44,415       116.9       6.3      00:27:27
  3996       9   4,935      44,415       125.1       6.7      00:27:51
  4283       2   4,935       9,870       133.9       7.2      00:28:02
  4517       5   4,935      24,675       141.3       7.6      00:28:30
  4751       7   4,935      34,545       149.0       8.0      00:28:49
  4945       6   4,935      29,610       155.2       8.3      00:29:25
  5218       6   4,935      29,610       163.9       8.8      00:29:26
  5447       9   4,935      44,415       171.3       9.2      00:29:41
  5750      10   4,935      49,350       180.1       9.7      00:29:39
  6001       3   4,935      14,805       188.1      10.1      00:29:45
  6202       7   4,935      34,545       194.5      10.4      00:30:06
  6458      10   4,935      49,350       202.5      10.9      00:30:08
  6672       5   4,935      24,675       209.1      11.2      00:30:24
  6907       7   4,935      34,545       216.5      11.6      00:30:29
  7166      10   4,935      49,350       224.4      12.0      00:30:30
  7463       7   4,935      34,545       234.1      12.6      00:30:13
  7753       5   4,935      24,675       243.4      13.1      00:30:01
  8058       5   4,935      24,675       253.9      13.6      00:29:39
  8323       8   4,935      39,480       262.8      14.1      00:29:30
  8632      10   4,935      49,350       273.3      14.7      00:29:09
  8912       6   4,935      29,610       282.6      15.2      00:28:57
  9210       8   4,935      39,480       292.7      15.7      00:28:41
  9412      10   4,935      49,350       299.5      16.1      00:28:47
  9614      10   4,935      49,350       306.5      16.4      00:28:51
  9880       9   4,935      44,415       315.4      16.9      00:28:42
 10087       5   4,935      24,675       322.0      17.3      00:28:47
 10335       5   4,935      24,675       329.2      17.7      00:28:48
 10569       6   4,935      29,610       336.8      18.1      00:28:46
 10861       4   4,935      19,740       346.0      18.6      00:28:34
 11136       9   4,935      44,415       354.8      19.0      00:28:24
 11328       7   4,935      34,545       360.9      19.4      00:28:30
 11539       3   4,935      14,805       367.8      19.7      00:28:31
 11755       9   4,935      44,415       374.6      20.1      00:28:32
 11921       7   4,935      34,545       380.0      20.4      00:28:41
 12081       7   4,935      34,545       385.4      20.7      00:28:49
 12254       6   4,935      29,610       391.0      21.0      00:28:56
 12540       6   4,935      29,610       400.2      21.5      00:28:42
 12909       7   4,935      34,545       411.6      22.1      00:28:17
 13212       7   4,935      34,545       421.4      22.6      00:28:00
 13559       7   4,935      34,545       433.2      23.2      00:27:35
 13746       6   4,935      29,610       439.4      23.6      00:27:36
 13949       3   4,935      14,805       445.8      23.9      00:27:37
 14221       8   4,935      39,480       454.7      24.4      00:27:26
 14460       6   4,935      29,610       462.7      24.8      00:27:18
 14739       5   4,935      24,675       471.8      25.3      00:27:06
 14967      10   4,935      49,350       479.4      25.7      00:27:00
 15329       8   4,935      39,480       491.5      26.4      00:26:34
 15626       6   4,935      29,610       501.2      26.9      00:26:20
 15930       7   4,935      34,545       511.4      27.4      00:26:03
 16238       6   4,935      29,610       522.0      28.0      00:25:45
 16527       8   4,935      39,480       531.9      28.5      00:25:30
 16789      10   4,935      49,350       540.4      29.0      00:25:21
 16959      10   4,935      49,350       546.0      29.3      00:25:24
 17117       4   4,935      19,740       551.1      29.6      00:25:27
 17303       6   4,935      29,610       557.3      29.9      00:25:27
 17459       6   4,935      29,610       562.7      30.2      00:25:29
 17651       8   4,935      39,480       569.4      30.6      00:25:26
 17832       8   4,935      39,480       575.0      30.9      00:25:27
 18105      10   4,935      49,350       584.2      31.4      00:25:14
 18429       9   4,935      44,415       594.7      31.9      00:24:57
 18684       8   4,935      39,480       603.2      32.4      00:24:47
 18843       8   4,935      39,480       608.5      32.7      00:24:48
 19020       7   4,935      34,545       614.7      33.0      00:24:46
 19193       6   4,935      29,610       620.6      33.3      00:24:45
 19391      10   4,935      49,350       627.2      33.7      00:24:42
 19670      10   4,935      49,350       636.8      34.2      00:24:27
 20005       4   4,935      19,740       648.5      34.8      00:24:06
 20349       6   4,935      29,610       660.0      35.4      00:23:46
 20575       6   4,935      29,610       667.8      35.8      00:23:38
 20771       9   4,935      44,415       674.3      36.2      00:23:34
 20932       6   4,935      29,610       679.8      36.5      00:23:34
 21206       2   4,935       9,870       688.4      36.9      00:23:23
 21429       1   4,935       4,935       694.9      37.3      00:23:19
 21679       8   4,935      39,480       702.9      37.7      00:23:10
 21890       9   4,935      44,415       709.4      38.1      00:23:06
 22068       9   4,935      44,415       715.0      38.4      00:23:05
 22308       7   4,935      34,545       722.1      38.8      00:22:58
 22506       8   4,935      39,480       728.4      39.1      00:22:55
 22758       5   4,935      24,675       736.1      39.5      00:22:46
 23050       4   4,935      19,740       745.2      40.0      00:22:34
 23366       7   4,935      34,545       755.8      40.6      00:22:17
 23697       6   4,935      29,610       765.9      41.1      00:22:02
 24006       8   4,935      39,480       776.0      41.6      00:21:46
 24317       8   4,935      39,480       785.6      42.2      00:21:33
 24656       9   4,935      44,415       796.7      42.8      00:21:15
 24932       3   4,935      14,805       805.4      43.2      00:21:04
 25251       8   4,935      39,480       816.0      43.8      00:20:48
 25514       8   4,935      39,480       824.7      44.3      00:20:37
 25738       6   4,935      29,610       831.7      44.6      00:20:31
 25961       8   4,935      39,480       839.2      45.0      00:20:23
 26150       5   4,935      24,675       845.5      45.4      00:20:19
 26374       8   4,935      39,480       852.7      45.8      00:20:12
 26589       9   4,935      44,415       859.5      46.1      00:20:06
 26868       7   4,935      34,545       868.3      46.6      00:19:55
 27077       7   4,935      34,545       875.2      47.0      00:19:48
 27289       8   4,935      39,480       882.0      47.3      00:19:42
 27463       7   4,935      34,545       887.7      47.6      00:19:39
 27684       6   4,935      29,610       895.0      48.0      00:19:31
 27879       9   4,935      44,415       901.6      48.4      00:19:26
 28256       4   4,935      19,740       914.0      49.1      00:19:05
 28538       9   4,935      44,415       923.9      49.6      00:18:52
 28803       8   4,935      39,480       932.9      50.1      00:18:40
 28980      10   4,935      49,350       938.9      50.4      00:18:35
 29177      10   4,935      49,350       945.4      50.7      00:18:30
 29365       6   4,935      29,610       951.6      51.1      00:18:25
 29646       8   4,935      39,480       960.7      51.6      00:18:12
 29805      10   4,935      49,350       966.1      51.8      00:18:09
 29971       8   4,935      39,480       971.6      52.1      00:18:06
 30111      10   4,935      49,350       976.3      52.4      00:18:04
 30339       9   4,935      44,415       983.9      52.8      00:17:55
 30572      10   4,935      49,350       991.9      53.2      00:17:46
 30823       6   4,935      29,610     1,000.4      53.7      00:17:35
 31151       9   4,935      44,415     1,011.1      54.3      00:17:19
 31449       9   4,935      44,415     1,021.4      54.8      00:17:05
 31776       6   4,935      29,610     1,032.6      55.4      00:16:48
 32066       9   4,935      44,415     1,042.7      56.0      00:16:34
 32357       8   4,935      39,480     1,052.9      56.5      00:16:20
 32575       7   4,935      34,545     1,060.4      56.9      00:16:12
 32754       7   4,935      34,545     1,066.4      57.2      00:16:06
 32913       8   4,935      39,480     1,071.8      57.5      00:16:03
 33070       7   4,935      34,545     1,077.3      57.8      00:15:58
 33281       7   4,935      34,545     1,084.5      58.2      00:15:50
 33517       9   4,935      44,415     1,092.5      58.6      00:15:41
 33751       6   4,935      29,610     1,100.6      59.1      00:15:31
 33971       8   4,935      39,480     1,108.2      59.5      00:15:22
 34190       7   4,935      34,545     1,115.9      59.9      00:15:13
 34505       8   4,935      39,480     1,126.8      60.5      00:14:58
 34851      10   4,935      49,350     1,138.7      61.1      00:14:40
 35257       7   4,935      34,545     1,152.6      61.9      00:14:19
 35637      10   4,935      49,350     1,165.5      62.5      00:14:00
 36049       7   4,935      34,545     1,179.5      63.3      00:13:40
 36443       9   4,935      44,415     1,193.0      64.0      00:13:20
 36706       9   4,935      44,415     1,201.7      64.5      00:13:09
 36935       7   4,935      34,545     1,209.3      64.9      00:13:01
 37236       8   4,935      39,480     1,218.6      65.4      00:12:49
 37524      10   4,935      49,350     1,227.7      65.9      00:12:38
 37776       8   4,935      39,480     1,235.8      66.3      00:12:28
 38001      10   4,935      49,350     1,243.2      66.7      00:12:20
 38247       4   4,935      19,740     1,251.5      67.2      00:12:10
 38493       8   4,935      39,480     1,259.9      67.6      00:12:00
 38852       8   4,935      39,480     1,271.9      68.3      00:11:44
 39165       7   4,935      34,545     1,282.3      68.8      00:11:31
 39479       8   4,935      39,480     1,292.3      69.4      00:11:18
 39780      10   4,935      49,350     1,302.1      69.9      00:11:06
 40176      10   4,935      49,350     1,315.1      70.6      00:10:48
 40552       5   4,935      24,675     1,327.7      71.2      00:10:31
 40934       7   4,935      34,545     1,340.4      71.9      00:10:14
 41214       7   4,935      34,545     1,349.9      72.4      00:10:02
 41556       7   4,935      34,545     1,361.3      73.1      00:09:48
 41867       7   4,935      34,545     1,371.7      73.6      00:09:35
 42142       4   4,935      19,740     1,380.6      74.1      00:09:24
 42433       7   4,935      34,545     1,390.0      74.6      00:09:13
 42704      10   4,935      49,350     1,398.7      75.1      00:09:03
 42992       9   4,935      44,415     1,408.2      75.6      00:08:51
 43245       4   4,935      19,740     1,417.1      76.0      00:08:41
 43513       4   4,935      19,740     1,426.1      76.5      00:08:30
 43744       5   4,935      24,675     1,433.3      76.9      00:08:22
 43975      10   4,935      49,350     1,441.1      77.3      00:08:14
 44244      10   4,935      49,350     1,449.8      77.8      00:08:03
 44503       9   4,935      44,415     1,458.1      78.2      00:07:54
 44771       6   4,935      29,610     1,466.9      78.7      00:07:43
 45103       7   4,935      34,545     1,477.8      79.3      00:07:30
 45430       6   4,935      29,610     1,487.8      79.8      00:07:18
 45723       7   4,935      34,545     1,497.0      80.3      00:07:07
 45993      10   4,935      49,350     1,505.7      80.8      00:06:57
 46265       8   4,935      39,480     1,515.0      81.3      00:06:46
 46549       6   4,935      29,610     1,524.4      81.8      00:06:35
 46897       7   4,935      34,545     1,536.1      82.4      00:06:20
 47208       9   4,935      44,415     1,545.3      82.9      00:06:09
 47365       8   4,935      39,480     1,550.4      83.2      00:06:04
 47540       7   4,935      34,545     1,555.8      83.5      00:05:59
 47782      10   4,935      49,350     1,563.8      83.9      00:05:50
 48053       8   4,935      39,480     1,572.6      84.4      00:05:39
 48311       5   4,935      24,675     1,581.1      84.8      00:05:29
 48614       9   4,935      44,415     1,591.2      85.4      00:05:17
 48903       7   4,935      34,545     1,600.5      85.9      00:05:06
 49220       8   4,935      39,480     1,611.2      86.5      00:04:53
 49482       6   4,935      29,610     1,619.4      86.9      00:04:44
 49770      10   4,935      49,350     1,628.0      87.4      00:04:34
 50049       9   4,935      44,415     1,637.0      87.8      00:04:23
 50309       3   4,935      14,805     1,645.2      88.3      00:04:14
 50562       5   4,935      24,675     1,653.3      88.7      00:04:05
 50833      10   4,935      49,350     1,662.4      89.2      00:03:54
 51081       9   4,935      44,415     1,670.9      89.7      00:03:44
 51376       9   4,935      44,415     1,680.4      90.2      00:03:33
 51671       9   4,935      44,415     1,690.5      90.7      00:03:21
 51999       7   4,935      34,545     1,701.7      91.3      00:03:08
 52320       8   4,935      39,480     1,713.0      91.9      00:02:54
 52749       6   4,935      29,610     1,728.6      92.8      00:02:36
 53128       8   4,935      39,480     1,741.8      93.5      00:02:20
 53518       9   4,935      44,415     1,755.1      94.2      00:02:04
 53853       8   4,935      39,480     1,766.4      94.8      00:01:51
 54177       6   4,935      29,610     1,777.1      95.4      00:01:39
 54533       6   4,935      29,610     1,788.1      96.0      00:01:26
 54901       8   4,935      39,480     1,800.1      96.6      00:01:12
 55250       9   4,935      44,415     1,811.4      97.2      00:00:59
 55582       7   4,935      34,545     1,821.5      97.8      00:00:48
 55853       9   4,935      44,415     1,830.5      98.2      00:00:38
 56182       8   4,935      39,480     1,841.5      98.8      00:00:25
 56546       7   4,935      34,545     1,854.2      99.5      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 2117.197
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A900.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A900.csv saved

. 
. cap log close

. 
end of do-file
