
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A100.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   386       8   4,135      33,080         9.1       0.6      00:28:27
   744       3   4,135      12,405        18.0       1.2      00:28:34
  1122       3   4,135      12,405        27.8       1.8      00:27:41
  1451       6   4,135      24,810        36.8       2.4      00:27:39
  1837       8   4,135      33,080        47.1       3.0      00:26:51
  2163      10   4,135      41,350        55.7       3.6      00:27:06
  2565       7   4,135      28,945        66.1       4.2      00:26:26
  2942       6   4,135      24,810        76.3       4.9      00:26:00
  3336       9   4,135      37,215        87.2       5.6      00:25:25
  3670       3   4,135      12,405        96.3       6.2      00:25:24
  3994       7   4,135      28,945       104.7       6.7      00:25:33
  4238       9   4,135      37,215       111.1       7.1      00:26:10
  4548      10   4,135      41,350       119.2       7.6      00:26:17
  4806       8   4,135      33,080       126.3       8.1      00:26:35
  5068       6   4,135      24,810       133.4       8.5      00:26:50
  5307       9   4,135      37,215       139.7       8.9      00:27:13
  5506       7   4,135      28,945       144.8       9.3      00:27:48
  5703       8   4,135      33,080       149.7       9.6      00:28:22
  5914       8   4,135      33,080       155.2       9.9      00:28:46
  6229       8   4,135      33,080       163.7      10.5      00:28:32
  6486       9   4,135      37,215       170.5      10.9      00:28:38
  6814      10   4,135      41,350       178.9      11.5      00:28:24
  7059       4   4,135      16,540       185.4      11.9      00:28:32
  7442       9   4,135      37,215       195.6      12.5      00:28:00
  7770      10   4,135      41,350       204.4      13.1      00:27:44
  8115       5   4,135      20,675       214.3      13.7      00:27:18
  8387       8   4,135      33,080       222.0      14.2      00:27:13
  8761       6   4,135      24,810       232.5      14.9      00:26:44
  9077       6   4,135      24,810       241.4      15.5      00:26:29
  9324       8   4,135      33,080       248.5      15.9      00:26:29
  9517       9   4,135      37,215       254.0      16.3      00:26:39
  9733       7   4,135      28,945       260.3      16.7      00:26:43
  9945       7   4,135      28,945       266.1      17.0      00:26:50
 10211       5   4,135      20,675       272.7      17.5      00:26:50
 10428       9   4,135      37,215       278.4      17.8      00:26:57
 10683       6   4,135      24,810       285.2      18.3      00:26:55
 10983       4   4,135      16,540       293.3      18.8      00:26:44
 11261       4   4,135      16,540       300.6      19.3      00:26:37
 11476       7   4,135      28,945       306.5      19.6      00:26:40
 11726       8   4,135      33,080       313.2      20.1      00:26:38
 11948       9   4,135      37,215       319.2      20.4      00:26:39
 12197       8   4,135      33,080       326.1      20.9      00:26:34
 12509       7   4,135      28,945       334.4      21.4      00:26:21
 12839       7   4,135      28,945       343.0      22.0      00:26:06
 13197       6   4,135      24,810       352.7      22.6      00:25:46
 13521       7   4,135      28,945       361.9      23.2      00:25:28
 13754       5   4,135      20,675       368.3      23.6      00:25:26
 13957       5   4,135      20,675       373.7      23.9      00:25:29
 14274      10   4,135      41,350       382.5      24.5      00:25:13
 14560       7   4,135      28,945       390.5      25.0      00:25:02
 14845      10   4,135      41,350       398.3      25.5      00:24:53
 15198       9   4,135      37,215       408.3      26.2      00:24:32
 15600       3   4,135      12,405       419.2      26.9      00:24:07
 15939       9   4,135      37,215       428.8      27.5      00:23:49
 16309      10   4,135      41,350       439.5      28.1      00:23:27
 16590      10   4,135      41,350       447.3      28.7      00:23:18
 16934       5   4,135      20,675       456.7      29.3      00:23:02
 17127       7   4,135      28,945       462.1      29.6      00:23:03
 17366       5   4,135      20,675       468.8      30.0      00:22:58
 17600       6   4,135      24,810       475.7      30.5      00:22:53
 17853       9   4,135      37,215       482.4      30.9      00:22:47
 18186      10   4,135      41,350       491.8      31.5      00:22:31
 18487       7   4,135      28,945       499.7      32.0      00:22:21
 18763       9   4,135      37,215       507.7      32.5      00:22:11
 18973      10   4,135      41,350       513.7      32.9      00:22:09
 19214       6   4,135      24,810       520.6      33.3      00:22:03
 19532       9   4,135      37,215       529.7      33.9      00:21:48
 19847      10   4,135      41,350       538.8      34.5      00:21:34
 20241      10   4,135      41,350       550.1      35.2      00:21:11
 20554       8   4,135      33,080       558.9      35.8      00:20:58
 20791       7   4,135      28,945       565.6      36.2      00:20:53
 21020       8   4,135      33,080       572.0      36.6      00:20:48
 21299       7   4,135      28,945       578.9      37.1      00:20:42
 21561       8   4,135      33,080       586.1      37.5      00:20:34
 21863       3   4,135      12,405       593.6      38.0      00:20:25
 22181       6   4,135      24,810       601.8      38.5      00:20:15
 22409       7   4,135      28,945       607.6      38.9      00:20:11
 22695       7   4,135      28,945       615.3      39.4      00:20:02
 22949       5   4,135      20,675       621.6      39.8      00:19:57
 23228       8   4,135      33,080       629.4      40.3      00:19:47
 23406       6   4,135      24,810       634.2      40.6      00:19:47
 23644       6   4,135      24,810       640.3      41.0      00:19:42
 23824      10   4,135      41,350       645.3      41.3      00:19:41
 24073       6   4,135      24,810       652.0      41.8      00:19:34
 24421       7   4,135      28,945       660.8      42.3      00:19:21
 24775       7   4,135      28,945       670.7      43.0      00:19:05
 25123      10   4,135      41,350       680.3      43.6      00:18:49
 25467       7   4,135      28,945       689.7      44.2      00:18:35
 25778       8   4,135      33,080       698.1      44.7      00:18:23
 25983       5   4,135      20,675       703.7      45.1      00:18:19
 26236       6   4,135      24,810       710.8      45.5      00:18:11
 26462       9   4,135      37,215       716.7      45.9      00:18:07
 26761       6   4,135      24,810       724.6      46.4      00:17:56
 26978       9   4,135      37,215       730.7      46.8      00:17:51
 27210       7   4,135      28,945       736.9      47.2      00:17:45
 27360       9   4,135      37,215       741.0      47.5      00:17:45
 27527       8   4,135      33,080       745.6      47.8      00:17:44
 27819       9   4,135      37,215       753.7      48.3      00:17:32
 28088       3   4,135      12,405       761.2      48.8      00:17:23
 28399       6   4,135      24,810       770.0      49.3      00:17:10
 28682       5   4,135      20,675       778.2      49.8      00:16:59
 28916       8   4,135      33,080       784.8      50.3      00:16:51
 29124       6   4,135      24,810       790.7      50.6      00:16:46
 29414       7   4,135      28,945       798.7      51.2      00:16:35
 29708       5   4,135      20,675       806.7      51.7      00:16:24
 29955       8   4,135      33,080       813.7      52.1      00:16:16
 30154       9   4,135      37,215       819.2      52.5      00:16:11
 30466       8   4,135      33,080       828.1      53.0      00:15:58
 30730       6   4,135      24,810       835.5      53.5      00:15:49
 31112       8   4,135      33,080       846.1      54.2      00:15:32
 31512       5   4,135      20,675       857.7      54.9      00:15:13
 31853      10   4,135      41,350       867.5      55.6      00:14:58
 32195       8   4,135      33,080       877.4      56.2      00:14:43
 32546       9   4,135      37,215       887.7      56.9      00:14:27
 32707       5   4,135      20,675       892.2      57.1      00:14:24
 32948       7   4,135      28,945       899.1      57.6      00:14:16
 33128       9   4,135      37,215       904.4      57.9      00:14:12
 33485       6   4,135      24,810       914.4      58.6      00:13:57
 33829       9   4,135      37,215       924.5      59.2      00:13:42
 34157       5   4,135      20,675       934.0      59.8      00:13:28
 34515       6   4,135      24,810       944.4      60.5      00:13:12
 34853       5   4,135      20,675       954.2      61.1      00:12:58
 35271       6   4,135      24,810       966.2      61.9      00:12:39
 35623       7   4,135      28,945       976.2      62.5      00:12:25
 35999       7   4,135      28,945       986.9      63.2      00:12:09
 36366       7   4,135      28,945       997.4      63.9      00:11:54
 36651       7   4,135      28,945     1,005.5      64.4      00:11:44
 36859       5   4,135      20,675     1,011.0      64.8      00:11:38
 37051       7   4,135      28,945     1,016.3      65.1      00:11:33
 37321       4   4,135      16,540     1,023.3      65.5      00:11:25
 37558       8   4,135      33,080     1,029.6      65.9      00:11:18
 37784       8   4,135      33,080     1,035.7      66.3      00:11:11
 38033       9   4,135      37,215     1,042.5      66.8      00:11:03
 38292       8   4,135      33,080     1,049.9      67.2      00:10:54
 38541       7   4,135      28,945     1,057.1      67.7      00:10:45
 38882       7   4,135      28,945     1,066.6      68.3      00:10:32
 39158      10   4,135      41,350     1,074.3      68.8      00:10:23
 39386       4   4,135      16,540     1,080.4      69.2      00:10:16
 39724       8   4,135      33,080     1,089.5      69.8      00:10:03
 40038       9   4,135      37,215     1,098.2      70.3      00:09:52
 40431       9   4,135      37,215     1,108.9      71.0      00:09:36
 40785       8   4,135      33,080     1,119.0      71.7      00:09:23
 41045       7   4,135      28,945     1,126.4      72.1      00:09:13
 41339       6   4,135      24,810     1,134.6      72.7      00:09:03
 41694       8   4,135      33,080     1,144.4      73.3      00:08:49
 42039       6   4,135      24,810     1,154.1      73.9      00:08:36
 42382       5   4,135      20,675     1,163.1      74.5      00:08:24
 42680      10   4,135      41,350     1,171.3      75.0      00:08:14
 42987       9   4,135      37,215     1,179.8      75.6      00:08:03
 43278       5   4,135      20,675     1,188.3      76.1      00:07:52
 43563       8   4,135      33,080     1,196.2      76.6      00:07:42
 43880       8   4,135      33,080     1,204.8      77.2      00:07:31
 44199       9   4,135      37,215     1,213.5      77.7      00:07:19
 44511      10   4,135      41,350     1,222.0      78.3      00:07:09
 44893       9   4,135      37,215     1,232.5      78.9      00:06:54
 45287       8   4,135      33,080     1,243.1      79.6      00:06:40
 45600       6   4,135      24,810     1,251.1      80.1      00:06:30
 45945       8   4,135      33,080     1,260.3      80.7      00:06:18
 46272      10   4,135      41,350     1,269.6      81.3      00:06:06
 46601       9   4,135      37,215     1,278.8      81.9      00:05:54
 46983       5   4,135      20,675     1,289.2      82.6      00:05:41
 47288       5   4,135      20,675     1,297.0      83.1      00:05:31
 47631       8   4,135      33,080     1,306.0      83.6      00:05:19
 47966       6   4,135      24,810     1,315.3      84.2      00:05:07
 48294       9   4,135      37,215     1,324.3      84.8      00:04:56
 48628       3   4,135      12,405     1,333.6      85.4      00:04:44
 48977       5   4,135      20,675     1,343.1      86.0      00:04:32
 49336       9   4,135      37,215     1,353.1      86.7      00:04:19
 49688       6   4,135      24,810     1,361.9      87.2      00:04:08
 50012       8   4,135      33,080     1,370.7      87.8      00:03:57
 50367       6   4,135      24,810     1,380.0      88.4      00:03:45
 50747       9   4,135      37,215     1,390.4      89.0      00:03:32
 51117       5   4,135      20,675     1,401.0      89.7      00:03:18
 51503       5   4,135      20,675     1,411.6      90.4      00:03:05
 51861       9   4,135      37,215     1,422.0      91.1      00:02:52
 52199       9   4,135      37,215     1,431.9      91.7      00:02:39
 52565       7   4,135      28,945     1,442.8      92.4      00:02:26
 52946       4   4,135      16,540     1,454.2      93.1      00:02:11
 53317       8   4,135      33,080     1,464.8      93.8      00:01:58
 53747      10   4,135      41,350     1,477.1      94.6      00:01:43
 54041       8   4,135      33,080     1,485.2      95.1      00:01:33
 54342       3   4,135      12,405     1,493.5      95.7      00:01:23
 54710       8   4,135      33,080     1,503.1      96.3      00:01:11
 55099       8   4,135      33,080     1,513.7      96.9      00:00:58
 55476       8   4,135      33,080     1,523.5      97.6      00:00:46
 55801      10   4,135      41,350     1,532.4      98.1      00:00:35
 56153       5   4,135      20,675     1,542.2      98.8      00:00:23
 56504       6   4,135      24,810     1,552.4      99.4      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1898.148
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A100.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A100.csv saved

. 
. cap log close

. 
end of do-file
