
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A400.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   156       7   4,435      31,045         3.8       0.2      01:13:38
   498       5   4,435      22,175        12.7       0.8      00:43:36
   894       8   4,435      35,480        23.4       1.4      00:35:18
  1249       7   4,435      31,045        33.7       2.0      00:32:30
  1609      10   4,435      44,350        44.3       2.6      00:30:41
  1990       4   4,435      17,740        54.9       3.3      00:29:30
  2363       7   4,435      31,045        65.5       3.9      00:28:40
  2732       6   4,435      26,610        76.1       4.5      00:28:02
  3107       9   4,435      39,915        86.8       5.2      00:27:28
  3449       3   4,435      13,305        97.1       5.8      00:27:04
  3803      10   4,435      44,350       107.4       6.4      00:26:45
  4110       9   4,435      39,915       115.8       6.9      00:26:55
  4397       7   4,435      31,045       123.6       7.4      00:27:13
  4678       5   4,435      22,175       132.0       7.9      00:27:18
  4962       9   4,435      39,915       140.1       8.4      00:27:24
  5232       7   4,435      31,045       147.8       8.8      00:27:34
  5503       8   4,435      35,480       155.3       9.3      00:27:45
  5753       2   4,435       8,870       162.2       9.7      00:27:60
  6023       7   4,435      31,045       170.0      10.2      00:28:03
  6304       7   4,435      31,045       177.8      10.6      00:28:05
  6576       8   4,435      35,480       185.5      11.1      00:28:07
  6862       8   4,435      35,480       193.5      11.6      00:28:05
  7198       9   4,435      39,915       202.8      12.1      00:27:51
  7522       1   4,435       4,435       212.3      12.7      00:27:35
  7843       6   4,435      26,610       221.7      13.2      00:27:20
  8152       5   4,435      22,175       231.3      13.8      00:27:04
  8467       5   4,435      22,175       240.8      14.4      00:26:49
  8782       8   4,435      35,480       250.2      15.0      00:26:35
  9090       9   4,435      39,915       259.6      15.5      00:26:22
  9355       7   4,435      31,045       267.7      16.0      00:26:18
  9600       5   4,435      22,175       275.3      16.4      00:26:17
  9853       7   4,435      31,045       282.8      16.9      00:26:16
 10109       5   4,435      22,175       289.9      17.3      00:26:17
 10355       9   4,435      39,915       296.7      17.7      00:26:20
 10615       8   4,435      35,480       304.1      18.2      00:26:19
 10913      10   4,435      44,350       312.7      18.7      00:26:09
 11193       8   4,435      35,480       320.7      19.2      00:26:03
 11415       8   4,435      35,480       327.2      19.6      00:26:06
 11654       6   4,435      26,610       334.0      20.0      00:26:06
 11904       1   4,435       4,435       341.2      20.4      00:26:04
 12147       6   4,435      26,610       348.5      20.8      00:26:01
 12450       9   4,435      39,915       357.0      21.3      00:25:51
 12788       7   4,435      31,045       366.7      21.9      00:25:35
 13140       8   4,435      35,480       376.8      22.5      00:25:17
 13474       7   4,435      31,045       386.9      23.1      00:24:59
 13718       9   4,435      39,915       394.3      23.6      00:24:55
 13975       6   4,435      26,610       401.6      24.0      00:24:51
 14264      10   4,435      44,350       410.1      24.5      00:24:41
 14544      10   4,435      44,350       418.6      25.0      00:24:31
 14836       7   4,435      31,045       427.1      25.5      00:24:21
 15175      10   4,435      44,350       437.5      26.1      00:24:03
 15524       6   4,435      26,610       447.6      26.7      00:23:46
 15880       7   4,435      31,045       458.3      27.4      00:23:27
 16212       7   4,435      31,045       468.6      28.0      00:23:11
 16532       4   4,435      17,740       478.3      28.6      00:22:56
 16782       7   4,435      31,045       485.7      29.0      00:22:52
 17017       9   4,435      39,915       492.7      29.4      00:22:48
 17262       7   4,435      31,045       499.8      29.9      00:22:44
 17496       7   4,435      31,045       507.3      30.3      00:22:38
 17744       5   4,435      22,175       514.5      30.7      00:22:34
 18025       5   4,435      22,175       522.7      31.2      00:22:25
 18374       7   4,435      31,045       533.2      31.9      00:22:08
 18650       8   4,435      35,480       541.3      32.3      00:21:60
 18904       8   4,435      35,480       549.1      32.8      00:21:53
 19145      10   4,435      44,350       556.6      33.3      00:21:46
 19440      10   4,435      44,350       565.5      33.8      00:21:35
 19775       6   4,435      26,610       576.0      34.4      00:21:19
 20106       9   4,435      39,915       586.4      35.0      00:21:03
 20445       8   4,435      35,480       596.4      35.6      00:20:48
 20666      10   4,435      44,350       603.1      36.0      00:20:44
 20895       7   4,435      31,045       610.1      36.5      00:20:39
 21160       1   4,435       4,435       617.6      36.9      00:20:34
 21416       5   4,435      22,175       624.4      37.3      00:20:30
 21671       6   4,435      26,610       631.8      37.8      00:20:24
 21942       3   4,435      13,305       639.2      38.2      00:20:17
 22216       8   4,435      35,480       646.8      38.7      00:20:10
 22479       9   4,435      39,915       654.1      39.1      00:20:03
 22746       8   4,435      35,480       661.4      39.5      00:19:57
 23007       4   4,435      17,740       668.7      40.0      00:19:50
 23260       6   4,435      26,610       676.3      40.4      00:19:43
 23543       7   4,435      31,045       684.0      40.9      00:19:35
 23794       6   4,435      26,610       691.5      41.3      00:19:28
 24057       6   4,435      26,610       699.1      41.8      00:19:20
 24380       8   4,435      35,480       707.8      42.3      00:19:09
 24689       8   4,435      35,480       717.2      42.9      00:18:56
 25014      10   4,435      44,350       726.4      43.4      00:18:44
 25328       5   4,435      22,175       735.8      44.0      00:18:32
 25612       8   4,435      35,480       743.9      44.5      00:18:23
 25805       8   4,435      35,480       749.9      44.8      00:18:19
 26027      10   4,435      44,350       756.4      45.2      00:18:14
 26292       3   4,435      13,305       764.3      45.7      00:18:05
 26573       6   4,435      26,610       772.2      46.1      00:17:57
 26868       7   4,435      31,045       780.8      46.7      00:17:46
 27112       5   4,435      22,175       787.9      47.1      00:17:39
 27321       8   4,435      35,480       794.0      47.4      00:17:35
 27463       7   4,435      31,045       798.1      47.7      00:17:36
 27698       6   4,435      26,610       805.1      48.1      00:17:29
 27939       9   4,435      39,915       812.4      48.5      00:17:21
 28233      10   4,435      44,350       821.1      49.1      00:17:10
 28515       8   4,435      35,480       829.9      49.6      00:16:59
 28765       6   4,435      26,610       837.6      50.1      00:16:51
 28989       8   4,435      35,480       844.3      50.5      00:16:44
 29252       7   4,435      31,045       852.0      50.9      00:16:36
 29512       5   4,435      22,175       859.8      51.4      00:16:27
 29755       6   4,435      26,610       867.1      51.8      00:16:19
 29975       5   4,435      22,175       873.6      52.2      00:16:13
 30179       7   4,435      31,045       879.8      52.6      00:16:08
 30406       8   4,435      35,480       886.6      53.0      00:16:01
 30663       6   4,435      26,610       894.4      53.4      00:15:52
 30987       7   4,435      31,045       904.2      54.0      00:15:38
 31288       7   4,435      31,045       913.3      54.6      00:15:26
 31609       6   4,435      26,610       923.2      55.2      00:15:13
 31915       9   4,435      39,915       932.8      55.7      00:14:60
 32226      10   4,435      44,350       942.5      56.3      00:14:46
 32511       8   4,435      35,480       951.4      56.9      00:14:35
 32704       9   4,435      39,915       957.2      57.2      00:14:30
 32918       8   4,435      35,480       963.9      57.6      00:14:24
 33120      10   4,435      44,350       970.2      58.0      00:14:18
 33380      10   4,435      44,350       978.1      58.4      00:14:08
 33639       7   4,435      31,045       986.1      58.9      00:13:59
 33896       7   4,435      31,045       994.0      59.4      00:13:49
 34148       9   4,435      39,915     1,002.0      59.9      00:13:40
 34463       6   4,435      26,610     1,011.7      60.5      00:13:27
 34783       5   4,435      22,175     1,021.6      61.1      00:13:13
 35107       7   4,435      31,045     1,031.5      61.6      00:12:60
 35423       7   4,435      31,045     1,041.4      62.2      00:12:47
 35748       8   4,435      35,480     1,051.2      62.8      00:12:34
 36062       4   4,435      17,740     1,060.7      63.4      00:12:21
 36360       7   4,435      31,045     1,070.0      63.9      00:12:09
 36621      10   4,435      44,350     1,077.9      64.4      00:11:60
 36841       8   4,435      35,480     1,084.2      64.8      00:11:54
 37076      10   4,435      44,350     1,091.2      65.2      00:11:46
 37302       4   4,435      17,740     1,097.3      65.6      00:11:40
 37522       8   4,435      35,480     1,103.6      66.0      00:11:34
 37747       6   4,435      26,610     1,110.1      66.3      00:11:27
 37956      10   4,435      44,350     1,116.2      66.7      00:11:21
 38195       4   4,435      17,740     1,123.6      67.1      00:11:12
 38436       4   4,435      17,740     1,130.9      67.6      00:11:04
 38747       9   4,435      39,915     1,140.4      68.1      00:10:51
 39032       5   4,435      22,175     1,148.9      68.7      00:10:41
 39272       8   4,435      35,480     1,155.8      69.1      00:10:33
 39531       7   4,435      31,045     1,163.3      69.5      00:10:24
 39804       6   4,435      26,610     1,171.3      70.0      00:10:15
 40139       9   4,435      39,915     1,181.1      70.6      00:10:02
 40456       7   4,435      31,045     1,190.6      71.1      00:09:49
 40773       6   4,435      26,610     1,200.2      71.7      00:09:37
 41043       4   4,435      17,740     1,208.4      72.2      00:09:27
 41255       8   4,435      35,480     1,214.8      72.6      00:09:20
 41487       4   4,435      17,740     1,221.7      73.0      00:09:12
 41745       2   4,435       8,870     1,229.4      73.5      00:09:03
 41956       3   4,435      13,305     1,235.9      73.9      00:08:56
 42194      10   4,435      44,350     1,242.4      74.2      00:08:49
 42430       5   4,435      22,175     1,249.4      74.7      00:08:40
 42637      10   4,435      44,350     1,255.3      75.0      00:08:34
 42851      10   4,435      44,350     1,261.8      75.4      00:08:27
 43070      10   4,435      44,350     1,268.5      75.8      00:08:19
 43277       9   4,435      39,915     1,274.9      76.2      00:08:12
 43481       9   4,435      39,915     1,281.0      76.6      00:08:05
 43812       6   4,435      26,610     1,290.6      77.1      00:07:53
 44109       5   4,435      22,175     1,299.2      77.6      00:07:42
 44330       7   4,435      31,045     1,305.7      78.0      00:07:35
 44595       6   4,435      26,610     1,313.5      78.5      00:07:25
 44869      10   4,435      44,350     1,321.7      79.0      00:07:15
 45136       6   4,435      26,610     1,329.3      79.4      00:07:06
 45387       6   4,435      26,610     1,336.2      79.8      00:06:58
 45612       8   4,435      35,480     1,342.5      80.2      00:06:50
 45870      10   4,435      44,350     1,349.7      80.7      00:06:41
 46116       7   4,435      31,045     1,357.3      81.1      00:06:32
 46358       5   4,435      22,175     1,364.5      81.5      00:06:24
 46613       3   4,435      13,305     1,372.2      82.0      00:06:14
 46908       5   4,435      22,175     1,381.0      82.5      00:06:03
 47162       3   4,435      13,305     1,387.7      82.9      00:05:55
 47394       7   4,435      31,045     1,394.4      83.3      00:05:47
 47632      10   4,435      44,350     1,401.2      83.7      00:05:39
 47864       6   4,435      26,610     1,407.9      84.1      00:05:31
 48075       7   4,435      31,045     1,414.2      84.5      00:05:23
 48289       7   4,435      31,045     1,420.6      84.9      00:05:16
 48539       8   4,435      35,480     1,428.0      85.3      00:05:07
 48800       8   4,435      35,480     1,435.6      85.8      00:04:57
 49048       9   4,435      39,915     1,442.9      86.2      00:04:48
 49285       6   4,435      26,610     1,450.0      86.7      00:04:40
 49510       9   4,435      39,915     1,456.2      87.0      00:04:32
 49744       8   4,435      35,480     1,462.6      87.4      00:04:24
 49961       8   4,435      35,480     1,468.9      87.8      00:04:17
 50192       6   4,435      26,610     1,475.6      88.2      00:04:09
 50420       9   4,435      39,915     1,481.9      88.6      00:04:01
 50643       9   4,435      39,915     1,488.4      88.9      00:03:53
 50859       4   4,435      17,740     1,495.1      89.3      00:03:45
 51059       9   4,435      39,915     1,501.4      89.7      00:03:37
 51298       8   4,435      35,480     1,508.2      90.1      00:03:29
 51522       5   4,435      22,175     1,515.1      90.5      00:03:20
 51748       6   4,435      26,610     1,522.2      91.0      00:03:11
 52009      10   4,435      44,350     1,530.1      91.4      00:03:01
 52303       9   4,435      39,915     1,539.5      92.0      00:02:49
 52604       8   4,435      35,480     1,549.2      92.6      00:02:37
 52896       8   4,435      35,480     1,558.6      93.1      00:02:25
 53206       7   4,435      31,045     1,568.1      93.7      00:02:13
 53505       9   4,435      39,915     1,577.3      94.3      00:02:01
 53774       7   4,435      31,045     1,585.5      94.7      00:01:51
 53996       4   4,435      17,740     1,592.0      95.1      00:01:42
 54196      10   4,435      44,350     1,598.0      95.5      00:01:35
 54409       7   4,435      31,045     1,604.0      95.8      00:01:28
 54687       2   4,435       8,870     1,611.9      96.3      00:01:18
 54953       7   4,435      31,045     1,619.7      96.8      00:01:08
 55173      10   4,435      44,350     1,625.9      97.2      00:01:00
 55396       8   4,435      35,480     1,632.1      97.5      00:00:52
 55619      10   4,435      44,350     1,638.5      97.9      00:00:44
 55840       8   4,435      35,480     1,645.2      98.3      00:00:36
 56069       7   4,435      31,045     1,652.0      98.7      00:00:27
 56312       7   4,435      31,045     1,659.5      99.2      00:00:18
 56587       9   4,435      39,915     1,668.0      99.7      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 2128.871
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A400.csv saved

. 
. cap log close

. 
end of do-file
