
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A900_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   387      10   4,935      49,350        10.9       0.6      00:28:17
   784       8   4,935      39,480        22.9       1.2      00:26:50
  1184       6   4,935      29,610        35.2       1.9      00:25:60
  1579      10   4,935      49,350        48.1       2.6      00:25:13
  1977      10   4,935      49,350        60.6       3.3      00:24:51
  2368       8   4,935      39,480        72.8       3.9      00:24:38
  2762       4   4,935      19,740        85.4       4.6      00:24:20
  3154       7   4,935      34,545        98.0       5.3      00:24:04
  3531       8   4,935      39,480       110.5       5.9      00:23:50
  3910       9   4,935      44,415       122.6       6.6      00:23:42
  4229       4   4,935      19,740       132.4       7.1      00:24:00
  4522       7   4,935      34,545       141.4       7.6      00:24:24
  4802       5   4,935      24,675       150.6       8.1      00:24:41
  5119      10   4,935      49,350       160.6       8.6      00:24:47
  5416       9   4,935      44,415       170.4       9.1      00:24:53
  5782       7   4,935      34,545       181.2       9.7      00:24:48
  6116       6   4,935      29,610       191.9      10.3      00:24:44
  6435       8   4,935      39,480       201.8      10.8      00:24:45
  6760       6   4,935      29,610       211.8      11.4      00:24:44
  7097       6   4,935      29,610       222.5      11.9      00:24:38
  7508       3   4,935      14,805       235.5      12.6      00:24:14
  7881       9   4,935      44,415       247.8      13.3      00:23:57
  8235       6   4,935      29,610       259.9      13.9      00:23:41
  8608      10   4,935      49,350       272.5      14.6      00:23:24
  8993       4   4,935      19,740       285.3      15.3      00:23:05
  9320       9   4,935      44,415       296.5      15.9      00:22:56
  9590       6   4,935      29,610       305.6      16.4      00:22:58
  9867       2   4,935       9,870       315.0      16.9      00:22:58
 10162      10   4,935      49,350       324.0      17.4      00:23:00
 10437      10   4,935      49,350       332.6      17.8      00:23:03
 10740      10   4,935      49,350       342.2      18.4      00:23:00
 11060       7   4,935      34,545       352.4      18.9      00:22:54
 11325       5   4,935      24,675       360.8      19.4      00:22:57
 11566       5   4,935      24,675       368.6      19.8      00:23:01
 11873       4   4,935      19,740       378.6      20.3      00:22:55
 12191       9   4,935      44,415       389.0      20.9      00:22:47
 12549       6   4,935      29,610       400.5      21.5      00:22:34
 12952       5   4,935      24,675       412.9      22.2      00:22:17
 13343       7   4,935      34,545       425.6      22.8      00:21:60
 13661       5   4,935      24,675       436.6      23.4      00:21:49
 13950       7   4,935      34,545       445.8      23.9      00:21:46
 14269       9   4,935      44,415       456.3      24.5      00:21:37
 14581       7   4,935      34,545       466.7      25.0      00:21:29
 14926       8   4,935      39,480       477.9      25.6      00:21:18
 15339       9   4,935      44,415       491.9      26.4      00:20:57
 15752       8   4,935      39,480       505.3      27.1      00:20:38
 16140       8   4,935      39,480       518.8      27.8      00:20:20
 16527       8   4,935      39,480       531.9      28.5      00:20:04
 16866       5   4,935      24,675       542.9      29.1      00:19:54
 17176       5   4,935      24,675       553.0      29.7      00:19:47
 17454      10   4,935      49,350       562.5      30.2      00:19:42
 17731       8   4,935      39,480       571.9      30.7      00:19:36
 18056       8   4,935      39,480       582.4      31.3      00:19:28
 18380       7   4,935      34,545       593.3      31.8      00:19:18
 18658       7   4,935      34,545       602.3      32.3      00:19:14
 18949       8   4,935      39,480       612.2      32.9      00:19:07
 19259       8   4,935      39,480       622.8      33.4      00:18:57
 19656       7   4,935      34,545       636.3      34.1      00:18:40
 20056       5   4,935      24,675       650.4      34.9      00:18:22
 20462       7   4,935      34,545       663.9      35.6      00:18:06
 20756       9   4,935      44,415       673.8      36.2      00:17:59
 21036       6   4,935      29,610       683.1      36.7      00:17:53
 21375       6   4,935      29,610       693.2      37.2      00:17:45
 21711       7   4,935      34,545       703.8      37.8      00:17:36
 22020       6   4,935      29,610       713.4      38.3      00:17:30
 22348       5   4,935      24,675       723.4      38.8      00:17:22
 22713       6   4,935      29,610       734.9      39.4      00:17:11
 23052       7   4,935      34,545       745.3      40.0      00:17:02
 23362      10   4,935      49,350       755.6      40.5      00:16:53
 23711       9   4,935      44,415       766.4      41.1      00:16:44
 24025       4   4,935      19,740       776.6      41.7      00:16:35
 24447       6   4,935      29,610       789.6      42.4      00:16:21
 24843       4   4,935      19,740       802.6      43.1      00:16:07
 25246       7   4,935      34,545       815.8      43.8      00:15:52
 25647       5   4,935      24,675       828.6      44.5      00:15:38
 25936       8   4,935      39,480       838.5      45.0      00:15:31
 26253       9   4,935      44,415       848.9      45.6      00:15:22
 26627       4   4,935      19,740       860.5      46.2      00:15:11
 26962       7   4,935      34,545       871.4      46.8      00:15:01
 27235       8   4,935      39,480       880.3      47.2      00:14:55
 27501       6   4,935      29,610       888.9      47.7      00:14:49
 27832       7   4,935      34,545       900.0      48.3      00:14:39
 28267       6   4,935      29,610       914.4      49.1      00:14:23
 28678       8   4,935      39,480       928.6      49.8      00:14:07
 28986      10   4,935      49,350       939.1      50.4      00:13:58
 29315      10   4,935      49,350       949.8      51.0      00:13:49
 29687      10   4,935      49,350       962.0      51.6      00:13:37
 29986       8   4,935      39,480       972.0      52.2      00:13:28
 30261       5   4,935      24,675       981.3      52.7      00:13:21
 30599      10   4,935      49,350       992.8      53.3      00:13:11
 31007       4   4,935      19,740     1,006.4      54.0      00:12:56
 31427       7   4,935      34,545     1,020.5      54.8      00:12:41
 31846       7   4,935      34,545     1,035.0      55.5      00:12:26
 32254       6   4,935      29,610     1,049.3      56.3      00:12:11
 32592       8   4,935      39,480     1,061.0      56.9      00:11:60
 32860       9   4,935      44,415     1,070.0      57.4      00:11:53
 33163       8   4,935      39,480     1,080.5      58.0      00:11:44
 33528       9   4,935      44,415     1,092.9      58.6      00:11:32
 33880       9   4,935      44,415     1,105.1      59.3      00:11:20
 34246       5   4,935      24,675     1,117.9      60.0      00:11:08
 34682       8   4,935      39,480     1,132.7      60.8      00:10:53
 35109       6   4,935      29,610     1,147.4      61.6      00:10:38
 35541       4   4,935      19,740     1,162.4      62.4      00:10:22
 35991      10   4,935      49,350     1,177.5      63.2      00:10:07
 36424       8   4,935      39,480     1,192.3      64.0      00:09:52
 36763       8   4,935      39,480     1,203.5      64.6      00:09:42
 37079       4   4,935      19,740     1,213.9      65.1      00:09:33
 37407       8   4,935      39,480     1,224.0      65.7      00:09:25
 37739       7   4,935      34,545     1,234.6      66.3      00:09:16
 38033       9   4,935      44,415     1,244.2      66.8      00:09:08
 38308       7   4,935      34,545     1,253.5      67.3      00:09:01
 38611       8   4,935      39,480     1,264.0      67.8      00:08:52
 39012       6   4,935      29,610     1,277.3      68.5      00:08:39
 39316       6   4,935      29,610     1,287.1      69.1      00:08:31
 39711      10   4,935      49,350     1,299.9      69.8      00:08:19
 40164       8   4,935      39,480     1,314.7      70.6      00:08:05
 40585       6   4,935      29,610     1,328.7      71.3      00:07:52
 40993       8   4,935      39,480     1,342.6      72.1      00:07:38
 41351       9   4,935      44,415     1,354.5      72.7      00:07:28
 41713       9   4,935      44,415     1,366.5      73.3      00:07:17
 42035       9   4,935      44,415     1,377.3      73.9      00:07:08
 42403       9   4,935      44,415     1,388.8      74.5      00:06:58
 42755       4   4,935      19,740     1,400.3      75.1      00:06:47
 43087      10   4,935      49,350     1,411.6      75.8      00:06:38
 43416      10   4,935      49,350     1,422.9      76.4      00:06:28
 43730       7   4,935      34,545     1,432.9      76.9      00:06:19
 44021       6   4,935      29,610     1,442.5      77.4      00:06:11
 44328       5   4,935      24,675     1,452.6      78.0      00:06:03
 44666       8   4,935      39,480     1,463.4      78.5      00:05:53
 45002       9   4,935      44,415     1,474.6      79.1      00:05:43
 45357       7   4,935      34,545     1,485.5      79.7      00:05:34
 45672       4   4,935      19,740     1,495.4      80.2      00:05:25
 46017       6   4,935      29,610     1,506.6      80.9      00:05:15
 46340       7   4,935      34,545     1,517.6      81.4      00:05:06
 46640       7   4,935      34,545     1,527.5      82.0      00:04:57
 46989       7   4,935      34,545     1,538.8      82.6      00:04:47
 47247       7   4,935      34,545     1,546.6      83.0      00:04:41
 47473       6   4,935      29,610     1,553.7      83.4      00:04:35
 47761       7   4,935      34,545     1,563.1      83.9      00:04:27
 48061       9   4,935      44,415     1,572.9      84.4      00:04:19
 48413       8   4,935      39,480     1,584.5      85.0      00:04:09
 48769       8   4,935      39,480     1,596.2      85.7      00:03:58
 49133       8   4,935      39,480     1,608.0      86.3      00:03:47
 49484       6   4,935      29,610     1,619.4      86.9      00:03:37
 49820      10   4,935      49,350     1,629.6      87.5      00:03:28
 50154       6   4,935      29,610     1,640.4      88.0      00:03:19
 50510       8   4,935      39,480     1,651.5      88.6      00:03:09
 50856       6   4,935      29,610     1,663.1      89.2      00:02:59
 51201       9   4,935      44,415     1,674.6      89.9      00:02:48
 51524       7   4,935      34,545     1,685.4      90.4      00:02:39
 51852       9   4,935      44,415     1,696.8      91.1      00:02:29
 52173       9   4,935      44,415     1,708.0      91.7      00:02:19
 52540       8   4,935      39,480     1,721.0      92.4      00:02:07
 52945       8   4,935      39,480     1,735.5      93.1      00:01:54
 53377       6   4,935      29,610     1,750.3      93.9      00:01:40
 53782       8   4,935      39,480     1,764.1      94.7      00:01:28
 54079       7   4,935      34,545     1,773.8      95.2      00:01:19
 54334       4   4,935      19,740     1,782.2      95.6      00:01:12
 54688       8   4,935      39,480     1,793.2      96.2      00:01:02
 55068       5   4,935      24,675     1,805.5      96.9      00:00:51
 55382      10   4,935      49,350     1,815.3      97.4      00:00:43
 55684       6   4,935      29,610     1,824.9      97.9      00:00:34
 56002      10   4,935      49,350     1,835.5      98.5      00:00:25
 56362       7   4,935      34,545     1,847.7      99.2      00:00:14
 56727       8   4,935      39,480     1,860.3      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 1660.838
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
