
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data//Intermediate/blk_coords.dta /export/storage_co
> vidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccinated/ca_Dollar_locations_
> total.dta /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vac
> cinated/ca_blk_Dollar_dist_total.csv 500 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  31 Aug 2023, 02:31:38

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vacci
> nated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 500

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   951       6   1,725      10,350        10.4       1.5      00:11:05
  1910       9   3,617      32,553        22.6       3.1      00:10:19
  2657       7   3,436      24,052        36.2       4.4      00:10:53
  3374       4   3,053      12,212        50.5       5.7      00:11:08
  4176       7   1,292       9,044        63.1       7.0      00:11:03
  5224       7   1,539      10,773        73.2       8.8      00:10:22
  6366       7   1,646      11,522        82.6      10.7      00:09:44
  7336       9   1,734      15,606        92.9      12.3      00:09:29
  8310       9   1,760      15,840       104.4      14.1      00:09:10
  9245       7   1,751      12,257       115.7      15.8      00:08:54
 10085       3   1,721       5,163       125.6      17.3      00:08:47
 10996       5   1,712       8,560       135.0      18.8      00:08:38
 11790       5   2,019      10,095       144.4      20.2      00:08:35
 12681       5   1,761       8,805       155.9      21.7      00:08:25
 13630      10   2,571      25,710       167.9      23.4      00:08:12
 14341       9   2,023      18,207       178.5      24.6      00:08:10
 15175       7   2,533      17,731       190.8      26.1      00:08:02
 16013       7   2,384      16,688       203.9      27.6      00:07:53
 16829       4   1,751       7,004       215.4      29.1      00:07:44
 17667       6   1,784      10,704       225.6      30.6      00:07:34
 18574       6   1,892      11,352       236.1      32.2      00:07:23
 19374       7   1,955      13,685       246.4      33.6      00:07:15
 20384       8   1,909      15,272       259.2      35.5      00:06:59
 21143       6   1,898      11,388       269.4      36.8      00:06:52
 21629       2   3,775       7,550       279.4      37.6      00:06:55
 22188       8   2,679      21,432       289.3      38.6      00:06:55
 22813       4   2,889      11,556       299.2      39.6      00:06:52
 23377       7   2,705      18,935       309.7      40.6      00:06:50
 23936       3   2,704       8,112       319.4      41.5      00:06:49
 24462       3   2,746       8,238       328.4      42.4      00:06:48
 25041       4   2,710      10,840       338.9      43.4      00:06:44
 25653      10   3,123      31,230       350.0      44.5      00:06:40
 26171      10   2,955      29,550       360.1      45.4      00:06:37
 26777       7   3,289      23,023       372.7      46.4      00:06:32
 27345      10   2,800      28,000       384.0      47.4      00:06:28
 27885       6   2,800      16,800       394.2      48.4      00:06:24
 28579       9   2,871      25,839       407.8      49.7      00:06:15
 29168       8   2,736      21,888       419.0      50.7      00:06:10
 29744       8   2,906      23,248       429.7      51.7      00:06:04
 30219       7   2,924      20,468       439.1      52.6      00:06:01
 30644       9   2,998      26,982       447.6      53.4      00:05:59
 31175       8   2,982      23,856       458.6      54.3      00:05:54
 31826       4   3,027      12,108       472.1      55.5      00:05:45
 32507       8   2,862      22,896       486.7      56.8      00:05:35
 33056       8   2,838      22,704       497.5      57.8      00:05:29
 33688       6   2,829      16,974       509.9      59.0      00:05:21
 34311       9   2,922      26,298       522.3      60.1      00:05:12
 35013       5   2,944      14,720       536.5      61.4      00:05:02
 35723       9   2,857      25,713       551.0      62.7      00:04:52
 36445       9   2,891      26,019       565.3      64.0      00:04:41
 37038      10   2,691      26,910       576.0      65.1      00:04:34
 37645       8   2,676      21,408       586.3      66.1      00:04:27
 38246       7   2,582      18,074       596.7      67.2      00:04:19
 38866       9   2,568      23,112       607.6      68.3      00:04:11
 39605      10   2,692      26,920       620.8      69.6      00:04:01
 40393       7   2,712      18,984       635.0      71.0      00:03:49
 41092       5   2,691      13,455       648.3      72.2      00:03:39
 41715       9   2,583      23,247       659.4      73.3      00:03:31
 42242       6   3,940      23,640       670.5      74.3      00:03:25
 42634       9   3,743      33,687       680.5      74.9      00:03:21
 43030       6   3,792      22,752       690.6      75.6      00:03:17
 43388       7   3,793      26,551       700.1      76.3      00:03:13
 43821      10   3,751      37,510       710.5      77.1      00:03:08
 44192       7   3,907      27,349       719.9      77.7      00:03:04
 44607      10   3,933      39,330       730.6      78.4      00:02:59
 45017       9   3,931      35,379       741.4      79.2      00:02:54
 45487       8   3,947      31,576       753.0      79.9      00:02:48
 45928      10   3,900      39,000       763.9      80.7      00:02:43
 46354       7   3,917      27,419       775.4      81.5      00:02:37
 46851       1   3,903       3,903       788.4      82.3      00:02:30
 47264      10   3,555      35,550       798.4      83.0      00:02:25
 47753       6   3,206      19,236       809.3      83.9      00:02:19
 48384       8   2,543      20,344       821.7      85.0      00:02:09
 49054       9   3,321      29,889       834.5      86.2      00:01:59
 49599       6   3,914      23,484       847.1      87.1      00:01:51
 50004      10   3,883      38,830       857.1      87.8      00:01:46
 50450       6   3,359      20,154       867.7      88.5      00:01:40
 50931      10   3,201      32,010       878.2      89.4      00:01:33
 51439       9   3,092      27,828       889.4      90.3      00:01:25
 51981      10   3,083      30,830       901.1      91.3      00:01:16
 52502       7   3,030      21,210       912.8      92.3      00:01:08
 53032       5   2,985      14,925       924.5      93.3      00:00:59
 53607       8   3,057      24,456       936.7      94.4      00:00:50
 54092       3   3,510      10,530       947.2      95.2      00:00:42
 54640       5   3,509      17,545       959.4      96.1      00:00:34
 55146       6   3,871      23,226       971.5      97.0      00:00:26
 55581       6   3,761      22,566       981.9      97.7      00:00:20
 56032       9   2,976      26,784       992.5      98.6      00:00:13
 56538      10   2,907      29,070     1,002.9      99.5      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,008.50       Total run time (seconds)  = 899.97
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccinate
    > d/ca_blk_Dollar_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccinated
> /ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
