
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A600_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   412       7   4,635      32,445        10.9       0.6      00:26:32
   799       6   4,635      27,810        22.0       1.3      00:26:14
  1170       6   4,635      27,810        32.6       1.9      00:26:22
  1540       8   4,635      37,080        44.0       2.5      00:25:53
  1941       3   4,635      13,905        55.7       3.2      00:25:22
  2318       6   4,635      27,810        67.0       3.8      00:25:08
  2725       9   4,635      41,715        79.0       4.5      00:24:43
  3121       9   4,635      41,715        90.9       5.2      00:24:22
  3492       6   4,635      27,810       102.6       5.9      00:24:07
  3865       8   4,635      37,080       113.9       6.5      00:23:58
  4132       9   4,635      41,715       121.5       6.9      00:24:37
  4393       6   4,635      27,810       128.9       7.4      00:25:12
  4652      10   4,635      46,350       136.9       7.8      00:25:35
  4947      10   4,635      46,350       145.8       8.3      00:25:44
  5236       3   4,635      13,905       154.4       8.8      00:25:53
  5518       7   4,635      32,445       162.6       9.3      00:26:06
  5792       7   4,635      32,445       170.4       9.7      00:26:19
  6131       8   4,635      37,080       180.6      10.3      00:26:07
  6442       8   4,635      37,080       189.7      10.8      00:26:07
  6751      10   4,635      46,350       198.7      11.4      00:26:05
  7044       8   4,635      37,080       207.3      11.8      00:26:06
  7369       7   4,635      32,445       217.0      12.4      00:25:57
  7640       4   4,635      18,540       225.3      12.9      00:26:00
  7903       6   4,635      27,810       233.4      13.3      00:26:03
  8169       8   4,635      37,080       242.0      13.8      00:26:01
  8442       6   4,635      27,810       250.7      14.3      00:25:59
  8772      10   4,635      46,350       261.0      14.9      00:25:44
  9107       5   4,635      23,175       271.6      15.5      00:25:27
  9392       7   4,635      32,445       280.6      16.0      00:25:21
  9647       5   4,635      23,175       288.9      16.5      00:25:20
  9888       7   4,635      32,445       296.5      16.9      00:25:23
 10162      10   4,635      46,350       304.3      17.4      00:25:23
 10452       8   4,635      37,080       312.9      17.9      00:25:19
 10739      10   4,635      46,350       321.4      18.4      00:25:15
 11014       7   4,635      32,445       329.7      18.8      00:25:11
 11332      10   4,635      46,350       339.1      19.4      00:25:01
 11551       6   4,635      27,810       345.8      19.8      00:25:06
 11839       9   4,635      41,715       354.5      20.3      00:24:59
 12162       5   4,635      23,175       364.4      20.8      00:24:46
 12518       7   4,635      32,445       375.1      21.4      00:24:29
 12936       7   4,635      32,445       387.3      22.1      00:24:05
 13299       6   4,635      27,810       398.4      22.8      00:23:48
 13621       9   4,635      41,715       408.9      23.4      00:23:33
 13927       6   4,635      27,810       418.0      23.9      00:23:25
 14223      10   4,635      46,350       427.1      24.4      00:23:17
 14478       4   4,635      18,540       435.2      24.9      00:23:13
 14718      10   4,635      46,350       442.5      25.3      00:23:12
 14984       4   4,635      18,540       450.8      25.8      00:23:06
 15319      10   4,635      46,350       461.4      26.4      00:22:52
 15722       9   4,635      41,715       473.7      27.1      00:22:30
 16100       9   4,635      41,715       486.0      27.8      00:22:09
 16490       7   4,635      32,445       498.5      28.5      00:21:49
 16775       4   4,635      18,540       507.2      29.0      00:21:42
 17038       7   4,635      32,445       515.3      29.4      00:21:37
 17300       6   4,635      27,810       523.3      29.9      00:21:32
 17582       6   4,635      27,810       532.6      30.4      00:21:23
 17919       9   4,635      41,715       542.9      31.0      00:21:10
 18244       6   4,635      27,810       553.2      31.6      00:20:58
 18555       7   4,635      32,445       562.3      32.1      00:20:49
 18775       7   4,635      32,445       569.4      32.5      00:20:47
 19031       5   4,635      23,175       577.7      33.0      00:20:41
 19256       6   4,635      27,810       584.9      33.4      00:20:38
 19563       6   4,635      27,810       594.7      34.0      00:20:27
 19862       9   4,635      41,715       604.4      34.5      00:20:16
 20245       9   4,635      41,715       616.8      35.2      00:19:57
 20577       6   4,635      27,810       627.2      35.8      00:19:44
 20827      10   4,635      46,350       635.1      36.3      00:19:39
 21097       7   4,635      32,445       643.4      36.8      00:19:32
 21409      10   4,635      46,350       652.2      37.3      00:19:24
 21711       7   4,635      32,445       661.0      37.8      00:19:16
 21988       4   4,635      18,540       669.2      38.2      00:19:09
 22298       4   4,635      18,540       677.9      38.7      00:19:01
 22586       7   4,635      32,445       686.4      39.2      00:18:54
 22870       9   4,635      41,715       694.4      39.7      00:18:47
 23139       8   4,635      37,080       702.7      40.2      00:18:40
 23472       8   4,635      37,080       712.8      40.7      00:18:28
 23801       9   4,635      41,715       722.6      41.3      00:18:17
 24148       8   4,635      37,080       733.0      41.9      00:18:05
 24609       9   4,635      41,715       746.7      42.7      00:17:44
 24951       7   4,635      32,445       756.9      43.2      00:17:32
 25261       6   4,635      27,810       766.7      43.8      00:17:21
 25612       9   4,635      41,715       777.3      44.4      00:17:08
 25890       6   4,635      27,810       786.1      44.9      00:17:00
 26190       8   4,635      37,080       795.2      45.4      00:16:51
 26476       8   4,635      37,080       803.9      45.9      00:16:43
 26854       6   4,635      27,810       815.1      46.6      00:16:29
 27169       8   4,635      37,080       824.9      47.1      00:16:18
 27406       5   4,635      23,175       832.0      47.5      00:16:13
 27720      10   4,635      46,350       841.7      48.1      00:16:02
 28121       5   4,635      23,175       854.4      48.8      00:15:45
 28545       9   4,635      41,715       867.9      49.6      00:15:27
 28804       4   4,635      18,540       876.2      50.1      00:15:19
 29017       5   4,635      23,175       882.9      50.4      00:15:15
 29276       6   4,635      27,810       890.8      50.9      00:15:09
 29537       9   4,635      41,715       899.1      51.4      00:15:01
 29796      10   4,635      46,350       907.1      51.8      00:14:54
 30069       8   4,635      37,080       915.6      52.3      00:14:46
 30347       9   4,635      41,715       924.3      52.8      00:14:37
 30643       9   4,635      41,715       933.8      53.4      00:14:27
 31074      10   4,635      46,350       947.2      54.1      00:14:09
 31464       8   4,635      37,080       959.8      54.8      00:13:53
 31839      10   4,635      46,350       971.9      55.5      00:13:38
 32195       8   4,635      37,080       983.5      56.2      00:13:24
 32508       8   4,635      37,080       993.9      56.8      00:13:13
 32746       9   4,635      41,715     1,001.3      57.2      00:13:07
 33008       7   4,635      32,445     1,009.8      57.7      00:12:59
 33338       7   4,635      32,445     1,020.4      58.3      00:12:47
 33717       6   4,635      27,810     1,032.7      59.0      00:12:32
 34067       8   4,635      37,080     1,043.9      59.6      00:12:19
 34429      10   4,635      46,350     1,055.7      60.3      00:12:05
 34773       4   4,635      18,540     1,066.9      61.0      00:11:52
 35098       9   4,635      41,715     1,077.3      61.6      00:11:41
 35483       6   4,635      27,810     1,089.9      62.3      00:11:26
 35894       9   4,635      41,715     1,102.9      63.0      00:11:10
 36261       8   4,635      37,080     1,114.6      63.7      00:10:57
 36609      10   4,635      46,350     1,125.6      64.3      00:10:45
 36820       9   4,635      41,715     1,132.1      64.7      00:10:40
 37087       8   4,635      37,080     1,140.4      65.2      00:10:32
 37352      10   4,635      46,350     1,147.9      65.6      00:10:26
 37577      10   4,635      46,350     1,154.8      66.0      00:10:20
 37864       7   4,635      32,445     1,163.4      66.5      00:10:12
 38108       7   4,635      32,445     1,171.1      66.9      00:10:05
 38356       5   4,635      23,175     1,178.9      67.4      00:09:57
 38676       6   4,635      27,810     1,189.1      67.9      00:09:46
 39059      10   4,635      46,350     1,201.2      68.6      00:09:32
 39360       9   4,635      41,715     1,210.3      69.2      00:09:23
 39680      10   4,635      46,350     1,220.0      69.7      00:09:13
 40011       7   4,635      32,445     1,230.2      70.3      00:09:02
 40384       6   4,635      27,810     1,241.4      70.9      00:08:50
 40800       7   4,635      32,445     1,254.8      71.7      00:08:34
 41145       8   4,635      37,080     1,265.7      72.3      00:08:22
 41470       7   4,635      32,445     1,275.8      72.9      00:08:12
 41820       8   4,635      37,080     1,286.8      73.5      00:07:60
 42079       8   4,635      37,080     1,294.8      74.0      00:07:52
 42376       9   4,635      41,715     1,303.5      74.5      00:07:43
 42684       8   4,635      37,080     1,313.0      75.0      00:07:34
 42936       8   4,635      37,080     1,320.9      75.5      00:07:26
 43205       8   4,635      37,080     1,329.7      76.0      00:07:17
 43461       6   4,635      27,810     1,337.9      76.4      00:07:09
 43717       5   4,635      23,175     1,345.3      76.9      00:07:02
 44005      10   4,635      46,350     1,354.4      77.4      00:06:53
 44318       3   4,635      13,905     1,364.0      77.9      00:06:43
 44635       7   4,635      32,445     1,373.5      78.5      00:06:33
 44976       9   4,635      41,715     1,384.2      79.1      00:06:21
 45354       1   4,635       4,635     1,395.1      79.7      00:06:10
 45662       5   4,635      23,175     1,404.2      80.2      00:06:00
 46004       6   4,635      27,810     1,414.6      80.8      00:05:49
 46340       7   4,635      32,445     1,425.3      81.4      00:05:38
 46627       7   4,635      32,445     1,434.2      81.9      00:05:29
 46953       4   4,635      18,540     1,444.4      82.5      00:05:18
 47232       9   4,635      41,715     1,452.1      83.0      00:05:10
 47560       6   4,635      27,810     1,461.8      83.5      00:05:00
 47884       7   4,635      32,445     1,471.6      84.1      00:04:50
 48129      10   4,635      46,350     1,479.4      84.5      00:04:42
 48457       9   4,635      41,715     1,489.5      85.1      00:04:32
 48822       6   4,635      27,810     1,500.8      85.8      00:04:20
 49168       8   4,635      37,080     1,511.5      86.4      00:04:08
 49433       9   4,635      41,715     1,519.4      86.8      00:04:00
 49761       3   4,635      13,905     1,528.8      87.4      00:03:51
 50091       2   4,635       9,270     1,538.8      87.9      00:03:40
 50426       4   4,635      18,540     1,548.5      88.5      00:03:30
 50717       7   4,635      32,445     1,557.5      89.0      00:03:21
 51020       7   4,635      32,445     1,567.3      89.6      00:03:11
 51330       5   4,635      23,175     1,576.8      90.1      00:03:01
 51661       7   4,635      32,445     1,587.4      90.7      00:02:49
 51967       8   4,635      37,080     1,597.2      91.3      00:02:39
 52268       7   4,635      32,445     1,607.3      91.8      00:02:29
 52638       9   4,635      41,715     1,619.6      92.5      00:02:16
 53004       9   4,635      41,715     1,631.8      93.2      00:02:03
 53407       8   4,635      37,080     1,644.8      94.0      00:01:49
 53790       8   4,635      37,080     1,657.1      94.7      00:01:36
 54090       4   4,635      18,540     1,666.3      95.2      00:01:27
 54360       8   4,635      37,080     1,674.7      95.7      00:01:18
 54726       8   4,635      37,080     1,685.4      96.3      00:01:07
 55107       5   4,635      23,175     1,696.9      97.0      00:00:55
 55437       7   4,635      32,445     1,706.5      97.5      00:00:45
 55727       5   4,635      23,175     1,715.3      98.0      00:00:36
 56011       7   4,635      32,445     1,724.2      98.5      00:00:27
 56323       8   4,635      37,080     1,734.1      99.1      00:00:17
 56597       9   4,635      41,715     1,743.0      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1818.707
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
