
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A700_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   243       4   4,735      18,940         6.6       0.4      00:44:59
   541       5   4,735      23,675        14.9       0.8      00:39:47
   831      10   4,735      47,350        23.5       1.3      00:37:37
  1121       5   4,735      23,675        32.0       1.8      00:36:40
  1381       8   4,735      37,880        40.1       2.2      00:36:22
  1617       8   4,735      37,880        47.5       2.7      00:36:40
  1826       8   4,735      37,880        53.8       3.0      00:37:42
  2059       9   4,735      42,615        60.7       3.4      00:38:01
  2254       7   4,735      33,145        66.7       3.7      00:38:47
  2526       9   4,735      42,615        74.7       4.2      00:38:17
  2782       7   4,735      33,145        82.8       4.6      00:37:48
  3013       7   4,735      33,145        89.6       5.0      00:37:57
  3244       8   4,735      37,880        97.2       5.4      00:37:46
  3454      10   4,735      47,350       103.9       5.8      00:37:55
  3632      10   4,735      47,350       109.3       6.1      00:38:29
  3837       9   4,735      42,615       115.7       6.5      00:38:37
  3986       8   4,735      37,880       119.9       6.7      00:39:30
  4111       3   4,735      14,205       123.7       6.9      00:40:28
  4230       6   4,735      28,410       127.2       7.1      00:41:27
  4373       8   4,735      37,880       131.2       7.3      00:42:11
  4508       7   4,735      33,145       135.4       7.6      00:42:48
  4655       9   4,735      42,615       140.2       7.8      00:43:13
  4792       8   4,735      37,880       144.4       8.1      00:43:45
  4921       9   4,735      42,615       148.3       8.3      00:44:20
  5045       9   4,735      42,615       152.2       8.5      00:44:54
  5209       7   4,735      33,145       157.2       8.8      00:45:05
  5328       6   4,735      28,410       160.8       9.0      00:45:39
  5482      10   4,735      47,350       165.3       9.3      00:45:55
  5618       6   4,735      28,410       169.1       9.5      00:46:23
  5740       5   4,735      23,675       172.7       9.7      00:46:53
  5896       8   4,735      37,880       177.4       9.9      00:47:01
  6029       6   4,735      28,410       181.7      10.2      00:47:16
  6158      10   4,735      47,350       185.6      10.4      00:47:37
  6309       8   4,735      37,880       190.0      10.6      00:47:46
  6445       8   4,735      37,880       194.1      10.9      00:48:01
  6568       6   4,735      28,410       197.8      11.1      00:48:22
  6719       5   4,735      23,675       202.2      11.3      00:48:30
  6857       6   4,735      28,410       206.4      11.6      00:48:39
  6991       5   4,735      23,675       210.5      11.8      00:48:50
  7125       5   4,735      23,675       214.4      12.0      00:49:03
  7267       6   4,735      28,410       218.6      12.2      00:49:12
  7438       3   4,735      14,205       224.0      12.5      00:48:60
  7625       7   4,735      33,145       229.8      12.9      00:48:43
  7823       4   4,735      18,940       236.0      13.2      00:48:21
  8020       5   4,735      23,675       242.5      13.6      00:47:55
  8247       6   4,735      28,410       249.8      14.0      00:47:19
  8473       8   4,735      37,880       257.3      14.4      00:46:42
  8679       7   4,735      33,145       263.8      14.8      00:46:20
  8847       6   4,735      28,410       269.3      15.1      00:46:10
  9014       6   4,735      28,410       274.7      15.4      00:46:01
  9165       5   4,735      23,675       279.7      15.7      00:45:57
  9290       7   4,735      33,145       283.7      15.9      00:46:04
  9398       6   4,735      28,410       287.1      16.1      00:46:18
  9495       5   4,735      23,675       290.3      16.3      00:46:32
  9611       5   4,735      23,675       294.2      16.5      00:46:39
  9757       8   4,735      37,880       299.0      16.7      00:46:35
  9885       9   4,735      42,615       303.0      17.0      00:46:40
 10011       9   4,735      42,615       306.8      17.2      00:46:47
 10155       9   4,735      42,615       310.8      17.4      00:46:51
 10318       6   4,735      28,410       315.6      17.7      00:46:47
 10440       8   4,735      37,880       319.5      17.9      00:46:51
 10593       9   4,735      42,615       324.0      18.1      00:46:49
 10786       5   4,735      23,675       329.8      18.5      00:46:33
 10922       7   4,735      33,145       334.1      18.7      00:46:32
 11088      10   4,735      47,350       339.1      19.0      00:46:24
 11195       7   4,735      33,145       342.5      19.2      00:46:33
 11318       6   4,735      28,410       346.2      19.4      00:46:37
 11417       7   4,735      33,145       349.4      19.6      00:46:47
 11562       8   4,735      37,880       353.7      19.8      00:46:45
 11712       7   4,735      33,145       358.4      20.1      00:46:39
 11855       6   4,735      28,410       362.8      20.3      00:46:35
 12009       5   4,735      23,675       367.6      20.6      00:46:29
 12139       5   4,735      23,675       371.8      20.8      00:46:28
 12312       7   4,735      33,145       377.0      21.1      00:46:17
 12563      10   4,735      47,350       384.8      21.5      00:45:41
 12813       7   4,735      33,145       392.2      22.0      00:45:11
 13074       7   4,735      33,145       400.2      22.4      00:44:36
 13313       9   4,735      42,615       407.7      22.8      00:44:07
 13558       9   4,735      42,615       415.8      23.3      00:43:33
 13718       9   4,735      42,615       421.0      23.6      00:43:24
 13875       6   4,735      28,410       425.7      23.8      00:43:18
 14051       8   4,735      37,880       431.0      24.1      00:43:07
 14224       6   4,735      28,410       436.6      24.4      00:42:55
 14352      10   4,735      47,350       440.8      24.7      00:42:53
 14492       9   4,735      42,615       445.3      24.9      00:42:49
 14647       6   4,735      28,410       450.1      25.2      00:42:42
 14798       5   4,735      23,675       454.8      25.5      00:42:36
 14977      10   4,735      47,350       460.6      25.8      00:42:22
 15169       7   4,735      33,145       466.8      26.1      00:42:05
 15365       8   4,735      37,880       473.1      26.5      00:41:47
 15585       7   4,735      33,145       479.8      26.9      00:41:27
 15809       6   4,735      28,410       487.0      27.3      00:41:03
 16042       6   4,735      28,410       494.7      27.7      00:40:36
 16274       7   4,735      33,145       502.3      28.1      00:40:11
 16499       6   4,735      28,410       509.7      28.5      00:39:48
 16666       9   4,735      42,615       514.8      28.8      00:39:39
 16814       7   4,735      33,145       519.5      29.1      00:39:34
 16956       7   4,735      33,145       524.1      29.3      00:39:29
 17098       8   4,735      37,880       528.4      29.6      00:39:25
 17235       8   4,735      37,880       532.8      29.8      00:39:21
 17351       8   4,735      37,880       536.7      30.0      00:39:20
 17457      10   4,735      47,350       540.1      30.2      00:39:22
 17560       9   4,735      42,615       543.7      30.4      00:39:23
 17664      10   4,735      47,350       547.0      30.6      00:39:25
 17817      10   4,735      47,350       551.5      30.9      00:39:19
 17953       5   4,735      23,675       555.8      31.1      00:39:15
 18100      10   4,735      47,350       560.6      31.4      00:39:08
 18320       6   4,735      28,410       567.7      31.8      00:38:47
 18523       8   4,735      37,880       573.7      32.1      00:38:32
 18658       8   4,735      37,880       578.2      32.4      00:38:27
 18792       6   4,735      28,410       582.5      32.6      00:38:22
 18941       9   4,735      42,615       587.5      32.9      00:38:14
 19106       6   4,735      28,410       592.8      33.2      00:38:03
 19240       6   4,735      28,410       597.2      33.4      00:37:58
 19448       9   4,735      42,615       604.0      33.8      00:37:39
 19655       9   4,735      42,615       610.9      34.2      00:37:20
 19880       6   4,735      28,410       618.4      34.6      00:36:58
 20122       8   4,735      37,880       626.5      35.1      00:36:32
 20369       9   4,735      42,615       634.2      35.5      00:36:09
 20519       8   4,735      37,880       639.1      35.8      00:36:02
 20641      10   4,735      47,350       643.1      36.0      00:35:59
 20801      10   4,735      47,350       648.2      36.3      00:35:50
 20932      10   4,735      47,350       652.6      36.5      00:35:45
 21139       9   4,735      42,615       658.7      36.9      00:35:30
 21335      10   4,735      47,350       664.2      37.2      00:35:19
 21529       9   4,735      42,615       670.5      37.5      00:35:05
 21732       5   4,735      23,675       676.1      37.8      00:34:53
 21904       3   4,735      14,205       681.3      38.1      00:34:44
 22109       6   4,735      28,410       687.2      38.5      00:34:31
 22267      10   4,735      47,350       691.9      38.7      00:34:24
 22441       8   4,735      37,880       697.0      39.0      00:34:15
 22613       7   4,735      33,145       702.4      39.3      00:34:04
 22823       5   4,735      23,675       708.2      39.6      00:33:52
 23046       7   4,735      33,145       715.3      40.0      00:33:34
 23286       8   4,735      37,880       722.9      40.5      00:33:13
 23538       8   4,735      37,880       730.2      40.9      00:32:54
 23754       9   4,735      42,615       736.9      41.2      00:32:38
 23952      10   4,735      47,350       743.1      41.6      00:32:25
 24198       8   4,735      37,880       750.4      42.0      00:32:06
 24452      10   4,735      47,350       758.1      42.4      00:31:46
 24675       8   4,735      37,880       765.3      42.8      00:31:28
 24921      10   4,735      47,350       772.6      43.2      00:31:10
 25108       9   4,735      42,615       778.7      43.6      00:30:57
 25290       9   4,735      42,615       784.4      43.9      00:30:46
 25508       8   4,735      37,880       791.4      44.3      00:30:30
 25665       8   4,735      37,880       796.0      44.6      00:30:23
 25794       8   4,735      37,880       800.3      44.8      00:30:18
 25949       6   4,735      28,410       805.0      45.1      00:30:10
 26086      10   4,735      47,350       809.5      45.3      00:30:04
 26315       9   4,735      42,615       816.7      45.7      00:29:47
 26538       8   4,735      37,880       823.4      46.1      00:29:32
 26763       7   4,735      33,145       830.3      46.5      00:29:16
 26929       5   4,735      23,675       835.5      46.8      00:29:07
 27087       5   4,735      23,675       840.3      47.0      00:28:60
 27226       4   4,735      18,940       844.7      47.3      00:28:54
 27339       6   4,735      28,410       848.2      47.5      00:28:51
 27482       7   4,735      33,145       852.7      47.7      00:28:45
 27622       9   4,735      42,615       857.2      48.0      00:28:39
 27796       8   4,735      37,880       862.8      48.3      00:28:28
 28018       9   4,735      42,615       869.8      48.7      00:28:12
 28273       8   4,735      37,880       878.1      49.1      00:27:51
 28562       5   4,735      23,675       887.7      49.7      00:27:26
 28758       9   4,735      42,615       894.0      50.0      00:27:13
 28910       6   4,735      28,410       898.9      50.3      00:27:05
 29045       4   4,735      18,940       903.3      50.6      00:26:59
 29227      10   4,735      47,350       908.8      50.9      00:26:49
 29402       9   4,735      42,615       914.7      51.2      00:26:37
 29568       9   4,735      42,615       919.7      51.5      00:26:29
 29722      10   4,735      47,350       924.7      51.8      00:26:20
 29894       7   4,735      33,145       930.1      52.1      00:26:10
 30065       6   4,735      28,410       935.6      52.4      00:26:00
 30223       4   4,735      18,940       940.7      52.7      00:25:52
 30381       7   4,735      33,145       945.7      52.9      00:25:43
 30537       4   4,735      18,940       951.0      53.2      00:25:34
 30758       7   4,735      33,145       958.1      53.6      00:25:18
 31015       9   4,735      42,615       966.2      54.1      00:24:59
 31257      10   4,735      47,350       974.1      54.5      00:24:41
 31495       9   4,735      42,615       982.0      55.0      00:24:23
 31738       9   4,735      42,615       989.9      55.4      00:24:05
 31973       9   4,735      42,615       997.9      55.9      00:23:47
 32199      10   4,735      47,350     1,005.4      56.3      00:23:31
 32430       8   4,735      37,880     1,013.2      56.7      00:23:14
 32558      10   4,735      47,350     1,017.3      56.9      00:23:08
 32654       4   4,735      18,940     1,020.3      57.1      00:23:06
 32769       6   4,735      28,410     1,024.2      57.3      00:23:02
 32905       5   4,735      23,675     1,028.6      57.6      00:22:55
 33031       9   4,735      42,615     1,032.8      57.8      00:22:49
 33143       7   4,735      33,145     1,036.5      58.0      00:22:45
 33322       6   4,735      28,410     1,042.3      58.3      00:22:34
 33494      10   4,735      47,350     1,047.9      58.7      00:22:24
 33674       7   4,735      33,145     1,054.0      59.0      00:22:12
 33856       8   4,735      37,880     1,060.0      59.3      00:22:00
 34027       8   4,735      37,880     1,065.5      59.6      00:21:50
 34143      10   4,735      47,350     1,069.6      59.9      00:21:45
 34370       8   4,735      37,880     1,077.1      60.3      00:21:29
 34623       9   4,735      42,615     1,085.3      60.7      00:21:11
 34876      10   4,735      47,350     1,093.9      61.2      00:20:52
 35143       9   4,735      42,615     1,102.6      61.7      00:20:32
 35388       7   4,735      33,145     1,110.6      62.2      00:20:15
 35629      10   4,735      47,350     1,118.5      62.6      00:19:58
 35868       8   4,735      37,880     1,126.2      63.0      00:19:42
 36134       9   4,735      42,615     1,135.0      63.5      00:19:23
 36386       9   4,735      42,615     1,143.2      64.0      00:19:06
 36602       6   4,735      28,410     1,150.2      64.4      00:18:52
 36767       4   4,735      18,940     1,155.2      64.7      00:18:44
 36920       7   4,735      33,145     1,160.2      64.9      00:18:36
 37076      10   4,735      47,350     1,165.0      65.2      00:18:28
 37211       7   4,735      33,145     1,168.8      65.4      00:18:23
 37327       6   4,735      28,410     1,172.3      65.6      00:18:19
 37447       8   4,735      37,880     1,176.0      65.8      00:18:14
 37584       9   4,735      42,615     1,180.3      66.1      00:18:07
 37797       9   4,735      42,615     1,186.7      66.4      00:17:55
 37981       6   4,735      28,410     1,192.5      66.7      00:17:45
 38144       8   4,735      37,880     1,197.9      67.1      00:17:35
 38329       9   4,735      42,615     1,203.9      67.4      00:17:24
 38510       8   4,735      37,880     1,209.9      67.7      00:17:13
 38781       8   4,735      37,880     1,218.5      68.2      00:16:55
 38980      10   4,735      47,350     1,225.0      68.6      00:16:43
 39118       4   4,735      18,940     1,229.3      68.8      00:16:36
 39260       7   4,735      33,145     1,233.5      69.0      00:16:30
 39417      10   4,735      47,350     1,238.3      69.3      00:16:22
 39617       6   4,735      28,410     1,244.8      69.7      00:16:09
 39786      10   4,735      47,350     1,249.9      70.0      00:16:01
 40034       8   4,735      37,880     1,257.7      70.4      00:15:45
 40284       8   4,735      37,880     1,265.5      70.8      00:15:30
 40524       7   4,735      33,145     1,273.4      71.3      00:15:14
 40778       3   4,735      14,205     1,281.6      71.7      00:14:57
 40980       7   4,735      33,145     1,288.2      72.1      00:14:45
 41096       5   4,735      23,675     1,291.8      72.3      00:14:40
 41250       6   4,735      28,410     1,296.8      72.6      00:14:31
 41449       6   4,735      28,410     1,303.2      72.9      00:14:20
 41657       8   4,735      37,880     1,309.7      73.3      00:14:07
 41889       5   4,735      23,675     1,317.4      73.7      00:13:53
 42083       2   4,735       9,470     1,323.2      74.1      00:13:42
 42295       9   4,735      42,615     1,329.4      74.4      00:13:31
 42512       4   4,735      18,940     1,336.5      74.8      00:13:17
 42687       2   4,735       9,470     1,341.9      75.1      00:13:08
 42818       8   4,735      37,880     1,346.1      75.3      00:13:01
 42925       5   4,735      23,675     1,349.4      75.5      00:12:57
 43038       6   4,735      28,410     1,353.2      75.7      00:12:51
 43162       8   4,735      37,880     1,357.4      76.0      00:12:44
 43322      10   4,735      47,350     1,362.6      76.3      00:12:35
 43488       6   4,735      28,410     1,367.9      76.6      00:12:26
 43731       5   4,735      23,675     1,375.2      77.0      00:12:12
 43947      10   4,735      47,350     1,382.2      77.4      00:11:59
 44122       6   4,735      28,410     1,387.5      77.7      00:11:50
 44235       9   4,735      42,615     1,391.2      77.9      00:11:44
 44376      10   4,735      47,350     1,395.3      78.1      00:11:38
 44594      10   4,735      47,350     1,402.3      78.5      00:11:25
 44773       6   4,735      28,410     1,407.9      78.8      00:11:15
 44918       9   4,735      42,615     1,412.6      79.1      00:11:07
 45063       8   4,735      37,880     1,417.0      79.3      00:10:59
 45267       9   4,735      42,615     1,423.1      79.7      00:10:48
 45358       5   4,735      23,675     1,425.6      79.8      00:10:45
 45460      10   4,735      47,350     1,428.9      80.0      00:10:40
 45605      10   4,735      47,350     1,433.1      80.2      00:10:34
 45777       7   4,735      33,145     1,438.3      80.5      00:10:24
 45939      10   4,735      47,350     1,443.3      80.8      00:10:16
 46086      10   4,735      47,350     1,448.0      81.0      00:10:08
 46236       8   4,735      37,880     1,453.1      81.3      00:09:59
 46403       5   4,735      23,675     1,458.2      81.6      00:09:50
 46554       9   4,735      42,615     1,463.1      81.9      00:09:41
 46750       8   4,735      37,880     1,469.3      82.2      00:09:30
 46906       7   4,735      33,145     1,474.4      82.5      00:09:21
 47039       5   4,735      23,675     1,478.0      82.7      00:09:15
 47235       7   4,735      33,145     1,483.8      83.1      00:09:05
 47391       7   4,735      33,145     1,488.6      83.3      00:08:56
 47579       6   4,735      28,410     1,494.2      83.6      00:08:46
 47773      10   4,735      47,350     1,500.3      84.0      00:08:35
 47953       9   4,735      42,615     1,506.1      84.3      00:08:25
 48119       5   4,735      23,675     1,511.2      84.6      00:08:15
 48272       7   4,735      33,145     1,516.1      84.9      00:08:07
 48517       9   4,735      42,615     1,523.9      85.3      00:07:52
 48797      10   4,735      47,350     1,532.6      85.8      00:07:36
 49000       7   4,735      33,145     1,538.9      86.1      00:07:24
 49199       6   4,735      28,410     1,545.6      86.5      00:07:12
 49424       5   4,735      23,675     1,552.2      86.9      00:06:60
 49640       6   4,735      28,410     1,558.4      87.2      00:06:48
 49839       9   4,735      42,615     1,564.4      87.6      00:06:38
 50015       6   4,735      28,410     1,569.9      87.9      00:06:28
 50225      10   4,735      47,350     1,576.4      88.2      00:06:16
 50366       6   4,735      28,410     1,580.4      88.5      00:06:09
 50503       9   4,735      42,615     1,584.8      88.7      00:06:02
 50646      10   4,735      47,350     1,589.2      89.0      00:05:54
 50806       6   4,735      28,410     1,594.5      89.2      00:05:45
 51031       6   4,735      28,410     1,602.1      89.7      00:05:31
 51293       4   4,735      18,940     1,610.1      90.1      00:05:16
 51610      10   4,735      47,350     1,620.5      90.7      00:04:56
 51933      10   4,735      47,350     1,631.1      91.3      00:04:37
 52305       6   4,735      28,410     1,643.7      92.0      00:04:13
 52628       5   4,735      23,675     1,654.9      92.6      00:03:52
 53011       8   4,735      37,880     1,667.9      93.4      00:03:29
 53399       7   4,735      33,145     1,680.5      94.1      00:03:06
 53725       9   4,735      42,615     1,691.2      94.7      00:02:46
 53929       7   4,735      33,145     1,697.5      95.0      00:02:35
 54193       9   4,735      42,615     1,706.0      95.5      00:02:20
 54453       8   4,735      37,880     1,713.7      95.9      00:02:07
 54770       7   4,735      33,145     1,723.5      96.5      00:01:50
 55065       3   4,735      14,205     1,732.6      97.0      00:01:34
 55324      10   4,735      47,350     1,740.4      97.4      00:01:20
 55599       8   4,735      37,880     1,748.6      97.9      00:01:06
 55840       8   4,735      37,880     1,756.5      98.3      00:00:52
 56122       9   4,735      42,615     1,765.5      98.8      00:00:36
 56398       4   4,735      18,940     1,774.6      99.3      00:00:21
 56707       8   4,735      37,880     1,784.7      99.9      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 3068.008
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
