
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A300.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A300.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A300.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A300.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   346       5   4,335      21,675         8.6       0.5      00:31:25
   726       6   4,335      26,010        18.5       1.1      00:29:09
  1105      10   4,335      43,350        28.8       1.8      00:27:56
  1468      10   4,335      43,350        39.3       2.4      00:27:08
  1831      10   4,335      43,350        49.4       3.0      00:26:49
  2205       6   4,335      26,010        59.7       3.7      00:26:25
  2603       8   4,335      34,680        70.6       4.3      00:25:54
  2994      10   4,335      43,350        81.5       5.0      00:25:29
  3365      10   4,335      43,350        92.5       5.7      00:25:04
  3744      10   4,335      43,350       103.4       6.3      00:24:45
  4058       7   4,335      30,345       111.8       6.8      00:25:02
  4353       5   4,335      21,675       119.6       7.3      00:25:24
  4620       9   4,335      39,015       127.3       7.8      00:25:43
  4908       8   4,335      34,680       135.4       8.3      00:25:54
  5198       3   4,335      13,005       143.6       8.8      00:26:02
  5495       5   4,335      21,675       151.6       9.3      00:26:10
  5774       7   4,335      30,345       159.1       9.7      00:26:21
  6090       4   4,335      17,340       168.1      10.3      00:26:15
  6366      10   4,335      43,350       175.5      10.7      00:26:24
  6659       8   4,335      34,680       183.5      11.2      00:26:26
  6963       6   4,335      26,010       191.9      11.7      00:26:23
  7314       9   4,335      39,015       201.5      12.3      00:26:09
  7662       3   4,335      13,005       211.5      12.9      00:25:52
  7994      10   4,335      43,350       221.3      13.5      00:25:37
  8334       7   4,335      30,345       231.4      14.1      00:25:20
  8677       9   4,335      39,015       241.5      14.8      00:25:04
  8991       7   4,335      30,345       250.8      15.3      00:24:54
  9201       7   4,335      30,345       257.0      15.7      00:25:04
  9317       7   4,335      30,345       260.5      15.9      00:25:34
  9454       6   4,335      26,010       264.5      16.2      00:25:58
  9569       5   4,335      21,675       268.1      16.4      00:26:25
  9681       9   4,335      39,015       271.6      16.6      00:26:51
  9797       8   4,335      34,680       275.0      16.8      00:27:16
  9930       6   4,335      26,010       278.7      17.0      00:27:40
 10045       6   4,335      26,010       281.8      17.2      00:28:06
 10175       6   4,335      26,010       285.1      17.4      00:28:30
 10347       7   4,335      30,345       289.8      17.7      00:28:43
 10547       6   4,335      26,010       295.4      18.1      00:28:48
 10761       8   4,335      34,680       301.3      18.4      00:28:52
 10976       8   4,335      34,680       307.5      18.8      00:28:52
 11151       6   4,335      26,010       312.3      19.1      00:29:02
 11273       7   4,335      30,345       315.6      19.3      00:29:21
 11380       7   4,335      30,345       318.7      19.5      00:29:42
 11520       5   4,335      21,675       322.8      19.7      00:29:55
 11668       5   4,335      21,675       326.9      20.0      00:30:06
 11807       7   4,335      30,345       330.9      20.2      00:30:19
 11946       6   4,335      26,010       334.7      20.5      00:30:32
 12100       9   4,335      39,015       339.3      20.7      00:30:39
 12232       6   4,335      26,010       343.0      21.0      00:30:51
 12349       2   4,335       8,670       346.2      21.2      00:31:07
 12543       9   4,335      39,015       351.8      21.5      00:31:06
 12795       7   4,335      30,345       358.6      21.9      00:30:56
 13027       8   4,335      34,680       365.1      22.3      00:30:49
 13269       9   4,335      39,015       372.0      22.7      00:30:39
 13456       8   4,335      34,680       377.6      23.1      00:30:37
 13618       4   4,335      17,340       382.6      23.4      00:30:39
 13769       8   4,335      34,680       386.7      23.6      00:30:46
 13894       6   4,335      26,010       390.3      23.9      00:30:56
 14035       9   4,335      39,015       394.1      24.1      00:31:03
 14227       5   4,335      21,675       399.8      24.4      00:30:60
 14399      10   4,335      43,350       404.9      24.8      00:30:59
 14550       7   4,335      30,345       409.3      25.0      00:31:03
 14712       7   4,335      30,345       413.9      25.3      00:31:05
 14875       9   4,335      39,015       418.6      25.6      00:31:06
 15103      10   4,335      43,350       425.4      26.0      00:30:54
 15337       9   4,335      39,015       432.3      26.4      00:30:42
 15550       4   4,335      17,340       438.3      26.8      00:30:35
 15772       6   4,335      26,010       444.8      27.2      00:30:26
 16006       8   4,335      34,680       451.8      27.6      00:30:13
 16233       9   4,335      39,015       458.6      28.0      00:30:01
 16470      10   4,335      43,350       465.9      28.5      00:29:48
 16655      10   4,335      43,350       471.0      28.8      00:29:45
 16859       8   4,335      34,680       476.9      29.2      00:29:39
 16997       7   4,335      30,345       481.0      29.4      00:29:42
 17118       6   4,335      26,010       484.4      29.6      00:29:48
 17242      10   4,335      43,350       488.0      29.8      00:29:53
 17376       6   4,335      26,010       492.0      30.1      00:29:55
 17487       9   4,335      39,015       495.5      30.3      00:29:60
 17614       8   4,335      34,680       499.3      30.5      00:30:03
 17775      10   4,335      43,350       503.7      30.8      00:30:03
 17960       7   4,335      30,345       509.1      31.1      00:29:58
 18171       7   4,335      30,345       515.4      31.5      00:29:48
 18406       4   4,335      17,340       522.0      31.9      00:29:36
 18555       8   4,335      34,680       526.2      32.2      00:29:36
 18686       9   4,335      39,015       530.2      32.4      00:29:37
 18801       6   4,335      26,010       533.5      32.6      00:29:42
 18934       9   4,335      39,015       537.6      32.9      00:29:43
 19064       9   4,335      39,015       541.6      33.1      00:29:43
 19207       6   4,335      26,010       545.8      33.4      00:29:43
 19314       7   4,335      30,345       549.0      33.6      00:29:47
 19519      10   4,335      43,350       555.2      33.9      00:29:36
 19732       5   4,335      21,675       561.7      34.3      00:29:25
 19960       5   4,335      21,675       568.6      34.8      00:29:11
 20114       5   4,335      21,675       573.4      35.1      00:29:07
 20347       7   4,335      30,345       580.0      35.5      00:28:55
 20522       7   4,335      30,345       585.2      35.8      00:28:49
 20662       9   4,335      39,015       589.4      36.0      00:28:47
 20761       7   4,335      30,345       592.3      36.2      00:28:52
 20897      10   4,335      43,350       596.4      36.5      00:28:50
 21039      10   4,335      43,350       600.4      36.7      00:28:50
 21211       5   4,335      21,675       604.9      37.0      00:28:46
 21381      10   4,335      43,350       609.5      37.3      00:28:43
 21515      10   4,335      43,350       613.3      37.5      00:28:42
 21649       8   4,335      34,680       616.9      37.7      00:28:43
 21795       8   4,335      34,680       620.7      37.9      00:28:42
 21963      10   4,335      43,350       625.4      38.2      00:28:37
 22142       3   4,335      13,005       630.1      38.5      00:28:33
 22287       6   4,335      26,010       634.1      38.8      00:28:31
 22447       9   4,335      39,015       638.3      39.0      00:28:28
 22605       6   4,335      26,010       642.8      39.3      00:28:24
 22726       3   4,335      13,005       646.0      39.5      00:28:26
 22926       7   4,335      30,345       651.3      39.8      00:28:18
 23136       3   4,335      13,005       657.4      40.2      00:28:07
 23350       5   4,335      21,675       663.6      40.6      00:27:55
 23581       8   4,335      34,680       669.6      40.9      00:27:44
 23753       8   4,335      34,680       674.6      41.2      00:27:38
 23954       3   4,335      13,005       680.3      41.6      00:27:28
 24168      10   4,335      43,350       686.2      41.9      00:27:18
 24362       6   4,335      26,010       691.3      42.3      00:27:11
 24550       4   4,335      17,340       696.9      42.6      00:27:02
 24753      10   4,335      43,350       702.7      43.0      00:26:51
 24965       5   4,335      21,675       708.6      43.3      00:26:41
 25192       5   4,335      21,675       715.4      43.7      00:26:27
 25380       9   4,335      39,015       720.7      44.1      00:26:19
 25572       6   4,335      26,010       726.1      44.4      00:26:11
 25696       5   4,335      21,675       729.7      44.6      00:26:09
 25796       9   4,335      39,015       732.8      44.8      00:26:10
 25930       6   4,335      26,010       736.5      45.0      00:26:07
 26057       6   4,335      26,010       740.3      45.3      00:26:05
 26205       7   4,335      30,345       744.6      45.5      00:26:01
 26389       8   4,335      34,680       749.7      45.8      00:25:53
 26590       9   4,335      39,015       755.2      46.2      00:25:44
 26767       6   4,335      26,010       760.3      46.5      00:25:36
 26936       5   4,335      21,675       765.1      46.8      00:25:29
 27082       7   4,335      30,345       769.2      47.0      00:25:25
 27210      10   4,335      43,350       772.9      47.2      00:25:23
 27352       6   4,335      26,010       776.9      47.5      00:25:19
 27502       9   4,335      39,015       781.3      47.8      00:25:14
 27645       5   4,335      21,675       785.4      48.0      00:25:09
 27783       9   4,335      39,015       789.5      48.3      00:25:05
 27955       4   4,335      17,340       794.6      48.6      00:24:57
 28140       9   4,335      39,015       800.0      48.9      00:24:48
 28326       5   4,335      21,675       805.4      49.2      00:24:39
 28481       8   4,335      34,680       810.2      49.5      00:24:32
 28635      10   4,335      43,350       814.8      49.8      00:24:25
 28729       7   4,335      30,345       817.6      50.0      00:24:25
 28837       9   4,335      39,015       820.9      50.2      00:24:24
 28969       5   4,335      21,675       824.7      50.4      00:24:20
 29103       4   4,335      17,340       828.7      50.7      00:24:16
 29278       5   4,335      21,675       833.6      51.0      00:24:08
 29427       9   4,335      39,015       838.1      51.2      00:24:01
 29608       6   4,335      26,010       843.2      51.5      00:23:53
 29755       6   4,335      26,010       847.5      51.8      00:23:47
 29879      10   4,335      43,350       851.2      52.0      00:23:44
 29984      10   4,335      43,350       854.2      52.2      00:23:43
 30120       7   4,335      30,345       858.2      52.5      00:23:38
 30242       6   4,335      26,010       861.7      52.7      00:23:35
 30344       9   4,335      39,015       864.8      52.9      00:23:33
 30475       9   4,335      39,015       868.8      53.1      00:23:28
 30620       6   4,335      26,010       873.0      53.4      00:23:22
 30792       8   4,335      34,680       878.2      53.7      00:23:13
 30978       9   4,335      39,015       883.5      54.0      00:23:04
 31196      10   4,335      43,350       890.0      54.4      00:22:50
 31380       8   4,335      34,680       895.5      54.7      00:22:40
 31587       7   4,335      30,345       901.7      55.1      00:22:28
 31834      10   4,335      43,350       909.3      55.6      00:22:10
 32085       7   4,335      30,345       916.9      56.1      00:21:53
 32295       7   4,335      30,345       923.3      56.4      00:21:40
 32516       2   4,335       8,670       930.1      56.9      00:21:26
 32632       5   4,335      21,675       933.5      57.1      00:21:23
 32770       8   4,335      34,680       937.7      57.3      00:21:17
 32900       6   4,335      26,010       941.5      57.6      00:21:12
 33017       7   4,335      30,345       945.1      57.8      00:21:08
 33151       6   4,335      26,010       949.1      58.0      00:21:03
 33292      10   4,335      43,350       953.4      58.3      00:20:57
 33454       9   4,335      39,015       958.1      58.6      00:20:49
 33612       7   4,335      30,345       963.1      58.9      00:20:40
 33779       8   4,335      34,680       968.1      59.2      00:20:32
 33925       6   4,335      26,010       972.5      59.5      00:20:25
 34083       8   4,335      34,680       977.3      59.7      00:20:17
 34248       6   4,335      26,010       982.4      60.1      00:20:08
 34488       9   4,335      39,015       989.7      60.5      00:19:52
 34695       7   4,335      30,345       995.8      60.9      00:19:40
 34910       7   4,335      30,345     1,002.5      61.3      00:19:26
 35139       3   4,335      13,005     1,009.3      61.7      00:19:12
 35355       7   4,335      30,345     1,015.8      62.1      00:18:59
 35580       8   4,335      34,680     1,022.5      62.5      00:18:45
 35784       7   4,335      30,345     1,028.5      62.9      00:18:33
 35998       9   4,335      39,015     1,035.0      63.3      00:18:20
 36252       9   4,335      39,015     1,042.6      63.7      00:18:04
 36491       9   4,335      39,015     1,049.7      64.2      00:17:50
 36624       8   4,335      34,680     1,053.7      64.4      00:17:44
 36792       2   4,335       8,670     1,058.3      64.7      00:17:36
 36951       9   4,335      39,015     1,063.0      65.0      00:17:28
 37112       8   4,335      34,680     1,067.6      65.3      00:17:21
 37252       6   4,335      26,010     1,071.3      65.5      00:17:16
 37392       7   4,335      30,345     1,075.1      65.7      00:17:10
 37552       9   4,335      39,015     1,079.7      66.0      00:17:03
 37743       3   4,335      13,005     1,084.9      66.3      00:16:53
 37896       7   4,335      30,345     1,089.4      66.6      00:16:46
 38064      10   4,335      43,350     1,094.4      66.9      00:16:37
 38271       5   4,335      21,675     1,100.4      67.3      00:16:26
 38469       6   4,335      26,010     1,106.5      67.6      00:16:14
 38666       6   4,335      26,010     1,112.2      68.0      00:16:03
 38890       8   4,335      34,680     1,118.8      68.4      00:15:50
 39049      10   4,335      43,350     1,123.5      68.7      00:15:42
 39163      10   4,335      43,350     1,126.6      68.9      00:15:38
 39309       8   4,335      34,680     1,130.8      69.1      00:15:32
 39464       6   4,335      26,010     1,135.1      69.4      00:15:25
 39632       8   4,335      34,680     1,140.0      69.7      00:15:16
 39763      10   4,335      43,350     1,143.6      69.9      00:15:11
 39987       6   4,335      26,010     1,150.2      70.3      00:14:58
 40252       5   4,335      21,675     1,157.6      70.8      00:14:42
 40509      10   4,335      43,350     1,165.4      71.2      00:14:26
 40765       8   4,335      34,680     1,172.9      71.7      00:14:11
 40951       8   4,335      34,680     1,178.5      72.1      00:14:01
 41070       6   4,335      26,010     1,181.9      72.3      00:13:56
 41201       8   4,335      34,680     1,185.8      72.5      00:13:50
 41390       9   4,335      39,015     1,191.2      72.8      00:13:40
 41579       7   4,335      30,345     1,196.8      73.2      00:13:29
 41727       8   4,335      34,680     1,201.2      73.4      00:13:22
 41871       5   4,335      21,675     1,205.5      73.7      00:13:15
 42001       9   4,335      39,015     1,209.2      73.9      00:13:09
 42186       7   4,335      30,345     1,214.1      74.2      00:13:00
 42336      10   4,335      43,350     1,218.4      74.5      00:12:53
 42476       6   4,335      26,010     1,222.6      74.7      00:12:46
 42648       7   4,335      30,345     1,227.3      75.0      00:12:38
 42770       9   4,335      39,015     1,230.9      75.3      00:12:32
 42943       8   4,335      34,680     1,235.9      75.6      00:12:23
 43114       7   4,335      30,345     1,241.3      75.9      00:12:13
 43261       8   4,335      34,680     1,245.7      76.2      00:12:06
 43400       5   4,335      21,675     1,249.8      76.4      00:11:59
 43614       8   4,335      34,680     1,255.8      76.8      00:11:47
 43912       7   4,335      30,345     1,264.4      77.3      00:11:29
 44143      10   4,335      43,350     1,270.9      77.7      00:11:17
 44298       7   4,335      30,345     1,275.4      78.0      00:11:09
 44424       8   4,335      34,680     1,278.8      78.2      00:11:04
 44560       7   4,335      30,345     1,282.8      78.4      00:10:57
 44715       6   4,335      26,010     1,287.3      78.7      00:10:49
 44890      10   4,335      43,350     1,292.4      79.0      00:10:40
 45057       9   4,335      39,015     1,297.1      79.3      00:10:31
 45316       9   4,335      39,015     1,304.1      79.7      00:10:17
 45480       8   4,335      34,680     1,308.7      80.0      00:10:09
 45653       8   4,335      34,680     1,313.3      80.3      00:10:01
 45800       5   4,335      21,675     1,317.4      80.5      00:09:54
 45981       9   4,335      39,015     1,322.7      80.9      00:09:44
 46169       9   4,335      39,015     1,328.2      81.2      00:09:34
 46332       6   4,335      26,010     1,333.1      81.5      00:09:25
 46480       9   4,335      39,015     1,337.2      81.8      00:09:18
 46708       4   4,335      17,340     1,344.0      82.2      00:09:04
 46941       3   4,335      13,005     1,350.6      82.6      00:08:52
 47157       7   4,335      30,345     1,356.3      82.9      00:08:41
 47323       8   4,335      34,680     1,360.9      83.2      00:08:32
 47450       8   4,335      34,680     1,364.4      83.4      00:08:27
 47575       7   4,335      30,345     1,367.9      83.6      00:08:21
 47672       9   4,335      39,015     1,370.8      83.8      00:08:16
 47806       8   4,335      34,680     1,374.5      84.0      00:08:10
 47932       9   4,335      39,015     1,378.2      84.3      00:08:04
 48122       8   4,335      34,680     1,383.6      84.6      00:07:53
 48294       8   4,335      34,680     1,388.7      84.9      00:07:44
 48487       7   4,335      30,345     1,394.3      85.2      00:07:33
 48633       6   4,335      26,010     1,398.5      85.5      00:07:26
 48833      10   4,335      43,350     1,404.1      85.8      00:07:15
 48974       6   4,335      26,010     1,408.2      86.1      00:07:08
 49105       8   4,335      34,680     1,412.1      86.3      00:07:01
 49290      10   4,335      43,350     1,417.5      86.7      00:06:51
 49489       7   4,335      30,345     1,422.9      87.0      00:06:41
 49638       7   4,335      30,345     1,426.7      87.2      00:06:34
 49779       5   4,335      21,675     1,430.6      87.5      00:06:27
 49913       9   4,335      39,015     1,434.3      87.7      00:06:20
 50059       5   4,335      21,675     1,438.6      87.9      00:06:13
 50217       9   4,335      39,015     1,443.0      88.2      00:06:04
 50404       9   4,335      39,015     1,448.0      88.5      00:05:55
 50538       6   4,335      26,010     1,451.9      88.8      00:05:48
 50682       8   4,335      34,680     1,456.0      89.0      00:05:40
 50855       9   4,335      39,015     1,461.3      89.3      00:05:31
 51012       9   4,335      39,015     1,466.1      89.6      00:05:21
 51159       5   4,335      21,675     1,470.2      89.9      00:05:14
 51280       2   4,335       8,670     1,473.7      90.1      00:05:08
 51514       6   4,335      26,010     1,480.7      90.5      00:04:54
 51773       5   4,335      21,675     1,488.6      91.0      00:04:39
 52025       9   4,335      39,015     1,496.1      91.5      00:04:24
 52252       5   4,335      21,675     1,503.2      91.9      00:04:10
 52461       7   4,335      30,345     1,509.7      92.3      00:03:58
 52672      10   4,335      43,350     1,516.5      92.7      00:03:45
 52890       7   4,335      30,345     1,523.3      93.1      00:03:32
 53136       8   4,335      34,680     1,530.6      93.6      00:03:18
 53346       6   4,335      26,010     1,536.9      94.0      00:03:06
 53597       6   4,335      26,010     1,544.6      94.4      00:02:51
 53810       5   4,335      21,675     1,550.8      94.8      00:02:39
 53977      10   4,335      43,350     1,555.5      95.1      00:02:30
 54179       6   4,335      26,010     1,561.4      95.5      00:02:19
 54353       5   4,335      21,675     1,566.4      95.8      00:02:10
 54552       6   4,335      26,010     1,571.6      96.1      00:02:00
 54713       7   4,335      30,345     1,576.3      96.4      00:01:52
 54905       6   4,335      26,010     1,581.7      96.7      00:01:41
 55101       7   4,335      30,345     1,587.3      97.0      00:01:31
 55332      10   4,335      43,350     1,593.6      97.4      00:01:19
 55472       9   4,335      39,015     1,597.5      97.7      00:01:12
 55665       8   4,335      34,680     1,602.9      98.0      00:01:02
 55850      10   4,335      43,350     1,608.4      98.3      00:00:51
 56080      10   4,335      43,350     1,615.1      98.7      00:00:39
 56295       8   4,335      34,680     1,621.5      99.1      00:00:27
 56507       5   4,335      21,675     1,628.0      99.5      00:00:14
 56745      10   4,335      43,350     1,635.1     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 3070.866
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A300.csv saved

. 
. cap log close

. 
end of do-file
