
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A700_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   316       7   4,735      33,145         8.5       0.5      00:35:01
   655       5   4,735      23,675        17.9       1.0      00:32:55
   994       7   4,735      33,145        27.9       1.6      00:31:37
  1309       7   4,735      33,145        37.6       2.1      00:31:01
  1627       8   4,735      37,880        47.7       2.7      00:30:26
  1969      10   4,735      47,350        57.9       3.2      00:29:55
  2296       7   4,735      33,145        67.8       3.8      00:29:37
  2617       8   4,735      37,880        77.3       4.3      00:29:31
  2920       6   4,735      28,410        86.8       4.9      00:29:26
  3213       7   4,735      33,145        95.9       5.4      00:29:27
  3523       9   4,735      42,615       105.7       5.9      00:29:12
  3834       6   4,735      28,410       115.5       6.5      00:29:01
  4094       5   4,735      23,675       123.0       6.9      00:29:22
  4348       5   4,735      23,675       130.3       7.3      00:29:43
  4585       9   4,735      42,615       137.7       7.7      00:30:01
  4812       1   4,735       4,735       144.8       8.1      00:30:18
  5057       4   4,735      18,940       152.4       8.5      00:30:28
  5316       9   4,735      42,615       160.2       9.0      00:30:32
  5559       6   4,735      28,410       167.3       9.4      00:30:44
  5786       6   4,735      28,410       174.0       9.7      00:30:58
  6057       8   4,735      37,880       182.3      10.2      00:30:52
  6329      10   4,735      47,350       190.4      10.7      00:30:48
  6572       6   4,735      28,410       197.7      11.1      00:30:53
  6856       9   4,735      42,615       206.2      11.5      00:30:44
  7156       1   4,735       4,735       215.0      12.0      00:30:32
  7476       7   4,735      33,145       225.0      12.6      00:30:09
  7795       5   4,735      23,675       234.9      13.1      00:29:48
  8105       9   4,735      42,615       245.1      13.7      00:29:26
  8416      10   4,735      47,350       255.3      14.3      00:29:04
  8729       7   4,735      33,145       265.3      14.8      00:28:45
  9048       5   4,735      23,675       275.6      15.4      00:28:24
  9300       7   4,735      33,145       283.8      15.9      00:28:18
  9518       8   4,735      37,880       290.9      16.3      00:28:21
  9776      10   4,735      47,350       299.4      16.7      00:28:13
 10035       3   4,735      14,205       307.3      17.2      00:28:09
 10292      10   4,735      47,350       314.6      17.6      00:28:09
 10541       8   4,735      37,880       322.3      18.0      00:28:05
 10846       5   4,735      23,675       331.5      18.5      00:27:53
 11151       3   4,735      14,205       340.8      19.1      00:27:39
 11378      10   4,735      47,350       347.9      19.5      00:27:38
 11624       9   4,735      42,615       355.4      19.9      00:27:35
 11897       8   4,735      37,880       363.9      20.4      00:27:26
 12143       4   4,735      18,940       371.7      20.8      00:27:21
 12419      10   4,735      47,350       380.2      21.3      00:27:12
 12750       3   4,735      14,205       390.3      21.8      00:26:54
 13092       9   4,735      42,615       400.6      22.4      00:26:36
 13436       7   4,735      33,145       411.4      23.0      00:26:15
 13698       3   4,735      14,205       420.2      23.5      00:26:05
 13958       9   4,735      42,615       428.0      23.9      00:25:60
 14259       5   4,735      23,675       437.5      24.5      00:25:46
 14551       8   4,735      37,880       446.9      25.0      00:25:33
 14860       7   4,735      33,145       456.5      25.5      00:25:19
 15225       7   4,735      33,145       468.5      26.2      00:24:56
 15593       4   4,735      18,940       479.8      26.8      00:24:35
 15943       9   4,735      42,615       491.2      27.5      00:24:14
 16295       6   4,735      28,410       502.7      28.1      00:23:54
 16600       6   4,735      28,410       512.5      28.7      00:23:41
 16859       8   4,735      37,880       520.7      29.1      00:23:34
 17122       3   4,735      14,205       528.9      29.6      00:23:27
 17388       6   4,735      28,410       537.6      30.1      00:23:18
 17642       7   4,735      33,145       546.0      30.5      00:23:10
 17936       6   4,735      28,410       555.1      31.0      00:22:59
 18238       9   4,735      42,615       564.9      31.6      00:22:46
 18551       9   4,735      42,615       574.3      32.1      00:22:35
 18817       8   4,735      37,880       583.0      32.6      00:22:26
 19127       7   4,735      33,145       593.2      33.2      00:22:12
 19469      10   4,735      47,350       604.4      33.8      00:21:54
 19855       6   4,735      28,410       617.2      34.5      00:21:32
 20241      10   4,735      47,350       630.0      35.2      00:21:11
 20581       6   4,735      28,410       640.9      35.8      00:20:55
 20860       8   4,735      37,880       649.9      36.3      00:20:46
 21187       1   4,735       4,735       659.9      36.9      00:20:34
 21498      10   4,735      47,350       669.0      37.4      00:20:24
 21844       9   4,735      42,615       679.1      38.0      00:20:11
 22173       7   4,735      33,145       688.8      38.5      00:19:60
 22468       3   4,735      14,205       697.6      39.0      00:19:51
 22778       7   4,735      33,145       706.8      39.5      00:19:41
 23086      10   4,735      47,350       716.3      40.1      00:19:30
 23409      10   4,735      47,350       726.4      40.6      00:19:18
 23740       7   4,735      33,145       736.2      41.2      00:19:06
 24061       6   4,735      28,410       746.3      41.7      00:18:54
 24473       5   4,735      23,675       758.4      42.4      00:18:36
 24885       8   4,735      37,880       771.5      43.1      00:18:16
 25310       9   4,735      42,615       784.8      43.9      00:17:56
 25681      10   4,735      47,350       796.2      44.5      00:17:42
 25879      10   4,735      47,350       802.7      44.9      00:17:38
 26095       4   4,735      18,940       809.5      45.3      00:17:34
 26343       7   4,735      33,145       817.2      45.7      00:17:28
 26628       7   4,735      33,145       825.7      46.2      00:17:20
 26896       5   4,735      23,675       834.0      46.6      00:17:12
 27147       7   4,735      33,145       841.9      47.1      00:17:05
 27360       9   4,735      42,615       848.5      47.5      00:17:01
 27558       4   4,735      18,940       854.8      47.8      00:16:58
 27767       8   4,735      37,880       861.4      48.2      00:16:54
 28020       8   4,735      37,880       869.5      48.6      00:16:46
 28311       8   4,735      37,880       878.9      49.2      00:16:35
 28606       8   4,735      37,880       888.7      49.7      00:16:24
 28813       5   4,735      23,675       895.4      50.1      00:16:19
 29011       8   4,735      37,880       901.8      50.4      00:16:15
 29239       9   4,735      42,615       908.8      50.8      00:16:10
 29500       4   4,735      18,940       917.4      51.3      00:16:01
 29751       9   4,735      42,615       925.2      51.7      00:15:54
 29966       6   4,735      28,410       932.0      52.1      00:15:48
 30173       8   4,735      37,880       938.7      52.5      00:15:43
 30392       7   4,735      33,145       945.7      52.9      00:15:37
 30625       4   4,735      18,940       953.4      53.3      00:15:30
 30909       6   4,735      28,410       962.6      53.8      00:15:20
 31207       6   4,735      28,410       972.0      54.4      00:15:09
 31498       4   4,735      18,940       981.7      54.9      00:14:57
 31789       8   4,735      37,880       991.2      55.4      00:14:46
 32070       7   4,735      33,145     1,000.6      56.0      00:14:36
 32360       7   4,735      33,145     1,010.4      56.5      00:14:24
 32594       4   4,735      18,940     1,018.0      56.9      00:14:17
 32785       7   4,735      33,145     1,024.3      57.3      00:14:12
 33001       7   4,735      33,145     1,031.4      57.7      00:14:06
 33224       6   4,735      28,410     1,038.6      58.1      00:13:59
 33472       8   4,735      37,880     1,046.7      58.5      00:13:51
 33724       5   4,735      23,675     1,055.1      59.0      00:13:41
 33970      10   4,735      47,350     1,063.3      59.5      00:13:33
 34230       6   4,735      28,410     1,072.1      60.0      00:13:23
 34549       8   4,735      37,880     1,082.5      60.5      00:13:10
 34896       9   4,735      42,615     1,094.0      61.2      00:12:56
 35260      10   4,735      47,350     1,106.0      61.9      00:12:40
 35655       9   4,735      42,615     1,118.9      62.6      00:12:23
 36046       9   4,735      42,615     1,131.6      63.3      00:12:07
 36429       6   4,735      28,410     1,144.2      64.0      00:11:51
 36755       8   4,735      37,880     1,154.5      64.6      00:11:38
 37070       9   4,735      42,615     1,164.4      65.1      00:11:27
 37364       4   4,735      18,940     1,173.0      65.6      00:11:18
 37657       4   4,735      18,940     1,182.2      66.1      00:11:08
 37919       7   4,735      33,145     1,190.3      66.6      00:10:59
 38194       6   4,735      28,410     1,199.2      67.1      00:10:50
 38464       5   4,735      23,675     1,207.9      67.6      00:10:40
 38814       9   4,735      42,615     1,219.2      68.2      00:10:27
 39128       8   4,735      37,880     1,229.2      68.8      00:10:15
 39431       4   4,735      18,940     1,238.4      69.3      00:10:05
 39764       8   4,735      37,880     1,248.8      69.8      00:09:53
 40130       6   4,735      28,410     1,260.3      70.5      00:09:39
 40517      10   4,735      47,350     1,272.7      71.2      00:09:24
 40913       8   4,735      37,880     1,285.5      71.9      00:09:08
 41180       6   4,735      28,410     1,294.1      72.4      00:08:59
 41489       9   4,735      42,615     1,304.0      72.9      00:08:48
 41797       9   4,735      42,615     1,313.9      73.5      00:08:37
 42101       7   4,735      33,145     1,323.4      74.0      00:08:27
 42419       9   4,735      42,615     1,333.1      74.6      00:08:16
 42709       9   4,735      42,615     1,342.2      75.1      00:08:06
 42999      10   4,735      47,350     1,351.4      75.6      00:07:56
 43292      10   4,735      47,350     1,361.2      76.1      00:07:45
 43583       6   4,735      28,410     1,370.4      76.6      00:07:35
 43865       7   4,735      33,145     1,379.1      77.1      00:07:26
 44157       7   4,735      33,145     1,388.2      77.6      00:07:16
 44405       2   4,735       9,470     1,395.8      78.1      00:07:08
 44720       9   4,735      42,615     1,405.9      78.6      00:06:57
 45059      10   4,735      47,350     1,416.6      79.2      00:06:45
 45417       5   4,735      23,675     1,427.1      79.8      00:06:33
 45719       8   4,735      37,880     1,436.2      80.3      00:06:23
 46039       7   4,735      33,145     1,446.3      80.9      00:06:12
 46367       5   4,735      23,675     1,456.9      81.5      00:05:60
 46715       4   4,735      18,940     1,467.9      82.1      00:05:47
 47075       7   4,735      33,145     1,478.9      82.7      00:05:35
 47358       7   4,735      33,145     1,487.3      83.2      00:05:26
 47645       4   4,735      18,940     1,496.0      83.7      00:05:17
 47940       5   4,735      23,675     1,505.2      84.2      00:05:07
 48153       2   4,735       9,470     1,512.0      84.6      00:04:60
 48357      10   4,735      47,350     1,518.5      84.9      00:04:53
 48592       7   4,735      33,145     1,526.0      85.3      00:04:46
 48831       5   4,735      23,675     1,533.4      85.8      00:04:38
 49039       9   4,735      42,615     1,539.8      86.1      00:04:31
 49211      10   4,735      47,350     1,545.6      86.5      00:04:25
 49434       7   4,735      33,145     1,552.2      86.8      00:04:19
 49642      10   4,735      47,350     1,558.3      87.2      00:04:13
 49844       6   4,735      28,410     1,564.3      87.5      00:04:06
 50033       7   4,735      33,145     1,570.2      87.8      00:04:00
 50247      10   4,735      47,350     1,576.8      88.2      00:03:53
 50492       5   4,735      23,675     1,584.0      88.6      00:03:46
 50752       9   4,735      42,615     1,592.3      89.1      00:03:37
 51021       8   4,735      37,880     1,601.1      89.6      00:03:27
 51303       9   4,735      42,615     1,610.0      90.0      00:03:17
 51591       3   4,735      14,205     1,619.3      90.6      00:03:07
 51869       7   4,735      33,145     1,628.6      91.1      00:02:57
 52159       6   4,735      28,410     1,638.2      91.6      00:02:46
 52499       9   4,735      42,615     1,649.7      92.3      00:02:33
 52882       6   4,735      28,410     1,663.0      93.0      00:02:18
 53236       6   4,735      28,410     1,674.7      93.7      00:02:05
 53605       7   4,735      33,145     1,686.9      94.3      00:01:51
 53924       2   4,735       9,470     1,697.0      94.9      00:01:40
 54218       8   4,735      37,880     1,706.3      95.4      00:01:30
 54486       5   4,735      23,675     1,714.4      95.9      00:01:21
 54805       5   4,735      23,675     1,724.2      96.4      00:01:10
 55111       6   4,735      28,410     1,733.6      97.0      00:00:60
 55417       8   4,735      37,880     1,742.8      97.5      00:00:50
 55661       9   4,735      42,615     1,750.2      97.9      00:00:41
 55909      10   4,735      47,350     1,758.2      98.3      00:00:33
 56213      10   4,735      47,350     1,768.0      98.9      00:00:22
 56492       6   4,735      28,410     1,777.3      99.4      00:00:12

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1970.689
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
