
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A800_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   328       9   4,835      43,515         9.1       0.5      00:33:15
   681       5   4,835      24,175        19.2       1.1      00:31:25
  1028       5   4,835      24,175        29.6       1.6      00:30:25
  1352       7   4,835      33,845        39.9       2.2      00:29:55
  1660       7   4,835      33,845        49.7       2.7      00:29:51
  1985       3   4,835      14,505        59.6       3.3      00:29:41
  2308       5   4,835      24,175        69.7       3.8      00:29:27
  2671       2   4,835       9,670        80.7       4.4      00:28:53
  3033      10   4,835      48,350        91.9       5.0      00:28:20
  3418      10   4,835      48,350       104.6       5.7      00:27:28
  3801       6   4,835      29,010       116.9       6.4      00:26:51
  4134       7   4,835      33,845       126.8       6.9      00:26:50
  4435       7   4,835      33,845       135.8       7.4      00:27:01
  4700       7   4,835      33,845       144.4       7.9      00:27:13
  4950       7   4,835      33,845       152.2       8.3      00:27:32
  5203       9   4,835      43,515       160.1       8.8      00:27:47
  5488       5   4,835      24,175       168.9       9.2      00:27:51
  5757       6   4,835      29,010       176.7       9.7      00:28:03
  6049       5   4,835      24,175       185.9      10.2      00:27:59
  6366       7   4,835      33,845       195.5      10.7      00:27:51
  6626       4   4,835      19,340       203.4      11.1      00:27:58
  6877       7   4,835      33,845       211.2      11.6      00:28:05
  7168      10   4,835      48,350       220.0      12.0      00:28:02
  7529       8   4,835      38,680       231.4      12.7      00:27:37
  7867       9   4,835      43,515       242.3      13.3      00:27:17
  8204       6   4,835      29,010       253.6      13.9      00:26:55
  8530       7   4,835      33,845       264.4      14.5      00:26:37
  8829       6   4,835      29,010       274.1      15.0      00:26:28
  9155       8   4,835      38,680       285.0      15.6      00:26:11
  9419       7   4,835      33,845       293.7      16.1      00:26:08
  9688       2   4,835       9,670       302.8      16.6      00:26:02
  9969       6   4,835      29,010       311.8      17.1      00:25:57
 10225       7   4,835      33,845       319.3      17.5      00:25:60
 10446       3   4,835      14,505       326.2      17.9      00:26:06
 10745       6   4,835      29,010       335.4      18.4      00:25:58
 11013       9   4,835      43,515       343.9      18.8      00:25:54
 11249       8   4,835      38,680       351.2      19.2      00:25:57
 11502       8   4,835      38,680       359.3      19.7      00:25:54
 11787       5   4,835      24,175       368.1      20.2      00:25:47
 12062       8   4,835      38,680       376.9      20.6      00:25:40
 12353       6   4,835      29,010       386.1      21.1      00:25:32
 12685      10   4,835      48,350       396.6      21.7      00:25:16
 13001       8   4,835      38,680       406.1      22.2      00:25:06
 13347       6   4,835      29,010       417.1      22.8      00:24:49
 13669       6   4,835      29,010       428.0      23.4      00:24:32
 13946       7   4,835      33,845       436.7      23.9      00:24:26
 14220       4   4,835      19,340       445.4      24.4      00:24:19
 14526       4   4,835      19,340       455.6      25.0      00:24:06
 14848      10   4,835      48,350       465.8      25.5      00:23:53
 15206       6   4,835      29,010       477.7      26.2      00:23:33
 15621       9   4,835      43,515       490.9      26.9      00:23:09
 16018       3   4,835      14,505       504.0      27.6      00:22:46
 16351       9   4,835      43,515       515.2      28.2      00:22:30
 16630       7   4,835      33,845       524.2      28.7      00:22:23
 16864       8   4,835      38,680       531.9      29.1      00:22:20
 17102       4   4,835      19,340       539.5      29.6      00:22:17
 17365       6   4,835      29,010       548.2      30.0      00:22:11
 17608       7   4,835      33,845       556.5      30.5      00:22:05
 17911       5   4,835      24,175       566.0      31.0      00:21:55
 18238       9   4,835      43,515       576.8      31.6      00:21:41
 18522       7   4,835      33,845       585.5      32.1      00:21:34
 18775       7   4,835      33,845       594.0      32.5      00:21:28
 19065       7   4,835      33,845       603.7      33.1      00:21:17
 19375       8   4,835      38,680       613.9      33.6      00:21:05
 19712      10   4,835      48,350       625.4      34.3      00:20:50
 20042       5   4,835      24,175       636.8      34.9      00:20:35
 20407       6   4,835      29,010       648.6      35.5      00:20:18
 20699       6   4,835      29,010       658.3      36.1      00:20:08
 20977       5   4,835      24,175       667.5      36.6      00:19:59
 21262       9   4,835      43,515       676.0      37.0      00:19:53
 21522       7   4,835      33,845       683.9      37.5      00:19:47
 21859      10   4,835      48,350       693.9      38.0      00:19:36
 22195       7   4,835      33,845       704.0      38.6      00:19:25
 22524       7   4,835      33,845       714.2      39.1      00:19:14
 22835       3   4,835      14,505       723.3      39.6      00:19:05
 23125      10   4,835      48,350       732.6      40.1      00:18:56
 23423       3   4,835      14,505       742.2      40.7      00:18:46
 23732       8   4,835      38,680       751.5      41.2      00:18:37
 24045       8   4,835      38,680       761.5      41.7      00:18:26
 24457       8   4,835      38,680       773.9      42.4      00:18:09
 24858       8   4,835      38,680       786.8      43.1      00:17:51
 25191       6   4,835      29,010       797.6      43.7      00:17:39
 25562       6   4,835      29,010       809.5      44.3      00:17:24
 25842       4   4,835      19,340       818.4      44.8      00:17:16
 26090       8   4,835      38,680       826.4      45.3      00:17:10
 26425       4   4,835      19,340       836.9      45.8      00:16:58
 26763       4   4,835      19,340       847.3      46.4      00:16:46
 27105       9   4,835      43,515       858.2      47.0      00:16:34
 27411       6   4,835      29,010       868.0      47.5      00:16:24
 27689       6   4,835      29,010       877.1      48.0      00:16:15
 27989       5   4,835      24,175       886.9      48.6      00:16:05
 28354       8   4,835      38,680       898.9      49.2      00:15:50
 28702      10   4,835      48,350       910.5      49.9      00:15:37
 28991       7   4,835      33,845       920.2      50.4      00:15:27
 29313       6   4,835      29,010       930.5      51.0      00:15:16
 29634       3   4,835      14,505       940.9      51.5      00:15:04
 29879       7   4,835      33,845       948.9      52.0      00:14:58
 30065       5   4,835      24,175       955.0      52.3      00:14:55
 30282       6   4,835      29,010       962.1      52.7      00:14:50
 30517       6   4,835      29,010       970.0      53.1      00:14:44
 30777       9   4,835      43,515       978.5      53.6      00:14:36
 31090       8   4,835      38,680       988.6      54.2      00:14:25
 31394       7   4,835      33,845       998.7      54.7      00:14:14
 31760       9   4,835      43,515     1,011.1      55.4      00:13:59
 32167       7   4,835      33,845     1,025.0      56.1      00:13:42
 32534       8   4,835      38,680     1,037.6      56.8      00:13:27
 32763       6   4,835      29,010     1,045.1      57.2      00:13:21
 32975       7   4,835      33,845     1,052.3      57.6      00:13:15
 33189       6   4,835      29,010     1,059.4      58.0      00:13:10
 33505       6   4,835      29,010     1,069.9      58.6      00:12:59
 33739       7   4,835      33,845     1,077.9      59.0      00:12:51
 33963       8   4,835      38,680     1,085.5      59.5      00:12:45
 34211       7   4,835      33,845     1,094.0      59.9      00:12:37
 34599       6   4,835      29,010     1,107.0      60.6      00:12:21
 34990       5   4,835      24,175     1,120.3      61.4      00:12:05
 35363      10   4,835      48,350     1,132.8      62.0      00:11:51
 35631       3   4,835      14,505     1,141.7      62.5      00:11:42
 35984      10   4,835      48,350     1,153.4      63.2      00:11:29
 36343       6   4,835      29,010     1,165.5      63.8      00:11:15
 36675       2   4,835       9,670     1,176.5      64.4      00:11:03
 36943       8   4,835      38,680     1,185.1      64.9      00:10:55
 37199       4   4,835      19,340     1,192.9      65.3      00:10:48
 37461       7   4,835      33,845     1,200.9      65.8      00:10:41
 37725       8   4,835      38,680     1,209.1      66.2      00:10:33
 37983       9   4,835      43,515     1,217.4      66.7      00:10:26
 38268       4   4,835      19,340     1,226.8      67.2      00:10:16
 38498      10   4,835      48,350     1,234.6      67.6      00:10:09
 38800       4   4,835      19,340     1,244.5      68.2      00:09:59
 39074       5   4,835      24,175     1,253.4      68.7      00:09:50
 39300       6   4,835      29,010     1,260.5      69.0      00:09:44
 39567       7   4,835      33,845     1,269.0      69.5      00:09:36
 39878       9   4,835      43,515     1,279.0      70.1      00:09:25
 40266       5   4,835      24,175     1,291.3      70.7      00:09:11
 40652       8   4,835      38,680     1,304.0      71.4      00:08:57
 41021       4   4,835      19,340     1,316.3      72.1      00:08:43
 41294       4   4,835      19,340     1,325.2      72.6      00:08:35
 41639       8   4,835      38,680     1,336.5      73.2      00:08:22
 41915       8   4,835      38,680     1,345.6      73.7      00:08:13
 42182       5   4,835      24,175     1,353.8      74.2      00:08:05
 42450       7   4,835      33,845     1,362.4      74.6      00:07:57
 42757       5   4,835      24,175     1,372.0      75.2      00:07:47
 43074       6   4,835      29,010     1,382.5      75.7      00:07:36
 43373       7   4,835      33,845     1,392.6      76.3      00:07:25
 43675       8   4,835      38,680     1,402.2      76.8      00:07:16
 43973       6   4,835      29,010     1,411.8      77.3      00:07:06
 44265       5   4,835      24,175     1,421.1      77.8      00:06:56
 44575       8   4,835      38,680     1,430.8      78.4      00:06:46
 44902       5   4,835      24,175     1,441.5      79.0      00:06:35
 45280       8   4,835      38,680     1,453.3      79.6      00:06:22
 45585       8   4,835      38,680     1,462.6      80.1      00:06:13
 45913      10   4,835      48,350     1,472.6      80.7      00:06:03
 46178       9   4,835      43,515     1,481.3      81.1      00:05:54
 46423       8   4,835      38,680     1,489.4      81.6      00:05:46
 46699       6   4,835      29,010     1,498.4      82.1      00:05:37
 46996       6   4,835      29,010     1,507.8      82.6      00:05:27
 47213       9   4,835      43,515     1,514.1      82.9      00:05:22
 47400      10   4,835      48,350     1,520.1      83.3      00:05:16
 47680       5   4,835      24,175     1,528.8      83.7      00:05:07
 47966       6   4,835      29,010     1,538.0      84.2      00:04:58
 48239      10   4,835      48,350     1,546.6      84.7      00:04:49
 48524      10   4,835      48,350     1,556.0      85.2      00:04:40
 48787       7   4,835      33,845     1,564.4      85.7      00:04:31
 49074       8   4,835      38,680     1,573.5      86.2      00:04:22
 49298       7   4,835      33,845     1,580.9      86.6      00:04:14
 49525       9   4,835      43,515     1,587.8      87.0      00:04:08
 49755       8   4,835      38,680     1,594.6      87.3      00:04:01
 49970       9   4,835      43,515     1,601.3      87.7      00:03:54
 50209       9   4,835      43,515     1,608.9      88.1      00:03:47
 50459       7   4,835      33,845     1,616.4      88.5      00:03:39
 50700       8   4,835      38,680     1,624.2      89.0      00:03:31
 50913       8   4,835      38,680     1,631.2      89.4      00:03:24
 51159       9   4,835      43,515     1,639.4      89.8      00:03:16
 51438       8   4,835      38,680     1,648.4      90.3      00:03:06
 51767       9   4,835      43,515     1,659.5      90.9      00:02:55
 52095       6   4,835      29,010     1,670.5      91.5      00:02:43
 52417       5   4,835      24,175     1,681.7      92.1      00:02:31
 52803       9   4,835      43,515     1,695.4      92.9      00:02:16
 53197       8   4,835      38,680     1,708.7      93.6      00:02:02
 53604       8   4,835      38,680     1,722.4      94.3      00:01:47
 53865       6   4,835      29,010     1,731.0      94.8      00:01:39
 54132      10   4,835      48,350     1,739.5      95.3      00:01:30
 54427       7   4,835      33,845     1,748.9      95.8      00:01:20
 54800       5   4,835      24,175     1,760.4      96.4      00:01:08
 55143      10   4,835      48,350     1,771.3      97.0      00:00:57
 55421       7   4,835      33,845     1,779.7      97.5      00:00:48
 55689       6   4,835      29,010     1,788.1      97.9      00:00:39
 55975       6   4,835      29,010     1,797.5      98.5      00:00:29
 56302       6   4,835      29,010     1,808.3      99.0      00:00:18
 56619       5   4,835      24,175     1,819.0      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1905.33
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
