
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A600_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   373       6   4,635      27,810        10.0       0.6      00:28:55
   754       6   4,635      27,810        20.7       1.2      00:27:53
  1086       6   4,635      27,810        30.3       1.7      00:28:24
  1404       8   4,635      37,080        40.0       2.3      00:28:32
  1721       4   4,635      18,540        49.7       2.8      00:28:32
  2046       6   4,635      27,810        59.0       3.4      00:28:39
  2375       8   4,635      37,080        68.8       3.9      00:28:31
  2683       8   4,635      37,080        77.9       4.5      00:28:39
  2973       6   4,635      27,810        86.5       4.9      00:28:52
  3263      10   4,635      46,350        95.8       5.5      00:28:49
  3560       7   4,635      32,445       104.9       6.0      00:28:46
  3863       8   4,635      37,080       114.0       6.5      00:28:46
  4093       7   4,635      32,445       120.6       6.9      00:29:21
  4322      10   4,635      46,350       127.0       7.3      00:29:53
  4549       2   4,635       9,270       133.8       7.7      00:30:16
  4775       9   4,635      41,715       140.9       8.1      00:30:32
  4997       8   4,635      37,080       147.5       8.4      00:30:51
  5228       3   4,635      13,905       154.4       8.8      00:31:05
  5444       9   4,635      41,715       160.9       9.2      00:31:21
  5662       7   4,635      32,445       166.8       9.5      00:31:42
  5880       7   4,635      32,445       173.2       9.9      00:31:56
  6107       5   4,635      23,175       180.2      10.3      00:32:01
  6347       7   4,635      32,445       187.1      10.7      00:32:06
  6583       9   4,635      41,715       194.1      11.1      00:32:09
  6799       8   4,635      37,080       200.4      11.5      00:32:18
  7017       7   4,635      32,445       206.7      11.8      00:32:26
  7278       6   4,635      27,810       214.3      12.3      00:32:19
  7546       8   4,635      37,080       222.6      12.7      00:32:06
  7821       3   4,635      13,905       230.9      13.2      00:31:52
  8076       5   4,635      23,175       239.2      13.7      00:31:39
  8323       9   4,635      41,715       247.1      14.1      00:31:30
  8588       6   4,635      27,810       255.5      14.6      00:31:16
  8854       8   4,635      37,080       263.8      15.1      00:31:04
  9135      10   4,635      46,350       272.8      15.6      00:30:46
  9335       1   4,635       4,635       279.1      16.0      00:30:49
  9506       8   4,635      37,080       284.6      16.3      00:30:58
  9684       4   4,635      18,540       290.4      16.6      00:31:03
  9879       5   4,635      23,175       296.4      16.9      00:31:07
 10091       7   4,635      32,445       302.6      17.3      00:31:09
 10303       8   4,635      37,080       308.5      17.6      00:31:13
 10506       8   4,635      37,080       314.7      18.0      00:31:14
 10766       6   4,635      27,810       322.3      18.4      00:31:04
 10981       8   4,635      37,080       328.9      18.8      00:31:02
 11179       9   4,635      41,715       334.8      19.1      00:31:04
 11350       9   4,635      41,715       339.9      19.4      00:31:11
 11522       3   4,635      13,905       345.2      19.7      00:31:16
 11697       6   4,635      27,810       350.4      20.0      00:31:21
 11851       7   4,635      32,445       355.1      20.3      00:31:30
 12034       3   4,635      13,905       360.7      20.6      00:31:31
 12237       7   4,635      32,445       366.9      21.0      00:31:28
 12523       6   4,635      27,810       375.5      21.5      00:31:10
 12849       8   4,635      37,080       385.0      22.0      00:30:47
 13155       5   4,635      23,175       394.3      22.5      00:30:26
 13460       9   4,635      41,715       403.9      23.1      00:30:03
 13656       8   4,635      37,080       410.2      23.5      00:29:60
 13856       6   4,635      27,810       416.2      23.8      00:29:58
 14072       8   4,635      37,080       422.6      24.2      00:29:54
 14327       9   4,635      41,715       430.7      24.6      00:29:40
 14590       7   4,635      32,445       438.8      25.1      00:29:26
 14847       4   4,635      18,540       446.7      25.5      00:29:14
 15141      10   4,635      46,350       456.1      26.1      00:28:54
 15447       5   4,635      23,175       465.5      26.6      00:28:34
 15744       8   4,635      37,080       474.6      27.1      00:28:16
 16039       7   4,635      32,445       484.2      27.7      00:27:56
 16312       9   4,635      41,715       492.9      28.2      00:27:41
 16558       6   4,635      27,810       500.7      28.6      00:27:30
 16789       2   4,635       9,270       507.8      29.0      00:27:22
 16990       4   4,635      18,540       514.0      29.4      00:27:18
 17190       7   4,635      32,445       520.1      29.7      00:27:15
 17388      10   4,635      46,350       526.5      30.1      00:27:10
 17584       8   4,635      37,080       532.9      30.5      00:27:04
 17835      10   4,635      46,350       540.4      30.9      00:26:54
 18097       8   4,635      37,080       548.7      31.4      00:26:41
 18408       9   4,635      41,715       558.2      31.9      00:26:23
 18603       7   4,635      32,445       564.1      32.3      00:26:19
 18803       6   4,635      27,810       570.5      32.6      00:26:14
 19003       5   4,635      23,175       577.1      33.0      00:26:07
 19225       4   4,635      18,540       584.2      33.4      00:25:59
 19487       8   4,635      37,080       592.5      33.9      00:25:46
 19769       6   4,635      27,810       601.8      34.4      00:25:29
 20047       8   4,635      37,080       610.9      34.9      00:25:13
 20350       5   4,635      23,175       620.2      35.5      00:24:56
 20573       1   4,635       4,635       627.3      35.9      00:24:47
 20784      10   4,635      46,350       634.0      36.2      00:24:41
 20981      10   4,635      46,350       640.2      36.6      00:24:36
 21223       7   4,635      32,445       647.1      37.0      00:24:28
 21460      10   4,635      46,350       654.1      37.4      00:24:20
 21683       4   4,635      18,540       660.5      37.8      00:24:14
 21897       7   4,635      32,445       666.7      38.1      00:24:08
 22131       7   4,635      32,445       673.3      38.5      00:24:01
 22358       6   4,635      27,810       680.0      38.9      00:23:54
 22563       7   4,635      32,445       686.0      39.2      00:23:49
 22802       3   4,635      13,905       692.6      39.6      00:23:42
 23080       7   4,635      32,445       701.2      40.1      00:23:28
 23375       3   4,635      13,905       710.2      40.6      00:23:13
 23680       8   4,635      37,080       719.0      41.1      00:22:58
 23972       7   4,635      32,445       727.9      41.6      00:22:44
 24255      10   4,635      46,350       736.3      42.1      00:22:31
 24541       6   4,635      27,810       744.8      42.6      00:22:18
 24829      10   4,635      46,350       753.7      43.1      00:22:04
 25113      10   4,635      46,350       762.4      43.6      00:21:50
 25391       7   4,635      32,445       770.9      44.1      00:21:37
 25636      10   4,635      46,350       778.2      44.5      00:21:28
 25822       5   4,635      23,175       784.2      44.8      00:21:22
 26026       7   4,635      32,445       790.5      45.2      00:21:16
 26253       6   4,635      27,810       797.7      45.6      00:21:07
 26507       6   4,635      27,810       805.0      46.0      00:20:58
 26768       7   4,635      32,445       813.0      46.5      00:20:46
 27031      10   4,635      46,350       821.0      46.9      00:20:35
 27241       6   4,635      27,810       827.3      47.3      00:20:28
 27460       6   4,635      27,810       834.0      47.7      00:20:21
 27652       7   4,635      32,445       840.0      48.0      00:20:15
 27901      10   4,635      46,350       847.9      48.5      00:20:04
 28209       6   4,635      27,810       857.4      49.0      00:19:48
 28485      10   4,635      46,350       866.4      49.5      00:19:34
 28710       9   4,635      41,715       873.6      50.0      00:19:25
 28869       8   4,635      37,080       878.6      50.2      00:19:22
 29073       9   4,635      41,715       885.1      50.6      00:19:14
 29323      10   4,635      46,350       892.8      51.0      00:19:04
 29589       7   4,635      32,445       901.0      51.5      00:18:52
 29812       6   4,635      27,810       908.0      51.9      00:18:43
 30017       9   4,635      41,715       914.4      52.3      00:18:36
 30227       7   4,635      32,445       921.0      52.7      00:18:28
 30456      10   4,635      46,350       928.3      53.1      00:18:19
 30726       8   4,635      37,080       936.8      53.6      00:18:06
 31011       4   4,635      18,540       945.6      54.1      00:17:53
 31316       7   4,635      32,445       955.4      54.6      00:17:37
 31629       5   4,635      23,175       965.4      55.2      00:17:21
 31915       9   4,635      41,715       974.8      55.7      00:17:07
 32204       9   4,635      41,715       984.3      56.3      00:16:52
 32482       5   4,635      23,175       993.4      56.8      00:16:38
 32655      10   4,635      46,350       998.8      57.1      00:16:34
 32824       8   4,635      37,080     1,004.2      57.4      00:16:29
 33028       9   4,635      41,715     1,010.9      57.8      00:16:20
 33223       3   4,635      13,905     1,017.1      58.2      00:16:14
 33463      10   4,635      46,350     1,024.7      58.6      00:16:03
 33698       7   4,635      32,445     1,032.5      59.0      00:15:53
 33937       7   4,635      32,445     1,040.2      59.5      00:15:42
 34175      10   4,635      46,350     1,048.1      59.9      00:15:32
 34465       9   4,635      41,715     1,057.4      60.5      00:15:18
 34778       8   4,635      37,080     1,067.5      61.0      00:15:02
 35076       1   4,635       4,635     1,077.0      61.6      00:14:48
 35369       4   4,635      18,540     1,086.6      62.1      00:14:34
 35673       7   4,635      32,445     1,096.2      62.7      00:14:19
 35973      10   4,635      46,350     1,105.8      63.2      00:14:05
 36263       9   4,635      41,715     1,115.1      63.8      00:13:52
 36542      10   4,635      46,350     1,123.9      64.3      00:13:39
 36747       6   4,635      27,810     1,130.2      64.6      00:13:32
 36971       7   4,635      32,445     1,137.2      65.0      00:13:23
 37190      10   4,635      46,350     1,143.5      65.4      00:13:16
 37392       7   4,635      32,445     1,149.6      65.7      00:13:09
 37585      10   4,635      46,350     1,155.4      66.1      00:13:03
 37794       7   4,635      32,445     1,161.6      66.4      00:12:55
 38014      10   4,635      46,350     1,168.4      66.8      00:12:47
 38247       8   4,635      37,080     1,175.8      67.2      00:12:37
 38460      10   4,635      46,350     1,182.8      67.6      00:12:28
 38764      10   4,635      46,350     1,192.2      68.2      00:12:15
 39012       9   4,635      41,715     1,200.1      68.6      00:12:04
 39229      10   4,635      46,350     1,206.5      69.0      00:11:56
 39481      10   4,635      46,350     1,214.2      69.4      00:11:46
 39719       9   4,635      41,715     1,221.4      69.8      00:11:37
 39997       5   4,635      23,175     1,230.1      70.3      00:11:25
 40324       6   4,635      27,810     1,240.0      70.9      00:11:11
 40619       7   4,635      32,445     1,249.5      71.4      00:10:57
 40924       8   4,635      37,080     1,259.2      72.0      00:10:43
 41143       8   4,635      37,080     1,266.0      72.4      00:10:35
 41356       6   4,635      27,810     1,272.6      72.8      00:10:27
 41583       7   4,635      32,445     1,279.8      73.2      00:10:17
 41797       4   4,635      18,540     1,286.5      73.6      00:10:09
 41971       3   4,635      13,905     1,292.0      73.9      00:10:03
 42155       5   4,635      23,175     1,297.3      74.2      00:09:57
 42359      10   4,635      46,350     1,303.4      74.5      00:09:49
 42553       3   4,635      13,905     1,309.5      74.9      00:09:42
 42751       9   4,635      41,715     1,315.5      75.2      00:09:35
 42936       9   4,635      41,715     1,321.3      75.5      00:09:28
 43117       9   4,635      41,715     1,327.2      75.9      00:09:20
 43293       9   4,635      41,715     1,332.9      76.2      00:09:14
 43464       4   4,635      18,540     1,338.2      76.5      00:09:08
 43713       9   4,635      41,715     1,345.7      76.9      00:08:58
 43998       7   4,635      32,445     1,354.5      77.4      00:08:45
 44200      10   4,635      46,350     1,360.7      77.8      00:08:38
 44362       9   4,635      41,715     1,365.4      78.1      00:08:32
 44575       7   4,635      32,445     1,372.1      78.5      00:08:24
 44793       9   4,635      41,715     1,378.8      78.8      00:08:15
 45021       6   4,635      27,810     1,385.9      79.2      00:08:06
 45269      10   4,635      46,350     1,393.1      79.7      00:07:56
 45453       8   4,635      37,080     1,398.5      80.0      00:07:50
 45658       3   4,635      13,905     1,404.3      80.3      00:07:42
 45907       5   4,635      23,175     1,411.8      80.7      00:07:32
 46123       9   4,635      41,715     1,418.6      81.1      00:07:23
 46340       5   4,635      23,175     1,425.6      81.5      00:07:14
 46550       5   4,635      23,175     1,432.1      81.9      00:07:06
 46829      10   4,635      46,350     1,440.9      82.4      00:06:54
 47028       9   4,635      41,715     1,446.5      82.7      00:06:47
 47210       6   4,635      27,810     1,451.7      83.0      00:06:40
 47421       4   4,635      18,540     1,458.0      83.4      00:06:32
 47622      10   4,635      46,350     1,464.0      83.7      00:06:24
 47817       6   4,635      27,810     1,469.9      84.1      00:06:17
 47986       9   4,635      41,715     1,475.3      84.4      00:06:10
 48187       9   4,635      41,715     1,481.3      84.7      00:06:02
 48384       8   4,635      37,080     1,487.6      85.1      00:05:54
 48624       6   4,635      27,810     1,495.0      85.5      00:05:44
 48861       9   4,635      41,715     1,502.2      85.9      00:05:34
 49091      10   4,635      46,350     1,509.3      86.3      00:05:25
 49314       6   4,635      27,810     1,516.3      86.7      00:05:15
 49546       4   4,635      18,540     1,522.9      87.1      00:05:06
 49763       6   4,635      27,810     1,529.1      87.4      00:04:58
 49986       6   4,635      27,810     1,535.9      87.8      00:04:49
 50218       5   4,635      23,175     1,542.9      88.2      00:04:40
 50477      10   4,635      46,350     1,550.4      88.7      00:04:29
 50714      10   4,635      46,350     1,557.9      89.1      00:04:19
 50929       8   4,635      37,080     1,564.8      89.5      00:04:10
 51145       7   4,635      32,445     1,571.5      89.9      00:04:01
 51365       5   4,635      23,175     1,578.4      90.2      00:03:52
 51579       9   4,635      41,715     1,585.2      90.6      00:03:43
 51782      10   4,635      46,350     1,591.9      91.0      00:03:34
 52010       7   4,635      32,445     1,599.1      91.4      00:03:24
 52279       6   4,635      27,810     1,608.1      91.9      00:03:11
 52570       5   4,635      23,175     1,617.9      92.5      00:02:58
 52836       9   4,635      41,715     1,626.9      93.0      00:02:45
 53133       9   4,635      41,715     1,636.5      93.6      00:02:32
 53386       7   4,635      32,445     1,644.6      94.0      00:02:21
 53644       3   4,635      13,905     1,652.8      94.5      00:02:10
 53841       5   4,635      23,175     1,659.1      94.9      00:02:02
 54048       7   4,635      32,445     1,665.4      95.2      00:01:53
 54264       7   4,635      32,445     1,672.1      95.6      00:01:44
 54516       7   4,635      32,445     1,679.2      96.0      00:01:34
 54776       5   4,635      23,175     1,687.2      96.5      00:01:24
 55022       8   4,635      37,080     1,694.7      96.9      00:01:13
 55279       5   4,635      23,175     1,702.4      97.3      00:01:03
 55516       7   4,635      32,445     1,709.2      97.7      00:00:54
 55728       6   4,635      27,810     1,715.8      98.1      00:00:45
 55938       6   4,635      27,810     1,722.4      98.5      00:00:36
 56176       6   4,635      27,810     1,730.0      98.9      00:00:26
 56391       7   4,635      32,445     1,736.9      99.3      00:00:16
 56652       6   4,635      27,810     1,745.3      99.8      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 2376.608
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
