
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A200.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   351       9   4,235      38,115         8.6       0.5      00:30:57
   765       4   4,235      16,940        19.2       1.2      00:27:27
  1181       6   4,235      25,410        30.3       1.9      00:25:57
  1568       2   4,235       8,470        41.1       2.6      00:25:18
  1968       4   4,235      16,940        51.9       3.2      00:24:53
  2352       4   4,235      16,940        62.2       3.9      00:24:43
  2735      10   4,235      42,350        72.7       4.6      00:24:30
  3127       4   4,235      16,940        83.5       5.2      00:24:13
  3507       2   4,235       8,470        94.3       5.9      00:23:56
  3900       6   4,235      25,410       105.1       6.6      00:23:42
  4208       9   4,235      38,115       113.3       7.1      00:24:03
  4522       4   4,235      16,940       121.5       7.6      00:24:20
  4804       5   4,235      21,175       129.4       8.1      00:24:36
  5106       6   4,235      25,410       137.7       8.6      00:24:47
  5392      10   4,235      42,350       145.8       9.1      00:24:56
  5692       9   4,235      38,115       153.3       9.6      00:25:10
  6011       8   4,235      33,880       162.0      10.1      00:25:09
  6347       7   4,235      29,645       170.9      10.7      00:25:05
  6657       9   4,235      38,115       179.2      11.2      00:25:07
  6973       6   4,235      25,410       187.7      11.7      00:25:05
  7358       4   4,235      16,940       198.2      12.4      00:24:46
  7724      10   4,235      42,350       208.3      13.0      00:24:31
  8074       6   4,235      25,410       218.5      13.7      00:24:15
  8412       8   4,235      33,880       228.4      14.3      00:24:02
  8760       9   4,235      38,115       238.3      14.9      00:23:49
  9100       5   4,235      21,175       248.2      15.5      00:23:37
  9352      10   4,235      42,350       255.5      16.0      00:23:41
  9555      10   4,235      42,350       261.5      16.4      00:23:54
  9731       5   4,235      21,175       266.7      16.7      00:24:10
  9880       9   4,235      38,115       270.9      17.0      00:24:33
 10033      10   4,235      42,350       275.0      17.2      00:24:55
 10172       8   4,235      33,880       278.4      17.4      00:25:20
 10306       6   4,235      25,410       281.9      17.6      00:25:44
 10421       9   4,235      38,115       285.2      17.8      00:26:09
 10583       6   4,235      25,410       289.5      18.1      00:26:26
 10739       8   4,235      33,880       293.7      18.4      00:26:42
 10925       7   4,235      29,645       298.9      18.7      00:26:52
 11136       7   4,235      29,645       304.6      19.1      00:26:57
 11302       5   4,235      21,175       309.2      19.3      00:27:10
 11445       5   4,235      21,175       313.3      19.6      00:27:25
 11580       6   4,235      25,410       316.9      19.8      00:27:42
 11739       8   4,235      33,880       321.2      20.1      00:27:54
 11892       7   4,235      29,645       325.6      20.4      00:28:05
 12062       7   4,235      29,645       330.4      20.7      00:28:13
 12222       9   4,235      38,115       334.8      21.0      00:28:22
 12441       4   4,235      16,940       340.7      21.3      00:28:22
 12642       5   4,235      21,175       346.4      21.7      00:28:23
 12888       4   4,235      16,940       352.8      22.1      00:28:19
 13147       8   4,235      33,880       360.0      22.5      00:28:09
 13380       7   4,235      29,645       366.5      22.9      00:28:04
 13583      10   4,235      42,350       372.7      23.3      00:28:01
 13730       5   4,235      21,175       376.8      23.6      00:28:10
 13885       6   4,235      25,410       381.1      23.8      00:28:17
 14034       9   4,235      38,115       385.0      24.1      00:28:26
 14174       8   4,235      33,880       389.1      24.3      00:28:33
 14295       8   4,235      33,880       392.6      24.6      00:28:44
 14450       5   4,235      21,175       397.0      24.8      00:28:49
 14624       8   4,235      33,880       401.9      25.2      00:28:51
 14768       9   4,235      38,115       406.0      25.4      00:28:57
 14939       7   4,235      29,645       410.7      25.7      00:28:59
 15141      10   4,235      42,350       416.7      26.1      00:28:54
 15340      10   4,235      42,350       422.4      26.4      00:28:50
 15554       6   4,235      25,410       428.3      26.8      00:28:45
 15795       8   4,235      33,880       435.2      27.2      00:28:35
 16020       7   4,235      29,645       441.8      27.6      00:28:26
 16274       7   4,235      29,645       449.3      28.1      00:28:12
 16501       8   4,235      33,880       455.9      28.5      00:28:03
 16700       9   4,235      38,115       461.5      28.9      00:27:59
 16890       4   4,235      16,940       466.7      29.2      00:27:57
 17000      10   4,235      42,350       470.0      29.4      00:28:05
 17152       6   4,235      25,410       474.1      29.7      00:28:08
 17296       6   4,235      25,410       478.3      29.9      00:28:10
 17458       8   4,235      33,880       483.1      30.2      00:28:09
 17631       9   4,235      38,115       488.3      30.6      00:28:06
 17791      10   4,235      42,350       492.6      30.8      00:28:08
 17977       6   4,235      25,410       497.8      31.2      00:28:04
 18206       5   4,235      21,175       504.6      31.6      00:27:53
 18415       7   4,235      29,645       510.2      31.9      00:27:48
 18576      10   4,235      42,350       514.7      32.2      00:27:48
 18722       7   4,235      29,645       519.0      32.5      00:27:48
 18877       7   4,235      29,645       523.5      32.8      00:27:47
 19024       7   4,235      29,645       527.9      33.0      00:27:47
 19172       6   4,235      25,410       532.2      33.3      00:27:47
 19311       8   4,235      33,880       536.3      33.6      00:27:48
 19513       7   4,235      29,645       542.2      33.9      00:27:40
 19721      10   4,235      42,350       548.4      34.3      00:27:31
 19940       9   4,235      38,115       554.9      34.7      00:27:20
 20172       9   4,235      38,115       561.8      35.2      00:27:08
 20371       8   4,235      33,880       567.3      35.5      00:27:01
 20546       6   4,235      25,410       572.5      35.8      00:26:57
 20685       7   4,235      29,645       576.5      36.1      00:26:57
 20858       6   4,235      25,410       581.5      36.4      00:26:53
 20994       8   4,235      33,880       585.4      36.6      00:26:53
 21160       1   4,235       4,235       589.7      36.9      00:26:52
 21284       5   4,235      21,175       592.7      37.1      00:26:56
 21447       8   4,235      33,880       597.2      37.4      00:26:54
 21602      10   4,235      42,350       601.4      37.6      00:26:52
 21758      10   4,235      42,350       605.3      37.9      00:26:52
 21919       7   4,235      29,645       609.8      38.2      00:26:49
 22045       8   4,235      33,880       613.2      38.4      00:26:51
 22210       9   4,235      38,115       617.4      38.6      00:26:49
 22326       3   4,235      12,705       620.5      38.8      00:26:52
 22467      10   4,235      42,350       624.2      39.1      00:26:52
 22609       9   4,235      38,115       628.1      39.3      00:26:51
 22802       3   4,235      12,705       632.9      39.6      00:26:46
 23018       5   4,235      21,175       638.9      40.0      00:26:36
 23233       5   4,235      21,175       645.0      40.4      00:26:25
 23451       4   4,235      16,940       650.8      40.7      00:26:16
 23668       5   4,235      21,175       656.6      41.1      00:26:07
 23878       9   4,235      38,115       662.7      41.5      00:25:57
 24102       6   4,235      25,410       668.7      41.8      00:25:47
 24288       8   4,235      33,880       673.5      42.1      00:25:42
 24519       8   4,235      33,880       679.9      42.5      00:25:30
 24764       3   4,235      12,705       686.8      43.0      00:25:17
 24988      10   4,235      42,350       693.0      43.4      00:25:06
 25179       4   4,235      16,940       698.5      43.7      00:24:58
 25360       8   4,235      33,880       703.5      44.0      00:24:52
 25573      10   4,235      42,350       709.4      44.4      00:24:43
 25715       8   4,235      33,880       713.4      44.6      00:24:40
 25843      10   4,235      42,350       717.2      44.9      00:24:38
 26021       8   4,235      33,880       722.1      45.2      00:24:32
 26192      10   4,235      42,350       727.0      45.5      00:24:26
 26394       6   4,235      25,410       732.5      45.8      00:24:17
 26595       9   4,235      38,115       737.9      46.2      00:24:09
 26793       4   4,235      16,940       743.4      46.5      00:24:01
 26950       7   4,235      29,645       747.9      46.8      00:23:56
 27099       9   4,235      38,115       752.0      47.1      00:23:53
 27247       6   4,235      25,410       756.1      47.3      00:23:49
 27407      10   4,235      42,350       760.6      47.6      00:23:44
 27573       3   4,235      12,705       765.3      47.9      00:23:38
 27746       9   4,235      38,115       770.2      48.2      00:23:32
 27925       5   4,235      21,175       775.4      48.5      00:23:24
 28108       5   4,235      21,175       780.6      48.9      00:23:17
 28272       6   4,235      25,410       785.3      49.1      00:23:11
 28459       7   4,235      29,645       790.8      49.5      00:23:02
 28633       7   4,235      29,645       795.9      49.8      00:22:54
 28801       5   4,235      21,175       800.8      50.1      00:22:48
 28911      10   4,235      42,350       804.0      50.3      00:22:47
 29025       8   4,235      33,880       807.3      50.5      00:22:45
 29192       3   4,235      12,705       811.9      50.8      00:22:39
 29387       9   4,235      38,115       817.6      51.2      00:22:30
 29535       8   4,235      33,880       821.7      51.4      00:22:25
 29700       5   4,235      21,175       826.4      51.7      00:22:19
 29812       6   4,235      25,410       829.7      51.9      00:22:17
 29940       4   4,235      16,940       833.2      52.1      00:22:15
 30051       3   4,235      12,705       836.4      52.3      00:22:13
 30150       8   4,235      33,880       839.3      52.5      00:22:13
 30271       7   4,235      29,645       842.8      52.7      00:22:10
 30418       6   4,235      25,410       847.0      53.0      00:22:05
 30565       6   4,235      25,410       851.4      53.3      00:21:59
 30792       8   4,235      33,880       857.9      53.7      00:21:46
 31026       8   4,235      33,880       864.4      54.1      00:21:34
 31238       4   4,235      16,940       870.7      54.5      00:21:22
 31434      10   4,235      42,350       876.5      54.8      00:21:11
 31664       9   4,235      38,115       883.1      55.3      00:20:58
 31856       7   4,235      29,645       888.9      55.6      00:20:48
 32106       7   4,235      29,645       896.4      56.1      00:20:32
 32278       8   4,235      33,880       901.5      56.4      00:20:24
 32473       8   4,235      33,880       907.5      56.8      00:20:13
 32579       7   4,235      29,645       910.4      57.0      00:20:12
 32694       7   4,235      29,645       913.7      57.2      00:20:09
 32824       8   4,235      33,880       917.6      57.4      00:20:05
 32975       4   4,235      16,940       922.1      57.7      00:19:58
 33107      10   4,235      42,350       926.0      58.0      00:19:54
 33259       8   4,235      33,880       930.4      58.2      00:19:47
 33467       8   4,235      33,880       936.4      58.6      00:19:36
 33615       9   4,235      38,115       940.9      58.9      00:19:30
 33793       6   4,235      25,410       946.1      59.2      00:19:21
 33941       9   4,235      38,115       950.6      59.5      00:19:14
 34078       8   4,235      33,880       954.6      59.7      00:19:09
 34248       6   4,235      25,410       959.7      60.1      00:19:01
 34463       6   4,235      25,410       966.1      60.5      00:18:48
 34698       9   4,235      38,115       973.0      60.9      00:18:35
 34943       7   4,235      29,645       980.3      61.3      00:18:20
 35171       5   4,235      21,175       987.0      61.8      00:18:07
 35396       5   4,235      21,175       993.6      62.2      00:17:54
 35624       8   4,235      33,880     1,000.3      62.6      00:17:41
 35838      10   4,235      42,350     1,006.4      63.0      00:17:29
 36042      10   4,235      42,350     1,012.3      63.3      00:17:19
 36237       5   4,235      21,175     1,018.1      63.7      00:17:08
 36446       7   4,235      29,645     1,024.3      64.1      00:16:57
 36585       8   4,235      33,880     1,028.1      64.3      00:16:52
 36748       9   4,235      38,115     1,032.7      64.6      00:16:45
 36883      10   4,235      42,350     1,036.6      64.9      00:16:39
 37022       5   4,235      21,175     1,040.4      65.1      00:16:34
 37168      10   4,235      42,350     1,044.3      65.4      00:16:29
 37316       8   4,235      33,880     1,048.2      65.6      00:16:24
 37471       7   4,235      29,645     1,052.5      65.9      00:16:17
 37617       9   4,235      38,115     1,056.6      66.1      00:16:11
 37782       9   4,235      38,115     1,061.0      66.4      00:16:05
 37960       4   4,235      16,940     1,066.0      66.7      00:15:56
 38090       9   4,235      38,115     1,069.8      66.9      00:15:51
 38220       7   4,235      29,645     1,073.6      67.2      00:15:46
 38351       4   4,235      16,940     1,077.4      67.4      00:15:40
 38517      10   4,235      42,350     1,082.3      67.7      00:15:32
 38726       6   4,235      25,410     1,088.4      68.1      00:15:21
 38933       6   4,235      25,410     1,094.2      68.5      00:15:10
 39066       7   4,235      29,645     1,098.0      68.7      00:15:04
 39269      10   4,235      42,350     1,103.5      69.1      00:14:54
 39442       6   4,235      25,410     1,108.3      69.4      00:14:46
 39636       6   4,235      25,410     1,113.8      69.7      00:14:36
 39794       6   4,235      25,410     1,118.2      70.0      00:14:29
 40020       7   4,235      29,645     1,124.6      70.4      00:14:17
 40206       8   4,235      33,880     1,129.7      70.7      00:14:08
 40416       5   4,235      21,175     1,135.7      71.1      00:13:57
 40622       8   4,235      33,880     1,141.8      71.5      00:13:46
 40829       5   4,235      21,175     1,147.6      71.8      00:13:35
 40985       7   4,235      29,645     1,152.3      72.1      00:13:27
 41098       6   4,235      25,410     1,155.5      72.3      00:13:23
 41250       6   4,235      25,410     1,159.9      72.6      00:13:16
 41422      10   4,235      42,350     1,164.7      72.9      00:13:07
 41608       6   4,235      25,410     1,170.1      73.2      00:12:58
 41763       5   4,235      21,175     1,174.5      73.5      00:12:50
 41933       6   4,235      25,410     1,179.6      73.8      00:12:41
 42122       3   4,235      12,705     1,184.5      74.1      00:12:33
 42319       7   4,235      29,645     1,189.7      74.5      00:12:23
 42483       2   4,235       8,470     1,194.6      74.8      00:12:15
 42665       6   4,235      25,410     1,199.6      75.1      00:12:06
 42797       8   4,235      33,880     1,203.3      75.3      00:12:01
 42945       8   4,235      33,880     1,207.5      75.6      00:11:54
 43051       8   4,235      33,880     1,210.7      75.8      00:11:49
 43213       9   4,235      38,115     1,215.5      76.1      00:11:41
 43368       8   4,235      33,880     1,220.1      76.4      00:11:33
 43533       7   4,235      29,645     1,224.6      76.6      00:11:25
 43770       7   4,235      29,645     1,231.1      77.0      00:11:13
 44015       8   4,235      33,880     1,238.1      77.5      00:10:59
 44162      10   4,235      42,350     1,242.2      77.7      00:10:52
 44305       7   4,235      29,645     1,246.2      78.0      00:10:46
 44511       8   4,235      33,880     1,251.8      78.3      00:10:35
 44688       8   4,235      33,880     1,256.8      78.7      00:10:26
 44917       9   4,235      38,115     1,263.4      79.1      00:10:14
 45147       8   4,235      33,880     1,269.7      79.5      00:10:02
 45344       5   4,235      21,175     1,274.7      79.8      00:09:53
 45486       7   4,235      29,645     1,278.7      80.0      00:09:46
 45679       7   4,235      29,645     1,283.7      80.3      00:09:37
 45875       8   4,235      33,880     1,289.0      80.7      00:09:27
 46021       8   4,235      33,880     1,293.3      80.9      00:09:20
 46152       6   4,235      25,410     1,297.1      81.2      00:09:14
 46299       6   4,235      25,410     1,301.4      81.4      00:09:06
 46451       8   4,235      33,880     1,305.6      81.7      00:08:59
 46593       9   4,235      38,115     1,309.7      82.0      00:08:52
 46858       6   4,235      25,410     1,317.4      82.4      00:08:37
 47039       5   4,235      21,175     1,322.0      82.7      00:08:29
 47193       8   4,235      33,880     1,326.0      83.0      00:08:22
 47356       7   4,235      29,645     1,330.5      83.3      00:08:14
 47564      10   4,235      42,350     1,336.1      83.6      00:08:04
 47698       8   4,235      33,880     1,339.9      83.8      00:07:57
 47841       7   4,235      29,645     1,343.7      84.1      00:07:51
 47960       7   4,235      29,645     1,347.2      84.3      00:07:45
 48097      10   4,235      42,350     1,351.1      84.5      00:07:38
 48295       9   4,235      38,115     1,356.7      84.9      00:07:28
 48579       8   4,235      33,880     1,364.8      85.4      00:07:12
 48826      10   4,235      42,350     1,371.6      85.8      00:06:59
 49020       8   4,235      33,880     1,377.0      86.2      00:06:49
 49224       9   4,235      38,115     1,383.0      86.5      00:06:38
 49396       8   4,235      33,880     1,387.5      86.8      00:06:30
 49617      10   4,235      42,350     1,393.3      87.2      00:06:19
 49903       7   4,235      29,645     1,401.0      87.7      00:06:04
 50197       6   4,235      25,410     1,409.2      88.2      00:05:48
 50494      10   4,235      42,350     1,417.2      88.7      00:05:33
 50766       6   4,235      25,410     1,425.0      89.2      00:05:18
 51008       8   4,235      33,880     1,432.2      89.6      00:05:04
 51278       8   4,235      33,880     1,439.7      90.1      00:04:50
 51531       6   4,235      25,410     1,447.0      90.6      00:04:36
 51764       6   4,235      25,410     1,454.0      91.0      00:04:23
 52076       8   4,235      33,880     1,463.2      91.6      00:04:06
 52368      10   4,235      42,350     1,472.0      92.1      00:03:49
 52670       8   4,235      33,880     1,481.4      92.7      00:03:31
 53026       6   4,235      25,410     1,492.2      93.4      00:03:11
 53379      10   4,235      42,350     1,502.5      94.0      00:02:52
 53741       7   4,235      29,645     1,513.1      94.7      00:02:33
 53995       2   4,235       8,470     1,520.2      95.1      00:02:19
 54256       5   4,235      21,175     1,527.6      95.6      00:02:06
 54562       6   4,235      25,410     1,535.6      96.1      00:01:52
 54807       4   4,235      16,940     1,542.4      96.5      00:01:39
 55125       8   4,235      33,880     1,551.3      97.1      00:01:23
 55424       5   4,235      21,175     1,559.3      97.6      00:01:09
 55733       9   4,235      38,115     1,567.8      98.1      00:00:54
 56029       7   4,235      29,645     1,576.3      98.6      00:00:38
 56314       8   4,235      33,880     1,584.7      99.2      00:00:24
 56611      10   4,235      42,350     1,593.5      99.7      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 2829.878
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A200.csv saved

. 
. cap log close

. 
end of do-file
