
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A300.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A300.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A300.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A300.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   494      10   4,335      43,350        12.3       0.8      00:22:04
  1007       4   4,335      17,340        25.9       1.6      00:20:47
  1531       8   4,335      34,680        40.9       2.5      00:19:31
  2051       6   4,335      26,010        55.2       3.4      00:19:07
  2579       6   4,335      26,010        69.7       4.3      00:18:45
  3064       6   4,335      26,010        83.3       5.1      00:18:40
  3544       6   4,335      26,010        97.4       6.0      00:18:28
  3991       4   4,335      17,340       109.7       6.7      00:18:34
  4362       8   4,335      34,680       119.7       7.3      00:19:02
  4716      10   4,335      43,350       129.9       7.9      00:19:21
  5106       7   4,335      30,345       140.7       8.6      00:19:31
  5481       6   4,335      26,010       151.2       9.2      00:19:40
  5876       3   4,335      13,005       161.6       9.9      00:19:48
  6282       3   4,335      13,005       173.1      10.6      00:19:45
  6690       9   4,335      39,015       184.2      11.3      00:19:45
  7127       3   4,335      13,005       196.3      12.0      00:19:35
  7583       9   4,335      39,015       209.1      12.8      00:19:22
  8068       5   4,335      21,675       223.3      13.6      00:19:01
  8512       9   4,335      39,015       236.6      14.5      00:18:46
  8982       6   4,335      26,010       250.4      15.3      00:18:29
  9355       4   4,335      17,340       261.4      16.0      00:18:26
  9716       8   4,335      34,680       272.4      16.6      00:18:23
 10102       3   4,335      13,005       283.1      17.3      00:18:21
 10472       5   4,335      21,675       293.2      17.9      00:18:21
 10906       5   4,335      21,675       305.2      18.6      00:18:12
 11301       9   4,335      39,015       316.2      19.3      00:18:07
 11647       5   4,335      21,675       326.1      19.9      00:18:07
 12017       6   4,335      26,010       336.6      20.6      00:18:03
 12418       9   4,335      39,015       348.0      21.3      00:17:55
 12919       6   4,335      26,010       361.8      22.1      00:17:38
 13421       9   4,335      39,015       376.2      23.0      00:17:20
 13936       9   4,335      39,015       391.2      23.9      00:17:00
 14445       8   4,335      34,680       406.0      24.8      00:16:42
 14933       8   4,335      34,680       420.0      25.7      00:16:26
 15420       6   4,335      26,010       434.4      26.5      00:16:10
 15910       6   4,335      26,010       448.7      27.4      00:15:55
 16385      10   4,335      43,350       463.0      28.3      00:15:39
 16755       6   4,335      26,010       473.7      28.9      00:15:34
 17116       9   4,335      39,015       484.1      29.6      00:15:30
 17449      10   4,335      43,350       493.9      30.2      00:15:27
 17806       9   4,335      39,015       504.4      30.8      00:15:22
 18195       8   4,335      34,680       515.9      31.5      00:15:14
 18624       9   4,335      39,015       528.0      32.3      00:15:04
 19133       8   4,335      34,680       543.3      33.2      00:14:47
 19625       7   4,335      30,345       558.0      34.1      00:14:31
 20101       9   4,335      39,015       572.8      35.0      00:14:16
 20554       8   4,335      34,680       585.9      35.8      00:14:04
 20861       6   4,335      26,010       595.0      36.4      00:14:01
 21198       4   4,335      17,340       604.5      36.9      00:13:58
 21547       9   4,335      39,015       614.0      37.5      00:13:54
 21906       5   4,335      21,675       623.6      38.1      00:13:50
 22311       6   4,335      26,010       634.4      38.8      00:13:43
 22699       6   4,335      26,010       645.2      39.4      00:13:36
 23068       5   4,335      21,675       655.2      40.0      00:13:30
 23421      10   4,335      43,350       665.4      40.7      00:13:24
 23847       8   4,335      34,680       677.2      41.4      00:13:15
 24316       7   4,335      30,345       690.0      42.2      00:13:03
 24799       8   4,335      34,680       703.8      43.0      00:12:50
 25279       8   4,335      34,680       717.6      43.8      00:12:37
 25660       3   4,335      13,005       728.2      44.5      00:12:30
 25953       4   4,335      17,340       737.0      45.0      00:12:26
 26306       8   4,335      34,680       747.2      45.7      00:12:19
 26753       5   4,335      21,675       759.4      46.4      00:12:09
 27172      10   4,335      43,350       771.6      47.1      00:11:59
 27528      10   4,335      43,350       781.7      47.8      00:11:52
 27902      10   4,335      43,350       792.7      48.4      00:11:44
 28321       6   4,335      26,010       804.9      49.2      00:11:33
 28730       3   4,335      13,005       817.2      49.9      00:11:23
 29047       4   4,335      17,340       826.7      50.5      00:11:17
 29445       7   4,335      30,345       838.3      51.2      00:11:08
 29834       8   4,335      34,680       849.5      51.9      00:10:59
 30160       7   4,335      30,345       859.0      52.5      00:10:53
 30487       4   4,335      17,340       868.8      53.1      00:10:46
 30936       6   4,335      26,010       882.0      53.9      00:10:34
 31433      10   4,335      43,350       896.7      54.8      00:10:20
 31942       8   4,335      34,680       912.2      55.7      00:10:05
 32425      10   4,335      43,350       927.0      56.6      00:09:50
 32764       8   4,335      34,680       937.1      57.2      00:09:43
 33111       9   4,335      39,015       947.6      57.9      00:09:35
 33500       6   4,335      26,010       959.1      58.6      00:09:26
 33915       6   4,335      26,010       971.8      59.4      00:09:15
 34312       9   4,335      39,015       984.0      60.1      00:09:05
 34824       5   4,335      21,675       999.4      61.1      00:08:50
 35314       7   4,335      30,345     1,014.2      62.0      00:08:36
 35819       8   4,335      34,680     1,029.2      62.9      00:08:23
 36307       8   4,335      34,680     1,043.8      63.8      00:08:09
 36755       8   4,335      34,680     1,057.0      64.6      00:07:58
 37157       5   4,335      21,675     1,068.5      65.3      00:07:49
 37524      10   4,335      43,350     1,078.5      65.9      00:07:41
 37885       9   4,335      39,015     1,088.7      66.5      00:07:34
 38204       6   4,335      26,010     1,098.1      67.1      00:07:27
 38542      10   4,335      43,350     1,108.3      67.7      00:07:19
 38874       9   4,335      39,015     1,118.0      68.3      00:07:12
 39200      10   4,335      43,350     1,127.3      68.9      00:07:05
 39601       7   4,335      30,345     1,138.8      69.6      00:06:56
 40059       6   4,335      26,010     1,151.9      70.4      00:06:45
 40530       7   4,335      30,345     1,165.5      71.2      00:06:33
 40992       9   4,335      39,015     1,179.4      72.0      00:06:21
 41326       7   4,335      30,345     1,189.0      72.6      00:06:13
 41727       5   4,335      21,675     1,200.8      73.4      00:06:04
 42114       6   4,335      26,010     1,212.0      74.0      00:05:55
 42512       6   4,335      26,010     1,223.3      74.7      00:05:45
 42900       9   4,335      39,015     1,234.4      75.4      00:05:36
 43279       7   4,335      30,345     1,245.8      76.1      00:05:27
 43665       7   4,335      30,345     1,256.9      76.8      00:05:18
 44026       7   4,335      30,345     1,267.3      77.4      00:05:09
 44436       8   4,335      34,680     1,278.8      78.1      00:05:00
 44869       9   4,335      39,015     1,291.4      78.9      00:04:49
 45318       9   4,335      39,015     1,304.0      79.7      00:04:39
 45682       7   4,335      30,345     1,313.8      80.3      00:04:31
 46082       7   4,335      30,345     1,325.3      81.0      00:04:21
 46488       8   4,335      34,680     1,337.2      81.7      00:04:11
 46954       6   4,335      26,010     1,350.9      82.5      00:03:59
 47370       6   4,335      26,010     1,362.0      83.2      00:03:50
 47723       6   4,335      26,010     1,372.0      83.8      00:03:42
 48068      10   4,335      43,350     1,381.8      84.4      00:03:34
 48391       9   4,335      39,015     1,391.3      85.0      00:03:27
 48757       4   4,335      17,340     1,401.7      85.6      00:03:18
 49141       8   4,335      34,680     1,412.8      86.3      00:03:09
 49571       6   4,335      26,010     1,424.9      87.0      00:02:59
 50120       8   4,335      34,680     1,439.9      88.0      00:02:46
 50537       6   4,335      26,010     1,451.5      88.7      00:02:36
 50936      10   4,335      43,350     1,463.3      89.4      00:02:26
 51330       5   4,335      21,675     1,474.8      90.1      00:02:16
 51731       9   4,335      39,015     1,486.9      90.8      00:02:06
 52125       6   4,335      26,010     1,498.7      91.6      00:01:56
 52491       7   4,335      30,345     1,510.1      92.3      00:01:47
 52842       9   4,335      39,015     1,521.3      92.9      00:01:37
 53236       6   4,335      26,010     1,533.3      93.7      00:01:27
 53734       9   4,335      39,015     1,548.1      94.6      00:01:15
 54093      10   4,335      43,350     1,558.6      95.2      00:01:06
 54460       9   4,335      39,015     1,568.9      95.8      00:00:57
 54913       7   4,335      30,345     1,581.6      96.6      00:00:47
 55342       5   4,335      21,675     1,593.5      97.4      00:00:36
 55699      10   4,335      43,350     1,603.5      98.0      00:00:28
 56059       6   4,335      26,010     1,614.1      98.6      00:00:19
 56449       8   4,335      34,680     1,625.8      99.3      00:00:09
 56818       9   4,335      39,015     1,636.8     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1387.452
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A300.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A300.csv saved

. 
. cap log close

. 
end of do-file
