
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A100_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   264       8   4,135      33,080         6.3       0.4      00:41:25
   578       8   4,135      33,080        14.0       0.9      00:36:56
   890       9   4,135      37,215        21.7       1.4      00:35:27
  1192       6   4,135      24,810        29.9       1.9      00:34:14
  1473       5   4,135      20,675        37.6       2.4      00:33:49
  1730      10   4,135      41,350        44.5       2.9      00:34:06
  1974       3   4,135      12,405        50.8       3.3      00:34:42
  2267       9   4,135      37,215        58.6       3.8      00:34:14
  2535       7   4,135      28,945        65.5       4.2      00:34:19
  2784       8   4,135      33,080        72.4       4.6      00:34:19
  3082       6   4,135      24,810        80.1       5.1      00:33:57
  3359      10   4,135      41,350        88.1       5.6      00:33:29
  3650       7   4,135      28,945        96.0       6.2      00:33:07
  3875       6   4,135      24,810       102.0       6.5      00:33:25
  4047       6   4,135      24,810       106.4       6.8      00:34:15
  4213       1   4,135       4,135       110.7       7.1      00:34:59
  4382       5   4,135      20,675       114.8       7.4      00:35:44
  4539      10   4,135      41,350       119.1       7.6      00:36:23
  4682       4   4,135      16,540       123.1       7.9      00:37:03
  4837      10   4,135      41,350       127.2       8.2      00:37:39
  4983       5   4,135      20,675       131.2       8.4      00:38:14
  5159       6   4,135      24,810       135.9       8.7      00:38:32
  5310       5   4,135      20,675       139.9       9.0      00:39:01
  5462       3   4,135      12,405       143.9       9.2      00:39:28
  5598       8   4,135      33,080       147.2       9.4      00:40:06
  5708       7   4,135      28,945       150.1       9.6      00:40:50
  5899       3   4,135      12,405       155.0       9.9      00:40:54
  6089       9   4,135      37,215       160.3      10.3      00:40:53
  6282       9   4,135      37,215       165.3      10.6      00:40:54
  6455       4   4,135      16,540       169.8      10.9      00:41:04
  6602      10   4,135      41,350       173.6      11.1      00:41:24
  6768       8   4,135      33,080       177.9      11.4      00:41:34
  6904       7   4,135      28,945       181.6      11.6      00:41:53
  7085       6   4,135      24,810       186.3      11.9      00:41:55
  7288       7   4,135      28,945       191.5      12.3      00:41:49
  7498       4   4,135      16,540       197.2      12.6      00:41:35
  7720       4   4,135      16,540       203.2      13.0      00:41:17
  7897       9   4,135      37,215       208.3      13.3      00:41:14
  8110       9   4,135      37,215       214.4      13.7      00:40:56
  8322       7   4,135      28,945       220.4      14.1      00:40:39
  8539       7   4,135      28,945       226.6      14.5      00:40:20
  8746       6   4,135      24,810       232.3      14.9      00:40:08
  8961       7   4,135      28,945       238.4      15.3      00:39:50
  9178       6   4,135      24,810       244.5      15.7      00:39:34
  9306       6   4,135      24,810       248.2      15.9      00:39:45
  9465       8   4,135      33,080       252.6      16.2      00:39:47
  9624       6   4,135      24,810       257.3      16.5      00:39:46
  9780       7   4,135      28,945       261.8      16.8      00:39:47
  9943       6   4,135      24,810       266.1      17.1      00:39:49
 10095       5   4,135      20,675       270.0      17.3      00:39:55
 10251      10   4,135      41,350       273.9      17.6      00:40:01
 10394       4   4,135      16,540       277.7      17.8      00:40:08
 10561       5   4,135      20,675       282.1      18.1      00:40:07
 10768       3   4,135      12,405       287.6      18.4      00:39:56
 10959       9   4,135      37,215       292.8      18.8      00:39:47
 11144       5   4,135      20,675       297.7      19.1      00:39:41
 11259       8   4,135      33,080       300.8      19.3      00:39:53
 11404       8   4,135      33,080       304.7      19.5      00:39:56
 11535       3   4,135      12,405       308.2      19.8      00:40:03
 11690       7   4,135      28,945       312.4      20.0      00:40:03
 11880       9   4,135      37,215       317.6      20.4      00:39:53
 12041       6   4,135      24,810       322.0      20.6      00:39:51
 12216       3   4,135      12,405       326.8      20.9      00:39:44
 12424       9   4,135      37,215       332.3      21.3      00:39:31
 12660       6   4,135      24,810       338.7      21.7      00:39:10
 12946       7   4,135      28,945       346.0      22.2      00:38:42
 13228       6   4,135      24,810       353.7      22.7      00:38:11
 13458       7   4,135      28,945       360.2      23.1      00:37:51
 13638       6   4,135      24,810       365.4      23.4      00:37:42
 13794       6   4,135      24,810       369.6      23.7      00:37:41
 13994       1   4,135       4,135       374.9      24.0      00:37:31
 14225       9   4,135      37,215       381.3      24.4      00:37:12
 14423      10   4,135      41,350       386.9      24.8      00:36:59
 14590       7   4,135      28,945       391.5      25.1      00:36:55
 14838       5   4,135      20,675       398.3      25.5      00:36:34
 15126      10   4,135      41,350       406.4      26.0      00:36:03
 15459       9   4,135      37,215       415.6      26.6      00:35:26
 15804       5   4,135      20,675       425.2      27.2      00:34:48
 16132       9   4,135      37,215       434.7      27.9      00:34:11
 16472       9   4,135      37,215       444.4      28.5      00:33:34
 16783       4   4,135      16,540       452.9      29.0      00:33:06
 17057       6   4,135      24,810       460.4      29.5      00:32:44
 17313      10   4,135      41,350       467.5      30.0      00:32:25
 17519       5   4,135      20,675       473.6      30.4      00:32:12
 17795       1   4,135       4,135       481.0      30.8      00:31:52
 18078       4   4,135      16,540       489.0      31.3      00:31:29
 18368       5   4,135      20,675       497.0      31.9      00:31:06
 18575      10   4,135      41,350       502.5      32.2      00:30:57
 18786       2   4,135       8,270       508.5      32.6      00:30:45
 18990       8   4,135      33,080       514.5      33.0      00:30:34
 19200       7   4,135      28,945       520.4      33.4      00:30:23
 19469      10   4,135      41,350       528.1      33.8      00:30:03
 19787       9   4,135      37,215       537.4      34.4      00:29:35
 20106       9   4,135      37,215       546.7      35.0      00:29:07
 20446       5   4,135      20,675       556.1      35.6      00:28:40
 20646       8   4,135      33,080       561.8      36.0      00:28:30
 20839       6   4,135      24,810       567.2      36.4      00:28:22
 21040       7   4,135      28,945       572.7      36.7      00:28:14
 21292      10   4,135      41,350       578.9      37.1      00:28:02
 21510       7   4,135      28,945       584.9      37.5      00:27:52
 21761       9   4,135      37,215       591.1      37.9      00:27:40
 22007       7   4,135      28,945       597.8      38.3      00:27:26
 22277      10   4,135      41,350       604.5      38.7      00:27:12
 22537       8   4,135      33,080       611.3      39.2      00:26:58
 22834       5   4,135      20,675       618.8      39.7      00:26:42
 23166       5   4,135      20,675       627.9      40.2      00:26:18
 23506       6   4,135      24,810       636.8      40.8      00:25:55
 23821       9   4,135      37,215       645.5      41.4      00:25:34
 24131       6   4,135      24,810       653.6      41.9      00:25:16
 24468       9   4,135      37,215       662.4      42.5      00:24:54
 24811       7   4,135      28,945       671.8      43.1      00:24:31
 25130       6   4,135      24,810       680.7      43.6      00:24:11
 25442       8   4,135      33,080       689.2      44.2      00:23:51
 25716      10   4,135      41,350       696.6      44.6      00:23:37
 25951      10   4,135      41,350       703.1      45.1      00:23:25
 26161       5   4,135      20,675       708.9      45.4      00:23:16
 26464       6   4,135      24,810       717.1      46.0      00:22:59
 26776       7   4,135      28,945       725.4      46.5      00:22:41
 27072       8   4,135      33,080       733.4      47.0      00:22:25
 27307       6   4,135      24,810       739.9      47.4      00:22:14
 27554       9   4,135      37,215       746.6      47.9      00:22:02
 27829       6   4,135      24,810       754.4      48.4      00:21:46
 28145       8   4,135      33,080       763.2      48.9      00:21:28
 28449       9   4,135      37,215       771.9      49.5      00:21:10
 28721       8   4,135      33,080       779.7      50.0      00:20:54
 28939       8   4,135      33,080       785.9      50.4      00:20:45
 29210      10   4,135      41,350       793.2      50.8      00:20:31
 29495       7   4,135      28,945       801.3      51.4      00:20:15
 29750       2   4,135       8,270       808.3      51.8      00:20:03
 29922       7   4,135      28,945       813.0      52.1      00:19:58
 30121       8   4,135      33,080       818.6      52.5      00:19:50
 30297       6   4,135      24,810       823.6      52.8      00:19:43
 30554       8   4,135      33,080       830.9      53.3      00:19:30
 30884       7   4,135      28,945       840.2      53.9      00:19:11
 31219       9   4,135      37,215       849.6      54.5      00:18:52
 31555      10   4,135      41,350       859.2      55.1      00:18:32
 31883       8   4,135      33,080       868.7      55.7      00:18:13
 32217       6   4,135      24,810       878.5      56.3      00:17:53
 32529       8   4,135      33,080       887.6      56.9      00:17:36
 32730       9   4,135      37,215       893.3      57.3      00:17:28
 32938       9   4,135      37,215       899.2      57.6      00:17:19
 33137       7   4,135      28,945       905.0      58.0      00:17:10
 33432       7   4,135      28,945       913.3      58.5      00:16:55
 33707       7   4,135      28,945       921.4      59.1      00:16:41
 34000       9   4,135      37,215       929.8      59.6      00:16:26
 34341       8   4,135      33,080       939.8      60.2      00:16:06
 34678       4   4,135      16,540       949.4      60.9      00:15:48
 35047       8   4,135      33,080       960.0      61.5      00:15:27
 35400       7   4,135      28,945       970.3      62.2      00:15:08
 35732       9   4,135      37,215       979.6      62.8      00:14:51
 36081      10   4,135      41,350       989.6      63.4      00:14:33
 36467       9   4,135      37,215     1,000.7      64.1      00:14:12
 36752       8   4,135      33,080     1,008.4      64.6      00:13:59
 37009      10   4,135      41,350     1,015.5      65.1      00:13:48
 37296      10   4,135      41,350     1,022.9      65.6      00:13:36
 37540       6   4,135      24,810     1,029.5      66.0      00:13:26
 37759       6   4,135      24,810     1,035.3      66.4      00:13:18
 38018       4   4,135      16,540     1,042.5      66.8      00:13:06
 38188       9   4,135      37,215     1,047.4      67.1      00:13:00
 38416       7   4,135      28,945     1,053.9      67.5      00:12:50
 38708       8   4,135      33,080     1,062.1      68.1      00:12:37
 39009       7   4,135      28,945     1,070.6      68.6      00:12:23
 39261       5   4,135      20,675     1,077.2      69.0      00:12:12
 39574       2   4,135       8,270     1,085.8      69.6      00:11:58
 39884       9   4,135      37,215     1,094.2      70.1      00:11:44
 40255       6   4,135      24,810     1,104.3      70.8      00:11:27
 40574      10   4,135      41,350     1,113.4      71.4      00:11:12
 40890       8   4,135      33,080     1,122.3      71.9      00:10:57
 41085       7   4,135      28,945     1,127.9      72.3      00:10:49
 41363       7   4,135      28,945     1,135.5      72.8      00:10:37
 41666       9   4,135      37,215     1,144.0      73.3      00:10:24
 41944       7   4,135      28,945     1,152.0      73.8      00:10:11
 42221       5   4,135      20,675     1,159.2      74.3      00:09:60
 42425       7   4,135      28,945     1,164.8      74.7      00:09:52
 42582       6   4,135      24,810     1,168.9      74.9      00:09:47
 42755       8   4,135      33,080     1,173.7      75.2      00:09:41
 42963       5   4,135      20,675     1,179.5      75.6      00:09:33
 43207       6   4,135      24,810     1,186.7      76.1      00:09:22
 43454       7   4,135      28,945     1,193.6      76.5      00:09:11
 43795      10   4,135      41,350     1,202.8      77.1      00:08:56
 44111       7   4,135      28,945     1,211.4      77.6      00:08:42
 44351       5   4,135      20,675     1,217.9      78.1      00:08:33
 44646       8   4,135      33,080     1,226.0      78.6      00:08:20
 44880       5   4,135      20,675     1,232.5      79.0      00:08:10
 45227       9   4,135      37,215     1,241.8      79.6      00:07:55
 45517      10   4,135      41,350     1,249.3      80.1      00:07:44
 45847       7   4,135      28,945     1,257.9      80.6      00:07:31
 46105       8   4,135      33,080     1,265.1      81.1      00:07:20
 46367       4   4,135      16,540     1,272.5      81.6      00:07:08
 46711      10   4,135      41,350     1,282.1      82.2      00:06:53
 47033       6   4,135      24,810     1,290.6      82.7      00:06:40
 47265       5   4,135      20,675     1,296.5      83.1      00:06:31
 47577      10   4,135      41,350     1,304.9      83.6      00:06:19
 47844      10   4,135      41,350     1,312.1      84.1      00:06:08
 48073       6   4,135      24,810     1,318.5      84.5      00:05:58
 48284      10   4,135      41,350     1,324.3      84.9      00:05:50
 48593       6   4,135      24,810     1,332.9      85.4      00:05:37
 48867       7   4,135      28,945     1,340.3      85.9      00:05:26
 49100       9   4,135      37,215     1,346.8      86.3      00:05:16
 49369       9   4,135      37,215     1,354.0      86.8      00:05:05
 49636       7   4,135      28,945     1,360.8      87.2      00:04:55
 49904       9   4,135      37,215     1,367.9      87.7      00:04:45
 50183       3   4,135      12,405     1,375.5      88.2      00:04:33
 50459       8   4,135      33,080     1,382.7      88.6      00:04:23
 50741       8   4,135      33,080     1,390.6      89.1      00:04:11
 51004       7   4,135      28,945     1,398.3      89.6      00:03:59
 51312       3   4,135      12,405     1,406.6      90.2      00:03:47
 51598       8   4,135      33,080     1,414.8      90.7      00:03:34
 51898       6   4,135      24,810     1,423.4      91.2      00:03:21
 52135      10   4,135      41,350     1,430.5      91.7      00:03:11
 52447       9   4,135      37,215     1,439.7      92.3      00:02:57
 52707       9   4,135      37,215     1,447.6      92.8      00:02:45
 53062      10   4,135      41,350     1,458.0      93.4      00:02:30
 53401       9   4,135      37,215     1,467.6      94.1      00:02:15
 53731       6   4,135      24,810     1,477.1      94.7      00:02:01
 54001       3   4,135      12,405     1,484.5      95.1      00:01:50
 54217       8   4,135      33,080     1,490.4      95.5      00:01:42
 54437       4   4,135      16,540     1,496.1      95.9      00:01:34
 54699       7   4,135      28,945     1,503.2      96.3      00:01:23
 54934       8   4,135      33,080     1,509.6      96.8      00:01:14
 55151       8   4,135      33,080     1,515.4      97.1      00:01:06
 55418       6   4,135      24,810     1,522.3      97.6      00:00:55
 55642       8   4,135      33,080     1,528.3      98.0      00:00:47
 55876       9   4,135      37,215     1,534.9      98.4      00:00:37
 56102       6   4,135      24,810     1,541.2      98.8      00:00:28
 56297       8   4,135      33,080     1,546.8      99.1      00:00:20
 56553       8   4,135      33,080     1,554.2      99.6      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 2293.224
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
