
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed940.dta /export/storage_covidva
> ccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_d
> ist_total_10000_5_4q_mnl_A1000_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed940.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed940.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   407       7   5,035      35,245        11.8       0.6      00:26:49
   887       5   5,035      25,175        26.2       1.4      00:23:51
  1327       6   5,035      30,210        40.7       2.1      00:22:55
  1743       5   5,035      25,175        54.4       2.9      00:22:40
  2191       6   5,035      30,210        68.7       3.6      00:22:16
  2630      10   5,035      50,350        82.7       4.3      00:22:02
  3058       5   5,035      25,175        96.5       5.1      00:21:50
  3479       5   5,035      25,175       111.1       5.8      00:21:31
  3900       9   5,035      45,315       124.8       6.6      00:21:23
  4238       9   5,035      45,315       135.3       7.1      00:21:47
  4558       7   5,035      35,245       145.5       7.7      00:22:10
  4876       5   5,035      25,175       156.1       8.2      00:22:24
  5194      10   5,035      50,350       166.4       8.8      00:22:37
  5521       6   5,035      30,210       176.7       9.3      00:22:49
  5856       9   5,035      45,315       187.1       9.8      00:22:56
  6199       9   5,035      45,315       198.3      10.4      00:22:56
  6540       4   5,035      20,140       209.2      11.0      00:22:57
  6877       7   5,035      35,245       219.9      11.6      00:22:58
  7239       4   5,035      20,140       231.3      12.2      00:22:53
  7624       9   5,035      45,315       244.2      12.8      00:22:39
  8013      10   5,035      50,350       257.5      13.5      00:22:23
  8383       8   5,035      40,280       270.2      14.2      00:22:10
  8764       6   5,035      30,210       283.2      14.9      00:21:56
  9143      10   5,035      50,350       296.3      15.6      00:21:42
  9479      10   5,035      50,350       307.9      16.2      00:21:36
  9780       9   5,035      45,315       318.6      16.8      00:21:34
 10083       7   5,035      35,245       328.4      17.3      00:21:35
 10383       4   5,035      20,140       337.5      17.8      00:21:39
 10717       6   5,035      30,210       348.4      18.3      00:21:35
 11024      10   5,035      50,350       358.5      18.9      00:21:33
 11293       6   5,035      30,210       367.0      19.3      00:21:38
 11514       8   5,035      40,280       374.5      19.7      00:21:47
 11770      10   5,035      50,350       382.7      20.1      00:21:52
 12027      10   5,035      50,350       391.3      20.6      00:21:55
 12327       2   5,035      10,070       401.2      21.1      00:21:51
 12726       8   5,035      40,280       414.3      21.8      00:21:35
 13118       6   5,035      30,210       426.8      22.5      00:21:21
 13475      10   5,035      50,350       439.0      23.1      00:21:08
 13755       9   5,035      45,315       448.5      23.6      00:21:06
 14043      10   5,035      50,350       457.8      24.1      00:21:04
 14347       3   5,035      15,105       468.3      24.6      00:20:57
 14686       7   5,035      35,245       479.7      25.2      00:20:47
 15067      10   5,035      50,350       492.6      25.9      00:20:32
 15489       6   5,035      30,210       506.8      26.7      00:20:13
 15907       6   5,035      30,210       521.0      27.4      00:19:54
 16315       8   5,035      40,280       535.3      28.2      00:19:36
 16674      10   5,035      50,350       547.4      28.8      00:19:25
 16991       8   5,035      40,280       558.2      29.4      00:19:17
 17275       7   5,035      35,245       567.6      29.9      00:19:13
 17557       7   5,035      35,245       577.7      30.4      00:19:08
 17881       5   5,035      25,175       588.4      30.9      00:19:00
 18215      10   5,035      50,350       599.9      31.6      00:18:50
 18553       8   5,035      40,280       610.8      32.1      00:18:42
 18851       8   5,035      40,280       621.1      32.7      00:18:35
 19183      10   5,035      50,350       632.8      33.3      00:18:25
 19577       8   5,035      40,280       646.5      34.0      00:18:09
 19993       9   5,035      45,315       661.2      34.8      00:17:51
 20436       9   5,035      45,315       676.5      35.6      00:17:32
 20740      10   5,035      50,350       686.9      36.1      00:17:25
 21013      10   5,035      50,350       696.2      36.6      00:17:20
 21354       7   5,035      35,245       706.5      37.2      00:17:13
 21691       8   5,035      40,280       717.6      37.7      00:17:05
 22018      10   5,035      50,350       727.8      38.3      00:16:58
 22325       7   5,035      35,245       737.3      38.8      00:16:52
 22645       8   5,035      40,280       747.6      39.3      00:16:45
 22994       2   5,035      10,070       758.4      39.9      00:16:36
 23307       9   5,035      45,315       769.2      40.5      00:16:28
 23656       2   5,035      10,070       780.0      41.0      00:16:19
 23972       5   5,035      25,175       790.5      41.6      00:16:11
 24344       6   5,035      30,210       802.3      42.2      00:16:01
 24756       8   5,035      40,280       816.1      42.9      00:15:46
 25165       4   5,035      20,140       829.7      43.6      00:15:32
 25559       4   5,035      20,140       842.9      44.3      00:15:18
 25860      10   5,035      50,350       852.9      44.9      00:15:11
 26168       3   5,035      15,105       863.1      45.4      00:15:04
 26549       9   5,035      45,315       875.5      46.0      00:14:52
 26933       1   5,035       5,035       888.0      46.7      00:14:40
 27289       8   5,035      40,280       899.9      47.3      00:14:30
 27636       7   5,035      35,245       911.5      47.9      00:14:19
 28003       9   5,035      45,315       924.1      48.6      00:14:08
 28378       5   5,035      25,175       936.9      49.3      00:13:55
 28731      10   5,035      50,350       949.2      49.9      00:13:44
 29025       6   5,035      30,210       959.4      50.5      00:13:36
 29366       5   5,035      25,175       970.9      51.1      00:13:26
 29738       7   5,035      35,245       983.4      51.7      00:13:15
 30021       8   5,035      40,280       993.0      52.2      00:13:08
 30310       9   5,035      45,315     1,002.9      52.8      00:13:01
 30638       7   5,035      35,245     1,014.2      53.3      00:12:51
 31068       6   5,035      30,210     1,028.7      54.1      00:12:36
 31465       8   5,035      40,280     1,042.7      54.8      00:12:22
 31872      10   5,035      50,350     1,057.0      55.6      00:12:08
 32280       9   5,035      45,315     1,071.5      56.4      00:11:54
 32620       7   5,035      35,245     1,083.4      57.0      00:11:43
 32900       4   5,035      20,140     1,093.1      57.5      00:11:36
 33169       8   5,035      40,280     1,102.6      58.0      00:11:29
 33489       6   5,035      30,210     1,113.6      58.6      00:11:20
 33836       6   5,035      30,210     1,125.9      59.2      00:11:09
 34189       9   5,035      45,315     1,138.5      59.9      00:10:58
 34610       8   5,035      40,280     1,153.2      60.7      00:10:43
 35023       9   5,035      45,315     1,167.7      61.4      00:10:29
 35446       5   5,035      25,175     1,182.6      62.2      00:10:15
 35878       6   5,035      30,210     1,197.4      63.0      00:10:01
 36297       7   5,035      35,245     1,212.1      63.8      00:09:47
 36671       5   5,035      25,175     1,225.1      64.4      00:09:35
 37036      10   5,035      50,350     1,237.0      65.1      00:09:25
 37399       6   5,035      30,210     1,248.6      65.7      00:09:15
 37738       7   5,035      35,245     1,259.6      66.3      00:09:06
 38041       2   5,035      10,070     1,269.7      66.8      00:08:58
 38341       7   5,035      35,245     1,280.1      67.3      00:08:50
 38632       9   5,035      45,315     1,290.2      67.9      00:08:42
 38928       8   5,035      40,280     1,300.3      68.4      00:08:34
 39234       9   5,035      45,315     1,310.5      68.9      00:08:26
 39565       8   5,035      40,280     1,321.4      69.5      00:08:17
 39938       6   5,035      30,210     1,333.8      70.2      00:08:06
 40381       5   5,035      25,175     1,348.5      70.9      00:07:52
 40808       6   5,035      30,210     1,363.3      71.7      00:07:38
 41179       9   5,035      45,315     1,376.1      72.4      00:07:27
 41530       7   5,035      35,245     1,388.0      73.0      00:07:17
 41853       8   5,035      40,280     1,399.0      73.6      00:07:08
 42178       6   5,035      30,210     1,409.6      74.1      00:06:59
 42507       8   5,035      40,280     1,420.6      74.7      00:06:50
 42865       9   5,035      45,315     1,432.5      75.4      00:06:40
 43206       7   5,035      35,245     1,444.5      76.0      00:06:30
 43554       8   5,035      40,280     1,456.3      76.6      00:06:19
 43869       9   5,035      45,315     1,466.6      77.1      00:06:11
 44219       5   5,035      25,175     1,478.4      77.8      00:06:01
 44575       8   5,035      40,280     1,490.0      78.4      00:05:51
 44933       6   5,035      30,210     1,502.2      79.0      00:05:41
 45321       6   5,035      30,210     1,514.6      79.7      00:05:30
 45620       7   5,035      35,245     1,524.1      80.2      00:05:22
 45936       5   5,035      25,175     1,534.2      80.7      00:05:14
 46247       8   5,035      40,280     1,545.1      81.3      00:05:05
 46565       3   5,035      15,105     1,555.8      81.8      00:04:56
 46960       8   5,035      40,280     1,569.2      82.5      00:04:44
 47313      10   5,035      50,350     1,580.0      83.1      00:04:35
 47634       4   5,035      20,140     1,590.4      83.7      00:04:26
 47923       7   5,035      35,245     1,600.0      84.2      00:04:18
 48229       8   5,035      40,280     1,610.3      84.7      00:04:10
 48583       7   5,035      35,245     1,622.3      85.3      00:03:59
 48916       7   5,035      35,245     1,633.3      85.9      00:03:50
 49250      10   5,035      50,350     1,644.9      86.5      00:03:40
 49587       5   5,035      25,175     1,655.4      87.1      00:03:31
 49927      10   5,035      50,350     1,666.0      87.6      00:03:22
 50270       6   5,035      30,210     1,677.4      88.2      00:03:12
 50624       6   5,035      30,210     1,688.8      88.8      00:03:03
 50959       7   5,035      35,245     1,700.4      89.4      00:02:53
 51293       9   5,035      45,315     1,711.7      90.0      00:02:43
 51635       7   5,035      35,245     1,723.4      90.6      00:02:33
 51970       6   5,035      30,210     1,735.1      91.3      00:02:23
 52309      10   5,035      50,350     1,747.4      91.9      00:02:12
 52736       6   5,035      30,210     1,763.1      92.7      00:01:58
 53117       5   5,035      25,175     1,776.7      93.5      00:01:47
 53506       4   5,035      20,140     1,790.2      94.2      00:01:35
 53872       7   5,035      35,245     1,802.8      94.8      00:01:24
 54190       6   5,035      30,210     1,813.5      95.4      00:01:15
 54532      10   5,035      50,350     1,824.4      96.0      00:01:06
 54908       5   5,035      25,175     1,836.8      96.6      00:00:55
 55251      10   5,035      50,350     1,848.1      97.2      00:00:45
 55586       7   5,035      35,245     1,858.5      97.8      00:00:37
 55879       6   5,035      30,210     1,868.5      98.3      00:00:28
 56188      10   5,035      50,350     1,879.1      98.8      00:00:19
 56525       5   5,035      25,175     1,891.0      99.5      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1636.612
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed940
    > .csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed940.csv sa
> ved

. 
. cap log close

. 
end of do-file
