
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A300_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   334       8   4,335      34,680         8.3       0.5      00:32:40
   707       9   4,335      39,015        17.8       1.1      00:30:18
  1084      10   4,335      43,350        28.1       1.7      00:28:39
  1466       9   4,335      39,015        39.0       2.4      00:27:20
  1852       8   4,335      34,680        49.8       3.0      00:26:36
  2225       8   4,335      34,680        60.1       3.7      00:26:16
  2595       6   4,335      26,010        70.2       4.3      00:26:05
  2998       5   4,335      21,675        81.4       5.0      00:25:31
  3385       6   4,335      26,010        92.9       5.7      00:24:59
  3756       6   4,335      26,010       103.5       6.3      00:24:44
  4058       8   4,335      34,680       111.7       6.8      00:25:05
  4395       6   4,335      26,010       120.6       7.4      00:25:11
  4689       6   4,335      26,010       129.1       7.9      00:25:20
  4999       8   4,335      34,680       137.8       8.4      00:25:25
  5299       8   4,335      34,680       146.2       8.9      00:25:32
  5554       5   4,335      21,675       153.0       9.3      00:25:54
  5818       5   4,335      21,675       160.1       9.8      00:26:10
  6111       6   4,335      26,010       168.4      10.3      00:26:12
  6412      10   4,335      43,350       176.6      10.8      00:26:13
  6753       8   4,335      34,680       185.9      11.4      00:26:03
  7036       7   4,335      30,345       193.7      11.8      00:26:07
  7371      10   4,335      43,350       203.1      12.4      00:25:56
  7703       7   4,335      30,345       212.3      13.0      00:25:45
  8037       8   4,335      34,680       222.4      13.6      00:25:29
  8399       6   4,335      26,010       233.1      14.2      00:25:08
  8776       7   4,335      30,345       244.2      14.9      00:24:45
  9149       7   4,335      30,345       255.3      15.6      00:24:23
  9409       7   4,335      30,345       263.0      16.1      00:24:25
  9673       4   4,335      17,340       271.1      16.6      00:24:24
  9987       4   4,335      17,340       280.0      17.1      00:24:16
 10278       7   4,335      30,345       287.7      17.6      00:24:16
 10580       4   4,335      17,340       296.1      18.1      00:24:11
 10946       4   4,335      17,340       306.4      18.7      00:23:55
 11260       9   4,335      39,015       315.1      19.3      00:23:48
 11534       9   4,335      39,015       322.9      19.7      00:23:46
 11857       5   4,335      21,675       332.1      20.3      00:23:37
 12126       7   4,335      30,345       339.8      20.8      00:23:35
 12456       7   4,335      30,345       349.0      21.3      00:23:25
 12855       8   4,335      34,680       360.0      22.0      00:23:05
 13276       9   4,335      39,015       371.9      22.7      00:22:42
 13621       9   4,335      39,015       382.5      23.4      00:22:27
 13911       9   4,335      39,015       390.6      23.9      00:22:22
 14261       9   4,335      39,015       400.6      24.5      00:22:09
 14580       6   4,335      26,010       409.9      25.0      00:21:59
 14910       5   4,335      21,675       419.4      25.6      00:21:48
 15281       4   4,335      17,340       430.4      26.3      00:21:31
 15678       9   4,335      39,015       441.7      27.0      00:21:14
 16073       4   4,335      17,340       453.6      27.7      00:20:54
 16456       8   4,335      34,680       465.2      28.4      00:20:36
 16737       6   4,335      26,010       473.2      28.9      00:20:31
 16982       4   4,335      17,340       480.3      29.3      00:20:30
 17280       6   4,335      26,010       488.9      29.9      00:20:23
 17524       6   4,335      26,010       496.4      30.3      00:20:19
 17785       8   4,335      34,680       503.8      30.8      00:20:16
 18101       9   4,335      39,015       513.0      31.3      00:20:07
 18463       6   4,335      26,010       523.4      32.0      00:19:53
 18758       7   4,335      30,345       532.1      32.5      00:19:45
 19088      10   4,335      43,350       542.0      33.1      00:19:33
 19432      10   4,335      43,350       552.2      33.7      00:19:21
 19839       7   4,335      30,345       564.6      34.5      00:19:01
 20260       4   4,335      17,340       577.2      35.3      00:18:42
 20633       5   4,335      21,675       588.3      35.9      00:18:27
 20895       7   4,335      30,345       596.0      36.4      00:18:22
 21192       9   4,335      39,015       604.3      36.9      00:18:15
 21547       9   4,335      39,015       614.0      37.5      00:18:05
 21913      10   4,335      43,350       623.7      38.1      00:17:54
 22233       5   4,335      21,675       632.3      38.6      00:17:46
 22513       5   4,335      21,675       640.0      39.1      00:17:41
 22860       8   4,335      34,680       649.2      39.7      00:17:31
 23179       7   4,335      30,345       658.4      40.2      00:17:22
 23497       3   4,335      13,005       667.3      40.8      00:17:13
 23838       5   4,335      21,675       677.0      41.4      00:17:03
 24189       6   4,335      26,010       686.6      41.9      00:16:52
 24608       6   4,335      26,010       698.4      42.7      00:16:36
 25040       8   4,335      34,680       710.6      43.4      00:16:19
 25454       7   4,335      30,345       722.7      44.1      00:16:03
 25819       9   4,335      39,015       733.1      44.8      00:15:51
 26148       8   4,335      34,680       742.6      45.4      00:15:41
 26528       7   4,335      30,345       753.1      46.0      00:15:29
 26893      10   4,335      43,350       763.5      46.6      00:15:17
 27225       8   4,335      34,680       773.1      47.2      00:15:07
 27543       9   4,335      39,015       782.2      47.8      00:14:58
 27891       7   4,335      30,345       792.4      48.4      00:14:46
 28300       9   4,335      39,015       804.3      49.1      00:14:31
 28686       4   4,335      17,340       815.9      49.8      00:14:17
 28949       9   4,335      39,015       823.8      50.3      00:14:10
 29278       4   4,335      17,340       833.2      50.9      00:14:01
 29672       1   4,335       4,335       844.5      51.6      00:13:47
 29958       3   4,335      13,005       853.1      52.1      00:13:39
 30214       7   4,335      30,345       860.7      52.6      00:13:33
 30527       7   4,335      30,345       870.0      53.2      00:13:23
 30905       8   4,335      34,680       881.2      53.8      00:13:10
 31314       7   4,335      30,345       893.2      54.6      00:12:56
 31698       5   4,335      21,675       904.6      55.3      00:12:42
 32071       7   4,335      30,345       916.1      56.0      00:12:29
 32451      10   4,335      43,350       927.8      56.7      00:12:15
 32717       6   4,335      26,010       935.6      57.2      00:12:08
 32944       8   4,335      34,680       942.5      57.6      00:12:03
 33170      10   4,335      43,350       949.4      58.0      00:11:58
 33475       5   4,335      21,675       958.4      58.6      00:11:49
 33797       8   4,335      34,680       968.2      59.1      00:11:39
 34132       6   4,335      26,010       978.4      59.8      00:11:28
 34487       9   4,335      39,015       989.2      60.4      00:11:15
 34831       8   4,335      34,680       999.7      61.1      00:11:04
 35215       7   4,335      30,345     1,011.2      61.8      00:10:51
 35602       8   4,335      34,680     1,022.8      62.5      00:10:37
 35978       6   4,335      26,010     1,033.9      63.2      00:10:25
 36378       9   4,335      39,015     1,046.0      63.9      00:10:11
 36705       6   4,335      26,010     1,055.6      64.5      00:10:01
 36967      10   4,335      43,350     1,063.3      65.0      00:09:54
 37245       9   4,335      39,015     1,070.7      65.4      00:09:48
 37504       9   4,335      39,015     1,077.9      65.9      00:09:42
 37778       6   4,335      26,010     1,085.6      66.3      00:09:35
 38054       9   4,335      39,015     1,093.6      66.8      00:09:27
 38304      10   4,335      43,350     1,101.0      67.3      00:09:21
 38548       8   4,335      34,680     1,108.4      67.7      00:09:14
 38978      10   4,335      43,350     1,121.0      68.5      00:08:59
 39286       8   4,335      34,680     1,129.7      69.0      00:08:51
 39622       8   4,335      34,680     1,139.4      69.6      00:08:40
 39987       6   4,335      26,010     1,149.8      70.2      00:08:29
 40424       7   4,335      30,345     1,162.4      71.0      00:08:15
 40856      10   4,335      43,350     1,175.2      71.8      00:08:00
 41177       8   4,335      34,680     1,184.7      72.4      00:07:50
 41517       9   4,335      39,015     1,194.6      73.0      00:07:40
 41871       8   4,335      34,680     1,205.0      73.6      00:07:29
 42188      10   4,335      43,350     1,214.0      74.2      00:07:20
 42515       4   4,335      17,340     1,223.4      74.7      00:07:10
 42818       6   4,335      26,010     1,231.9      75.3      00:07:01
 43129      10   4,335      43,350     1,241.3      75.8      00:06:52
 43453       5   4,335      21,675     1,251.0      76.4      00:06:42
 43790       9   4,335      39,015     1,260.4      77.0      00:06:32
 44141       7   4,335      30,345     1,270.5      77.6      00:06:21
 44487      10   4,335      43,350     1,280.3      78.2      00:06:11
 44799       6   4,335      26,010     1,289.3      78.8      00:06:02
 45173      10   4,335      43,350     1,300.1      79.4      00:05:50
 45559       8   4,335      34,680     1,310.6      80.1      00:05:39
 45918       8   4,335      34,680     1,320.4      80.7      00:05:29
 46234       6   4,335      26,010     1,329.9      81.2      00:05:19
 46530       6   4,335      26,010     1,338.4      81.8      00:05:10
 46926       5   4,335      21,675     1,350.2      82.5      00:04:58
 47240       7   4,335      30,345     1,358.4      83.0      00:04:50
 47542       8   4,335      34,680     1,366.7      83.5      00:04:41
 47816       5   4,335      21,675     1,374.5      84.0      00:04:33
 48133       9   4,335      39,015     1,383.7      84.5      00:04:24
 48512       8   4,335      34,680     1,394.7      85.2      00:04:12
 48895       4   4,335      17,340     1,405.7      85.9      00:04:00
 49294       4   4,335      17,340     1,417.3      86.6      00:03:48
 49623       6   4,335      26,010     1,426.1      87.1      00:03:39
 49891       8   4,335      34,680     1,433.4      87.6      00:03:32
 50214       7   4,335      30,345     1,442.7      88.1      00:03:22
 50547      10   4,335      43,350     1,451.8      88.7      00:03:13
 50866       8   4,335      34,680     1,461.1      89.3      00:03:03
 51188       6   4,335      26,010     1,470.7      89.8      00:02:53
 51536       6   4,335      26,010     1,480.8      90.5      00:02:43
 51885       4   4,335      17,340     1,491.5      91.1      00:02:31
 52198       9   4,335      39,015     1,501.1      91.7      00:02:21
 52602       7   4,335      30,345     1,513.7      92.5      00:02:08
 53035       8   4,335      34,680     1,527.2      93.3      00:01:54
 53469       7   4,335      30,345     1,540.2      94.1      00:01:40
 53850       6   4,335      26,010     1,551.5      94.8      00:01:28
 54171       5   4,335      21,675     1,560.9      95.4      00:01:19
 54526      10   4,335      43,350     1,570.6      96.0      00:01:08
 54921       5   4,335      21,675     1,581.8      96.6      00:00:57
 55262       8   4,335      34,680     1,591.5      97.2      00:00:47
 55605       9   4,335      39,015     1,600.7      97.8      00:00:37
 55902       5   4,335      21,675     1,609.5      98.3      00:00:28
 56207      10   4,335      43,350     1,618.5      98.9      00:00:19
 56526      10   4,335      43,350     1,628.2      99.5      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1696.708
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
