
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A400_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   326       5   4,435      22,175         8.3       0.5      00:33:34
   693       7   4,435      31,045        17.9       1.1      00:30:51
  1083       3   4,435      13,305        28.7       1.7      00:28:40
  1479       3   4,435      13,305        40.3       2.4      00:27:02
  1860       3   4,435      13,305        51.2       3.1      00:26:27
  2240       5   4,435      22,175        62.0       3.7      00:26:03
  2611       8   4,435      35,480        72.3       4.3      00:25:54
  3013       6   4,435      26,610        83.7       5.0      00:25:22
  3382       8   4,435      35,480        94.9       5.7      00:24:59
  3768       6   4,435      26,610       106.3       6.3      00:24:37
  4067       4   4,435      17,740       114.5       6.8      00:25:00
  4391       7   4,435      31,045       123.3       7.4      00:25:12
  4681       8   4,435      35,480       131.9       7.9      00:25:23
  4960       7   4,435      31,045       139.9       8.4      00:25:37
  5254       8   4,435      35,480       148.2       8.9      00:25:47
  5498      10   4,435      44,350       155.1       9.3      00:26:10
  5747      10   4,435      44,350       161.7       9.7      00:26:33
  5999       8   4,435      35,480       169.0      10.1      00:26:46
  6310      10   4,435      44,350       177.8      10.6      00:26:42
  6630       3   4,435      13,305       186.7      11.2      00:26:36
  6918      10   4,435      44,350       194.9      11.6      00:26:37
  7278      10   4,435      44,350       204.9      12.2      00:26:21
  7632       7   4,435      31,045       215.3      12.9      00:26:01
  7999       8   4,435      35,480       226.4      13.5      00:25:38
  8322       6   4,435      26,610       236.2      14.1      00:25:25
  8694       7   4,435      31,045       247.4      14.8      00:25:03
  9063      10   4,435      44,350       258.5      15.4      00:24:42
  9360       8   4,435      35,480       267.6      16.0      00:24:35
  9637       8   4,435      35,480       276.1      16.5      00:24:31
  9940       9   4,435      39,915       285.2      17.0      00:24:24
 10210      10   4,435      44,350       292.5      17.5      00:24:28
 10490      10   4,435      44,350       300.5      17.9      00:24:26
 10819       4   4,435      17,740       309.7      18.5      00:24:17
 11164       6   4,435      26,610       319.6      19.1      00:24:04
 11434      10   4,435      44,350       327.6      19.6      00:24:02
 11706       2   4,435       8,870       335.3      20.0      00:24:00
 11991       8   4,435      35,480       343.6      20.5      00:23:56
 12235      10   4,435      44,350       350.9      21.0      00:23:56
 12591       9   4,435      39,915       361.0      21.6      00:23:41
 13020       8   4,435      35,480       373.1      22.3      00:23:18
 13406       7   4,435      31,045       384.4      23.0      00:22:59
 13686       5   4,435      22,175       393.1      23.5      00:22:52
 13972      10   4,435      44,350       401.3      24.0      00:22:47
 14338      10   4,435      44,350       412.2      24.6      00:22:30
 14686       7   4,435      31,045       422.5      25.2      00:22:16
 15041       7   4,435      31,045       433.1      25.9      00:22:01
 15417      10   4,435      44,350       444.4      26.5      00:21:44
 15808       5   4,435      22,175       455.9      27.2      00:21:26
 16226       6   4,435      26,610       468.8      28.0      00:21:03
 16601       9   4,435      39,915       480.1      28.7      00:20:46
 16895       5   4,435      22,175       488.7      29.2      00:20:40
 17190      10   4,435      44,350       497.4      29.7      00:20:33
 17447       7   4,435      31,045       505.3      30.2      00:20:29
 17682       9   4,435      39,915       512.6      30.6      00:20:26
 17995       5   4,435      22,175       521.6      31.1      00:20:18
 18291       7   4,435      31,045       530.6      31.7      00:20:10
 18613       6   4,435      26,610       539.8      32.2      00:20:01
 18914       7   4,435      31,045       549.1      32.8      00:19:51
 19229       8   4,435      35,480       558.8      33.4      00:19:40
 19625       7   4,435      31,045       570.9      34.1      00:19:22
 20029      10   4,435      44,350       583.6      34.8      00:19:03
 20456       7   4,435      31,045       596.5      35.6      00:18:43
 20741       4   4,435      17,740       605.1      36.1      00:18:36
 20980       5   4,435      22,175       612.3      36.6      00:18:32
 21315       8   4,435      35,480       621.3      37.1      00:18:24
 21620       1   4,435       4,435       630.0      37.6      00:18:16
 21940       4   4,435      17,740       638.9      38.2      00:18:08
 22204       6   4,435      26,610       646.1      38.6      00:18:05
 22507       7   4,435      31,045       654.6      39.1      00:17:57
 22826       3   4,435      13,305       663.2      39.6      00:17:49
 23155       9   4,435      39,915       672.8      40.2      00:17:39
 23502       5   4,435      22,175       682.8      40.8      00:17:28
 23803       7   4,435      31,045       691.5      41.3      00:17:20
 24149       6   4,435      26,610       701.4      41.9      00:17:09
 24594       9   4,435      39,915       714.1      42.6      00:16:51
 25011       8   4,435      35,480       726.1      43.4      00:16:35
 25427       9   4,435      39,915       738.5      44.1      00:16:18
 25766       5   4,435      22,175       748.4      44.7      00:16:07
 26094       5   4,435      22,175       758.2      45.3      00:15:57
 26502       3   4,435      13,305       769.9      46.0      00:15:42
 26908       7   4,435      31,045       781.6      46.7      00:15:27
 27276       7   4,435      31,045       792.3      47.3      00:15:15
 27596      10   4,435      44,350       801.7      47.9      00:15:05
 27954       2   4,435       8,870       812.5      48.5      00:14:53
 28358       6   4,435      26,610       824.6      49.2      00:14:38
 28718       9   4,435      39,915       835.7      49.9      00:14:25
 29027       7   4,435      31,045       845.1      50.5      00:14:15
 29370      10   4,435      44,350       855.3      51.1      00:14:04
 29706       9   4,435      39,915       865.1      51.7      00:13:54
 29944       6   4,435      26,610       872.3      52.1      00:13:49
 30202       7   4,435      31,045       880.2      52.6      00:13:43
 30525       5   4,435      22,175       890.0      53.1      00:13:32
 30876       1   4,435       4,435       900.6      53.8      00:13:21
 31265       9   4,435      39,915       912.3      54.5      00:13:07
 31635       8   4,435      35,480       923.6      55.2      00:12:54
 32006      10   4,435      44,350       935.2      55.8      00:12:40
 32394       5   4,435      22,175       947.4      56.6      00:12:26
 32656       6   4,435      26,610       955.4      57.1      00:12:19
 32916       6   4,435      26,610       963.3      57.5      00:12:12
 33199       8   4,435      35,480       972.1      58.0      00:12:04
 33560       9   4,435      39,915       983.2      58.7      00:11:51
 33922      10   4,435      44,350       994.4      59.4      00:11:39
 34239       6   4,435      26,610     1,004.4      60.0      00:11:28
 34572       6   4,435      26,610     1,014.5      60.6      00:11:18
 34947       9   4,435      39,915     1,026.3      61.3      00:11:04
 35345       5   4,435      22,175     1,038.6      62.0      00:10:50
 35723       9   4,435      39,915     1,050.1      62.7      00:10:38
 36073      10   4,435      44,350     1,060.7      63.3      00:10:26
 36436       9   4,435      39,915     1,071.9      64.0      00:10:14
 36693       9   4,435      39,915     1,079.7      64.5      00:10:07
 36964       6   4,435      26,610     1,087.7      65.0      00:10:00
 37254       7   4,435      31,045     1,095.7      65.4      00:09:53
 37547       8   4,435      35,480     1,104.0      65.9      00:09:45
 37799       4   4,435      17,740     1,111.2      66.4      00:09:39
 38065       9   4,435      39,915     1,119.2      66.8      00:09:32
 38346       8   4,435      35,480     1,127.7      67.3      00:09:24
 38721       3   4,435      13,305     1,139.1      68.0      00:09:11
 39093      10   4,435      44,350     1,150.3      68.7      00:08:59
 39383       2   4,435       8,870     1,158.7      69.2      00:08:51
 39711      10   4,435      44,350     1,168.2      69.8      00:08:41
 40114       8   4,435      35,480     1,180.0      70.5      00:08:28
 40545       7   4,435      31,045     1,192.9      71.2      00:08:13
 40985       6   4,435      26,610     1,206.3      72.0      00:07:58
 41313       5   4,435      22,175     1,216.1      72.6      00:07:48
 41643       9   4,435      39,915     1,226.0      73.2      00:07:38
 41969      10   4,435      44,350     1,236.0      73.8      00:07:28
 42316       8   4,435      35,480     1,245.5      74.4      00:07:18
 42634       9   4,435      39,915     1,254.9      74.9      00:07:09
 42966       7   4,435      31,045     1,264.8      75.5      00:06:59
 43259       9   4,435      39,915     1,273.9      76.1      00:06:50
 43529       9   4,435      39,915     1,282.1      76.6      00:06:42
 43779       9   4,435      39,915     1,289.2      77.0      00:06:35
 44059       8   4,435      35,480     1,297.5      77.5      00:06:27
 44332       6   4,435      26,610     1,305.5      78.0      00:06:20
 44639       6   4,435      26,610     1,314.4      78.5      00:06:11
 44940       8   4,435      35,480     1,323.4      79.0      00:06:02
 45263      10   4,435      44,350     1,332.6      79.6      00:05:52
 45575       7   4,435      31,045     1,341.3      80.1      00:05:44
 45878       5   4,435      22,175     1,349.7      80.6      00:05:35
 46163       6   4,435      26,610     1,358.3      81.1      00:05:27
 46455       4   4,435      17,740     1,367.0      81.6      00:05:18
 46783       6   4,435      26,610     1,377.0      82.2      00:05:08
 47112       7   4,435      31,045     1,386.3      82.8      00:04:58
 47442       7   4,435      31,045     1,395.5      83.3      00:04:49
 47727       5   4,435      22,175     1,403.7      83.8      00:04:40
 48014       8   4,435      35,480     1,412.1      84.3      00:04:32
 48260       8   4,435      35,480     1,419.3      84.8      00:04:25
 48569       9   4,435      39,915     1,428.6      85.3      00:04:15
 48889       4   4,435      17,740     1,437.9      85.9      00:04:06
 49204       7   4,435      31,045     1,447.5      86.4      00:03:56
 49545       8   4,435      35,480     1,457.0      87.0      00:03:46
 49874      10   4,435      44,350     1,466.0      87.5      00:03:37
 50169       9   4,435      39,915     1,474.6      88.1      00:03:28
 50522       8   4,435      35,480     1,484.5      88.6      00:03:18
 50833      10   4,435      44,350     1,493.9      89.2      00:03:08
 51177       6   4,435      26,610     1,504.3      89.8      00:02:57
 51520      10   4,435      44,350     1,514.5      90.4      00:02:46
 51880       9   4,435      39,915     1,525.7      91.1      00:02:34
 52232       9   4,435      39,915     1,536.8      91.8      00:02:23
 52618       8   4,435      35,480     1,549.1      92.5      00:02:10
 53058       8   4,435      35,480     1,563.1      93.3      00:01:55
 53532       8   4,435      35,480     1,577.7      94.2      00:01:40
 53903       7   4,435      31,045     1,588.9      94.9      00:01:28
 54142       9   4,435      39,915     1,595.9      95.3      00:01:21
 54473       8   4,435      35,480     1,605.4      95.9      00:01:11
 54856       8   4,435      35,480     1,616.4      96.5      00:00:60
 55209       8   4,435      35,480     1,626.6      97.1      00:00:49
 55579       3   4,435      13,305     1,636.9      97.7      00:00:39
 55881       6   4,435      26,610     1,645.9      98.3      00:00:30
 56219       8   4,435      35,480     1,656.1      98.9      00:00:19
 56588       7   4,435      31,045     1,667.5      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1725.568
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
