
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A200_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   345      10   4,235      42,350         8.4       0.5      00:31:43
   711       6   4,235      25,410        17.5       1.1      00:30:05
  1072       6   4,235      25,410        27.2       1.7      00:29:01
  1416       7   4,235      29,645        36.7       2.3      00:28:26
  1762      10   4,235      42,350        46.3       2.9      00:28:00
  2121       8   4,235      33,880        55.9       3.5      00:27:40
  2481       4   4,235      16,940        65.5       4.1      00:27:22
  2853       8   4,235      33,880        75.9       4.7      00:26:49
  3221       7   4,235      29,645        86.0       5.4      00:26:27
  3582       1   4,235       4,235        96.3       6.0      00:26:04
  3912       7   4,235      29,645       105.3       6.6      00:26:04
  4180       8   4,235      33,880       112.3       7.0      00:26:31
  4468       6   4,235      25,410       119.8       7.5      00:26:48
  4707       8   4,235      33,880       126.7       7.9      00:27:10
  4993      10   4,235      42,350       134.5       8.4      00:27:16
  5249      10   4,235      42,350       141.5       8.8      00:27:31
  5477       9   4,235      38,115       147.6       9.2      00:27:54
  5700       2   4,235       8,470       153.2       9.6      00:28:22
  5936       4   4,235      16,940       159.6      10.0      00:28:37
  6229       8   4,235      33,880       167.7      10.5      00:28:30
  6547       8   4,235      33,880       176.1      11.0      00:28:20
  6841       6   4,235      25,410       184.0      11.5      00:28:15
  7180       6   4,235      25,410       193.0      12.1      00:27:59
  7546       8   4,235      33,880       203.2      12.7      00:27:32
  7904       7   4,235      29,645       213.3      13.3      00:27:07
  8240       5   4,235      21,175       223.2      14.0      00:26:46
  8580       9   4,235      38,115       233.1      14.6      00:26:25
  8926       4   4,235      16,940       243.0      15.2      00:26:06
  9265       9   4,235      38,115       252.8      15.8      00:25:47
  9533       6   4,235      25,410       260.6      16.3      00:25:44
  9819       3   4,235      12,705       269.0      16.8      00:25:36
 10118       9   4,235      38,115       277.0      17.3      00:25:30
 10439       8   4,235      33,880       285.5      17.9      00:25:21
 10772       4   4,235      16,940       294.5      18.4      00:25:09
 11112       5   4,235      21,175       303.8      19.0      00:24:55
 11382       6   4,235      25,410       311.3      19.5      00:24:52
 11644       8   4,235      33,880       318.5      19.9      00:24:51
 11918       2   4,235       8,470       326.1      20.4      00:24:46
 12200       6   4,235      25,410       334.1      20.9      00:24:40
 12526       7   4,235      29,645       343.0      21.4      00:24:28
 12932       9   4,235      38,115       353.8      22.1      00:24:06
 13319       5   4,235      21,175       364.6      22.8      00:23:45
 13648       9   4,235      38,115       374.4      23.4      00:23:30
 13951       8   4,235      33,880       382.6      23.9      00:23:22
 14268       4   4,235      16,940       391.6      24.5      00:23:10
 14593       8   4,235      33,880       400.9      25.1      00:22:58
 14919      10   4,235      42,350       410.0      25.6      00:22:46
 15300       5   4,235      21,175       421.0      26.3      00:22:26
 15702       7   4,235      29,645       432.2      27.0      00:22:05
 16076       8   4,235      33,880       443.3      27.7      00:21:46
 16450       5   4,235      21,175       454.3      28.4      00:21:28
 16794       9   4,235      38,115       463.9      29.0      00:21:15
 17106       5   4,235      21,175       472.7      29.6      00:21:05
 17387       5   4,235      21,175       480.8      30.1      00:20:58
 17657      10   4,235      42,350       488.8      30.6      00:20:52
 17998       8   4,235      33,880       498.2      31.2      00:20:40
 18358      10   4,235      42,350       508.6      31.8      00:20:24
 18698       8   4,235      33,880       518.1      32.4      00:20:12
 19013       7   4,235      29,645       527.3      33.0      00:20:01
 19327       9   4,235      38,115       536.4      33.5      00:19:51
 19711       9   4,235      38,115       547.8      34.3      00:19:33
 20107       7   4,235      29,645       559.7      35.0      00:19:13
 20521       5   4,235      21,175       571.4      35.7      00:18:55
 20849      10   4,235      42,350       581.0      36.3      00:18:44
 21199       6   4,235      25,410       590.5      36.9      00:18:32
 21554       7   4,235      29,645       600.0      37.5      00:18:21
 21915       4   4,235      16,940       609.4      38.1      00:18:10
 22290       4   4,235      16,940       619.2      38.7      00:17:58
 22659       7   4,235      29,645       629.2      39.3      00:17:45
 23033      10   4,235      42,350       639.1      40.0      00:17:33
 23384       3   4,235      12,705       649.0      40.6      00:17:21
 23800       4   4,235      16,940       660.2      41.3      00:17:06
 24204       3   4,235      12,705       671.1      42.0      00:16:51
 24656       9   4,235      38,115       683.7      42.8      00:16:33
 25109       8   4,235      33,880       696.3      43.5      00:16:14
 25557       8   4,235      33,880       708.9      44.3      00:15:56
 25903      10   4,235      42,350       718.6      44.9      00:15:45
 26248       9   4,235      38,115       728.3      45.5      00:15:34
 26663       5   4,235      21,175       739.5      46.2      00:15:20
 27070       5   4,235      21,175       750.9      47.0      00:15:05
 27443       3   4,235      12,705       761.2      47.6      00:14:53
 27787       7   4,235      29,645       771.0      48.2      00:14:42
 28189       6   4,235      25,410       782.6      48.9      00:14:27
 28627      10   4,235      42,350       795.5      49.7      00:14:10
 28898       9   4,235      38,115       803.3      50.2      00:14:03
 29127      10   4,235      42,350       809.9      50.6      00:13:59
 29416       9   4,235      38,115       818.1      51.2      00:13:52
 29690       9   4,235      38,115       825.6      51.6      00:13:46
 29922       6   4,235      25,410       832.4      52.1      00:13:41
 30150      10   4,235      42,350       838.9      52.5      00:13:37
 30405       5   4,235      21,175       846.2      52.9      00:13:31
 30666       7   4,235      29,645       853.9      53.4      00:13:24
 30996       9   4,235      38,115       863.4      54.0      00:13:14
 31321       5   4,235      21,175       872.7      54.6      00:13:04
 31645      10   4,235      42,350       882.2      55.2      00:12:53
 31971       8   4,235      33,880       892.0      55.8      00:12:42
 32298       7   4,235      29,645       901.8      56.4      00:12:31
 32560       2   4,235       8,470       909.5      56.9      00:12:24
 32761       7   4,235      29,645       915.4      57.2      00:12:21
 32991       6   4,235      25,410       922.2      57.7      00:12:15
 33232      10   4,235      42,350       929.2      58.1      00:12:09
 33495       9   4,235      38,115       936.8      58.6      00:12:02
 33745       7   4,235      29,645       944.3      59.1      00:11:55
 33985       9   4,235      38,115       951.5      59.5      00:11:49
 34241       7   4,235      29,645       959.2      60.0      00:11:42
 34524       8   4,235      33,880       967.5      60.5      00:11:33
 34838       7   4,235      29,645       976.8      61.1      00:11:23
 35157      10   4,235      42,350       986.1      61.7      00:11:13
 35469       8   4,235      33,880       995.4      62.2      00:11:02
 35799      10   4,235      42,350     1,004.9      62.8      00:10:52
 36116       7   4,235      29,645     1,014.1      63.4      00:10:41
 36443       9   4,235      38,115     1,023.8      64.0      00:10:31
 36726       8   4,235      33,880     1,031.8      64.5      00:10:22
 36964       6   4,235      25,410     1,038.6      65.0      00:10:16
 37245       9   4,235      38,115     1,046.0      65.4      00:10:09
 37493       5   4,235      21,175     1,052.7      65.8      00:10:03
 37747       6   4,235      25,410     1,059.7      66.3      00:09:57
 37976       7   4,235      29,645     1,066.1      66.7      00:09:51
 38190       8   4,235      33,880     1,072.4      67.1      00:09:45
 38432       9   4,235      38,115     1,079.5      67.5      00:09:39
 38746       9   4,235      38,115     1,088.5      68.1      00:09:29
 39074       5   4,235      21,175     1,097.9      68.7      00:09:18
 39412       6   4,235      25,410     1,107.2      69.2      00:09:07
 39785      10   4,235      42,350     1,117.6      69.9      00:08:55
 40211       5   4,235      21,175     1,129.5      70.6      00:08:41
 40641      10   4,235      42,350     1,141.9      71.4      00:08:25
 41027       7   4,235      29,645     1,153.2      72.1      00:08:12
 41344       6   4,235      25,410     1,162.2      72.7      00:08:02
 41671       3   4,235      12,705     1,171.5      73.3      00:07:52
 41988       1   4,235       4,235     1,180.7      73.8      00:07:42
 42349       4   4,235      16,940     1,190.2      74.4      00:07:31
 42688       7   4,235      29,645     1,199.8      75.0      00:07:20
 43020       6   4,235      25,410     1,209.3      75.6      00:07:10
 43366       6   4,235      25,410     1,219.6      76.3      00:06:58
 43703      10   4,235      42,350     1,228.9      76.8      00:06:48
 44001       7   4,235      29,645     1,237.4      77.4      00:06:38
 44288       7   4,235      29,645     1,245.4      77.9      00:06:30
 44620       7   4,235      29,645     1,254.6      78.5      00:06:20
 44979      10   4,235      42,350     1,264.8      79.1      00:06:08
 45358       5   4,235      21,175     1,274.8      79.7      00:05:57
 45718       5   4,235      21,175     1,284.5      80.3      00:05:46
 46045       5   4,235      21,175     1,293.7      80.9      00:05:36
 46378       7   4,235      29,645     1,303.4      81.5      00:05:25
 46741       6   4,235      25,410     1,313.7      82.1      00:05:14
 47103      10   4,235      42,350     1,323.5      82.8      00:05:03
 47417       7   4,235      29,645     1,331.9      83.3      00:04:53
 47716       6   4,235      25,410     1,340.1      83.8      00:04:45
 48013       2   4,235       8,470     1,348.4      84.3      00:04:36
 48324       7   4,235      29,645     1,357.2      84.9      00:04:26
 48665       5   4,235      21,175     1,366.9      85.5      00:04:15
 49025      10   4,235      42,350     1,376.9      86.1      00:04:04
 49391       6   4,235      25,410     1,387.2      86.7      00:03:53
 49765       6   4,235      25,410     1,397.0      87.4      00:03:42
 50135       4   4,235      16,940     1,407.2      88.0      00:03:30
 50495       4   4,235      16,940     1,416.8      88.6      00:03:20
 50847       6   4,235      25,410     1,426.9      89.2      00:03:09
 51206       4   4,235      16,940     1,437.2      89.9      00:02:57
 51563      10   4,235      42,350     1,447.5      90.5      00:02:46
 51954       8   4,235      33,880     1,459.0      91.2      00:02:33
 52281       7   4,235      29,645     1,468.9      91.9      00:02:22
 52653       5   4,235      21,175     1,480.4      92.6      00:02:09
 52970       9   4,235      38,115     1,490.0      93.2      00:01:59
 53277       6   4,235      25,410     1,499.1      93.7      00:01:49
 53574       5   4,235      21,175     1,507.8      94.3      00:01:39
 53834       9   4,235      38,115     1,515.3      94.8      00:01:31
 54066      10   4,235      42,350     1,521.8      95.2      00:01:24
 54327       5   4,235      21,175     1,529.3      95.6      00:01:16
 54603       5   4,235      21,175     1,536.4      96.1      00:01:09
 54858       7   4,235      29,645     1,543.5      96.5      00:01:01
 55114       5   4,235      21,175     1,550.7      97.0      00:00:53
 55373       5   4,235      21,175     1,557.5      97.4      00:00:46
 55594       9   4,235      38,115     1,563.4      97.8      00:00:39
 55808       5   4,235      21,175     1,569.6      98.2      00:00:33
 56032       9   4,235      38,115     1,576.1      98.6      00:00:25
 56262       3   4,235      12,705     1,582.8      99.0      00:00:18
 56499      10   4,235      42,350     1,589.8      99.4      00:00:10
 56805       9   4,235      38,115     1,598.7     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1781.071
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
