
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed129.dta /export/storage_covidva
> ccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_d
> ist_total_10000_5_4q_mnl_A1000_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed129.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed129.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   312      10   5,035      50,350         8.9       0.5      00:35:29
   646       4   5,035      20,140        18.9       1.0      00:33:21
   983       5   5,035      25,175        29.3       1.5      00:32:02
  1300       6   5,035      30,210        39.7       2.1      00:31:18
  1627       8   5,035      40,280        50.7       2.7      00:30:28
  2002       9   5,035      45,315        62.6       3.3      00:29:26
  2348       4   5,035      20,140        73.7       3.9      00:28:60
  2694       4   5,035      20,140        84.7       4.5      00:28:38
  3046      10   5,035      50,350        96.2       5.1      00:28:12
  3375       8   5,035      40,280       107.6       5.7      00:27:50
  3701      10   5,035      50,350       118.4       6.2      00:27:40
  4010       6   5,035      30,210       128.1       6.7      00:27:45
  4240       9   5,035      45,315       135.4       7.1      00:28:19
  4463       8   5,035      40,280       142.3       7.5      00:28:55
  4682       9   5,035      45,315       149.7       7.9      00:29:19
  4913       6   5,035      30,210       157.3       8.3      00:29:38
  5187       7   5,035      35,245       166.2       8.7      00:29:39
  5419       3   5,035      15,105       173.9       9.1      00:29:51
  5675       7   5,035      35,245       181.4       9.5      00:30:06
  5909       8   5,035      40,280       188.8       9.9      00:30:18
  6196       8   5,035      40,280       198.2      10.4      00:30:09
  6487       4   5,035      20,140       207.6      10.9      00:29:59
  6799       7   5,035      35,245       217.4      11.4      00:29:46
  7094       9   5,035      45,315       226.9      11.9      00:29:35
  7424       8   5,035      40,280       237.6      12.5      00:29:14
  7753       5   5,035      25,175       248.3      13.1      00:28:54
  8091       6   5,035      30,210       260.1      13.7      00:28:27
  8410       5   5,035      25,175       271.2      14.3      00:28:07
  8737       9   5,035      45,315       282.3      14.9      00:27:47
  9051       6   5,035      30,210       293.1      15.4      00:27:30
  9324       8   5,035      40,280       302.6      15.9      00:27:22
  9570      10   5,035      50,350       311.1      16.4      00:27:19
  9810       9   5,035      45,315       319.6      16.8      00:27:17
 10054      10   5,035      50,350       327.4      17.2      00:27:18
 10293       8   5,035      40,280       334.6      17.6      00:27:23
 10528       8   5,035      40,280       342.4      18.0      00:27:23
 10804       6   5,035      30,210       351.1      18.5      00:27:17
 11092       4   5,035      20,140       360.5      19.0      00:27:08
 11366      10   5,035      50,350       369.5      19.4      00:27:00
 11591       9   5,035      45,315       376.9      19.8      00:27:02
 11860       6   5,035      30,210       385.8      20.3      00:26:54
 12112       7   5,035      35,245       394.2      20.7      00:26:49
 12338       7   5,035      35,245       401.5      21.1      00:26:50
 12689       8   5,035      40,280       413.2      21.7      00:26:28
 13018      10   5,035      50,350       423.5      22.3      00:26:14
 13387      10   5,035      50,350       435.7      22.9      00:25:51
 13650      10   5,035      50,350       445.1      23.4      00:25:41
 13891       7   5,035      35,245       453.0      23.8      00:25:38
 14203       9   5,035      45,315       463.3      24.4      00:25:24
 14505       5   5,035      25,175       473.7      24.9      00:25:10
 14795       6   5,035      30,210       483.3      25.4      00:24:60
 15172       9   5,035      45,315       496.3      26.1      00:24:35
 15496       6   5,035      30,210       507.0      26.7      00:24:21
 15872       5   5,035      25,175       519.7      27.3      00:23:59
 16230       7   5,035      35,245       532.3      28.0      00:23:37
 16560       7   5,035      35,245       543.8      28.6      00:23:21
 16814       9   5,035      45,315       552.2      29.0      00:23:15
 17047       4   5,035      20,140       560.1      29.5      00:23:12
 17310       7   5,035      35,245       568.8      29.9      00:23:05
 17504      10   5,035      50,350       575.8      30.3      00:23:04
 17735      10   5,035      50,350       583.7      30.7      00:22:60
 18057       9   5,035      45,315       594.3      31.3      00:22:46
 18445       6   5,035      30,210       607.3      31.9      00:22:25
 18664       8   5,035      40,280       614.7      32.3      00:22:22
 18939      10   5,035      50,350       624.2      32.8      00:22:13
 19190       3   5,035      15,105       633.1      33.3      00:22:05
 19508       9   5,035      45,315       644.1      33.9      00:21:51
 19881       7   5,035      35,245       657.2      34.6      00:21:30
 20267       3   5,035      15,105       670.6      35.3      00:21:09
 20591       8   5,035      40,280       681.8      35.9      00:20:54
 20783       7   5,035      35,245       688.4      36.2      00:20:53
 21020       8   5,035      40,280       696.5      36.6      00:20:48
 21362       7   5,035      35,245       706.8      37.2      00:20:36
 21613       6   5,035      30,210       715.1      37.6      00:20:30
 21902       8   5,035      40,280       724.1      38.1      00:20:22
 22194       6   5,035      30,210       733.1      38.6      00:20:13
 22501       9   5,035      45,315       742.9      39.1      00:20:03
 22838       9   5,035      45,315       753.3      39.6      00:19:51
 23164       8   5,035      40,280       764.2      40.2      00:19:38
 23432       4   5,035      20,140       773.2      40.7      00:19:30
 23705       7   5,035      35,245       781.7      41.1      00:19:23
 23960       4   5,035      20,140       790.2      41.6      00:19:15
 24236      10   5,035      50,350       798.9      42.0      00:19:07
 24587       6   5,035      30,210       810.4      42.6      00:18:53
 24954       8   5,035      40,280       822.3      43.3      00:18:37
 25260      10   5,035      50,350       832.8      43.8      00:18:25
 25534       6   5,035      30,210       842.1      44.3      00:18:16
 25767      10   5,035      50,350       849.7      44.7      00:18:11
 25967       8   5,035      40,280       856.4      45.0      00:18:08
 26183      10   5,035      50,350       863.6      45.4      00:18:04
 26533      10   5,035      50,350       874.9      46.0      00:17:50
 26903       7   5,035      35,245       887.1      46.7      00:17:34
 27205       8   5,035      40,280       897.2      47.2      00:17:23
 27494       8   5,035      40,280       906.7      47.7      00:17:13
 27792       6   5,035      30,210       916.8      48.2      00:17:02
 28127       5   5,035      25,175       928.3      48.8      00:16:48
 28459       9   5,035      45,315       939.7      49.4      00:16:35
 28729       8   5,035      40,280       949.2      49.9      00:16:25
 28959       9   5,035      45,315       957.2      50.3      00:16:18
 29274      10   5,035      50,350       967.6      50.9      00:16:07
 29614       9   5,035      45,315       979.2      51.5      00:15:53
 29906      10   5,035      50,350       989.1      52.0      00:15:43
 30134       5   5,035      25,175       996.8      52.4      00:15:36
 30347       9   5,035      45,315     1,004.1      52.8      00:15:31
 30581       7   5,035      35,245     1,012.3      53.2      00:15:24
 30887      10   5,035      50,350     1,022.9      53.8      00:15:12
 31212       7   5,035      35,245     1,033.8      54.4      00:14:60
 31544       6   5,035      30,210     1,045.4      55.0      00:14:46
 31869       7   5,035      35,245     1,056.8      55.6      00:14:33
 32205       4   5,035      20,140     1,068.7      56.2      00:14:19
 32514       8   5,035      40,280     1,079.9      56.8      00:14:06
 32738       8   5,035      40,280     1,087.4      57.2      00:13:60
 32975       7   5,035      35,245     1,095.8      57.6      00:13:52
 33197       6   5,035      30,210     1,103.5      58.0      00:13:46
 33519      10   5,035      50,350     1,114.7      58.6      00:13:33
 33791       7   5,035      35,245     1,124.3      59.1      00:13:23
 34021      10   5,035      50,350     1,132.4      59.6      00:13:16
 34281      10   5,035      50,350     1,141.7      60.1      00:13:07
 34615       5   5,035      25,175     1,153.3      60.7      00:12:53
 34955       7   5,035      35,245     1,165.4      61.3      00:12:39
 35305       5   5,035      25,175     1,177.6      61.9      00:12:25
 35630       5   5,035      25,175     1,188.9      62.5      00:12:12
 35934       7   5,035      35,245     1,199.4      63.1      00:12:01
 36316       5   5,035      25,175     1,212.8      63.8      00:11:45
 36641      10   5,035      50,350     1,223.9      64.4      00:11:33
 36873       4   5,035      20,140     1,231.6      64.8      00:11:27
 37120       6   5,035      30,210     1,239.9      65.2      00:11:19
 37349       6   5,035      30,210     1,246.9      65.6      00:11:13
 37596       6   5,035      30,210     1,255.1      66.0      00:11:06
 37844       6   5,035      30,210     1,263.1      66.4      00:10:58
 38102       8   5,035      40,280     1,271.9      66.9      00:10:49
 38326       7   5,035      35,245     1,279.6      67.3      00:10:43
 38573       6   5,035      30,210     1,288.3      67.8      00:10:34
 38977       6   5,035      30,210     1,301.9      68.5      00:10:18
 39255      10   5,035      50,350     1,311.1      69.0      00:10:09
 39560       9   5,035      45,315     1,321.3      69.5      00:09:58
 39874       6   5,035      30,210     1,331.7      70.0      00:09:47
 40243       8   5,035      40,280     1,344.0      70.7      00:09:33
 40623       8   5,035      40,280     1,357.0      71.4      00:09:19
 40999       5   5,035      25,175     1,370.0      72.1      00:09:04
 41314      10   5,035      50,350     1,380.6      72.6      00:08:53
 41644       7   5,035      35,245     1,391.9      73.2      00:08:41
 41977       5   5,035      25,175     1,403.5      73.8      00:08:28
 42249       6   5,035      30,210     1,411.9      74.3      00:08:20
 42546       6   5,035      30,210     1,421.9      74.8      00:08:10
 42836       6   5,035      30,210     1,431.4      75.3      00:08:00
 43037       3   5,035      15,105     1,438.4      75.7      00:07:54
 43235       6   5,035      30,210     1,445.5      76.0      00:07:48
 43442       7   5,035      35,245     1,452.7      76.4      00:07:41
 43768       6   5,035      30,210     1,463.2      77.0      00:07:30
 44144       8   5,035      40,280     1,475.7      77.6      00:07:16
 44414       8   5,035      40,280     1,484.6      78.1      00:07:07
 44674       3   5,035      15,105     1,493.4      78.5      00:06:59
 45000       6   5,035      30,210     1,504.4      79.1      00:06:47
 45365       6   5,035      30,210     1,515.8      79.7      00:06:35
 45654       4   5,035      20,140     1,525.2      80.2      00:06:25
 45938       8   5,035      40,280     1,534.3      80.7      00:06:16
 46184       9   5,035      45,315     1,542.8      81.2      00:06:08
 46497       8   5,035      40,280     1,553.4      81.7      00:05:57
 46843       8   5,035      40,280     1,565.4      82.3      00:05:44
 47126       7   5,035      35,245     1,574.3      82.8      00:05:35
 47419       4   5,035      20,140     1,583.6      83.3      00:05:26
 47703       7   5,035      35,245     1,592.8      83.8      00:05:16
 47912       7   5,035      35,245     1,599.6      84.1      00:05:10
 48163       7   5,035      35,245     1,608.1      84.6      00:05:01
 48404       6   5,035      30,210     1,616.3      85.0      00:04:53
 48679       6   5,035      30,210     1,625.5      85.5      00:04:44
 48916       7   5,035      35,245     1,633.3      85.9      00:04:36
 49190       6   5,035      30,210     1,642.8      86.4      00:04:26
 49504       5   5,035      25,175     1,652.7      86.9      00:04:16
 49810       6   5,035      30,210     1,662.3      87.4      00:04:06
 50080       9   5,035      45,315     1,671.3      87.9      00:03:57
 50362       6   5,035      30,210     1,680.2      88.4      00:03:48
 50653       8   5,035      40,280     1,689.9      88.9      00:03:38
 50939       4   5,035      20,140     1,699.7      89.4      00:03:28
 51220       7   5,035      35,245     1,709.2      89.9      00:03:18
 51531       9   5,035      45,315     1,719.8      90.5      00:03:07
 51832       4   5,035      20,140     1,730.5      91.0      00:02:56
 52151      10   5,035      50,350     1,741.7      91.6      00:02:44
 52481      10   5,035      50,350     1,753.6      92.2      00:02:32
 52850       9   5,035      45,315     1,767.2      93.0      00:02:17
 53252       5   5,035      25,175     1,781.4      93.7      00:02:03
 53662       8   5,035      40,280     1,795.7      94.5      00:01:48
 53936       9   5,035      45,315     1,804.9      94.9      00:01:38
 54199       7   5,035      35,245     1,813.8      95.4      00:01:29
 54487       8   5,035      40,280     1,823.0      95.9      00:01:20
 54855       8   5,035      40,280     1,835.0      96.5      00:01:08
 55171      10   5,035      50,350     1,845.5      97.1      00:00:57
 55479       6   5,035      30,210     1,855.2      97.6      00:00:47
 55776       6   5,035      30,210     1,865.0      98.1      00:00:37
 56055       9   5,035      45,315     1,874.7      98.6      00:00:27
 56373      10   5,035      50,350     1,885.6      99.2      00:00:16
 56707       8   5,035      40,280     1,897.3      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1943.189
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed129
    > .csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed129.csv sa
> ved

. 
. cap log close

. 
end of do-file
