
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A600.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A600.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   285       7   4,635      32,445         7.6       0.4      00:38:20
   578       8   4,635      37,080        15.7       0.9      00:36:55
   896       7   4,635      32,445        24.5       1.4      00:35:14
  1186       6   4,635      27,810        33.3       1.9      00:34:25
  1473       5   4,635      23,175        42.1       2.4      00:33:50
  1758       7   4,635      32,445        50.7       2.9      00:33:31
  2035       3   4,635      13,905        58.7       3.4      00:33:39
  2312       2   4,635       9,270        67.0       3.8      00:33:30
  2610       6   4,635      27,810        75.7       4.3      00:33:11
  2932       7   4,635      32,445        85.5       4.9      00:32:29
  3250       4   4,635      18,540        95.3       5.5      00:31:51
  3536       7   4,635      32,445       104.1       6.0      00:31:38
  3818       5   4,635      23,175       112.7       6.4      00:31:29
  4083       7   4,635      32,445       120.3       6.9      00:31:38
  4316       9   4,635      41,715       126.8       7.3      00:32:02
  4518       7   4,635      32,445       132.8       7.6      00:32:30
  4755       4   4,635      18,540       140.2       8.0      00:32:33
  5013       3   4,635      13,905       148.0       8.5      00:32:31
  5269       8   4,635      37,080       155.5       8.9      00:32:30
  5495       5   4,635      23,175       162.1       9.3      00:32:41
  5685       8   4,635      37,080       167.5       9.6      00:33:06
  5905       9   4,635      41,715       174.0      10.0      00:33:14
  6144       7   4,635      32,445       181.2      10.4      00:33:13
  6395       7   4,635      32,445       188.5      10.8      00:33:11
  6632       6   4,635      27,810       195.4      11.2      00:33:12
  6846       5   4,635      23,175       201.8      11.5      00:33:18
  7129       8   4,635      37,080       210.0      12.0      00:33:03
  7415       7   4,635      32,445       218.6      12.5      00:32:44
  7682       4   4,635      18,540       226.6      13.0      00:32:33
  7941       6   4,635      27,810       234.9      13.4      00:32:18
  8200       8   4,635      37,080       243.2      13.9      00:32:04
  8496       8   4,635      37,080       252.6      14.4      00:31:40
  8794       7   4,635      32,445       261.9      15.0      00:31:18
  9078       4   4,635      18,540       270.9      15.5      00:30:59
  9280       9   4,635      41,715       277.4      15.9      00:31:00
  9509       7   4,635      32,445       284.6      16.3      00:30:56
  9758      10   4,635      46,350       292.8      16.7      00:30:44
  9981       9   4,635      41,715       299.4      17.1      00:30:43
 10213       9   4,635      41,715       305.9      17.5      00:30:44
 10417       8   4,635      37,080       312.0      17.8      00:30:46
 10644       9   4,635      41,715       318.6      18.2      00:30:44
 10886       9   4,635      41,715       325.9      18.6      00:30:38
 11169       6   4,635      27,810       334.4      19.1      00:30:23
 11394       9   4,635      41,715       341.2      19.5      00:30:19
 11596       6   4,635      27,810       347.2      19.9      00:30:21
 11854       3   4,635      13,905       355.2      20.3      00:30:09
 12066       8   4,635      37,080       361.7      20.7      00:30:07
 12251       7   4,635      32,445       367.3      21.0      00:30:10
 12515       9   4,635      41,715       375.3      21.5      00:29:57
 12829       7   4,635      32,445       384.4      22.0      00:29:39
 13180       8   4,635      37,080       395.0      22.6      00:29:12
 13535       7   4,635      32,445       406.3      23.2      00:28:42
 13682       5   4,635      23,175       411.0      23.5      00:28:49
 13879       7   4,635      32,445       416.9      23.8      00:28:49
 14148       2   4,635       9,270       425.0      24.3      00:28:37
 14382       7   4,635      32,445       432.4      24.7      00:28:29
 14623       9   4,635      41,715       439.8      25.2      00:28:20
 14866      10   4,635      46,350       447.3      25.6      00:28:12
 15154       7   4,635      32,445       456.5      26.1      00:27:54
 15506       9   4,635      41,715       467.4      26.7      00:27:29
 15861       5   4,635      23,175       478.4      27.4      00:27:04
 16120       9   4,635      41,715       486.9      27.8      00:26:51
 16414       6   4,635      27,810       496.3      28.4      00:26:34
 16654      10   4,635      46,350       503.5      28.8      00:26:26
 16896       9   4,635      41,715       511.0      29.2      00:26:18
 17104      10   4,635      46,350       517.5      29.6      00:26:14
 17260       8   4,635      37,080       522.3      29.9      00:26:17
 17444      10   4,635      46,350       528.3      30.2      00:26:15
 17646       8   4,635      37,080       534.9      30.6      00:26:10
 17915       8   4,635      37,080       542.9      31.0      00:25:59
 18236       7   4,635      32,445       553.1      31.6      00:25:39
 18556       5   4,635      23,175       562.6      32.2      00:25:22
 18829      10   4,635      46,350       571.3      32.7      00:25:08
 19098       8   4,635      37,080       580.1      33.2      00:24:55
 19345       9   4,635      41,715       587.9      33.6      00:24:45
 19639      10   4,635      46,350       597.4      34.2      00:24:28
 19902       9   4,635      41,715       606.0      34.7      00:24:15
 20191       6   4,635      27,810       615.5      35.2      00:23:60
 20486       5   4,635      23,175       624.6      35.7      00:23:45
 20675      10   4,635      46,350       630.6      36.1      00:23:42
 20896       9   4,635      41,715       637.7      36.5      00:23:35
 21134       4   4,635      18,540       644.7      36.9      00:23:28
 21352       6   4,635      27,810       650.7      37.2      00:23:24
 21560       6   4,635      27,810       657.0      37.6      00:23:19
 21804       8   4,635      37,080       663.9      38.0      00:23:12
 21996       6   4,635      27,810       669.7      38.3      00:23:09
 22238       3   4,635      13,905       676.5      38.7      00:23:02
 22547       6   4,635      27,810       685.5      39.2      00:22:48
 22898       9   4,635      41,715       695.5      39.8      00:22:31
 23250       6   4,635      27,810       706.5      40.4      00:22:11
 23671      10   4,635      46,350       718.8      41.1      00:21:47
 24092       6   4,635      27,810       731.5      41.8      00:21:22
 24459       9   4,635      41,715       742.3      42.4      00:21:04
 24804       9   4,635      41,715       752.9      43.0      00:20:46
 25183       3   4,635      13,905       764.6      43.7      00:20:26
 25532       4   4,635      18,540       775.3      44.3      00:20:08
 25746       6   4,635      27,810       781.9      44.7      00:20:02
 25933      10   4,635      46,350       787.6      45.0      00:19:59
 26116       7   4,635      32,445       793.3      45.4      00:19:55
 26467       5   4,635      23,175       803.9      46.0      00:19:38
 26802       5   4,635      23,175       813.8      46.5      00:19:23
 27106       9   4,635      41,715       823.2      47.1      00:19:09
 27332       6   4,635      27,810       830.1      47.5      00:19:03
 27524       9   4,635      41,715       836.0      47.8      00:18:58
 27779       9   4,635      41,715       844.0      48.3      00:18:48
 28094       6   4,635      27,810       853.9      48.8      00:18:33
 28442       5   4,635      23,175       864.9      49.5      00:18:16
 28751      10   4,635      46,350       874.9      50.0      00:18:01
 29017       8   4,635      37,080       883.3      50.5      00:17:50
 29306       9   4,635      41,715       892.2      51.0      00:17:39
 29644       5   4,635      23,175       902.5      51.6      00:17:23
 29871       9   4,635      41,715       909.8      52.0      00:17:15
 30096       6   4,635      27,810       916.8      52.4      00:17:08
 30321       3   4,635      13,905       923.9      52.8      00:17:00
 30552       4   4,635      18,540       931.3      53.3      00:16:52
 30857      10   4,635      46,350       941.0      53.8      00:16:38
 31227       8   4,635      37,080       952.6      54.5      00:16:20
 31598      10   4,635      46,350       964.5      55.1      00:16:02
 31932       7   4,635      32,445       975.4      55.8      00:15:46
 32256       9   4,635      41,715       986.0      56.4      00:15:30
 32532       5   4,635      23,175       994.9      56.9      00:15:19
 32734       5   4,635      23,175     1,001.5      57.3      00:15:12
 32901       9   4,635      41,715     1,006.7      57.6      00:15:09
 33039       6   4,635      27,810     1,011.3      57.8      00:15:06
 33274       7   4,635      32,445     1,018.8      58.3      00:14:58
 33561      10   4,635      46,350     1,028.0      58.8      00:14:45
 33860       7   4,635      32,445     1,037.7      59.3      00:14:32
 34165       7   4,635      32,445     1,047.7      59.9      00:14:18
 34471       7   4,635      32,445     1,057.6      60.5      00:14:05
 34789      10   4,635      46,350     1,067.9      61.1      00:13:51
 35115       7   4,635      32,445     1,078.3      61.7      00:13:36
 35484      10   4,635      46,350     1,090.4      62.3      00:13:19
 35807       7   4,635      32,445     1,100.4      62.9      00:13:05
 36144       8   4,635      37,080     1,111.3      63.5      00:12:50
 36485       6   4,635      27,810     1,122.1      64.2      00:12:36
 36706       8   4,635      37,080     1,129.0      64.6      00:12:28
 36955       5   4,635      23,175     1,136.7      65.0      00:12:19
 37216       8   4,635      37,080     1,144.3      65.4      00:12:11
 37512       9   4,635      41,715     1,153.1      65.9      00:11:60
 37786      10   4,635      46,350     1,161.3      66.4      00:11:50
 38036       9   4,635      41,715     1,169.2      66.9      00:11:41
 38335       9   4,635      41,715     1,178.7      67.4      00:11:28
 38615       8   4,635      37,080     1,187.6      67.9      00:11:17
 38903       8   4,635      37,080     1,196.6      68.4      00:11:06
 39088       5   4,635      23,175     1,202.4      68.8      00:11:00
 39374       7   4,635      32,445     1,211.0      69.2      00:10:50
 39687       6   4,635      27,810     1,220.5      69.8      00:10:38
 40030       3   4,635      13,905     1,231.1      70.4      00:10:24
 40347       4   4,635      18,540     1,240.7      70.9      00:10:12
 40678       6   4,635      27,810     1,251.3      71.5      00:09:58
 41012       7   4,635      32,445     1,262.0      72.2      00:09:44
 41243       8   4,635      37,080     1,269.2      72.6      00:09:36
 41542       7   4,635      32,445     1,278.5      73.1      00:09:24
 41788       9   4,635      41,715     1,286.2      73.5      00:09:15
 42005       8   4,635      37,080     1,293.0      73.9      00:09:08
 42257      10   4,635      46,350     1,300.3      74.3      00:08:59
 42478       7   4,635      32,445     1,307.3      74.7      00:08:51
 42712       4   4,635      18,540     1,314.3      75.1      00:08:44
 42933       7   4,635      32,445     1,321.2      75.5      00:08:36
 43138       8   4,635      37,080     1,327.9      75.9      00:08:28
 43345       7   4,635      32,445     1,334.5      76.3      00:08:21
 43550       6   4,635      27,810     1,340.8      76.7      00:08:14
 43845       9   4,635      41,715     1,349.8      77.2      00:08:03
 44101      10   4,635      46,350     1,357.6      77.6      00:07:54
 44276      10   4,635      46,350     1,363.1      77.9      00:07:48
 44476       5   4,635      23,175     1,369.0      78.3      00:07:42
 44694       4   4,635      18,540     1,375.7      78.7      00:07:34
 44921       6   4,635      27,810     1,382.8      79.1      00:07:26
 45182       5   4,635      23,175     1,390.6      79.5      00:07:16
 45395       9   4,635      41,715     1,396.7      79.9      00:07:10
 45603       8   4,635      37,080     1,402.8      80.2      00:07:03
 45795      10   4,635      46,350     1,408.4      80.5      00:06:57
 45996       7   4,635      32,445     1,414.7      80.9      00:06:50
 46225       8   4,635      37,080     1,422.0      81.3      00:06:41
 46458       9   4,635      41,715     1,429.1      81.7      00:06:32
 46714       9   4,635      41,715     1,437.2      82.2      00:06:22
 46963       6   4,635      27,810     1,444.7      82.6      00:06:13
 47170       7   4,635      32,445     1,450.5      82.9      00:06:07
 47386       7   4,635      32,445     1,457.0      83.3      00:05:59
 47615       8   4,635      37,080     1,463.8      83.7      00:05:51
 47813      10   4,635      46,350     1,469.8      84.0      00:05:44
 48007       8   4,635      37,080     1,475.9      84.4      00:05:37
 48198       8   4,635      37,080     1,481.7      84.7      00:05:31
 48379       7   4,635      32,445     1,487.4      85.1      00:05:24
 48609       7   4,635      32,445     1,494.5      85.5      00:05:16
 48838      10   4,635      46,350     1,501.5      85.9      00:05:07
 49048       9   4,635      41,715     1,508.0      86.2      00:04:59
 49235       7   4,635      32,445     1,513.9      86.6      00:04:52
 49468       8   4,635      37,080     1,520.7      87.0      00:04:44
 49682       6   4,635      27,810     1,526.8      87.3      00:04:37
 49882       8   4,635      37,080     1,532.6      87.6      00:04:30
 50055       7   4,635      32,445     1,538.0      87.9      00:04:24
 50259       3   4,635      13,905     1,544.0      88.3      00:04:17
 50469       8   4,635      37,080     1,550.2      88.6      00:04:09
 50656       6   4,635      27,810     1,556.0      89.0      00:04:02
 50836       7   4,635      32,445     1,561.7      89.3      00:03:55
 51028       9   4,635      41,715     1,568.1      89.7      00:03:48
 51247       6   4,635      27,810     1,574.7      90.0      00:03:40
 51476      10   4,635      46,350     1,581.9      90.5      00:03:31
 51682       9   4,635      41,715     1,588.7      90.8      00:03:22
 51896       3   4,635      13,905     1,595.5      91.2      00:03:14
 52168       8   4,635      37,080     1,604.5      91.7      00:03:02
 52435       4   4,635      18,540     1,613.3      92.2      00:02:51
 52715       5   4,635      23,175     1,622.9      92.8      00:02:39
 52997       5   4,635      23,175     1,632.1      93.3      00:02:27
 53272       6   4,635      27,810     1,641.0      93.8      00:02:16
 53540       6   4,635      27,810     1,649.6      94.3      00:02:05
 53776       6   4,635      27,810     1,657.1      94.8      00:01:55
 53979      10   4,635      46,350     1,663.3      95.1      00:01:48
 54187      10   4,635      46,350     1,669.7      95.5      00:01:40
 54408       6   4,635      27,810     1,676.3      95.8      00:01:32
 54645       7   4,635      32,445     1,683.3      96.2      00:01:23
 54913       7   4,635      32,445     1,691.4      96.7      00:01:13
 55148       5   4,635      23,175     1,698.5      97.1      00:01:04
 55377       3   4,635      13,905     1,705.1      97.5      00:00:55
 55571       6   4,635      27,810     1,710.8      97.8      00:00:48
 55723       9   4,635      41,715     1,715.6      98.1      00:00:42
 55934       6   4,635      27,810     1,722.3      98.5      00:00:34
 56169      10   4,635      46,350     1,729.7      98.9      00:00:24
 56400      10   4,635      46,350     1,737.2      99.3      00:00:15
 56684       6   4,635      27,810     1,746.3      99.9      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 2225.905
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600.csv saved

. 
. cap log close

. 
end of do-file
