
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total.dta /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10
> 000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  13 Jan 2024, 17:02:23

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   517      10   4,035      40,350        12.0       0.8      00:21:03
  1092       2   4,035       8,070        26.4       1.7      00:18:57
  1651       5   4,035      20,175        41.2       2.7      00:18:01
  2220       5   4,035      20,175        55.8       3.7      00:17:33
  2790       8   4,035      32,280        70.6       4.6      00:17:10
  3355       8   4,035      32,280        85.6       5.6      00:16:49
  3908       1   4,035       4,035       100.2       6.6      00:16:35
  4389      10   4,035      40,350       112.1       7.4      00:16:48
  4831       8   4,035      32,280       123.9       8.1      00:16:58
  5272      10   4,035      40,350       135.3       8.9      00:17:07
  5689       2   4,035       8,070       145.7       9.6      00:17:21
  6133       4   4,035      16,140       157.3      10.3      00:17:23
  6577       5   4,035      20,175       168.6      11.1      00:17:26
  7017      10   4,035      40,350       179.9      11.8      00:17:26
  7510       8   4,035      32,280       192.6      12.6      00:17:17
  7987       8   4,035      32,280       205.6      13.5      00:17:06
  8474       7   4,035      28,245       219.1      14.4      00:16:53
  8966       6   4,035      24,210       232.6      15.3      00:16:40
  9378       3   4,035      12,105       244.0      16.0      00:16:37
  9751       5   4,035      20,175       254.4      16.7      00:16:38
 10158       9   4,035      36,315       264.8      17.4      00:16:39
 10615       9   4,035      36,315       276.5      18.1      00:16:33
 11099       7   4,035      28,245       289.1      19.0      00:16:23
 11467      10   4,035      40,350       298.9      19.6      00:16:24
 11860       6   4,035      24,210       309.2      20.3      00:16:23
 12269       7   4,035      28,245       320.1      21.0      00:16:19
 12795       8   4,035      32,280       333.6      21.9      00:16:04
 13354       7   4,035      28,245       348.3      22.9      00:15:46
 13912       9   4,035      36,315       363.6      23.9      00:15:26
 14484       9   4,035      36,315       379.0      24.9      00:15:07
 15041       7   4,035      28,245       394.0      25.9      00:14:50
 15594       8   4,035      32,280       408.9      26.8      00:14:33
 16141       9   4,035      36,315       424.2      27.8      00:14:16
 16657       9   4,035      36,315       438.2      28.8      00:14:03
 17061       9   4,035      36,315       449.2      29.5      00:13:58
 17436       5   4,035      20,175       459.4      30.2      00:13:55
 17835       8   4,035      32,280       470.3      30.9      00:13:50
 18294       3   4,035      12,105       482.8      31.7      00:13:40
 18810       5   4,035      20,175       496.7      32.6      00:13:27
 19359       9   4,035      36,315       511.9      33.6      00:13:11
 19908       5   4,035      20,175       527.5      34.6      00:12:55
 20471       8   4,035      32,280       543.1      35.6      00:12:39
 20843       9   4,035      36,315       553.3      36.3      00:12:35
 21264       6   4,035      24,210       564.2      37.0      00:12:29
 21737       9   4,035      36,315       576.0      37.8      00:12:21
 22204       6   4,035      24,210       587.8      38.6      00:12:13
 22636       6   4,035      24,210       598.9      39.3      00:12:06
 23084       8   4,035      32,280       610.3      40.1      00:11:59
 23542       3   4,035      12,105       622.1      40.8      00:11:51
 23988       5   4,035      20,175       634.0      41.6      00:11:42
 24516       6   4,035      24,210       647.5      42.5      00:11:31
 25054       9   4,035      36,315       661.8      43.4      00:11:18
 25570       4   4,035      16,140       675.8      44.4      00:11:06
 25967       8   4,035      32,280       686.3      45.0      00:10:59
 26408       5   4,035      20,175       698.0      45.8      00:10:51
 26895       6   4,035      24,210       710.7      46.6      00:10:41
 27311       7   4,035      28,245       721.7      47.4      00:10:34
 27721       6   4,035      24,210       732.8      48.1      00:10:26
 28215       5   4,035      20,175       746.3      49.0      00:10:15
 28689       8   4,035      32,280       759.5      49.9      00:10:04
 29046       7   4,035      28,245       769.4      50.5      00:09:58
 29464       9   4,035      36,315       780.8      51.2      00:09:50
 29883       9   4,035      36,315       792.0      52.0      00:09:43
 30257       7   4,035      28,245       802.3      52.7      00:09:36
 30669       5   4,035      20,175       813.6      53.4      00:09:28
 31208       6   4,035      24,210       828.3      54.4      00:09:15
 31736       7   4,035      28,245       843.1      55.3      00:09:01
 32260       8   4,035      32,280       858.1      56.3      00:08:48
 32694       8   4,035      32,280       870.3      57.1      00:08:39
 33058       7   4,035      28,245       880.5      57.8      00:08:32
 33490      10   4,035      40,350       892.5      58.6      00:08:23
 33923       8   4,035      32,280       904.8      59.4      00:08:13
 34382       8   4,035      32,280       917.9      60.2      00:08:02
 34922      10   4,035      40,350       933.1      61.2      00:07:49
 35474       6   4,035      24,210       948.5      62.3      00:07:35
 36019       5   4,035      20,175       963.6      63.2      00:07:22
 36567       5   4,035      20,175       978.7      64.2      00:07:09
 36976       9   4,035      36,315       989.9      65.0      00:07:01
 37377       6   4,035      24,210     1,000.0      65.6      00:06:54
 37745       9   4,035      36,315     1,009.6      66.3      00:06:48
 38106      10   4,035      40,350     1,019.4      66.9      00:06:41
 38477      10   4,035      40,350     1,029.7      67.6      00:06:34
 38854       8   4,035      32,280     1,040.0      68.3      00:06:26
 39228       9   4,035      36,315     1,050.0      68.9      00:06:19
 39667       6   4,035      24,210     1,061.7      69.7      00:06:10
 40189       9   4,035      36,315     1,075.6      70.6      00:05:59
 40737       5   4,035      20,175     1,090.6      71.6      00:05:46
 41166       6   4,035      24,210     1,102.4      72.4      00:05:37
 41611      10   4,035      40,350     1,114.6      73.2      00:05:27
 42028       6   4,035      24,210     1,126.0      73.9      00:05:18
 42466       6   4,035      24,210     1,137.4      74.7      00:05:09
 42895       6   4,035      24,210     1,148.8      75.4      00:05:00
 43301       8   4,035      32,280     1,160.2      76.1      00:04:52
 43710      10   4,035      40,350     1,171.0      76.9      00:04:43
 44091       9   4,035      36,315     1,181.3      77.5      00:04:36
 44554       5   4,035      20,175     1,193.5      78.3      00:04:26
 45010       5   4,035      20,175     1,205.9      79.1      00:04:16
 45478      10   4,035      40,350     1,217.8      79.9      00:04:06
 45891       4   4,035      16,140     1,228.4      80.6      00:03:58
 46295       6   4,035      24,210     1,239.6      81.4      00:03:49
 46742       8   4,035      32,280     1,251.6      82.2      00:03:40
 47159       9   4,035      36,315     1,262.3      82.9      00:03:31
 47578       4   4,035      16,140     1,273.1      83.6      00:03:23
 47966       6   4,035      24,210     1,283.5      84.2      00:03:15
 48354       6   4,035      24,210     1,293.9      84.9      00:03:07
 48778       7   4,035      28,245     1,305.3      85.7      00:02:57
 49205      10   4,035      40,350     1,317.0      86.4      00:02:48
 49755       8   4,035      32,280     1,330.7      87.3      00:02:37
 50306       6   4,035      24,210     1,345.1      88.3      00:02:25
 50744       8   4,035      32,280     1,356.6      89.0      00:02:16
 51164       4   4,035      16,140     1,368.2      89.8      00:02:06
 51612       6   4,035      24,210     1,380.5      90.6      00:01:56
 52048       8   4,035      32,280     1,392.7      91.4      00:01:46
 52470       6   4,035      24,210     1,405.0      92.2      00:01:36
 52891       8   4,035      32,280     1,417.5      93.0      00:01:26
 53344       8   4,035      32,280     1,430.2      93.9      00:01:16
 53844       9   4,035      36,315     1,444.0      94.8      00:01:05
 54250       6   4,035      24,210     1,455.0      95.5      00:00:56
 54703       9   4,035      36,315     1,466.5      96.3      00:00:46
 55172       4   4,035      16,140     1,479.0      97.1      00:00:36
 55589       5   4,035      20,175     1,489.5      97.8      00:00:28
 55974       6   4,035      24,210     1,500.1      98.5      00:00:19
 56397       8   4,035      32,280     1,511.8      99.2      00:00:10
 56811       9   4,035      36,315     1,523.4     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1246.46
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
