
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A200.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Apr 2024, 11:57:47

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   345      10   4,235      42,350         8.4       0.5      00:31:48
   728       5   4,235      21,175        18.0       1.1      00:29:19
  1124       4   4,235      16,940        28.5       1.8      00:27:37
  1527       6   4,235      25,410        39.9       2.5      00:26:07
  1954       9   4,235      38,115        51.3       3.2      00:25:12
  2377       4   4,235      16,940        62.8       3.9      00:24:31
  2803       8   4,235      33,880        74.5       4.7      00:23:55
  3235       8   4,235      33,880        86.4       5.4      00:23:23
  3703       3   4,235      12,705        99.6       6.2      00:22:37
  4112       8   4,235      33,880       110.5       6.9      00:22:29
  4483       7   4,235      29,645       120.3       7.5      00:22:35
  4824       6   4,235      25,410       129.8       8.1      00:22:40
  5186       8   4,235      33,880       139.7       8.7      00:22:40
  5529       5   4,235      21,175       148.8       9.3      00:22:46
  5853       8   4,235      33,880       157.3       9.8      00:22:57
  6230      10   4,235      42,350       167.7      10.5      00:22:48
  6549       4   4,235      16,940       176.2      11.0      00:22:55
  6893       9   4,235      38,115       185.4      11.6      00:22:54
  7268       8   4,235      33,880       195.3      12.2      00:22:47
  7701       4   4,235      16,940       207.4      13.0      00:22:24
  8040       7   4,235      29,645       217.3      13.6      00:22:17
  8435       3   4,235      12,705       228.8      14.3      00:21:59
  8854       7   4,235      29,645       240.8      15.1      00:21:39
  9250      10   4,235      42,350       252.4      15.8      00:21:22
  9555       5   4,235      21,175       261.2      16.3      00:21:22
  9893       2   4,235       8,470       271.0      17.0      00:21:16
 10267      10   4,235      42,350       280.7      17.6      00:21:10
 10653       2   4,235       8,470       291.2      18.2      00:20:60
 11059       9   4,235      38,115       302.4      18.9      00:20:45
 11385       9   4,235      38,115       311.4      19.5      00:20:42
 11671       8   4,235      33,880       319.2      20.0      00:20:45
 11969       6   4,235      25,410       327.5      20.5      00:20:44
 12320      10   4,235      42,350       337.3      21.1      00:20:36
 12780      10   4,235      42,350       349.7      21.9      00:20:16
 13241       4   4,235      16,940       362.5      22.7      00:19:56
 13653       8   4,235      33,880       374.5      23.4      00:19:39
 14032       7   4,235      29,645       384.8      24.1      00:19:29
 14435       4   4,235      16,940       396.3      24.8      00:19:15
 14858       6   4,235      25,410       408.3      25.5      00:18:59
 15328       5   4,235      21,175       421.8      26.4      00:18:38
 15751       9   4,235      38,115       433.6      27.1      00:18:24
 16144       9   4,235      38,115       445.3      27.8      00:18:10
 16527       8   4,235      33,880       456.5      28.5      00:17:58
 16888       6   4,235      25,410       466.5      29.2      00:17:50
 17232       7   4,235      29,645       476.2      29.8      00:17:43
 17554       8   4,235      33,880       485.8      30.4      00:17:36
 17904      10   4,235      42,350       495.6      31.0      00:17:28
 18268       6   4,235      25,410       506.0      31.6      00:17:18
 18694      10   4,235      42,350       517.9      32.4      00:17:04
 19153       6   4,235      25,410       531.4      33.2      00:16:46
 19620      10   4,235      42,350       545.0      34.1      00:16:28
 20087       8   4,235      33,880       559.1      35.0      00:16:09
 20542       7   4,235      29,645       572.0      35.8      00:15:53
 20903      10   4,235      42,350       582.5      36.4      00:15:44
 21282       7   4,235      29,645       592.6      37.1      00:15:36
 21636       6   4,235      25,410       602.0      37.6      00:15:29
 21961       2   4,235       8,470       610.7      38.2      00:15:24
 22312       8   4,235      33,880       619.8      38.8      00:15:18
 22656      10   4,235      42,350       629.2      39.3      00:15:11
 23024       8   4,235      33,880       638.8      39.9      00:15:03
 23356       3   4,235      12,705       648.2      40.5      00:14:56
 23762       7   4,235      29,645       659.1      41.2      00:14:46
 24126       7   4,235      29,645       669.1      41.8      00:14:37
 24586       8   4,235      33,880       681.6      42.6      00:14:23
 25039       7   4,235      29,645       694.2      43.4      00:14:09
 25469       7   4,235      29,645       706.4      44.2      00:13:55
 25774       7   4,235      29,645       714.9      44.7      00:13:50
 26047       5   4,235      21,175       722.6      45.2      00:13:46
 26376      10   4,235      42,350       731.8      45.8      00:13:39
 26720       6   4,235      25,410       741.0      46.3      00:13:32
 27040       8   4,235      33,880       750.1      46.9      00:13:25
 27374       8   4,235      33,880       759.3      47.5      00:13:17
 27720      10   4,235      42,350       769.1      48.1      00:13:09
 28129       5   4,235      21,175       780.9      48.8      00:12:56
 28532       7   4,235      29,645       792.6      49.6      00:12:44
 28827       8   4,235      33,880       801.2      50.1      00:12:38
 29056       6   4,235      25,410       807.9      50.5      00:12:35
 29330       9   4,235      38,115       815.5      51.0      00:12:30
 29607      10   4,235      42,350       823.4      51.5      00:12:25
 29850      10   4,235      42,350       830.4      51.9      00:12:22
 30060       5   4,235      21,175       836.4      52.3      00:12:20
 30357       9   4,235      38,115       844.9      52.8      00:12:13
 30770       8   4,235      33,880       856.9      53.6      00:12:00
 31231       9   4,235      38,115       870.1      54.4      00:11:45
 31669       5   4,235      21,175       882.9      55.2      00:11:31
 32056       6   4,235      25,410       894.5      55.9      00:11:18
 32507       8   4,235      33,880       908.1      56.8      00:11:03
 32808       6   4,235      25,410       916.8      57.3      00:10:56
 33124      10   4,235      42,350       926.1      57.9      00:10:48
 33475       5   4,235      21,175       936.3      58.6      00:10:38
 33824       8   4,235      33,880       946.7      59.2      00:10:28
 34182       7   4,235      29,645       957.4      59.9      00:10:18
 34625      10   4,235      42,350       970.4      60.7      00:10:03
 35076       7   4,235      29,645       983.7      61.5      00:09:49
 35505       7   4,235      29,645       996.4      62.3      00:09:35
 35910       8   4,235      33,880     1,008.1      63.0      00:09:24
 36321       9   4,235      38,115     1,020.2      63.8      00:09:11
 36665       8   4,235      33,880     1,030.3      64.4      00:09:02
 36937       6   4,235      25,410     1,037.8      64.9      00:08:56
 37238       4   4,235      16,940     1,045.8      65.4      00:08:50
 37500       5   4,235      21,175     1,052.9      65.8      00:08:45
 37748       8   4,235      33,880     1,059.7      66.3      00:08:40
 38001      10   4,235      42,350     1,066.8      66.7      00:08:35
 38256      10   4,235      42,350     1,074.2      67.2      00:08:29
 38505       8   4,235      33,880     1,081.6      67.6      00:08:23
 38896       7   4,235      29,645     1,092.8      68.3      00:08:12
 39205      10   4,235      42,350     1,101.5      68.9      00:08:04
 39493       6   4,235      25,410     1,109.4      69.4      00:07:58
 39768       9   4,235      38,115     1,117.1      69.9      00:07:51
 40082      10   4,235      42,350     1,126.0      70.4      00:07:43
 40430      10   4,235      42,350     1,135.7      71.0      00:07:34
 40764      10   4,235      42,350     1,145.4      71.6      00:07:24
 41049       8   4,235      33,880     1,153.8      72.2      00:07:17
 41297       8   4,235      33,880     1,160.8      72.6      00:07:11
 41581       8   4,235      33,880     1,168.9      73.1      00:07:04
 41853       8   4,235      33,880     1,176.7      73.6      00:06:57
 42143       4   4,235      16,940     1,184.8      74.1      00:06:50
 42488       3   4,235      12,705     1,194.4      74.7      00:06:41
 42802       6   4,235      25,410     1,203.1      75.2      00:06:32
 43123       9   4,235      38,115     1,212.5      75.8      00:06:23
 43447       6   4,235      25,410     1,222.0      76.4      00:06:14
 43794       9   4,235      38,115     1,231.4      77.0      00:06:05
 44113       7   4,235      29,645     1,240.6      77.6      00:05:56
 44418       7   4,235      29,645     1,248.8      78.1      00:05:48
 44803       7   4,235      29,645     1,259.7      78.8      00:05:37
 45157       6   4,235      25,410     1,269.7      79.4      00:05:27
 45521       5   4,235      21,175     1,279.4      80.0      00:05:18
 45893       6   4,235      25,410     1,289.3      80.6      00:05:08
 46228       9   4,235      38,115     1,299.0      81.2      00:04:58
 46621       8   4,235      33,880     1,310.3      81.9      00:04:47
 47038       6   4,235      25,410     1,321.8      82.7      00:04:35
 47390       9   4,235      38,115     1,331.2      83.2      00:04:26
 47755      10   4,235      42,350     1,341.2      83.9      00:04:16
 48104       7   4,235      29,645     1,351.0      84.5      00:04:06
 48454       9   4,235      38,115     1,360.9      85.1      00:03:57
 48787       7   4,235      29,645     1,370.3      85.7      00:03:47
 49075       7   4,235      29,645     1,378.3      86.2      00:03:40
 49352       4   4,235      16,940     1,386.2      86.7      00:03:32
 49662       2   4,235       8,470     1,394.2      87.2      00:03:25
 49947       7   4,235      29,645     1,401.9      87.7      00:03:17
 50215       8   4,235      33,880     1,409.4      88.1      00:03:10
 50483       8   4,235      33,880     1,416.5      88.6      00:03:03
 50755      10   4,235      42,350     1,424.3      89.1      00:02:56
 51053       6   4,235      25,410     1,433.0      89.6      00:02:47
 51349       8   4,235      33,880     1,441.3      90.1      00:02:39
 51644       6   4,235      25,410     1,449.9      90.7      00:02:31
 51952       7   4,235      29,645     1,459.0      91.2      00:02:21
 52267       4   4,235      16,940     1,468.5      91.8      00:02:12
 52670      10   4,235      42,350     1,480.9      92.6      00:01:59
 53020       6   4,235      25,410     1,491.5      93.3      00:01:48
 53384       5   4,235      21,175     1,502.2      93.9      00:01:38
 53745       6   4,235      25,410     1,512.7      94.6      00:01:27
 54095       8   4,235      33,880     1,522.7      95.2      00:01:17
 54391       8   4,235      33,880     1,531.0      95.7      00:01:09
 54815       7   4,235      29,645     1,542.4      96.5      00:00:57
 55212       1   4,235       4,235     1,553.3      97.1      00:00:46
 55508      10   4,235      42,350     1,561.3      97.6      00:00:38
 55750       8   4,235      33,880     1,567.9      98.1      00:00:31
 56012       7   4,235      29,645     1,575.5      98.5      00:00:24
 56329       5   4,235      21,175     1,584.7      99.1      00:00:15
 56695       5   4,235      21,175     1,595.5      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1621.661
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200.csv saved

. 
. cap log close

. 
end of do-file
