
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A300_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   267       6   4,335      26,010         6.6       0.4      00:40:58
   489       9   4,335      39,015        12.3       0.8      00:44:11
   745       4   4,335      17,340        19.1       1.2      00:42:27
   981       9   4,335      39,015        25.3       1.5      00:42:32
  1200       7   4,335      30,345        31.5       1.9      00:42:31
  1376       7   4,335      30,345        36.6       2.2      00:43:49
  1601       8   4,335      34,680        43.1       2.6      00:43:16
  1812       4   4,335      17,340        48.8       3.0      00:43:27
  2053      10   4,335      43,350        55.4       3.4      00:42:53
  2294       9   4,335      39,015        62.3       3.8      00:42:13
  2547       5   4,335      21,675        69.0       4.2      00:41:42
  2779       8   4,335      34,680        75.7       4.6      00:41:17
  3012       9   4,335      39,015        82.0       5.0      00:41:08
  3242       7   4,335      30,345        88.9       5.4      00:40:42
  3467       7   4,335      30,345        95.5       5.8      00:40:25
  3708       9   4,335      39,015       102.3       6.3      00:40:04
  3892       9   4,335      39,015       107.4       6.6      00:40:25
  4042       7   4,335      30,345       111.4       6.8      00:41:09
  4174       9   4,335      39,015       115.0       7.0      00:41:58
  4357       7   4,335      30,345       119.7       7.3      00:42:20
  4521      10   4,335      43,350       124.3       7.6      00:42:40
  4661       9   4,335      39,015       128.5       7.9      00:43:09
  4801       3   4,335      13,005       132.4       8.1      00:43:39
  4905      10   4,335      43,350       135.3       8.3      00:44:28
  5029       6   4,335      26,010       138.9       8.5      00:45:03
  5196       7   4,335      30,345       143.6       8.8      00:45:11
  5320      10   4,335      43,350       147.0       9.0      00:45:44
  5433       8   4,335      34,680       150.3       9.2      00:46:19
  5576       6   4,335      26,010       153.8       9.4      00:46:46
  5718       3   4,335      13,005       157.5       9.6      00:47:07
  5853       6   4,335      26,010       161.2       9.9      00:47:26
  6023       7   4,335      30,345       166.2      10.2      00:47:20
  6151       5   4,335      21,675       169.7      10.4      00:47:41
  6297       8   4,335      34,680       173.7      10.6      00:47:53
  6431       8   4,335      34,680       177.3      10.8      00:48:10
  6587       3   4,335      13,005       181.6      11.1      00:48:14
  6753       3   4,335      13,005       186.1      11.4      00:48:13
  6901       5   4,335      21,675       190.3      11.6      00:48:17
  7055       8   4,335      34,680       194.4      11.9      00:48:22
  7232       9   4,335      39,015       199.1      12.2      00:48:16
  7400       5   4,335      21,675       204.1      12.5      00:48:06
  7572       8   4,335      34,680       208.9      12.8      00:47:59
  7748       7   4,335      30,345       213.8      13.1      00:47:49
  7925       9   4,335      39,015       219.2      13.4      00:47:33
  8095       6   4,335      26,010       224.3      13.7      00:47:22
  8287       8   4,335      34,680       230.0      14.1      00:47:02
  8468       8   4,335      34,680       235.4      14.4      00:46:45
  8670       9   4,335      39,015       241.3      14.8      00:46:24
  8857       8   4,335      34,680       246.8      15.1      00:46:08
  9047       4   4,335      17,340       252.4      15.4      00:45:51
  9209      10   4,335      43,350       257.3      15.7      00:45:42
  9344      10   4,335      43,350       261.2      16.0      00:45:47
  9460      10   4,335      43,350       264.7      16.2      00:45:56
  9569       5   4,335      21,675       268.1      16.4      00:46:06
  9689      10   4,335      43,350       271.8      16.6      00:46:11
  9823       4   4,335      17,340       275.7      16.9      00:46:14
  9996      10   4,335      43,350       280.4      17.1      00:46:06
 10158       5   4,335      21,675       284.6      17.4      00:46:04
 10310       4   4,335      17,340       288.7      17.6      00:46:04
 10433       9   4,335      39,015       292.3      17.9      00:46:09
 10589      10   4,335      43,350       296.5      18.1      00:46:06
 10753       6   4,335      26,010       301.1      18.4      00:45:59
 10924       4   4,335      17,340       305.9      18.7      00:45:49
 11099       8   4,335      34,680       310.8      19.0      00:45:39
 11231       8   4,335      34,680       314.5      19.2      00:45:41
 11350       9   4,335      39,015       317.9      19.4      00:45:47
 11488       8   4,335      34,680       321.9      19.7      00:45:46
 11648       8   4,335      34,680       326.3      19.9      00:45:40
 11760      10   4,335      43,350       329.4      20.1      00:45:47
 11888       4   4,335      17,340       333.1      20.4      00:45:48
 12033      10   4,335      43,350       337.3      20.6      00:45:44
 12160       5   4,335      21,675       341.0      20.8      00:45:45
 12313       5   4,335      21,675       345.2      21.1      00:45:40
 12558       5   4,335      21,675       352.2      21.5      00:45:08
 12817       5   4,335      21,675       359.2      22.0      00:44:36
 13061       5   4,335      21,675       366.0      22.4      00:44:06
 13293       8   4,335      34,680       372.7      22.8      00:43:40
 13511       5   4,335      21,675       379.3      23.2      00:43:13
 13669       8   4,335      34,680       384.0      23.5      00:43:05
 13827       6   4,335      26,010       388.4      23.7      00:42:59
 13986       6   4,335      26,010       392.8      24.0      00:42:52
 14165      10   4,335      43,350       398.0      24.3      00:42:40
 14336       3   4,335      13,005       403.1      24.6      00:42:28
 14495       5   4,335      21,675       407.8      24.9      00:42:19
 14655       5   4,335      21,675       412.3      25.2      00:42:12
 14784       5   4,335      21,675       416.0      25.4      00:42:11
 14925       4   4,335      17,340       420.0      25.7      00:42:08
 15090       9   4,335      39,015       425.0      26.0      00:41:57
 15290       2   4,335       8,670       430.8      26.3      00:41:38
 15512       7   4,335      30,345       437.3      26.7      00:41:16
 15722       9   4,335      39,015       443.2      27.1      00:40:57
 15949       6   4,335      26,010       450.1      27.5      00:40:33
 16173       6   4,335      26,010       456.9      27.9      00:40:08
 16394      10   4,335      43,350       463.5      28.3      00:39:46
 16582       8   4,335      34,680       468.9      28.7      00:39:33
 16740       6   4,335      26,010       473.5      28.9      00:39:25
 16884       4   4,335      17,340       477.5      29.2      00:39:21
 17039       4   4,335      17,340       482.2      29.5      00:39:13
 17156       9   4,335      39,015       485.4      29.7      00:39:15
 17285       7   4,335      30,345       489.2      29.9      00:39:12
 17424      10   4,335      43,350       493.4      30.2      00:39:06
 17560       9   4,335      39,015       497.7      30.4      00:39:01
 17743       7   4,335      30,345       502.9      30.7      00:38:49
 17913       5   4,335      21,675       507.7      31.0      00:38:39
 18085       4   4,335      17,340       512.8      31.4      00:38:27
 18303      10   4,335      43,350       519.2      31.7      00:38:08
 18510       6   4,335      26,010       524.8      32.1      00:37:53
 18630      10   4,335      43,350       528.5      32.3      00:37:51
 18748       9   4,335      39,015       532.0      32.5      00:37:49
 18878       5   4,335      21,675       535.9      32.8      00:37:46
 19006       5   4,335      21,675       539.8      33.0      00:37:42
 19156       9   4,335      39,015       544.3      33.3      00:37:34
 19273      10   4,335      43,350       547.7      33.5      00:37:33
 19406      10   4,335      43,350       551.7      33.7      00:37:28
 19630       7   4,335      30,345       558.5      34.1      00:37:06
 19834       7   4,335      30,345       564.7      34.5      00:36:48
 20048       6   4,335      26,010       571.4      34.9      00:36:27
 20291       9   4,335      39,015       578.4      35.4      00:36:05
 20496       5   4,335      21,675       584.4      35.7      00:35:48
 20641      10   4,335      43,350       588.8      36.0      00:35:42
 20784      10   4,335      43,350       592.9      36.2      00:35:36
 20923       8   4,335      34,680       597.2      36.5      00:35:30
 21077       7   4,335      30,345       601.5      36.8      00:35:23
 21215       9   4,335      39,015       605.0      37.0      00:35:20
 21414       4   4,335      17,340       610.3      37.3      00:35:08
 21589       7   4,335      30,345       615.3      37.6      00:34:57
 21754       7   4,335      30,345       619.5      37.9      00:34:51
 21901       6   4,335      26,010       623.7      38.1      00:34:45
 22051       9   4,335      39,015       627.8      38.4      00:34:38
 22248      10   4,335      43,350       633.0      38.7      00:34:27
 22407       7   4,335      30,345       637.3      39.0      00:34:20
 22545       7   4,335      30,345       641.1      39.2      00:34:15
 22719       6   4,335      26,010       645.8      39.5      00:34:06
 22939      10   4,335      43,350       651.7      39.8      00:33:51
 23182       5   4,335      21,675       658.7      40.3      00:33:29
 23438       5   4,335      21,675       665.9      40.7      00:33:08
 23690       6   4,335      26,010       672.7      41.1      00:32:48
 23885       4   4,335      17,340       678.5      41.5      00:32:34
 24092       6   4,335      26,010       684.2      41.8      00:32:20
 24312       9   4,335      39,015       690.0      42.2      00:32:05
 24511       5   4,335      21,675       695.7      42.5      00:31:52
 24693       8   4,335      34,680       701.1      42.9      00:31:39
 24933       7   4,335      30,345       707.7      43.3      00:31:22
 25132      10   4,335      43,350       713.7      43.6      00:31:07
 25348       9   4,335      39,015       719.8      44.0      00:30:51
 25549       8   4,335      34,680       725.5      44.4      00:30:38
 25704      10   4,335      43,350       729.9      44.6      00:30:31
 25828       8   4,335      34,680       733.7      44.9      00:30:26
 25959       8   4,335      34,680       737.3      45.1      00:30:22
 26110       9   4,335      39,015       741.8      45.4      00:30:14
 26306       7   4,335      30,345       747.4      45.7      00:30:01
 26490       8   4,335      34,680       752.4      46.0      00:29:51
 26708       7   4,335      30,345       758.5      46.4      00:29:36
 26916       5   4,335      21,675       764.5      46.7      00:29:21
 27107       7   4,335      30,345       770.0      47.1      00:29:09
 27244       5   4,335      21,675       773.8      47.3      00:29:04
 27381      10   4,335      43,350       777.8      47.5      00:28:58
 27521       6   4,335      26,010       781.9      47.8      00:28:51
 27673       6   4,335      26,010       786.3      48.1      00:28:44
 27840       7   4,335      30,345       791.2      48.4      00:28:33
 28054       4   4,335      17,340       797.4      48.8      00:28:18
 28229       5   4,335      21,675       802.5      49.1      00:28:08
 28420       7   4,335      30,345       808.2      49.4      00:27:54
 28626       9   4,335      39,015       814.6      49.8      00:27:39
 28758       9   4,335      39,015       818.5      50.0      00:27:33
 28887       7   4,335      30,345       822.3      50.3      00:27:28
 29028      10   4,335      43,350       826.5      50.5      00:27:21
 29191       8   4,335      34,680       831.1      50.8      00:27:12
 29330      10   4,335      43,350       835.2      51.1      00:27:05
 29486       3   4,335      13,005       839.7      51.3      00:26:57
 29664       6   4,335      26,010       844.7      51.6      00:26:47
 29798       6   4,335      26,010       848.8      51.9      00:26:40
 29932       6   4,335      26,010       852.7      52.1      00:26:34
 30052       9   4,335      39,015       856.2      52.3      00:26:30
 30165      10   4,335      43,350       859.6      52.6      00:26:25
 30306       7   4,335      30,345       863.7      52.8      00:26:19
 30430       9   4,335      39,015       867.5      53.0      00:26:13
 30561       8   4,335      34,680       871.3      53.3      00:26:07
 30774       3   4,335      13,005       877.6      53.7      00:25:52
 30989       6   4,335      26,010       883.9      54.0      00:25:37
 31201       7   4,335      30,345       890.1      54.4      00:25:21
 31394      10   4,335      43,350       895.9      54.8      00:25:08
 31625       4   4,335      17,340       902.8      55.2      00:24:51
 31832      10   4,335      43,350       909.2      55.6      00:24:35
 32052       6   4,335      26,010       915.9      56.0      00:24:19
 32267       6   4,335      26,010       922.5      56.4      00:24:03
 32470       9   4,335      39,015       928.9      56.8      00:23:48
 32601       8   4,335      34,680       932.6      57.0      00:23:42
 32751       4   4,335      17,340       937.1      57.3      00:23:34
 32915       6   4,335      26,010       942.0      57.6      00:23:24
 33050      10   4,335      43,350       946.2      57.8      00:23:17
 33172       5   4,335      21,675       949.8      58.1      00:23:11
 33308       6   4,335      26,010       953.8      58.3      00:23:04
 33458       6   4,335      26,010       958.2      58.6      00:22:56
 33622      10   4,335      43,350       963.4      58.9      00:22:46
 33782       9   4,335      39,015       968.2      59.2      00:22:36
 33915       9   4,335      39,015       972.2      59.4      00:22:29
 34073       9   4,335      39,015       977.0      59.7      00:22:20
 34167       9   4,335      39,015       980.0      59.9      00:22:16
 34398       6   4,335      26,010       986.9      60.3      00:21:59
 34649       7   4,335      30,345       994.4      60.8      00:21:41
 34899       6   4,335      26,010     1,002.1      61.3      00:21:21
 35164       5   4,335      21,675     1,010.1      61.8      00:21:02
 35432       8   4,335      34,680     1,018.2      62.2      00:20:41
 35685       9   4,335      39,015     1,025.6      62.7      00:20:24
 35926       6   4,335      26,010     1,032.8      63.1      00:20:07
 36137       7   4,335      30,345     1,039.2      63.5      00:19:52
 36368      10   4,335      43,350     1,046.1      64.0      00:19:36
 36586       4   4,335      17,340     1,052.4      64.3      00:19:22
 36731       5   4,335      21,675     1,056.6      64.6      00:19:15
 36871       9   4,335      39,015     1,060.7      64.9      00:19:08
 37018       5   4,335      21,675     1,064.9      65.1      00:19:00
 37143      10   4,335      43,350     1,068.3      65.3      00:18:55
 37248       6   4,335      26,010     1,071.2      65.5      00:18:52
 37408       6   4,335      26,010     1,075.5      65.8      00:18:44
 37567       7   4,335      30,345     1,080.1      66.0      00:18:35
 37738       8   4,335      34,680     1,084.8      66.3      00:18:26
 37923       7   4,335      30,345     1,090.2      66.6      00:18:15
 38125       8   4,335      34,680     1,096.1      67.0      00:18:02
 38287       9   4,335      39,015     1,100.9      67.3      00:17:52
 38449       4   4,335      17,340     1,105.8      67.6      00:17:43
 38674       7   4,335      30,345     1,112.5      68.0      00:17:28
 38927       8   4,335      34,680     1,119.9      68.5      00:17:11
 39084      10   4,335      43,350     1,124.5      68.7      00:17:02
 39255       4   4,335      17,340     1,129.2      69.0      00:16:53
 39422       6   4,335      26,010     1,133.9      69.3      00:16:44
 39597       9   4,335      39,015     1,139.1      69.6      00:16:33
 39773       3   4,335      13,005     1,143.9      69.9      00:16:24
 39989       5   4,335      21,675     1,150.2      70.3      00:16:10
 40240       9   4,335      39,015     1,157.3      70.8      00:15:54
 40491       8   4,335      34,680     1,164.8      71.2      00:15:37
 40718       5   4,335      21,675     1,171.5      71.6      00:15:23
 40943       6   4,335      26,010     1,178.3      72.0      00:15:08
 41069       9   4,335      39,015     1,181.9      72.3      00:15:02
 41201       8   4,335      34,680     1,185.8      72.5      00:14:55
 41426       3   4,335      13,005     1,192.4      72.9      00:14:41
 41623       4   4,335      17,340     1,198.1      73.2      00:14:28
 41855       9   4,335      39,015     1,205.0      73.7      00:14:14
 42055      10   4,335      43,350     1,210.6      74.0      00:14:02
 42268       4   4,335      17,340     1,216.4      74.4      00:13:50
 42496      10   4,335      43,350     1,223.2      74.8      00:13:36
 42740       6   4,335      26,010     1,230.0      75.2      00:13:21
 43009       9   4,335      39,015     1,238.0      75.7      00:13:03
 43283       9   4,335      39,015     1,246.3      76.2      00:12:45
 43586       7   4,335      30,345     1,255.0      76.7      00:12:26
 43957       7   4,335      30,345     1,265.7      77.4      00:12:01
 44269       7   4,335      30,345     1,274.6      77.9      00:11:42
 44560       7   4,335      30,345     1,282.8      78.4      00:11:24
 44839      10   4,335      43,350     1,290.9      78.9      00:11:07
 45157       6   4,335      26,010     1,300.0      79.5      00:10:48
 45450      10   4,335      43,350     1,307.9      80.0      00:10:31
 45709       7   4,335      30,345     1,314.8      80.4      00:10:17
 45952      10   4,335      43,350     1,321.8      80.8      00:10:03
 46213       6   4,335      26,010     1,329.6      81.3      00:09:47
 46508       8   4,335      34,680     1,338.1      81.8      00:09:29
 46843       6   4,335      26,010     1,348.0      82.4      00:09:08
 47131       3   4,335      13,005     1,355.6      82.9      00:08:53
 47354       6   4,335      26,010     1,361.8      83.3      00:08:41
 47611       9   4,335      39,015     1,368.9      83.7      00:08:26
 47891       5   4,335      21,675     1,376.9      84.2      00:08:10
 48158       8   4,335      34,680     1,384.7      84.7      00:07:55
 48411       9   4,335      39,015     1,392.1      85.1      00:07:40
 48669       8   4,335      34,680     1,399.6      85.6      00:07:25
 48915       7   4,335      30,345     1,406.6      86.0      00:07:11
 49181       5   4,335      21,675     1,414.5      86.5      00:06:56
 49499       4   4,335      17,340     1,423.1      87.0      00:06:39
 49821       8   4,335      34,680     1,431.8      87.5      00:06:22
 50133      10   4,335      43,350     1,440.7      88.1      00:06:04
 50431       9   4,335      39,015     1,448.8      88.6      00:05:48
 50716       7   4,335      30,345     1,457.1      89.1      00:05:32
 50990       8   4,335      34,680     1,465.4      89.6      00:05:16
 51322       9   4,335      39,015     1,474.9      90.2      00:04:57
 51656       8   4,335      34,680     1,485.0      90.8      00:04:38
 51987       6   4,335      26,010     1,494.9      91.4      00:04:19
 52282       7   4,335      30,345     1,504.1      92.0      00:04:01
 52679       9   4,335      39,015     1,516.8      92.7      00:03:37
 53087       6   4,335      26,010     1,529.2      93.5      00:03:14
 53485       7   4,335      30,345     1,541.1      94.2      00:02:51
 53797       6   4,335      26,010     1,550.4      94.8      00:02:34
 54047       7   4,335      30,345     1,557.6      95.2      00:02:21
 54310       7   4,335      30,345     1,565.3      95.7      00:02:07
 54657       8   4,335      34,680     1,574.7      96.3      00:01:50
 54975       1   4,335       4,335     1,583.7      96.8      00:01:33
 55195       6   4,335      26,010     1,589.9      97.2      00:01:22
 55475       1   4,335       4,335     1,597.6      97.7      00:01:08
 55804       6   4,335      26,010     1,606.9      98.2      00:00:51
 56111       5   4,335      21,675     1,616.0      98.8      00:00:35
 56480       7   4,335      30,345     1,627.2      99.5      00:00:15

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 2903.231
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
