
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A500_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   356       5   4,535      22,675         9.2       0.5      00:30:59
   735       8   4,535      36,280        19.5       1.1      00:28:57
  1102       4   4,535      18,140        29.9       1.7      00:28:10
  1442       8   4,535      36,280        40.1       2.3      00:27:48
  1780       6   4,535      27,210        50.1       2.9      00:27:43
  2136       9   4,535      40,815        60.3       3.5      00:27:27
  2509       5   4,535      22,675        70.9       4.1      00:27:02
  2877       7   4,535      31,745        81.9       4.8      00:26:34
  3231       7   4,535      31,745        92.4       5.4      00:26:21
  3607       7   4,535      31,745       103.7       6.1      00:25:53
  3980       9   4,535      40,815       114.5       6.7      00:25:38
  4237       3   4,535      13,605       121.8       7.1      00:26:09
  4507       8   4,535      36,280       129.5       7.6      00:26:31
  4767       8   4,535      36,280       137.4       8.0      00:26:48
  5035      10   4,535      45,350       145.3       8.5      00:27:01
  5290      10   4,535      45,350       152.6       8.9      00:27:19
  5496       7   4,535      31,745       158.5       9.3      00:27:50
  5717       9   4,535      40,815       164.6       9.6      00:28:16
  5963       8   4,535      36,280       171.7      10.0      00:28:29
  6231       7   4,535      31,745       179.6      10.5      00:28:31
  6473       9   4,535      40,815       186.5      10.9      00:28:42
  6712       2   4,535       9,070       193.2      11.3      00:28:54
  7039       9   4,535      40,815       202.7      11.8      00:28:38
  7380       9   4,535      40,815       212.7      12.4      00:28:16
  7762       7   4,535      31,745       224.0      13.1      00:27:46
  8158      10   4,535      45,350       236.4      13.8      00:27:07
  8554       8   4,535      36,280       248.8      14.5      00:26:32
  8940       7   4,535      31,745       260.6      15.2      00:26:03
  9267       4   4,535      18,140       270.8      15.8      00:25:48
  9476       8   4,535      36,280       277.2      16.2      00:25:57
  9722       6   4,535      27,210       285.1      16.7      00:25:55
  9995       8   4,535      36,280       293.2      17.1      00:25:53
 10226       8   4,535      36,280       299.5      17.5      00:26:00
 10473      10   4,535      45,350       306.7      17.9      00:26:02
 10721       3   4,535      13,605       313.9      18.3      00:26:03
 10993       5   4,535      22,675       322.0      18.8      00:25:58
 11200       9   4,535      40,815       328.0      19.2      00:26:05
 11435       7   4,535      31,745       335.0      19.6      00:26:06
 11688      10   4,535      45,350       342.4      20.0      00:26:04
 11945      10   4,535      45,350       349.9      20.4      00:26:01
 12188       7   4,535      31,745       357.4      20.9      00:25:58
 12571       8   4,535      36,280       368.6      21.5      00:25:34
 12949       4   4,535      18,140       379.3      22.2      00:25:15
 13285       6   4,535      27,210       389.4      22.7      00:24:58
 13603      10   4,535      45,350       399.5      23.3      00:24:42
 13833       6   4,535      27,210       406.3      23.7      00:24:42
 14086       8   4,535      36,280       413.7      24.2      00:24:39
 14355       9   4,535      40,815       422.1      24.6      00:24:31
 14648       8   4,535      36,280       430.9      25.2      00:24:20
 14937       8   4,535      36,280       439.5      25.7      00:24:11
 15283      10   4,535      45,350       450.3      26.3      00:23:53
 15681       7   4,535      31,745       462.2      27.0      00:23:29
 16012       8   4,535      36,280       472.6      27.6      00:23:13
 16359      10   4,535      45,350       483.6      28.2      00:22:55
 16641      10   4,535      45,350       492.0      28.7      00:22:47
 16906       5   4,535      22,675       500.0      29.2      00:22:41
 17177       6   4,535      27,210       508.2      29.7      00:22:34
 17396       8   4,535      36,280       515.1      30.1      00:22:31
 17632       6   4,535      27,210       522.6      30.5      00:22:26
 17939       6   4,535      27,210       531.7      31.1      00:22:15
 18224       7   4,535      31,745       540.6      31.6      00:22:05
 18531       8   4,535      36,280       549.4      32.1      00:21:55
 18840       7   4,535      31,745       559.1      32.6      00:21:43
 19147       9   4,535      40,815       568.8      33.2      00:21:29
 19485       7   4,535      31,745       579.3      33.8      00:21:14
 19862       9   4,535      40,815       591.4      34.5      00:20:54
 20260       4   4,535      18,140       603.9      35.3      00:20:33
 20617      10   4,535      45,350       614.9      35.9      00:20:16
 20865       6   4,535      27,210       622.6      36.4      00:20:10
 21136       8   4,535      36,280       630.6      36.8      00:20:03
 21381      10   4,535      45,350       637.2      37.2      00:20:01
 21631       7   4,535      31,745       644.5      37.6      00:19:56
 21889       7   4,535      31,745       651.8      38.1      00:19:50
 22150       2   4,535       9,070       659.1      38.5      00:19:45
 22439       5   4,535      22,675       667.3      39.0      00:19:37
 22720       9   4,535      40,815       675.6      39.5      00:19:29
 22981       4   4,535      18,140       682.7      39.9      00:19:24
 23263       8   4,535      36,280       691.4      40.4      00:19:14
 23614       8   4,535      36,280       701.3      41.0      00:19:01
 23959       9   4,535      40,815       711.7      41.6      00:18:47
 24339       7   4,535      31,745       722.5      42.2      00:18:32
 24748       7   4,535      31,745       734.9      42.9      00:18:13
 25177       7   4,535      31,745       747.7      43.7      00:17:53
 25575       9   4,535      40,815       759.6      44.4      00:17:36
 25832       9   4,535      40,815       767.4      44.8      00:17:29
 26134       8   4,535      36,280       776.5      45.3      00:17:19
 26462       9   4,535      40,815       786.0      45.9      00:17:08
 26856       7   4,535      31,745       797.6      46.6      00:16:52
 27177       4   4,535      18,140       807.3      47.1      00:16:40
 27464       8   4,535      36,280       815.8      47.6      00:16:31
 27750       7   4,535      31,745       824.5      48.2      00:16:22
 28099       7   4,535      31,745       835.2      48.8      00:16:08
 28443       7   4,535      31,745       845.9      49.4      00:15:55
 28756       9   4,535      40,815       855.8      50.0      00:15:43
 28993       7   4,535      31,745       863.1      50.4      00:15:37
 29265       9   4,535      40,815       871.2      50.9      00:15:29
 29533       6   4,535      27,210       879.6      51.4      00:15:20
 29787       9   4,535      40,815       887.2      51.8      00:15:13
 30016       8   4,535      36,280       894.2      52.2      00:15:08
 30223       5   4,535      22,675       900.6      52.6      00:15:03
 30487       4   4,535      18,140       908.9      53.1      00:14:55
 30860       5   4,535      22,675       920.5      53.8      00:14:39
 31244      10   4,535      45,350       932.2      54.4      00:14:24
 31627       7   4,535      31,745       944.1      55.1      00:14:08
 32055       7   4,535      31,745       957.9      55.9      00:13:49
 32489       9   4,535      40,815       971.8      56.8      00:13:29
 32795       9   4,535      40,815       981.3      57.3      00:13:19
 33080       6   4,535      27,210       990.3      57.8      00:13:09
 33380       4   4,535      18,140       999.7      58.4      00:12:59
 33714       8   4,535      36,280     1,010.3      59.0      00:12:46
 34021      10   4,535      45,350     1,019.9      59.6      00:12:35
 34357       8   4,535      36,280     1,030.8      60.2      00:12:22
 34714      10   4,535      45,350     1,042.0      60.8      00:12:09
 35065       9   4,535      40,815     1,053.0      61.5      00:11:55
 35397       7   4,535      31,745     1,063.5      62.1      00:11:43
 35742       7   4,535      31,745     1,074.3      62.7      00:11:30
 36114       8   4,535      36,280     1,085.9      63.4      00:11:16
 36542       6   4,535      27,210     1,099.2      64.2      00:10:60
 36794       5   4,535      22,675     1,106.8      64.6      00:10:52
 37048       4   4,535      18,140     1,114.5      65.1      00:10:45
 37329       5   4,535      22,675     1,122.5      65.6      00:10:37
 37568      10   4,535      45,350     1,129.5      66.0      00:10:31
 37823       7   4,535      31,745     1,137.0      66.4      00:10:24
 38078       9   4,535      40,815     1,144.8      66.9      00:10:16
 38374       9   4,535      40,815     1,154.0      67.4      00:10:06
 38689      10   4,535      45,350     1,163.9      68.0      00:09:55
 39028       4   4,535      18,140     1,174.3      68.6      00:09:43
 39271      10   4,535      45,350     1,181.4      69.0      00:09:37
 39525      10   4,535      45,350     1,189.0      69.4      00:09:29
 39798       5   4,535      22,675     1,197.1      69.9      00:09:21
 40133       5   4,535      22,675     1,207.2      70.5      00:09:09
 40478       4   4,535      18,140     1,217.7      71.1      00:08:57
 40823      10   4,535      45,350     1,228.4      71.7      00:08:45
 41113       6   4,535      27,210     1,237.4      72.3      00:08:35
 41422       6   4,535      27,210     1,246.7      72.8      00:08:25
 41773       5   4,535      22,675     1,257.6      73.4      00:08:13
 42111       6   4,535      27,210     1,267.8      74.0      00:08:01
 42412       7   4,535      31,745     1,276.6      74.6      00:07:52
 42685       3   4,535      13,605     1,284.7      75.0      00:07:44
 42986       8   4,535      36,280     1,293.9      75.6      00:07:34
 43249       7   4,535      31,745     1,302.4      76.1      00:07:25
 43564       3   4,535      13,605     1,311.9      76.6      00:07:14
 43865       7   4,535      31,745     1,320.9      77.1      00:07:05
 44184       8   4,535      36,280     1,330.4      77.7      00:06:54
 44510       5   4,535      22,675     1,340.2      78.3      00:06:44
 44873       5   4,535      22,675     1,351.1      78.9      00:06:31
 45269       5   4,535      22,675     1,362.8      79.6      00:06:18
 45643       5   4,535      22,675     1,373.4      80.2      00:06:06
 45959       9   4,535      40,815     1,382.6      80.7      00:05:56
 46236       8   4,535      36,280     1,391.3      81.2      00:05:47
 46517       4   4,535      18,140     1,399.7      81.7      00:05:38
 46896      10   4,535      45,350     1,411.6      82.4      00:05:25
 47211       5   4,535      22,675     1,420.1      82.9      00:05:16
 47531       9   4,535      40,815     1,429.4      83.5      00:05:05
 47845       7   4,535      31,745     1,438.8      84.0      00:04:55
 48136       3   4,535      13,605     1,447.7      84.5      00:04:46
 48394       7   4,535      31,745     1,455.5      85.0      00:04:38
 48660       6   4,535      27,210     1,463.6      85.5      00:04:29
 48913       7   4,535      31,745     1,471.1      85.9      00:04:21
 49191       9   4,535      40,815     1,479.7      86.4      00:04:12
 49450       7   4,535      31,745     1,487.1      86.8      00:04:04
 49763       6   4,535      27,210     1,495.9      87.4      00:03:55
 50097       7   4,535      31,745     1,505.7      87.9      00:03:44
 50337       9   4,535      40,815     1,512.6      88.3      00:03:37
 50587       6   4,535      27,210     1,520.0      88.8      00:03:29
 50848       7   4,535      31,745     1,528.0      89.2      00:03:21
 51133       4   4,535      18,140     1,536.9      89.8      00:03:11
 51422       9   4,535      40,815     1,545.6      90.3      00:03:02
 51720       9   4,535      40,815     1,555.1      90.8      00:02:51
 52056      10   4,535      45,350     1,565.6      91.4      00:02:40
 52402       8   4,535      36,280     1,576.9      92.1      00:02:27
 52803       9   4,535      40,815     1,590.2      92.9      00:02:12
 53167       8   4,535      36,280     1,601.8      93.5      00:01:60
 53553       9   4,535      40,815     1,614.0      94.3      00:01:46
 53853       8   4,535      36,280     1,623.2      94.8      00:01:36
 54142       9   4,535      40,815     1,631.9      95.3      00:01:27
 54457       8   4,535      36,280     1,641.2      95.8      00:01:17
 54792      10   4,535      45,350     1,651.0      96.4      00:01:06
 55102       6   4,535      27,210     1,660.2      97.0      00:00:56
 55392       9   4,535      40,815     1,668.5      97.4      00:00:47
 55677       7   4,535      31,745     1,676.8      97.9      00:00:39
 55930       9   4,535      40,815     1,684.6      98.4      00:00:30
 56248       9   4,535      40,815     1,694.4      99.0      00:00:19
 56575       8   4,535      36,280     1,704.8      99.6      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1857.591
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
