
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A100.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   342       5   4,135      20,675         8.2       0.5      00:31:36
   732       7   4,135      28,945        17.9       1.1      00:28:51
  1113       9   4,135      37,215        27.7       1.8      00:27:43
  1467       9   4,135      37,215        37.4       2.4      00:27:10
  1842      10   4,135      41,350        47.4       3.0      00:26:38
  2212      10   4,135      41,350        57.2       3.7      00:26:19
  2588      10   4,135      41,350        67.0       4.3      00:26:03
  2956       6   4,135      24,810        76.8       4.9      00:25:47
  3308       7   4,135      28,945        86.6       5.6      00:25:33
  3672       9   4,135      37,215        96.6       6.2      00:25:17
  4010       7   4,135      28,945       105.3       6.8      00:25:21
  4302       5   4,135      20,675       112.7       7.2      00:25:43
  4577       8   4,135      33,080       120.2       7.7      00:26:00
  4862       5   4,135      20,675       127.9       8.2      00:26:10
  5159       6   4,135      24,810       135.9       8.7      00:26:15
  5431       9   4,135      37,215       143.3       9.2      00:26:25
  5679       4   4,135      16,540       149.3       9.6      00:26:49
  5940       5   4,135      20,675       156.2      10.0      00:27:00
  6205      10   4,135      41,350       163.3      10.5      00:27:08
  6496       6   4,135      24,810       170.8      10.9      00:27:09
  6749       6   4,135      24,810       177.4      11.4      00:27:19
  7036       6   4,135      24,810       184.9      11.9      00:27:19
  7370       7   4,135      28,945       193.8      12.4      00:27:04
  7714       6   4,135      24,810       203.0      13.0      00:26:47
  8046      10   4,135      41,350       212.6      13.6      00:26:27
  8390      10   4,135      41,350       222.4      14.3      00:26:07
  8708       7   4,135      28,945       231.2      14.8      00:25:55
  9030       9   4,135      37,215       240.3      15.4      00:25:40
  9287       6   4,135      24,810       247.7      15.9      00:25:39
  9534       7   4,135      28,945       254.7      16.3      00:25:40
  9807      10   4,135      41,350       262.5      16.8      00:25:35
 10079       9   4,135      37,215       269.7      17.3      00:25:34
 10349       6   4,135      24,810       276.5      17.7      00:25:35
 10641       6   4,135      24,810       284.1      18.2      00:25:30
 10956      10   4,135      41,350       292.7      18.8      00:25:18
 11253      10   4,135      41,350       300.6      19.3      00:25:12
 11485       8   4,135      33,080       307.0      19.7      00:25:13
 11735       9   4,135      37,215       313.5      20.1      00:25:14
 11998       8   4,135      33,080       320.7      20.6      00:25:10
 12263       8   4,135      33,080       328.0      21.0      00:25:06
 12595       9   4,135      37,215       336.9      21.6      00:24:52
 12973       9   4,135      37,215       346.7      22.2      00:24:33
 13318      10   4,135      41,350       356.1      22.8      00:24:17
 13603       9   4,135      37,215       364.5      23.4      00:24:06
 13860      10   4,135      41,350       371.4      23.8      00:24:03
 14136      10   4,135      41,350       378.8      24.3      00:23:58
 14409       9   4,135      37,215       386.5      24.8      00:23:50
 14686       5   4,135      20,675       394.1      25.3      00:23:43
 14993       6   4,135      24,810       402.6      25.8      00:23:32
 15354      10   4,135      41,350       412.8      26.5      00:23:12
 15714       5   4,135      20,675       422.5      27.1      00:22:56
 16075       6   4,135      24,810       433.0      27.8      00:22:36
 16427       7   4,135      28,945       443.1      28.4      00:22:19
 16707      10   4,135      41,350       450.7      28.9      00:22:12
 16966       8   4,135      33,080       457.9      29.4      00:22:06
 17219       5   4,135      20,675       464.8      29.8      00:22:02
 17462       9   4,135      37,215       471.9      30.2      00:21:57
 17705      10   4,135      41,350       478.7      30.7      00:21:53
 17998      10   4,135      41,350       486.6      31.2      00:21:44
 18281       9   4,135      37,215       494.6      31.7      00:21:35
 18567       8   4,135      33,080       502.2      32.2      00:21:27
 18810       6   4,135      24,810       509.2      32.6      00:21:22
 19051       7   4,135      28,945       516.2      33.1      00:21:17
 19327       4   4,135      16,540       524.0      33.6      00:21:08
 19683       8   4,135      33,080       534.3      34.2      00:20:50
 20035       7   4,135      28,945       544.6      34.9      00:20:33
 20399       7   4,135      28,945       554.8      35.6      00:20:17
 20638       8   4,135      33,080       561.5      36.0      00:20:12
 20869       7   4,135      28,945       568.0      36.4      00:20:08
 21144      10   4,135      41,350       575.4      36.9      00:20:00
 21390       1   4,135       4,135       581.6      37.3      00:19:57
 21671       6   4,135      24,810       589.0      37.8      00:19:50
 21933       7   4,135      28,945       595.7      38.2      00:19:44
 22228      10   4,135      41,350       603.3      38.7      00:19:36
 22513       8   4,135      33,080       610.7      39.1      00:19:28
 22792       9   4,135      37,215       617.7      39.6      00:19:22
 23048       9   4,135      37,215       624.7      40.0      00:19:15
 23327       7   4,135      28,945       632.3      40.5      00:19:07
 23630       5   4,135      20,675       640.0      41.0      00:18:58
 23909       4   4,135      16,540       647.8      41.5      00:18:49
 24215      10   4,135      41,350       655.8      42.0      00:18:39
 24554      10   4,135      41,350       664.8      42.6      00:18:27
 24883       7   4,135      28,945       673.8      43.2      00:18:14
 25215       8   4,135      33,080       682.9      43.8      00:18:01
 25543      10   4,135      41,350       691.9      44.3      00:17:49
 25774       7   4,135      28,945       698.3      44.8      00:17:44
 26005       6   4,135      24,810       704.6      45.2      00:17:38
 26269       8   4,135      33,080       712.0      45.6      00:17:30
 26581       6   4,135      24,810       720.2      46.2      00:17:20
 26894       6   4,135      24,810       728.6      46.7      00:17:09
 27148       5   4,135      20,675       735.6      47.1      00:17:02
 27368       8   4,135      33,080       741.5      47.5      00:16:58
 27597       7   4,135      28,945       747.8      47.9      00:16:52
 27797      10   4,135      41,350       753.5      48.3      00:16:49
 28042      10   4,135      41,350       760.3      48.7      00:16:42
 28360       7   4,135      28,945       769.2      49.3      00:16:29
 28640       3   4,135      12,405       777.3      49.8      00:16:19
 28845       2   4,135       8,270       783.2      50.2      00:16:14
 29063      10   4,135      41,350       789.3      50.6      00:16:09
 29365       7   4,135      28,945       797.6      51.1      00:15:58
 29661       8   4,135      33,080       805.7      51.6      00:15:48
 29848      10   4,135      41,350       811.0      52.0      00:15:44
 30047       8   4,135      33,080       816.6      52.3      00:15:40
 30269      10   4,135      41,350       822.8      52.7      00:15:34
 30508       9   4,135      37,215       829.7      53.2      00:15:26
 30806       9   4,135      37,215       838.1      53.7      00:15:15
 31153       7   4,135      28,945       847.7      54.3      00:15:01
 31494       6   4,135      24,810       857.5      55.0      00:14:47
 31841      10   4,135      41,350       867.5      55.6      00:14:32
 32179      10   4,135      41,350       877.4      56.2      00:14:18
 32492       8   4,135      33,080       886.5      56.8      00:14:05
 32704       9   4,135      37,215       892.5      57.2      00:13:60
 32924      10   4,135      41,350       898.8      57.6      00:13:53
 33148       6   4,135      24,810       905.3      58.0      00:13:46
 33439       6   4,135      24,810       913.5      58.5      00:13:36
 33711       9   4,135      37,215       921.5      59.1      00:13:26
 33995       3   4,135      12,405       929.6      59.6      00:13:15
 34280       7   4,135      28,945       938.1      60.1      00:13:04
 34619       8   4,135      33,080       947.7      60.7      00:12:51
 34952       4   4,135      16,540       957.4      61.4      00:12:37
 35307       7   4,135      28,945       967.6      62.0      00:12:23
 35652       8   4,135      33,080       977.4      62.6      00:12:09
 35971      10   4,135      41,350       986.4      63.2      00:11:57
 36314       4   4,135      16,540       996.3      63.9      00:11:43
 36592       8   4,135      33,080     1,004.1      64.4      00:11:34
 36823       9   4,135      37,215     1,010.4      64.8      00:11:27
 37065       9   4,135      37,215     1,017.1      65.2      00:11:20
 37315       7   4,135      28,945     1,023.4      65.6      00:11:13
 37555       5   4,135      20,675     1,029.9      66.0      00:11:06
 37796       6   4,135      24,810     1,036.3      66.4      00:10:59
 38028       9   4,135      37,215     1,042.8      66.8      00:10:51
 38278      10   4,135      41,350     1,049.9      67.3      00:10:43
 38540       7   4,135      28,945     1,057.4      67.8      00:10:34
 38884       5   4,135      20,675     1,067.0      68.4      00:10:21
 39122       9   4,135      37,215     1,073.6      68.8      00:10:13
 39384       9   4,135      37,215     1,080.6      69.3      00:10:05
 39659       8   4,135      33,080     1,088.1      69.7      00:09:56
 39969       7   4,135      28,945     1,096.7      70.3      00:09:45
 40345      10   4,135      41,350     1,106.8      70.9      00:09:31
 40692       9   4,135      37,215     1,116.7      71.6      00:09:17
 40995       9   4,135      37,215     1,125.4      72.1      00:09:06
 41207       7   4,135      28,945     1,131.3      72.5      00:08:60
 41465       7   4,135      28,945     1,138.4      73.0      00:08:51
 41751      10   4,135      41,350     1,146.4      73.5      00:08:41
 41987       6   4,135      24,810     1,153.0      73.9      00:08:33
 42251       6   4,135      24,810     1,159.8      74.3      00:08:25
 42503       6   4,135      24,810     1,166.9      74.8      00:08:16
 42748       8   4,135      33,080     1,173.5      75.2      00:08:09
 42986       8   4,135      33,080     1,180.2      75.6      00:08:01
 43181      10   4,135      41,350     1,186.0      76.0      00:07:54
 43400       5   4,135      20,675     1,192.2      76.4      00:07:47
 43728      10   4,135      41,350     1,200.9      77.0      00:07:36
 44064       4   4,135      16,540     1,210.3      77.6      00:07:23
 44250       8   4,135      33,080     1,215.3      77.9      00:07:18
 44479      10   4,135      41,350     1,221.4      78.3      00:07:11
 44753       7   4,135      28,945     1,228.9      78.8      00:07:01
 45036      10   4,135      41,350     1,236.8      79.3      00:06:51
 45336       5   4,135      20,675     1,244.4      79.8      00:06:42
 45565       9   4,135      37,215     1,250.5      80.1      00:06:35
 45843       5   4,135      20,675     1,257.7      80.6      00:06:26
 46115       8   4,135      33,080     1,265.4      81.1      00:06:16
 46374       6   4,135      24,810     1,272.7      81.6      00:06:07
 46655       5   4,135      20,675     1,280.5      82.1      00:05:57
 46938       3   4,135      12,405     1,288.2      82.6      00:05:47
 47181       9   4,135      37,215     1,294.3      83.0      00:05:40
 47437       6   4,135      24,810     1,301.1      83.4      00:05:31
 47678       6   4,135      24,810     1,307.7      83.8      00:05:23
 47906      10   4,135      41,350     1,313.9      84.2      00:05:16
 48132       7   4,135      28,945     1,320.0      84.6      00:05:08
 48362       9   4,135      37,215     1,326.5      85.0      00:05:00
 48631       5   4,135      20,675     1,333.9      85.5      00:04:51
 48881       8   4,135      33,080     1,340.7      85.9      00:04:42
 49108       9   4,135      37,215     1,347.0      86.3      00:04:34
 49316       7   4,135      28,945     1,352.7      86.7      00:04:27
 49549       5   4,135      20,675     1,358.7      87.1      00:04:20
 49797       7   4,135      28,945     1,365.1      87.5      00:04:12
 50034       7   4,135      28,945     1,371.6      87.9      00:04:04
 50285       4   4,135      16,540     1,378.1      88.3      00:03:56
 50532       9   4,135      37,215     1,384.7      88.8      00:03:47
 50768       7   4,135      28,945     1,391.4      89.2      00:03:39
 50993       9   4,135      37,215     1,397.9      89.6      00:03:31
 51252       7   4,135      28,945     1,405.0      90.0      00:03:22
 51503       7   4,135      28,945     1,412.0      90.5      00:03:13
 51743       5   4,135      20,675     1,419.0      91.0      00:03:03
 52003      10   4,135      41,350     1,426.4      91.4      00:02:54
 52304       9   4,135      37,215     1,435.4      92.0      00:02:42
 52591      10   4,135      41,350     1,444.1      92.6      00:02:31
 52886       7   4,135      28,945     1,452.9      93.1      00:02:19
 53185      10   4,135      41,350     1,461.5      93.7      00:02:08
 53483       6   4,135      24,810     1,470.0      94.2      00:01:57
 53740       8   4,135      33,080     1,477.3      94.7      00:01:47
 53989       8   4,135      33,080     1,484.1      95.1      00:01:39
 54226       7   4,135      28,945     1,490.7      95.5      00:01:30
 54457       9   4,135      37,215     1,496.7      95.9      00:01:23
 54743       3   4,135      12,405     1,504.4      96.4      00:01:13
 55016       6   4,135      24,810     1,511.7      96.9      00:01:03
 55268       8   4,135      33,080     1,518.5      97.3      00:00:54
 55523       3   4,135      12,405     1,525.0      97.7      00:00:46
 55768       8   4,135      33,080     1,531.8      98.2      00:00:37
 56006       2   4,135       8,270     1,538.5      98.6      00:00:28
 56263       8   4,135      33,080     1,545.8      99.1      00:00:19
 56525       8   4,135      33,080     1,553.4      99.6      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 2039.375
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A100.csv saved

. 
. cap log close

. 
end of do-file
