
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_Do
> llar_locations_total_fixR400.dta /export/storage_covidvaccine/Result/MaxVaxDi
> stLogLin/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR4
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   3 Nov 2023, 20:39:43

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capc
> oef/Dollar/vaccinated/ca_Dollar_locations_total_fixR400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capco
> ef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   528       8   4,035      32,280        12.3       0.8      00:20:31
  1076       9   4,035      36,315        26.0       1.7      00:19:15
  1594       5   4,035      20,175        39.7       2.6      00:18:42
  2135       9   4,035      36,315        53.6       3.5      00:18:19
  2698      10   4,035      40,350        68.0       4.5      00:17:52
  3251       9   4,035      36,315        82.8       5.4      00:17:26
  3821       7   4,035      28,245        98.1       6.4      00:16:59
  4336      10   4,035      40,350       110.8       7.3      00:17:02
  4793       6   4,035      24,210       123.0       8.1      00:17:07
  5261       6   4,035      24,210       135.0       8.9      00:17:10
  5664       6   4,035      24,210       145.1       9.5      00:17:26
  6027       9   4,035      36,315       154.5      10.1      00:17:45
  6402       8   4,035      32,280       164.1      10.8      00:17:59
  6777       6   4,035      24,210       173.6      11.4      00:18:10
  7277       5   4,035      20,175       186.4      12.2      00:17:58
  7789       6   4,035      24,210       200.0      13.1      00:17:40
  8298       9   4,035      36,315       214.1      14.1      00:17:21
  8809       4   4,035      16,140       228.2      15.0      00:17:03
  9278       7   4,035      28,245       241.2      15.8      00:16:51
  9642       5   4,035      20,175       251.4      16.5      00:16:53
 10026       7   4,035      28,245       261.7      17.2      00:16:54
 10472       5   4,035      20,175       272.9      17.9      00:16:50
 10940       4   4,035      16,140       285.0      18.7      00:16:41
 11371       9   4,035      36,315       296.3      19.4      00:16:35
 11816       6   4,035      24,210       308.0      20.2      00:16:28
 12305       6   4,035      24,210       321.0      21.1      00:16:15
 12924       6   4,035      24,210       336.9      22.1      00:15:52
 13513       9   4,035      36,315       352.9      23.2      00:15:30
 13901       9   4,035      36,315       363.3      23.8      00:15:27
 14412       8   4,035      32,280       377.0      24.7      00:15:13
 14964       9   4,035      36,315       391.8      25.7      00:14:56
 15547       1   4,035       4,035       407.7      26.8      00:14:37
 16109       9   4,035      36,315       423.3      27.8      00:14:19
 16640       6   4,035      24,210       437.8      28.7      00:14:04
 17061       9   4,035      36,315       449.2      29.5      00:13:58
 17505      10   4,035      40,350       461.5      30.3      00:13:49
 18041       7   4,035      28,245       475.8      31.2      00:13:36
 18428       2   4,035       8,070       486.2      31.9      00:13:32
 18829       6   4,035      24,210       497.1      32.6      00:13:26
 19313       9   4,035      36,315       510.7      33.5      00:13:14
 19866       9   4,035      36,315       526.3      34.5      00:12:58
 20447       5   4,035      20,175       542.4      35.6      00:12:41
 20843       9   4,035      36,315       553.3      36.3      00:12:35
 21283       9   4,035      36,315       564.6      37.1      00:12:28
 21691       8   4,035      32,280       575.1      37.7      00:12:23
 22131       8   4,035      32,280       585.9      38.5      00:12:17
 22549       5   4,035      20,175       596.6      39.2      00:12:11
 22967       8   4,035      32,280       607.1      39.8      00:12:06
 23351       8   4,035      32,280       617.5      40.5      00:11:60
 23761       5   4,035      20,175       627.9      41.2      00:11:54
 24262       9   4,035      36,315       641.0      42.1      00:11:43
 24861      10   4,035      40,350       656.8      43.1      00:11:27
 25457       6   4,035      24,210       672.7      44.2      00:11:11
 25852      10   4,035      40,350       683.3      44.8      00:11:05
 26328      10   4,035      40,350       696.1      45.7      00:10:55
 26865       8   4,035      32,280       709.8      46.6      00:10:43
 27312       4   4,035      16,140       721.8      47.4      00:10:34
 27709       6   4,035      24,210       732.5      48.1      00:10:27
 28198       8   4,035      32,280       745.8      49.0      00:10:16
 28696       9   4,035      36,315       759.7      49.9      00:10:04
 29098       5   4,035      20,175       770.9      50.6      00:09:56
 29600       8   4,035      32,280       784.3      51.5      00:09:45
 30073       6   4,035      24,210       797.2      52.3      00:09:35
 30513       6   4,035      24,210       809.4      53.1      00:09:25
 31014       5   4,035      20,175       823.1      54.0      00:09:14
 31573       5   4,035      20,175       838.6      55.0      00:08:60
 32131       8   4,035      32,280       854.4      56.1      00:08:45
 32638       3   4,035      12,105       868.7      57.0      00:08:33
 33029       5   4,035      20,175       879.7      57.7      00:08:26
 33481      10   4,035      40,350       892.2      58.6      00:08:16
 33970      10   4,035      40,350       906.1      59.5      00:08:04
 34500       9   4,035      36,315       921.1      60.5      00:07:51
 35071       6   4,035      24,210       937.1      61.5      00:07:37
 35658       9   4,035      36,315       953.6      62.6      00:07:23
 36235       5   4,035      20,175       969.6      63.6      00:07:09
 36750      10   4,035      40,350       983.7      64.6      00:06:58
 37196       8   4,035      32,280       995.4      65.3      00:06:49
 37591       6   4,035      24,210     1,005.7      66.0      00:06:42
 37982       2   4,035       8,070     1,015.9      66.7      00:06:35
 38351      10   4,035      40,350     1,026.1      67.4      00:06:28
 38709       8   4,035      32,280     1,036.1      68.0      00:06:22
 39075       6   4,035      24,210     1,046.1      68.7      00:06:15
 39494       8   4,035      32,280     1,057.0      69.4      00:06:07
 39958       9   4,035      36,315     1,069.5      70.2      00:05:57
 40537      10   4,035      40,350     1,085.1      71.2      00:05:44
 41044      10   4,035      40,350     1,099.2      72.1      00:05:32
 41457       6   4,035      24,210     1,110.3      72.9      00:05:24
 41875       4   4,035      16,140     1,121.8      73.6      00:05:16
 42308       8   4,035      32,280     1,133.0      74.4      00:05:07
 42713       9   4,035      36,315     1,143.9      75.1      00:04:59
 43091       8   4,035      32,280     1,154.2      75.8      00:04:52
 43428       9   4,035      36,315     1,163.8      76.4      00:04:45
 43820       6   4,035      24,210     1,174.0      77.1      00:04:37
 44218      10   4,035      40,350     1,184.8      77.8      00:04:29
 44686       7   4,035      28,245     1,197.1      78.6      00:04:19
 45136       3   4,035      12,105     1,209.2      79.4      00:04:10
 45612       7   4,035      28,245     1,221.2      80.2      00:04:00
 46054       7   4,035      28,245     1,232.9      80.9      00:03:51
 46490       6   4,035      24,210     1,244.7      81.7      00:03:42
 46973       7   4,035      28,245     1,257.8      82.6      00:03:32
 47341      10   4,035      40,350     1,267.0      83.2      00:03:25
 47782      10   4,035      40,350     1,278.6      83.9      00:03:16
 48283       9   4,035      36,315     1,291.9      84.8      00:03:05
 48771       9   4,035      36,315     1,305.2      85.7      00:02:54
 49344       8   4,035      32,280     1,320.6      86.7      00:02:42
 49757       9   4,035      36,315     1,330.8      87.3      00:02:34
 50156       8   4,035      32,280     1,341.3      88.0      00:02:26
 50597       8   4,035      32,280     1,352.7      88.8      00:02:17
 51023       9   4,035      36,315     1,364.5      89.6      00:02:07
 51469       9   4,035      36,315     1,376.5      90.3      00:01:58
 51911       8   4,035      32,280     1,388.9      91.2      00:01:48
 52341       6   4,035      24,210     1,401.2      92.0      00:01:38
 52761       5   4,035      20,175     1,413.7      92.8      00:01:28
 53197       8   4,035      32,280     1,426.0      93.6      00:01:18
 53729       8   4,035      32,280     1,440.9      94.6      00:01:06
 54142       9   4,035      36,315     1,452.0      95.3      00:00:57
 54582       5   4,035      20,175     1,463.2      96.0      00:00:48
 55030       8   4,035      32,280     1,475.2      96.8      00:00:39
 55459       5   4,035      20,175     1,486.2      97.5      00:00:30
 55870       8   4,035      32,280     1,497.2      98.3      00:00:21
 56285       7   4,035      28,245     1,508.6      99.0      00:00:12
 56733       9   4,035      36,315     1,521.2      99.8      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1227.814
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv saved

. 
. cap log close

. 
end of do-file
