
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar//vaccinated/ca_Dollar_loc
> ations_total_8000_5_4q_mnl_A500.dta /export/storage_covidvaccine/Result/MNL_p
> artial_new/M5_K8000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_8000_5_4q_
> mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dolla
> r//vaccinated/ca_Dollar_locations_total_8000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar
> //vaccinated/ca_blk_Dollar_dist_total_8000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   380       6   4,535      27,210        10.0       0.6      00:28:25
   747       6   4,535      27,210        20.0       1.2      00:28:12
  1127      10   4,535      45,350        30.8       1.8      00:27:19
  1482       8   4,535      36,280        41.5       2.4      00:26:53
  1897       5   4,535      22,675        53.4       3.1      00:25:55
  2305       8   4,535      36,280        65.4       3.8      00:25:13
  2722      10   4,535      45,350        77.4       4.5      00:24:39
  3128       9   4,535      40,815        89.4       5.2      00:24:13
  3531       6   4,535      27,210       101.7       5.9      00:23:46
  3931      10   4,535      45,350       113.4       6.6      00:23:32
  4206       5   4,535      22,675       121.2       7.1      00:24:05
  4473       6   4,535      27,210       128.6       7.5      00:24:39
  4750      10   4,535      45,350       137.1       8.0      00:24:56
  5031      10   4,535      45,350       145.4       8.5      00:25:12
  5282       5   4,535      22,675       152.6       8.9      00:25:36
  5578       7   4,535      31,745       160.9       9.4      00:25:45
  5902      10   4,535      45,350       170.2       9.9      00:25:43
  6261       7   4,535      31,745       180.8      10.6      00:25:28
  6564       4   4,535      18,140       189.3      11.1      00:25:31
  6900       9   4,535      40,815       199.0      11.6      00:25:23
  7291       9   4,535      40,815       210.1      12.3      00:25:03
  7710       9   4,535      40,815       222.6      13.0      00:24:34
  8051       5   4,535      22,675       233.2      13.6      00:24:20
  8389       8   4,535      36,280       243.8      14.2      00:24:07
  8723       9   4,535      40,815       254.1      14.8      00:23:57
  9049       9   4,535      40,815       264.1      15.4      00:23:47
  9351      10   4,535      45,350       273.5      16.0      00:23:42
  9679       7   4,535      31,745       284.0      16.6      00:23:30
 10019       5   4,535      22,675       294.1      17.2      00:23:20
 10346       6   4,535      27,210       303.1      17.7      00:23:16
 10702       1   4,535       4,535       313.5      18.3      00:23:04
 11076       7   4,535      31,745       324.5      19.0      00:22:50
 11350       9   4,535      40,815       332.6      19.4      00:22:50
 11635       7   4,535      31,745       341.0      19.9      00:22:49
 11923       4   4,535      18,140       349.5      20.4      00:22:46
 12227       6   4,535      27,210       358.7      21.0      00:22:40
 12632      10   4,535      45,350       370.6      21.7      00:22:21
 13083       8   4,535      36,280       383.6      22.4      00:21:57
 13538       4   4,535      18,140       397.6      23.2      00:21:31
 13866       3   4,535      13,605       407.5      23.8      00:21:22
 14164       9   4,535      40,815       416.3      24.3      00:21:17
 14463       9   4,535      40,815       425.6      24.9      00:21:11
 14769       6   4,535      27,210       434.7      25.4      00:21:05
 15133       6   4,535      27,210       445.9      26.1      00:20:50
 15562       5   4,535      22,675       458.8      26.8      00:20:30
 16003       9   4,535      40,815       472.5      27.6      00:20:08
 16450       7   4,535      31,745       486.7      28.4      00:19:44
 16805       4   4,535      18,140       497.3      29.1      00:19:34
 17119       9   4,535      40,815       506.8      29.6      00:19:26
 17420      10   4,535      45,350       516.1      30.2      00:19:20
 17671       9   4,535      40,815       524.1      30.6      00:19:17
 17995       3   4,535      13,605       533.6      31.2      00:19:09
 18285       9   4,535      40,815       542.6      31.7      00:19:03
 18591       6   4,535      27,210       551.6      32.2      00:18:57
 18861       8   4,535      36,280       560.0      32.7      00:18:53
 19162       7   4,535      31,745       569.6      33.3      00:18:44
 19502       6   4,535      27,210       580.2      33.9      00:18:33
 19883       9   4,535      40,815       592.3      34.6      00:18:17
 20279      10   4,535      45,350       604.7      35.3      00:18:01
 20635       7   4,535      31,745       615.8      36.0      00:17:49
 21002      10   4,535      45,350       627.0      36.6      00:17:36
 21404      10   4,535      45,350       638.2      37.3      00:17:24
 21764       8   4,535      36,280       648.4      37.9      00:17:14
 22145       8   4,535      36,280       659.3      38.5      00:17:03
 22555       6   4,535      27,210       671.0      39.2      00:16:49
 22893       6   4,535      27,210       680.3      39.8      00:16:42
 23217       6   4,535      27,210       690.2      40.3      00:16:33
 23562       5   4,535      22,675       700.0      40.9      00:16:24
 23902      10   4,535      45,350       710.3      41.5      00:16:14
 24280       7   4,535      31,745       721.0      42.1      00:16:03
 24670      10   4,535      45,350       732.8      42.8      00:15:50
 25103       5   4,535      22,675       745.6      43.6      00:15:34
 25535      10   4,535      45,350       758.7      44.3      00:15:18
 25899       4   4,535      18,140       769.7      45.0      00:15:07
 26272       8   4,535      36,280       781.0      45.6      00:14:55
 26677       5   4,535      22,675       792.5      46.3      00:14:42
 27095      10   4,535      45,350       805.1      47.1      00:14:28
 27445       8   4,535      36,280       815.6      47.7      00:14:18
 27826      10   4,535      45,350       827.3      48.3      00:14:06
 28293       6   4,535      27,210       841.6      49.2      00:13:48
 28716       9   4,535      40,815       855.0      50.0      00:13:33
 29027      10   4,535      45,350       864.6      50.5      00:13:24
 29347       9   4,535      40,815       874.3      51.1      00:13:16
 29703       8   4,535      36,280       885.0      51.7      00:13:06
 29977       5   4,535      22,675       893.3      52.2      00:12:60
 30267       6   4,535      27,210       902.3      52.7      00:12:52
 30653       6   4,535      27,210       914.3      53.4      00:12:40
 31047       7   4,535      31,745       926.3      54.1      00:12:27
 31421       7   4,535      31,745       938.1      54.8      00:12:15
 31856       7   4,535      31,745       951.9      55.6      00:11:59
 32306      10   4,535      45,350       966.3      56.5      00:11:43
 32589      10   4,535      45,350       975.3      57.0      00:11:35
 32899       9   4,535      40,815       984.9      57.6      00:11:27
 33205      10   4,535      45,350       994.6      58.1      00:11:18
 33559       8   4,535      36,280     1,005.8      58.8      00:11:07
 33955       7   4,535      31,745     1,018.3      59.5      00:10:54
 34374       5   4,535      22,675     1,031.7      60.3      00:10:40
 34795       7   4,535      31,745     1,045.1      61.1      00:10:26
 35240      10   4,535      45,350     1,059.1      61.9      00:10:11
 35721       6   4,535      27,210     1,074.0      62.8      00:09:54
 36125       7   4,535      31,745     1,086.8      63.5      00:09:41
 36542      10   4,535      45,350     1,099.7      64.3      00:09:28
 36800       9   4,535      40,815     1,107.4      64.7      00:09:22
 37092       6   4,535      27,210     1,116.2      65.2      00:09:15
 37386       5   4,535      22,675     1,124.6      65.7      00:09:09
 37653       4   4,535      18,140     1,132.4      66.2      00:09:03
 37914       5   4,535      22,675     1,140.2      66.6      00:08:57
 38191       8   4,535      36,280     1,148.8      67.1      00:08:50
 38433       7   4,535      31,745     1,156.4      67.6      00:08:44
 38832       9   4,535      40,815     1,168.6      68.3      00:08:32
 39184       6   4,535      27,210     1,179.2      68.9      00:08:22
 39476       8   4,535      36,280     1,187.8      69.4      00:08:14
 39747       9   4,535      40,815     1,195.9      69.9      00:08:08
 40110       8   4,535      36,280     1,206.9      70.5      00:07:57
 40503       7   4,535      31,745     1,218.9      71.2      00:07:45
 40869       9   4,535      40,815     1,230.2      71.9      00:07:34
 41165       5   4,535      22,675     1,239.4      72.4      00:07:26
 41539       8   4,535      36,280     1,250.8      73.1      00:07:15
 41895       6   4,535      27,210     1,261.9      73.7      00:07:04
 42232      10   4,535      45,350     1,271.6      74.3      00:06:56
 42589       5   4,535      22,675     1,282.2      74.9      00:06:45
 42942       4   4,535      18,140     1,292.9      75.6      00:06:35
 43278       7   4,535      31,745     1,303.7      76.2      00:06:25
 43638       6   4,535      27,210     1,314.4      76.8      00:06:15
 44016       9   4,535      40,815     1,325.8      77.5      00:06:04
 44441       3   4,535      13,605     1,338.3      78.2      00:05:52
 44855       7   4,535      31,745     1,351.0      79.0      00:05:39
 45270       5   4,535      22,675     1,363.1      79.7      00:05:27
 45613       3   4,535      13,605     1,372.8      80.2      00:05:19
 45965       9   4,535      40,815     1,383.2      80.8      00:05:09
 46309       9   4,535      40,815     1,393.9      81.5      00:04:59
 46728       5   4,535      22,675     1,406.6      82.2      00:04:46
 47133       7   4,535      31,745     1,418.2      82.9      00:04:35
 47477       8   4,535      36,280     1,428.1      83.5      00:04:26
 47776       8   4,535      36,280     1,437.0      84.0      00:04:18
 48089      10   4,535      45,350     1,446.5      84.5      00:04:09
 48364       9   4,535      40,815     1,454.9      85.0      00:04:02
 48650       5   4,535      22,675     1,463.5      85.5      00:03:54
 48994       9   4,535      40,815     1,473.7      86.1      00:03:44
 49366       3   4,535      13,605     1,484.9      86.8      00:03:34
 49664       9   4,535      40,815     1,493.3      87.3      00:03:26
 49932       8   4,535      36,280     1,501.1      87.7      00:03:19
 50172       2   4,535       9,070     1,508.2      88.1      00:03:13
 50453       8   4,535      36,280     1,516.2      88.6      00:03:05
 50757       5   4,535      22,675     1,525.6      89.2      00:02:57
 51052       4   4,535      18,140     1,535.0      89.7      00:02:48
 51369       9   4,535      40,815     1,544.4      90.3      00:02:39
 51665       7   4,535      31,745     1,553.8      90.8      00:02:30
 51979       9   4,535      40,815     1,563.6      91.4      00:02:21
 52303       9   4,535      40,815     1,574.2      92.0      00:02:11
 52738       9   4,535      40,815     1,588.6      92.8      00:01:57
 53190       9   4,535      40,815     1,603.0      93.7      00:01:43
 53644       3   4,535      13,605     1,617.2      94.5      00:01:29
 53979      10   4,535      45,350     1,627.4      95.1      00:01:19
 54283       9   4,535      40,815     1,636.6      95.6      00:01:11
 54652       5   4,535      22,675     1,647.1      96.3      00:01:01
 55005       8   4,535      36,280     1,657.6      96.9      00:00:51
 55199       3   4,535      13,605     1,663.4      97.2      00:00:45
 55490       9   4,535      40,815     1,671.6      97.7      00:00:38
 55800       5   4,535      22,675     1,680.9      98.2      00:00:29
 56150       8   4,535      36,280     1,691.8      98.9      00:00:18
 56504       8   4,535      36,280     1,703.0      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 1636.943
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar//va
> ccinated/ca_blk_Dollar_dist_total_8000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
