
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A500_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   300       6   4,535      27,210         7.8       0.5      00:36:24
   605       6   4,535      27,210        16.0       0.9      00:35:19
   905       8   4,535      36,280        24.3       1.4      00:34:49
  1164       8   4,535      36,280        31.9       1.9      00:35:09
  1432       8   4,535      36,280        40.0       2.3      00:34:54
  1698       7   4,535      31,745        48.0       2.8      00:34:45
  2000       7   4,535      31,745        56.4       3.3      00:34:17
  2295      10   4,535      45,350        65.2       3.8      00:33:46
  2593       7   4,535      31,745        73.6       4.3      00:33:28
  2890       6   4,535      27,210        82.5       4.8      00:33:00
  3183       6   4,535      27,210        91.1       5.3      00:32:40
  3486       3   4,535      13,605       100.4       5.9      00:32:10
  3783       5   4,535      22,675       109.3       6.4      00:31:50
  4026       5   4,535      22,675       116.0       6.8      00:32:09
  4243       7   4,535      31,745       122.2       7.1      00:32:35
  4470       8   4,535      36,280       128.6       7.5      00:32:54
  4684       6   4,535      27,210       135.1       7.9      00:33:07
  4914       8   4,535      36,280       141.9       8.3      00:33:15
  5153       7   4,535      31,745       148.9       8.7      00:33:18
  5379      10   4,535      45,350       155.7       9.1      00:33:22
  5594       6   4,535      27,210       161.3       9.4      00:33:42
  5785       8   4,535      36,280       166.7       9.7      00:34:02
  5997       9   4,535      40,815       173.0      10.1      00:34:09
  6229       7   4,535      31,745       179.8      10.5      00:34:08
  6457       9   4,535      40,815       186.3      10.9      00:34:11
  6665       6   4,535      27,210       192.1      11.2      00:34:20
  6899      10   4,535      45,350       199.0      11.6      00:34:16
  7177       9   4,535      40,815       206.7      12.1      00:34:02
  7474       8   4,535      36,280       215.7      12.6      00:33:35
  7771       6   4,535      27,210       224.4      13.1      00:33:12
  8031      10   4,535      45,350       232.7      13.6      00:32:54
  8295       8   4,535      36,280       240.8      14.1      00:32:38
  8550       8   4,535      36,280       248.9      14.5      00:32:23
  8810       6   4,535      27,210       256.7      15.0      00:32:10
  9059       7   4,535      31,745       264.4      15.5      00:31:59
  9245       4   4,535      18,140       270.3      15.8      00:32:03
  9402       7   4,535      31,745       275.1      16.1      00:32:16
  9631       9   4,535      40,815       282.4      16.5      00:32:06
  9860       9   4,535      40,815       289.4      16.9      00:32:00
 10089       8   4,535      36,280       296.0      17.3      00:31:57
 10315       9   4,535      40,815       302.1      17.7      00:31:56
 10515       9   4,535      40,815       308.1      18.0      00:31:57
 10774       6   4,535      27,210       315.6      18.4      00:31:46
 11013       7   4,535      31,745       322.7      18.9      00:31:38
 11257      10   4,535      45,350       329.8      19.3      00:31:29
 11448       6   4,535      27,210       335.5      19.6      00:31:30
 11670       7   4,535      31,745       342.0      20.0      00:31:26
 11898       7   4,535      31,745       348.8      20.4      00:31:19
 12112       9   4,535      40,815       355.3      20.8      00:31:14
 12347       1   4,535       4,535       362.2      21.2      00:31:06
 12642       5   4,535      22,675       370.9      21.7      00:30:47
 12943       6   4,535      27,210       379.3      22.2      00:30:30
 13232       4   4,535      18,140       388.0      22.7      00:30:11
 13523       7   4,535      31,745       397.2      23.2      00:29:50
 13731       9   4,535      40,815       403.5      23.6      00:29:46
 13964       4   4,535      18,140       410.3      24.0      00:29:39
 14203      10   4,535      45,350       417.6      24.4      00:29:30
 14468       7   4,535      31,745       425.8      24.9      00:29:15
 14706       7   4,535      31,745       432.8      25.3      00:29:06
 14971       8   4,535      36,280       440.9      25.8      00:28:52
 15278       7   4,535      31,745       450.4      26.3      00:28:31
 15592       6   4,535      27,210       459.8      26.9      00:28:11
 15873      10   4,535      45,350       468.4      27.4      00:27:55
 16156       7   4,535      31,745       477.4      27.9      00:27:37
 16438       5   4,535      22,675       486.3      28.4      00:27:20
 16675       8   4,535      36,280       493.4      28.8      00:27:12
 16896       9   4,535      40,815       500.0      29.2      00:27:06
 17072      10   4,535      45,350       505.4      29.5      00:27:06
 17273       5   4,535      22,675       511.5      29.9      00:27:02
 17484       8   4,535      36,280       518.3      30.3      00:26:55
 17702       5   4,535      22,675       524.9      30.7      00:26:48
 17981       9   4,535      40,815       533.2      31.2      00:26:34
 18284       5   4,535      22,675       542.6      31.7      00:26:16
 18555       8   4,535      36,280       550.5      32.2      00:26:04
 18763       8   4,535      36,280       557.1      32.6      00:25:57
 18971       9   4,535      40,815       563.6      32.9      00:25:51
 19194       8   4,535      36,280       570.6      33.3      00:25:43
 19463       7   4,535      31,745       578.9      33.8      00:25:29
 19745       6   4,535      27,210       588.0      34.4      00:25:13
 20042      10   4,535      45,350       597.6      34.9      00:24:55
 20352      10   4,535      45,350       606.9      35.5      00:24:38
 20573       1   4,535       4,535       613.8      35.9      00:24:30
 20756       8   4,535      36,280       619.5      36.2      00:24:26
 20943       3   4,535      13,605       625.3      36.5      00:24:22
 21160       1   4,535       4,535       631.5      36.9      00:24:17
 21379      10   4,535      45,350       637.5      37.3      00:24:12
 21602      10   4,535      45,350       644.0      37.6      00:24:06
 21822       8   4,535      36,280       650.1      38.0      00:23:60
 22031       7   4,535      31,745       656.3      38.4      00:23:54
 22273       9   4,535      40,815       662.9      38.7      00:23:47
 22514       6   4,535      27,210       669.8      39.1      00:23:38
 22735       8   4,535      36,280       676.0      39.5      00:23:33
 23034       7   4,535      31,745       684.7      40.0      00:23:18
 23328      10   4,535      45,350       693.5      40.5      00:23:03
 23607       8   4,535      36,280       701.3      41.0      00:22:52
 23894       7   4,535      31,745       710.1      41.5      00:22:37
 24194       6   4,535      27,210       718.6      42.0      00:22:23
 24479       8   4,535      36,280       726.8      42.5      00:22:11
 24771       6   4,535      27,210       735.6      43.0      00:21:56
 25047       6   4,535      27,210       743.9      43.5      00:21:44
 25323       7   4,535      31,745       752.3      44.0      00:21:31
 25579       5   4,535      22,675       759.8      44.4      00:21:20
 25765       6   4,535      27,210       765.6      44.7      00:21:15
 25978       7   4,535      31,745       771.9      45.1      00:21:09
 26142      10   4,535      45,350       776.9      45.4      00:21:06
 26422       9   4,535      40,815       785.2      45.9      00:20:53
 26687      10   4,535      45,350       792.9      46.3      00:20:42
 26946      10   4,535      45,350       800.8      46.8      00:20:31
 27179       7   4,535      31,745       807.7      47.2      00:20:22
 27410      10   4,535      45,350       814.5      47.6      00:20:14
 27646       9   4,535      40,815       821.7      48.0      00:20:05
 27890       7   4,535      31,745       829.3      48.5      00:19:54
 28210       6   4,535      27,210       838.9      49.0      00:19:38
 28497       9   4,535      40,815       848.1      49.6      00:19:23
 28699      10   4,535      45,350       854.4      49.9      00:19:16
 28885       6   4,535      27,210       860.2      50.3      00:19:11
 29106       7   4,535      31,745       867.0      50.7      00:19:02
 29362       9   4,535      40,815       874.7      51.1      00:18:51
 29636       7   4,535      31,745       882.8      51.6      00:18:40
 29837       6   4,535      27,210       889.1      52.0      00:18:32
 30030       6   4,535      27,210       895.1      52.3      00:18:26
 30231       8   4,535      36,280       901.2      52.7      00:18:19
 30446       8   4,535      36,280       908.0      53.1      00:18:11
 30707       8   4,535      36,280       915.9      53.5      00:17:59
 31031       8   4,535      36,280       925.8      54.1      00:17:43
 31340       8   4,535      36,280       935.5      54.7      00:17:27
 31655       6   4,535      27,210       945.4      55.2      00:17:11
 31949       4   4,535      18,140       954.9      55.8      00:16:56
 32241       8   4,535      36,280       964.3      56.4      00:16:42
 32511       8   4,535      36,280       972.9      56.9      00:16:29
 32696       6   4,535      27,210       978.5      57.2      00:16:23
 32904       9   4,535      40,815       985.1      57.6      00:16:15
 33102      10   4,535      45,350       991.5      57.9      00:16:08
 33333       8   4,535      36,280       998.6      58.4      00:15:58
 33572       8   4,535      36,280     1,006.2      58.8      00:15:48
 33827       9   4,535      40,815     1,014.3      59.3      00:15:37
 34077       8   4,535      36,280     1,022.2      59.7      00:15:26
 34347       9   4,535      40,815     1,030.9      60.2      00:15:13
 34650       9   4,535      40,815     1,040.3      60.8      00:14:59
 34933       9   4,535      40,815     1,049.4      61.3      00:14:45
 35240      10   4,535      45,350     1,059.1      61.9      00:14:30
 35549       6   4,535      27,210     1,068.7      62.5      00:14:16
 35864       7   4,535      31,745     1,078.5      63.0      00:14:01
 36183      10   4,535      45,350     1,088.5      63.6      00:13:46
 36489       6   4,535      27,210     1,098.0      64.2      00:13:32
 36715       5   4,535      22,675     1,104.9      64.6      00:13:23
 36925       9   4,535      40,815     1,111.4      64.9      00:13:15
 37168      10   4,535      45,350     1,118.3      65.4      00:13:07
 37385       8   4,535      36,280     1,124.6      65.7      00:12:59
 37600       8   4,535      36,280     1,130.9      66.1      00:12:52
 37827      10   4,535      45,350     1,137.5      66.5      00:12:43
 38024       5   4,535      22,675     1,143.6      66.8      00:12:36
 38259       7   4,535      31,745     1,150.8      67.3      00:12:27
 38454       7   4,535      31,745     1,157.0      67.6      00:12:19
 38759      10   4,535      45,350     1,166.4      68.2      00:12:06
 39021       3   4,535      13,605     1,174.5      68.6      00:11:55
 39257       7   4,535      31,745     1,181.3      69.0      00:11:46
 39511      10   4,535      45,350     1,188.9      69.5      00:11:36
 39779       7   4,535      31,745     1,196.8      69.9      00:11:25
 40078      10   4,535      45,350     1,205.9      70.5      00:11:12
 40405       9   4,535      40,815     1,215.8      71.1      00:10:58
 40715       6   4,535      27,210     1,225.4      71.6      00:10:44
 40990       7   4,535      31,745     1,234.1      72.1      00:10:32
 41170      10   4,535      45,350     1,239.6      72.4      00:10:26
 41406       7   4,535      31,745     1,246.7      72.9      00:10:16
 41650       7   4,535      31,745     1,254.1      73.3      00:10:06
 41883       9   4,535      40,815     1,261.6      73.7      00:09:57
 42087      10   4,535      45,350     1,267.4      74.1      00:09:50
 42291       6   4,535      27,210     1,273.1      74.4      00:09:43
 42474       7   4,535      31,745     1,279.0      74.7      00:09:36
 42651       8   4,535      36,280     1,284.0      75.0      00:09:30
 42863      10   4,535      45,350     1,290.6      75.4      00:09:22
 43049      10   4,535      45,350     1,296.4      75.8      00:09:15
 43236       7   4,535      31,745     1,302.3      76.1      00:09:08
 43442       5   4,535      22,675     1,308.8      76.5      00:08:59
 43693      10   4,535      45,350     1,316.0      76.9      00:08:50
 43945       6   4,535      27,210     1,323.7      77.4      00:08:39
 44163      10   4,535      45,350     1,330.3      77.7      00:08:31
 44335       9   4,535      40,815     1,335.3      78.0      00:08:25
 44519       8   4,535      36,280     1,340.8      78.4      00:08:19
 44745       9   4,535      40,815     1,347.6      78.8      00:08:10
 44972      10   4,535      45,350     1,354.5      79.2      00:08:00
 45233       6   4,535      27,210     1,362.1      79.6      00:07:50
 45447      10   4,535      45,350     1,368.1      80.0      00:07:43
 45646       4   4,535      18,140     1,373.7      80.3      00:07:36
 45867       5   4,535      22,675     1,380.1      80.7      00:07:27
 46099       7   4,535      31,745     1,387.2      81.1      00:07:18
 46315       5   4,535      22,675     1,394.1      81.5      00:07:09
 46549       9   4,535      40,815     1,401.2      81.9      00:06:59
 46842       5   4,535      22,675     1,410.2      82.4      00:06:47
 47056       5   4,535      22,675     1,416.1      82.8      00:06:39
 47274       9   4,535      40,815     1,422.2      83.1      00:06:31
 47492       7   4,535      31,745     1,428.5      83.5      00:06:23
 47688       2   4,535       9,070     1,434.5      83.8      00:06:15
 47883       6   4,535      27,210     1,440.2      84.2      00:06:08
 48080       6   4,535      27,210     1,446.2      84.5      00:05:60
 48260       9   4,535      40,815     1,451.7      84.8      00:05:53
 48474       7   4,535      31,745     1,458.2      85.2      00:05:44
 48700       9   4,535      40,815     1,465.0      85.6      00:05:35
 48924       5   4,535      22,675     1,471.7      86.0      00:05:26
 49139       3   4,535      13,605     1,478.4      86.4      00:05:17
 49384       4   4,535      18,140     1,485.4      86.8      00:05:08
 49620       8   4,535      36,280     1,492.0      87.2      00:04:59
 49857       8   4,535      36,280     1,498.8      87.6      00:04:50
 50057       7   4,535      31,745     1,504.9      87.9      00:04:42
 50292       7   4,535      31,745     1,511.6      88.3      00:04:33
 50530       9   4,535      40,815     1,518.6      88.7      00:04:23
 50773       6   4,535      27,210     1,526.2      89.2      00:04:13
 51015       6   4,535      27,210     1,533.9      89.6      00:04:02
 51252       7   4,535      31,745     1,540.9      90.0      00:03:53
 51464       7   4,535      31,745     1,547.4      90.4      00:03:44
 51666       8   4,535      36,280     1,553.8      90.8      00:03:35
 51897      10   4,535      45,350     1,561.1      91.2      00:03:25
 52181      10   4,535      45,350     1,570.3      91.8      00:03:12
 52465      10   4,535      45,350     1,579.5      92.3      00:02:60
 52747       7   4,535      31,745     1,588.9      92.9      00:02:47
 53022       9   4,535      40,815     1,597.8      93.4      00:02:34
 53325       8   4,535      36,280     1,607.2      93.9      00:02:21
 53606       7   4,535      31,745     1,616.1      94.4      00:02:09
 53831       5   4,535      22,675     1,623.0      94.8      00:01:60
 54021       8   4,535      36,280     1,628.7      95.2      00:01:52
 54203       7   4,535      31,745     1,634.2      95.5      00:01:45
 54404       8   4,535      36,280     1,640.0      95.8      00:01:37
 54668      10   4,535      45,350     1,647.7      96.3      00:01:27
 54929       9   4,535      40,815     1,655.4      96.7      00:01:16
 55155       6   4,535      27,210     1,662.1      97.1      00:01:07
 55396       8   4,535      36,280     1,668.9      97.5      00:00:58
 55613       6   4,535      27,210     1,675.2      97.9      00:00:49
 55842       8   4,535      36,280     1,682.3      98.3      00:00:39
 56076      10   4,535      45,350     1,689.4      98.7      00:00:30
 56291       8   4,535      36,280     1,696.2      99.1      00:00:20
 56537       9   4,535      40,815     1,704.0      99.6      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 2340.747
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
