
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A500_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   348       6   4,535      27,210         9.0       0.5      00:31:34
   693       7   4,535      31,745        18.3       1.1      00:30:54
  1040       7   4,535      31,745        28.1       1.6      00:30:03
  1388      10   4,535      45,350        38.5       2.2      00:29:04
  1744       9   4,535      40,815        49.1       2.9      00:28:17
  2114      10   4,535      45,350        59.7       3.5      00:27:45
  2492       6   4,535      27,210        70.4       4.1      00:27:15
  2861       6   4,535      27,210        81.5       4.8      00:26:44
  3259      10   4,535      45,350        93.3       5.4      00:26:04
  3666       7   4,535      31,745       105.5       6.2      00:25:25
  4023       5   4,535      22,675       115.7       6.8      00:25:20
  4345       5   4,535      22,675       124.8       7.3      00:25:30
  4644       3   4,535      13,605       133.7       7.8      00:25:37
  4958       6   4,535      27,210       143.0       8.4      00:25:39
  5257       8   4,535      36,280       151.6       8.9      00:25:46
  5537       3   4,535      13,605       159.6       9.3      00:25:59
  5834       5   4,535      22,675       167.9       9.8      00:26:06
  6188       4   4,535      18,140       178.3      10.4      00:25:51
  6555       8   4,535      36,280       188.8      11.0      00:25:35
  6904       7   4,535      31,745       198.9      11.6      00:25:24
  7304       9   4,535      40,815       210.3      12.3      00:25:02
  7704      10   4,535      45,350       222.2      13.0      00:24:38
  8102       9   4,535      40,815       234.6      13.7      00:24:11
  8512       9   4,535      40,815       247.5      14.5      00:23:43
  8938       6   4,535      27,210       260.6      15.2      00:23:15
  9295       9   4,535      40,815       271.7      15.9      00:23:01
  9597       8   4,535      36,280       281.1      16.4      00:22:57
  9952       3   4,535      13,605       292.0      17.1      00:22:44
 10309       8   4,535      36,280       301.8      17.6      00:22:38
 10671       4   4,535      18,140       312.4      18.2      00:22:27
 11077       7   4,535      31,745       324.3      18.9      00:22:09
 11386       7   4,535      31,745       333.5      19.5      00:22:05
 11723       2   4,535       9,070       343.4      20.1      00:21:58
 12050       6   4,535      27,210       353.2      20.6      00:21:50
 12415       6   4,535      27,210       364.0      21.3      00:21:39
 12882       9   4,535      40,815       377.5      22.0      00:21:15
 13357      10   4,535      45,350       391.6      22.9      00:20:50
 13747       6   4,535      27,210       403.8      23.6      00:20:33
 14136       7   4,535      31,745       415.2      24.2      00:20:20
 14563       6   4,535      27,210       428.4      25.0      00:20:01
 14970       9   4,535      40,815       440.6      25.7      00:19:45
 15448       5   4,535      22,675       455.3      26.6      00:19:22
 15934       6   4,535      27,210       470.1      27.5      00:18:58
 16407       8   4,535      36,280       485.0      28.3      00:18:35
 16809      10   4,535      45,350       497.2      29.0      00:18:21
 17168       7   4,535      31,745       507.9      29.7      00:18:12
 17513       8   4,535      36,280       519.0      30.3      00:18:03
 17888      10   4,535      45,350       530.2      31.0      00:17:52
 18286       5   4,535      22,675       542.4      31.7      00:17:39
 18742       7   4,535      31,745       556.1      32.5      00:17:21
 19238       8   4,535      36,280       571.7      33.4      00:16:59
 19731      10   4,535      45,350       587.3      34.3      00:16:38
 20236       4   4,535      18,140       603.2      35.2      00:16:16
 20646       6   4,535      27,210       615.8      36.0      00:16:03
 21008       9   4,535      40,815       627.0      36.6      00:15:54
 21418      10   4,535      45,350       638.4      37.3      00:15:44
 21822       7   4,535      31,745       649.7      37.9      00:15:34
 22238       8   4,535      36,280       661.7      38.6      00:15:22
 22623       6   4,535      27,210       672.7      39.3      00:15:13
 23011       7   4,535      31,745       683.6      39.9      00:15:04
 23383       5   4,535      22,675       695.0      40.6      00:14:54
 23766       6   4,535      27,210       705.9      41.2      00:14:45
 24149       6   4,535      27,210       717.2      41.9      00:14:36
 24633      10   4,535      45,350       731.4      42.7      00:14:20
 25110       9   4,535      40,815       745.6      43.5      00:14:04
 25566       4   4,535      18,140       759.4      44.3      00:13:49
 25941       8   4,535      36,280       770.6      45.0      00:13:40
 26340       6   4,535      27,210       782.6      45.7      00:13:29
 26805      10   4,535      45,350       796.2      46.5      00:13:15
 27211       7   4,535      31,745       808.3      47.2      00:13:04
 27575       3   4,535      13,605       819.2      47.8      00:12:55
 28002       7   4,535      31,745       832.3      48.6      00:12:42
 28501       7   4,535      31,745       847.7      49.5      00:12:26
 28891      10   4,535      45,350       860.0      50.2      00:12:15
 29267      10   4,535      45,350       871.3      50.9      00:12:05
 29677      10   4,535      45,350       883.7      51.6      00:11:54
 30019      10   4,535      45,350       894.3      52.2      00:11:45
 30387       7   4,535      31,745       905.6      52.9      00:11:36
 30806       7   4,535      31,745       918.7      53.7      00:11:23
 31294       8   4,535      36,280       933.7      54.5      00:11:08
 31787       6   4,535      27,210       949.3      55.4      00:10:52
 32249       5   4,535      22,675       964.1      56.3      00:10:37
 32645       7   4,535      31,745       976.6      57.0      00:10:26
 32973       3   4,535      13,605       986.9      57.6      00:10:18
 33349       6   4,535      27,210       998.7      58.3      00:10:08
 33767       6   4,535      27,210     1,011.9      59.1      00:09:56
 34165      10   4,535      45,350     1,024.6      59.8      00:09:45
 34643       7   4,535      31,745     1,039.7      60.7      00:09:30
 35139       9   4,535      40,815     1,055.3      61.6      00:09:15
 35631       3   4,535      13,605     1,070.8      62.5      00:08:60
 36122      10   4,535      45,350     1,086.2      63.4      00:08:45
 36591      10   4,535      45,350     1,100.8      64.3      00:08:32
 36947       8   4,535      36,280     1,111.7      64.9      00:08:23
 37324       6   4,535      27,210     1,122.4      65.5      00:08:15
 37687       4   4,535      18,140     1,133.1      66.2      00:08:06
 38050       9   4,535      40,815     1,143.9      66.8      00:07:58
 38380      10   4,535      45,350     1,154.2      67.4      00:07:50
 38715      10   4,535      45,350     1,164.6      68.0      00:07:42
 39036       6   4,535      27,210     1,174.5      68.6      00:07:34
 39435       8   4,535      36,280     1,186.3      69.3      00:07:24
 39861       9   4,535      40,815     1,199.1      70.0      00:07:13
 40355       9   4,535      40,815     1,213.8      70.9      00:06:59
 40841       7   4,535      31,745     1,229.0      71.8      00:06:46
 41195       3   4,535      13,605     1,239.9      72.4      00:06:37
 41591       6   4,535      27,210     1,252.0      73.1      00:06:27
 41985       4   4,535      18,140     1,264.3      73.8      00:06:16
 42360       4   4,535      18,140     1,274.9      74.4      00:06:08
 42731       9   4,535      40,815     1,286.2      75.1      00:05:58
 43096       8   4,535      36,280     1,297.4      75.8      00:05:49
 43431       8   4,535      36,280     1,308.1      76.4      00:05:40
 43801       3   4,535      13,605     1,318.8      77.0      00:05:32
 44157       7   4,535      31,745     1,329.6      77.6      00:05:23
 44577       6   4,535      27,210     1,342.1      78.4      00:05:12
 44978       3   4,535      13,605     1,354.3      79.1      00:05:02
 45402       5   4,535      22,675     1,366.4      79.8      00:04:52
 45771       6   4,535      27,210     1,377.1      80.4      00:04:43
 46129      10   4,535      45,350     1,387.9      81.0      00:04:34
 46500       6   4,535      27,210     1,399.2      81.7      00:04:24
 46937       9   4,535      40,815     1,412.8      82.5      00:04:13
 47314       7   4,535      31,745     1,423.1      83.1      00:04:04
 47682       6   4,535      27,210     1,434.0      83.7      00:03:55
 48019       9   4,535      40,815     1,444.2      84.3      00:03:47
 48364       9   4,535      40,815     1,454.6      84.9      00:03:38
 48743       5   4,535      22,675     1,466.1      85.6      00:03:29
 49133       8   4,535      36,280     1,477.7      86.3      00:03:19
 49547       4   4,535      18,140     1,489.9      87.0      00:03:08
 50035       6   4,535      27,210     1,503.9      87.8      00:02:56
 50427      10   4,535      45,350     1,515.1      88.5      00:02:47
 50790       7   4,535      31,745     1,526.3      89.1      00:02:38
 51176       6   4,535      27,210     1,538.1      89.8      00:02:27
 51564       6   4,535      27,210     1,550.1      90.5      00:02:17
 51934       5   4,535      22,675     1,561.7      91.2      00:02:07
 52311       8   4,535      36,280     1,573.9      91.9      00:01:57
 52679      10   4,535      45,350     1,586.2      92.6      00:01:47
 53067       5   4,535      22,675     1,598.7      93.4      00:01:36
 53500       8   4,535      36,280     1,612.2      94.2      00:01:25
 53910       7   4,535      31,745     1,624.9      94.9      00:01:14
 54273      10   4,535      45,350     1,635.9      95.5      00:01:05
 54676      10   4,535      45,350     1,647.5      96.2      00:00:55
 55093       2   4,535       9,070     1,659.9      96.9      00:00:44
 55462       5   4,535      22,675     1,670.5      97.6      00:00:35
 55797       8   4,535      36,280     1,680.5      98.1      00:00:27
 56132      10   4,535      45,350     1,690.7      98.7      00:00:18
 56496       9   4,535      40,815     1,702.3      99.4      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1456.434
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
