
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A200.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   326       8   4,235      33,880         8.1       0.5      00:32:48
   710       7   4,235      29,645        17.6       1.1      00:29:53
  1053       7   4,235      29,645        26.8       1.7      00:29:23
  1372       5   4,235      21,175        35.6       2.2      00:29:17
  1716      10   4,235      42,350        45.3       2.8      00:28:37
  2066       7   4,235      29,645        54.5       3.4      00:28:23
  2416       8   4,235      33,880        64.0       4.0      00:27:60
  2745       5   4,235      21,175        73.0       4.6      00:27:53
  3084       5   4,235      21,175        82.1       5.1      00:27:44
  3408       9   4,235      38,115        91.6       5.7      00:27:27
  3772       6   4,235      25,410       101.8       6.4      00:26:59
  4050       8   4,235      33,880       109.0       6.8      00:27:21
  4329       7   4,235      29,645       116.2       7.3      00:27:39
  4559       8   4,235      33,880       122.6       7.7      00:28:07
  4832       7   4,235      29,645       130.1       8.1      00:28:14
  5037       8   4,235      33,880       135.9       8.5      00:28:44
  5294      10   4,235      42,350       142.9       8.9      00:28:54
  5536       4   4,235      16,940       149.2       9.3      00:29:11
  5775       8   4,235      33,880       155.5       9.7      00:29:26
  6029       6   4,235      25,410       162.5      10.2      00:29:29
  6320       8   4,235      33,880       170.3      10.7      00:29:24
  6620       8   4,235      33,880       178.2      11.2      00:29:16
  6897       5   4,235      21,175       185.7      11.6      00:29:12
  7231       7   4,235      29,645       194.5      12.2      00:28:55
  7583      10   4,235      42,350       204.5      12.8      00:28:27
  7899       8   4,235      33,880       213.4      13.4      00:28:10
  8238       3   4,235      12,705       223.2      14.0      00:27:46
  8565       8   4,235      33,880       232.8      14.6      00:27:25
  8898       6   4,235      25,410       242.4      15.2      00:27:05
  9197       6   4,235      25,410       251.0      15.7      00:26:53
  9400       7   4,235      29,645       256.9      16.1      00:27:02
  9644       7   4,235      29,645       264.1      16.5      00:26:59
  9892       4   4,235      16,940       271.2      17.0      00:26:57
 10183       5   4,235      21,175       278.7      17.4      00:26:52
 10486       6   4,235      25,410       287.0      18.0      00:26:42
 10834       5   4,235      21,175       296.3      18.5      00:26:24
 11152      10   4,235      42,350       305.1      19.1      00:26:11
 11336      10   4,235      42,350       310.2      19.4      00:26:21
 11553       8   4,235      33,880       316.1      19.8      00:26:25
 11772       7   4,235      29,645       322.2      20.2      00:26:27
 12018       7   4,235      29,645       329.1      20.6      00:26:24
 12271      10   4,235      42,350       336.1      21.0      00:26:20
 12588       8   4,235      33,880       344.8      21.6      00:26:06
 12936       8   4,235      33,880       354.1      22.2      00:25:49
 13222       7   4,235      29,645       362.1      22.7      00:25:39
 13516       6   4,235      25,410       370.7      23.2      00:25:26
 13735       5   4,235      21,175       376.9      23.6      00:25:26
 14036       5   4,235      21,175       385.1      24.1      00:25:15
 14350       8   4,235      33,880       394.2      24.7      00:24:59
 14619       6   4,235      25,410       401.8      25.1      00:24:52
 14831       6   4,235      25,410       407.7      25.5      00:24:52
 15154       7   4,235      29,645       417.1      26.1      00:24:35
 15486       8   4,235      33,880       426.4      26.7      00:24:19
 15813       9   4,235      38,115       435.7      27.3      00:24:03
 16169       9   4,235      38,115       446.2      27.9      00:23:42
 16516       8   4,235      33,880       456.4      28.6      00:23:23
 16795       8   4,235      33,880       464.1      29.0      00:23:15
 17011       9   4,235      38,115       470.3      29.4      00:23:13
 17249       7   4,235      29,645       476.9      29.8      00:23:10
 17503       8   4,235      33,880       484.6      30.3      00:23:01
 17738       8   4,235      33,880       491.2      30.7      00:22:57
 18014       7   4,235      29,645       498.9      31.2      00:22:49
 18394       9   4,235      38,115       509.7      31.9      00:22:28
 18688       5   4,235      21,175       518.0      32.4      00:22:17
 18910       6   4,235      25,410       524.5      32.8      00:22:13
 19119       9   4,235      38,115       530.6      33.2      00:22:10
 19379       7   4,235      29,645       538.2      33.7      00:22:02
 19719       9   4,235      38,115       548.3      34.3      00:21:44
 20064       8   4,235      33,880       558.7      35.0      00:21:26
 20350       5   4,235      21,175       566.7      35.5      00:21:16
 20611       7   4,235      29,645       574.3      35.9      00:21:08
 20861       9   4,235      38,115       581.6      36.4      00:21:01
 21128      10   4,235      42,350       588.9      36.9      00:20:53
 21379      10   4,235      42,350       595.3      37.3      00:20:49
 21545       8   4,235      33,880       600.0      37.5      00:20:50
 21674       5   4,235      21,175       603.3      37.8      00:20:56
 21909       6   4,235      25,410       609.5      38.1      00:20:51
 22145       8   4,235      33,880       615.7      38.5      00:20:47
 22419       6   4,235      25,410       622.9      39.0      00:20:39
 22701       8   4,235      33,880       630.6      39.5      00:20:30
 23033      10   4,235      42,350       639.4      40.0      00:20:17
 23346       6   4,235      25,410       648.2      40.6      00:20:04
 23727       4   4,235      16,940       658.3      41.2      00:19:47
 24079       4   4,235      16,940       668.2      41.8      00:19:31
 24397       7   4,235      29,645       676.4      42.3      00:19:21
 24739       9   4,235      38,115       686.2      42.9      00:19:05
 25057       9   4,235      38,115       695.0      43.5      00:18:53
 25400      10   4,235      42,350       704.7      44.1      00:18:38
 25762       8   4,235      33,880       714.8      44.7      00:18:22
 26089       4   4,235      16,940       724.1      45.3      00:18:08
 26447       7   4,235      29,645       734.0      45.9      00:17:54
 26804      10   4,235      42,350       743.7      46.5      00:17:39
 27105       5   4,235      21,175       752.1      47.1      00:17:28
 27331       5   4,235      21,175       758.5      47.5      00:17:23
 27610       6   4,235      25,410       766.3      48.0      00:17:13
 27968       6   4,235      25,410       776.6      48.6      00:16:58
 28321       9   4,235      38,115       786.7      49.2      00:16:42
 28654       7   4,235      29,645       796.5      49.8      00:16:28
 28892      10   4,235      42,350       803.5      50.3      00:16:21
 29173       8   4,235      33,880       811.5      50.8      00:16:11
 29546       9   4,235      38,115       822.0      51.4      00:15:56
 29840       5   4,235      21,175       830.4      52.0      00:15:45
 30101      10   4,235      42,350       837.8      52.4      00:15:37
 30351       7   4,235      29,645       845.0      52.9      00:15:29
 30702       7   4,235      29,645       855.2      53.5      00:15:14
 31150       7   4,235      29,645       868.1      54.3      00:14:53
 31572       7   4,235      29,645       880.5      55.1      00:14:34
 31964       7   4,235      29,645       892.2      55.8      00:14:16
 32340       6   4,235      25,410       903.5      56.5      00:13:60
 32645       7   4,235      29,645       912.3      57.1      00:13:48
 32942      10   4,235      42,350       921.1      57.6      00:13:37
 33230       5   4,235      21,175       929.5      58.2      00:13:27
 33547       6   4,235      25,410       938.9      58.8      00:13:15
 33872       6   4,235      25,410       948.5      59.4      00:13:02
 34113      10   4,235      42,350       955.7      59.8      00:12:54
 34369       6   4,235      25,410       963.3      60.3      00:12:46
 34779       9   4,235      38,115       975.4      61.0      00:12:28
 35183       7   4,235      29,645       987.3      61.8      00:12:11
 35614       9   4,235      38,115       999.9      62.6      00:11:53
 35983      10   4,235      42,350     1,010.7      63.2      00:11:39
 36310       9   4,235      38,115     1,020.3      63.9      00:11:26
 36608       6   4,235      25,410     1,028.9      64.4      00:11:16
 36887       4   4,235      16,940     1,036.7      64.9      00:11:07
 37179      10   4,235      42,350     1,044.5      65.4      00:10:58
 37389       9   4,235      38,115     1,050.3      65.7      00:10:53
 37639       4   4,235      16,940     1,057.1      66.2      00:10:46
 37922       4   4,235      16,940     1,065.0      66.6      00:10:37
 38179      10   4,235      42,350     1,072.4      67.1      00:10:29
 38408       6   4,235      25,410     1,079.2      67.5      00:10:21
 38769       7   4,235      29,645     1,089.5      68.2      00:10:08
 39125       9   4,235      38,115     1,099.7      68.8      00:09:55
 39439       7   4,235      29,645     1,108.2      69.4      00:09:45
 39753       5   4,235      21,175     1,117.0      69.9      00:09:34
 40087       5   4,235      21,175     1,126.4      70.5      00:09:22
 40442       5   4,235      21,175     1,136.5      71.1      00:09:09
 40802       7   4,235      29,645     1,146.9      71.8      00:08:56
 41087       7   4,235      29,645     1,155.2      72.3      00:08:46
 41385       6   4,235      25,410     1,163.6      72.8      00:08:36
 41686       5   4,235      21,175     1,172.3      73.4      00:08:26
 41972       9   4,235      38,115     1,180.6      73.9      00:08:16
 42208       5   4,235      21,175     1,186.7      74.3      00:08:10
 42416       5   4,235      21,175     1,192.7      74.6      00:08:03
 42658       9   4,235      38,115     1,199.3      75.1      00:07:56
 42858       8   4,235      33,880     1,205.1      75.4      00:07:50
 43057       8   4,235      33,880     1,210.9      75.8      00:07:45
 43305       9   4,235      38,115     1,218.2      76.2      00:07:36
 43636       9   4,235      38,115     1,227.4      76.8      00:07:25
 44009       9   4,235      38,115     1,237.9      77.5      00:07:11
 44245       8   4,235      33,880     1,244.6      77.9      00:07:04
 44463       8   4,235      33,880     1,250.5      78.3      00:06:58
 44739       8   4,235      33,880     1,258.2      78.7      00:06:49
 45063       8   4,235      33,880     1,267.4      79.3      00:06:37
 45419       7   4,235      29,645     1,276.8      79.9      00:06:26
 45726      10   4,235      42,350     1,285.0      80.4      00:06:16
 45963       7   4,235      29,645     1,291.6      80.8      00:06:08
 46141       9   4,235      38,115     1,296.8      81.2      00:06:03
 46377       9   4,235      38,115     1,303.5      81.6      00:05:55
 46630       7   4,235      29,645     1,310.8      82.0      00:05:47
 46908       5   4,235      21,175     1,318.8      82.5      00:05:37
 47163      10   4,235      42,350     1,325.1      82.9      00:05:30
 47384       9   4,235      38,115     1,331.2      83.3      00:05:23
 47613      10   4,235      42,350     1,337.4      83.7      00:05:16
 47845       9   4,235      38,115     1,343.9      84.1      00:05:09
 48057      10   4,235      42,350     1,350.0      84.5      00:05:02
 48281       7   4,235      29,645     1,356.3      84.9      00:04:55
 48515       7   4,235      29,645     1,362.9      85.3      00:04:47
 48753       9   4,235      38,115     1,369.6      85.7      00:04:39
 48999       5   4,235      21,175     1,376.4      86.1      00:04:31
 49213       4   4,235      16,940     1,382.8      86.5      00:04:24
 49458       8   4,235      33,880     1,389.2      86.9      00:04:16
 49721      10   4,235      42,350     1,396.0      87.4      00:04:08
 49961       8   4,235      33,880     1,402.7      87.8      00:03:60
 50179       6   4,235      25,410     1,408.6      88.2      00:03:53
 50422       4   4,235      16,940     1,415.1      88.6      00:03:45
 50651       6   4,235      25,410     1,421.6      89.0      00:03:38
 50893       6   4,235      25,410     1,428.7      89.4      00:03:29
 51149       4   4,235      16,940     1,436.0      89.9      00:03:20
 51380       8   4,235      33,880     1,442.6      90.3      00:03:12
 51607       6   4,235      25,410     1,449.3      90.7      00:03:04
 51851       8   4,235      33,880     1,456.5      91.1      00:02:55
 52120       9   4,235      38,115     1,464.6      91.7      00:02:45
 52414       6   4,235      25,410     1,473.5      92.2      00:02:34
 52697       8   4,235      33,880     1,482.3      92.8      00:02:23
 52975       9   4,235      38,115     1,490.6      93.3      00:02:13
 53266       7   4,235      29,645     1,499.2      93.8      00:02:02
 53572       4   4,235      16,940     1,508.2      94.4      00:01:51
 53848       4   4,235      16,940     1,516.1      94.9      00:01:41
 54093       3   4,235      12,705     1,522.9      95.3      00:01:33
 54354       8   4,235      33,880     1,530.3      95.8      00:01:24
 54608       9   4,235      38,115     1,537.0      96.2      00:01:16
 54868       5   4,235      21,175     1,544.2      96.6      00:01:07
 55091       6   4,235      25,410     1,550.4      97.0      00:00:59
 55330       4   4,235      16,940     1,556.7      97.4      00:00:51
 55565       8   4,235      33,880     1,563.0      97.8      00:00:44
 55744       8   4,235      33,880     1,568.2      98.1      00:00:37
 55970       8   4,235      33,880     1,574.7      98.5      00:00:29
 56207       7   4,235      29,645     1,581.6      99.0      00:00:20
 56454       9   4,235      38,115     1,589.0      99.4      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 2001.804
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200.csv saved

. 
. cap log close

. 
end of do-file
