
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A800.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A800.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A800.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A800.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   453       9   4,835      43,515        12.5       0.7      00:24:17
   941       9   4,835      43,515        26.8       1.5      00:22:24
  1412       5   4,835      24,175        41.8       2.3      00:21:22
  1899       3   4,835      14,505        56.9       3.1      00:20:45
  2392       9   4,835      43,515        72.2       4.0      00:20:16
  2843       7   4,835      33,845        86.3       4.7      00:20:10
  3300       4   4,835      19,340       100.9       5.5      00:19:58
  3748       9   4,835      43,515       115.2       6.3      00:19:49
  4127      10   4,835      48,350       126.6       6.9      00:20:09
  4520       8   4,835      38,680       138.5       7.6      00:20:20
  4914       7   4,835      33,845       151.1       8.3      00:20:21
  5296       7   4,835      33,845       162.9       8.9      00:20:26
  5650       9   4,835      43,515       173.4       9.5      00:20:40
  6031       9   4,835      43,515       185.3      10.2      00:20:40
  6430      10   4,835      48,350       197.5      10.8      00:20:38
  6823       8   4,835      38,680       209.5      11.5      00:20:35
  7263       6   4,835      29,010       222.8      12.2      00:20:24
  7706       6   4,835      29,010       237.0      13.0      00:20:08
  8126       5   4,835      24,175       251.0      13.7      00:19:54
  8557       6   4,835      29,010       265.3      14.5      00:19:37
  9014       6   4,835      29,010       280.3      15.4      00:19:19
  9381       8   4,835      38,680       292.4      16.0      00:19:15
  9741       5   4,835      24,175       304.6      16.7      00:19:10
 10104       8   4,835      38,680       315.9      17.3      00:19:09
 10450      10   4,835      48,350       326.3      17.9      00:19:10
 10859       9   4,835      43,515       338.9      18.6      00:19:02
 11252       9   4,835      43,515       351.2      19.2      00:18:55
 11593       7   4,835      33,845       361.9      19.8      00:18:54
 11949       7   4,835      33,845       373.2      20.4      00:18:50
 12295       2   4,835       9,670       384.3      21.1      00:18:47
 12718       7   4,835      33,845       397.6      21.8      00:18:35
 13178      10   4,835      48,350       411.8      22.6      00:18:20
 13601      10   4,835      48,350       425.8      23.3      00:18:06
 13947       8   4,835      38,680       436.7      23.9      00:18:03
 14367       9   4,835      43,515       450.3      24.7      00:17:50
 14792       9   4,835      43,515       464.0      25.4      00:17:38
 15245       6   4,835      29,010       478.9      26.2      00:17:22
 15717       7   4,835      33,845       493.9      27.1      00:17:06
 16182       6   4,835      29,010       509.6      27.9      00:16:49
 16617       6   4,835      29,010       523.9      28.7      00:16:35
 16964       5   4,835      24,175       535.1      29.3      00:16:30
 17318       4   4,835      19,340       546.5      29.9      00:16:25
 17654       8   4,835      38,680       557.9      30.6      00:16:18
 18040       6   4,835      29,010       570.1      31.2      00:16:10
 18440       9   4,835      43,515       583.0      31.9      00:16:00
 18909       8   4,835      38,680       598.4      32.8      00:15:45
 19403       9   4,835      43,515       615.0      33.7      00:15:27
 19872       5   4,835      24,175       630.8      34.6      00:15:10
 20376       5   4,835      24,175       647.5      35.5      00:14:53
 20746       5   4,835      24,175       659.8      36.1      00:14:45
 21096       5   4,835      24,175       671.2      36.8      00:14:39
 21491       3   4,835      14,505       682.9      37.4      00:14:31
 21892       7   4,835      33,845       695.1      38.1      00:14:23
 22275      10   4,835      48,350       706.5      38.7      00:14:17
 22661       4   4,835      19,340       718.5      39.4      00:14:09
 23049       9   4,835      43,515       730.1      40.0      00:14:01
 23428      10   4,835      48,350       742.4      40.7      00:13:53
 23827       6   4,835      29,010       754.7      41.3      00:13:44
 24276       5   4,835      24,175       768.6      42.1      00:13:33
 24788       9   4,835      43,515       784.7      43.0      00:13:17
 25280      10   4,835      48,350       800.4      43.8      00:13:03
 25717       5   4,835      24,175       814.2      44.6      00:12:51
 26053       8   4,835      38,680       825.2      45.2      00:12:45
 26466       9   4,835      43,515       838.2      45.9      00:12:35
 26944       7   4,835      33,845       853.2      46.7      00:12:22
 27321       8   4,835      38,680       865.2      47.4      00:12:14
 27656       9   4,835      43,515       876.0      48.0      00:12:07
 28109      10   4,835      48,350       890.8      48.8      00:11:55
 28589       8   4,835      38,680       906.9      49.7      00:11:40
 28946       9   4,835      43,515       918.7      50.3      00:11:32
 29326      10   4,835      48,350       930.9      51.0      00:11:23
 29730       6   4,835      29,010       944.0      51.7      00:11:13
 30024      10   4,835      48,350       953.6      52.2      00:11:08
 30383       9   4,835      43,515       965.4      52.9      00:11:00
 30797       8   4,835      38,680       979.2      53.6      00:10:49
 31290       9   4,835      43,515       995.3      54.5      00:10:35
 31749       6   4,835      29,010     1,010.7      55.4      00:10:22
 32202       6   4,835      29,010     1,026.2      56.2      00:10:09
 32610       6   4,835      29,010     1,040.0      57.0      00:09:58
 32901      10   4,835      48,350     1,049.7      57.5      00:09:52
 33207       8   4,835      38,680     1,060.0      58.1      00:09:46
 33619       9   4,835      43,515     1,073.9      58.8      00:09:35
 34034       9   4,835      43,515     1,087.8      59.6      00:09:24
 34475       9   4,835      43,515     1,102.8      60.4      00:09:11
 34970       5   4,835      24,175     1,119.6      61.3      00:08:57
 35453       9   4,835      43,515     1,135.9      62.2      00:08:43
 35951       9   4,835      43,515     1,152.3      63.1      00:08:29
 36464      10   4,835      48,350     1,169.5      64.1      00:08:14
 36871       8   4,835      38,680     1,182.6      64.8      00:08:05
 37255       8   4,835      38,680     1,194.5      65.4      00:07:56
 37600       7   4,835      33,845     1,205.3      66.0      00:07:49
 37935       6   4,835      29,010     1,215.9      66.6      00:07:42
 38272       7   4,835      33,845     1,226.9      67.2      00:07:35
 38591       7   4,835      33,845     1,237.7      67.8      00:07:27
 38931       3   4,835      14,505     1,248.7      68.4      00:07:20
 39269       7   4,835      33,845     1,259.5      69.0      00:07:12
 39686       6   4,835      29,010     1,272.8      69.7      00:07:02
 40164       8   4,835      38,680     1,288.1      70.6      00:06:50
 40660       8   4,835      38,680     1,304.3      71.4      00:06:36
 41070       9   4,835      43,515     1,317.9      72.2      00:06:26
 41405       7   4,835      33,845     1,328.7      72.8      00:06:18
 41769       8   4,835      38,680     1,340.7      73.4      00:06:09
 42115      10   4,835      48,350     1,351.8      74.0      00:06:02
 42462       5   4,835      24,175     1,362.8      74.6      00:05:54
 42825       6   4,835      29,010     1,374.2      75.3      00:05:45
 43160       9   4,835      43,515     1,385.5      75.9      00:05:37
 43520      10   4,835      48,350     1,397.4      76.5      00:05:28
 43869       9   4,835      43,515     1,408.4      77.1      00:05:20
 44198      10   4,835      48,350     1,418.9      77.7      00:05:13
 44540       9   4,835      43,515     1,429.7      78.3      00:05:05
 44942       6   4,835      29,010     1,442.8      79.0      00:04:55
 45371       5   4,835      24,175     1,455.8      79.7      00:04:45
 45732      10   4,835      48,350     1,466.9      80.3      00:04:37
 46101       6   4,835      29,010     1,478.7      81.0      00:04:28
 46459       5   4,835      24,175     1,490.4      81.6      00:04:19
 46892       7   4,835      33,845     1,504.8      82.4      00:04:08
 47229       7   4,835      33,845     1,514.7      83.0      00:04:01
 47554       4   4,835      19,340     1,524.7      83.5      00:03:53
 47896       8   4,835      38,680     1,535.6      84.1      00:03:45
 48255       8   4,835      38,680     1,547.1      84.7      00:03:36
 48625       8   4,835      38,680     1,559.3      85.4      00:03:27
 49001       4   4,835      19,340     1,571.2      86.1      00:03:18
 49414       8   4,835      38,680     1,584.4      86.8      00:03:08
 49933       7   4,835      33,845     1,600.0      87.6      00:02:55
 50371       4   4,835      19,340     1,613.7      88.4      00:02:44
 50735       7   4,835      33,845     1,625.3      89.0      00:02:36
 51081       9   4,835      43,515     1,637.0      89.7      00:02:27
 51453       5   4,835      24,175     1,648.9      90.3      00:02:17
 51819       7   4,835      33,845     1,661.3      91.0      00:02:08
 52196       4   4,835      19,340     1,674.2      91.7      00:01:58
 52560       9   4,835      43,515     1,686.8      92.4      00:01:48
 52867       7   4,835      33,845     1,697.7      93.0      00:01:40
 53168       5   4,835      24,175     1,707.8      93.5      00:01:32
 53543       8   4,835      38,680     1,720.3      94.2      00:01:22
 53883       7   4,835      33,845     1,731.6      94.8      00:01:13
 54214       8   4,835      38,680     1,742.1      95.4      00:01:05
 54576       7   4,835      33,845     1,753.2      96.0      00:00:57
 54914       8   4,835      38,680     1,764.0      96.6      00:00:48
 55240       9   4,835      43,515     1,774.3      97.2      00:00:40
 55575       9   4,835      43,515     1,784.4      97.7      00:00:32
 55898       7   4,835      33,845     1,795.0      98.3      00:00:24
 56255       9   4,835      43,515     1,806.8      99.0      00:00:15
 56619       5   4,835      24,175     1,819.0      99.6      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1442.701
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A800.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A800.csv saved

. 
. cap log close

. 
end of do-file
