
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locations_total
> .dta /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/c
> a_blk_Dollar_dist_total.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   9 Nov 2023, 16:07:24

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinate
> d/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated
> /ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   514       8   4,035      32,280        11.9       0.8      00:21:11
  1056       6   4,035      24,210        25.4       1.7      00:19:39
  1594       5   4,035      20,175        39.7       2.6      00:18:42
  2148       4   4,035      16,140        53.9       3.5      00:18:11
  2699       7   4,035      28,245        68.1       4.5      00:17:50
  3216       7   4,035      28,245        81.8       5.4      00:17:39
  3742      10   4,035      40,350        95.9       6.3      00:17:23
  4263       3   4,035      12,105       109.1       7.2      00:17:18
  4743       3   4,035      12,105       121.7       8.0      00:17:18
  5205       4   4,035      16,140       133.6       8.8      00:17:21
  5621       9   4,035      36,315       144.0       9.5      00:17:34
  6032       8   4,035      32,280       154.7      10.2      00:17:43
  6469       7   4,035      28,245       165.9      10.9      00:17:45
  6918      10   4,035      40,350       177.3      11.6      00:17:44
  7466       8   4,035      32,280       191.5      12.6      00:17:24
  7985       8   4,035      32,280       205.6      13.5      00:17:07
  8490       8   4,035      32,280       219.6      14.4      00:16:51
  8999      10   4,035      40,350       233.5      15.3      00:16:36
  9441      10   4,035      40,350       245.7      16.1      00:16:29
  9817       8   4,035      32,280       256.3      16.8      00:16:30
 10149       6   4,035      24,210       264.6      17.4      00:16:40
 10514       6   4,035      24,210       274.0      18.0      00:16:44
 10907       7   4,035      28,245       284.1      18.6      00:16:45
 11276      10   4,035      40,350       293.7      19.3      00:16:46
 11609       9   4,035      36,315       302.5      19.9      00:16:51
 12041       7   4,035      28,245       314.0      20.6      00:16:43
 12544       7   4,035      28,245       327.3      21.5      00:16:28
 13128      10   4,035      40,350       342.4      22.5      00:16:07
 13589       5   4,035      20,175       355.0      23.3      00:15:56
 13943       9   4,035      36,315       364.3      23.9      00:15:56
 14395       8   4,035      32,280       376.6      24.7      00:15:45
 14843       4   4,035      16,140       388.6      25.5      00:15:36
 15335       5   4,035      20,175       402.1      26.4      00:15:22
 15877      10   4,035      40,350       416.7      27.3      00:15:04
 16394       4   4,035      16,140       431.2      28.3      00:14:48
 16797       7   4,035      28,245       442.1      29.0      00:14:42
 17233      10   4,035      40,350       453.8      29.8      00:14:33
 17607       8   4,035      32,280       464.4      30.5      00:14:28
 18055       6   4,035      24,210       476.2      31.3      00:14:19
 18350       5   4,035      20,175       484.3      31.8      00:14:19
 18708       6   4,035      24,210       493.9      32.4      00:14:16
 19117       5   4,035      20,175       505.3      33.2      00:14:08
 19543       6   4,035      24,210       517.2      33.9      00:13:58
 20081       9   4,035      36,315       532.5      34.9      00:13:40
 20542       7   4,035      28,245       545.0      35.8      00:13:29
 20847       7   4,035      28,245       553.4      36.3      00:13:27
 21198       4   4,035      16,140       562.6      36.9      00:13:24
 21527       9   4,035      36,315       570.9      37.5      00:13:22
 21860      10   4,035      40,350       579.2      38.0      00:13:20
 22189       4   4,035      16,140       587.4      38.6      00:13:18
 22503       7   4,035      28,245       595.4      39.1      00:13:16
 22847       4   4,035      16,140       603.9      39.6      00:13:13
 23162       7   4,035      28,245       612.4      40.2      00:13:10
 23543       5   4,035      20,175       622.1      40.8      00:13:03
 23909       8   4,035      32,280       632.0      41.5      00:12:57
 24349       7   4,035      28,245       643.1      42.2      00:12:48
 24873       9   4,035      36,315       657.1      43.1      00:12:33
 25381      10   4,035      40,350       670.7      44.0      00:12:19
 25770       8   4,035      32,280       681.0      44.7      00:12:11
 26175       4   4,035      16,140       691.9      45.4      00:12:02
 26696       6   4,035      24,210       705.4      46.3      00:11:48
 27119       4   4,035      16,140       716.6      47.0      00:11:39
 27421      10   4,035      40,350       724.7      47.6      00:11:35
 27744       8   4,035      32,280       733.4      48.1      00:11:30
 28127       5   4,035      20,175       743.9      48.8      00:11:22
 28561       9   4,035      36,315       756.1      49.6      00:11:11
 28879       5   4,035      20,175       764.9      50.2      00:11:05
 29264       3   4,035      12,105       775.1      50.9      00:10:57
 29651       7   4,035      28,245       785.7      51.6      00:10:49
 30027       9   4,035      36,315       795.9      52.2      00:10:41
 30401       6   4,035      24,210       806.1      52.9      00:10:33
 30803       7   4,035      28,245       817.3      53.6      00:10:23
 31312       8   4,035      32,280       831.3      54.6      00:10:09
 31796       4   4,035      16,140       844.9      55.5      00:09:55
 32269       4   4,035      16,140       858.3      56.3      00:09:42
 32681      10   4,035      40,350       869.9      57.1      00:09:32
 32983      10   4,035      40,350       878.4      57.7      00:09:26
 33299       6   4,035      24,210       887.2      58.2      00:09:20
 33650       7   4,035      28,245       897.1      58.9      00:09:12
 34037       9   4,035      36,315       907.9      59.6      00:09:03
 34440      10   4,035      40,350       919.4      60.3      00:08:53
 34911       5   4,035      20,175       932.7      61.2      00:08:40
 35410       4   4,035      16,140       946.7      62.1      00:08:26
 35927       8   4,035      32,280       961.0      63.1      00:08:12
 36413       4   4,035      16,140       974.6      64.0      00:07:59
 36805       9   4,035      36,315       985.1      64.7      00:07:51
 37193      10   4,035      40,350       995.3      65.3      00:07:42
 37518       6   4,035      24,210     1,003.7      65.9      00:07:36
 37824       9   4,035      36,315     1,011.7      66.4      00:07:31
 38137       5   4,035      20,175     1,020.2      67.0      00:07:25
 38432       9   4,035      36,315     1,028.5      67.5      00:07:19
 38720       6   4,035      24,210     1,036.4      68.0      00:07:13
 39017      10   4,035      40,350     1,044.5      68.6      00:07:07
 39315       8   4,035      32,280     1,052.4      69.1      00:07:01
 39731       7   4,035      28,245     1,063.3      69.8      00:06:52
 40193       5   4,035      20,175     1,075.7      70.6      00:06:40
 40693      10   4,035      40,350     1,089.4      71.5      00:06:27
 41103       6   4,035      24,210     1,100.7      72.2      00:06:17
 41433       8   4,035      32,280     1,109.6      72.8      00:06:10
 41760       5   4,035      20,175     1,118.6      73.4      00:06:03
 42074       5   4,035      20,175     1,127.0      74.0      00:05:56
 42432       7   4,035      28,245     1,136.5      74.6      00:05:48
 42745       9   4,035      36,315     1,144.7      75.1      00:05:41
 43040       4   4,035      16,140     1,152.8      75.7      00:05:35
 43331       4   4,035      16,140     1,161.0      76.2      00:05:28
 43649       4   4,035      16,140     1,169.5      76.8      00:05:21
 43978       6   4,035      24,210     1,178.3      77.3      00:05:14
 44285       7   4,035      28,245     1,186.5      77.9      00:05:07
 44603       3   4,035      12,105     1,194.9      78.4      00:05:00
 44935       8   4,035      32,280     1,203.9      79.0      00:04:52
 45322      10   4,035      40,350     1,213.8      79.7      00:04:44
 45672       4   4,035      16,140     1,222.7      80.2      00:04:36
 46076       7   4,035      28,245     1,233.5      81.0      00:04:26
 46470       7   4,035      28,245     1,244.1      81.7      00:04:16
 46887       8   4,035      32,280     1,255.7      82.4      00:04:06
 47252       4   4,035      16,140     1,264.7      83.0      00:03:58
 47617       4   4,035      16,140     1,274.1      83.6      00:03:49
 48024      10   4,035      40,350     1,285.1      84.3      00:03:39
 48449       7   4,035      28,245     1,296.4      85.1      00:03:29
 48849       4   4,035      16,140     1,307.2      85.8      00:03:19
 49354       7   4,035      28,245     1,320.8      86.7      00:03:06
 49676       2   4,035       8,070     1,328.7      87.2      00:02:59
 49990       9   4,035      36,315     1,336.9      87.7      00:02:52
 50341       7   4,035      28,245     1,346.0      88.3      00:02:44
 50696      10   4,035      40,350     1,355.3      89.0      00:02:35
 51037       7   4,035      28,245     1,364.9      89.6      00:02:27
 51390       6   4,035      24,210     1,374.3      90.2      00:02:18
 51727      10   4,035      40,350     1,383.8      90.8      00:02:09
 52073       6   4,035      24,210     1,393.5      91.5      00:02:01
 52421      10   4,035      40,350     1,403.6      92.1      00:01:51
 52755       9   4,035      36,315     1,413.5      92.8      00:01:42
 53106      10   4,035      40,350     1,423.5      93.4      00:01:33
 53537       7   4,035      28,245     1,435.5      94.2      00:01:22
 53905       9   4,035      36,315     1,445.7      94.9      00:01:12
 54257       6   4,035      24,210     1,455.1      95.5      00:01:04
 54658       7   4,035      28,245     1,465.4      96.2      00:00:54
 55018       5   4,035      20,175     1,475.0      96.8      00:00:45
 55369       6   4,035      24,210     1,483.9      97.4      00:00:37
 55709       9   4,035      36,315     1,492.8      98.0      00:00:29
 56057       7   4,035      28,245     1,502.4      98.6      00:00:20
 56377       8   4,035      32,280     1,511.2      99.2      00:00:12
 56744       7   4,035      28,245     1,521.5      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1429.537
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_
> blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
