
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A100_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   424       5   4,135      20,675        10.0       0.6      00:25:49
   864       3   4,135      12,405        21.0       1.3      00:24:25
  1306       7   4,135      28,945        32.8       2.1      00:23:19
  1704       6   4,135      24,810        43.7       2.8      00:23:10
  2090       6   4,135      24,810        53.7       3.4      00:23:25
  2503      10   4,135      41,350        64.5       4.1      00:23:15
  2919       7   4,135      28,945        75.8       4.9      00:22:54
  3358       9   4,135      37,215        87.8       5.6      00:22:24
  3791       4   4,135      16,540        99.7       6.4      00:22:02
  4113      10   4,135      41,350       107.9       6.9      00:22:29
  4486       3   4,135      12,405       117.5       7.5      00:22:34
  4832       8   4,135      33,080       127.0       8.1      00:22:37
  5133       9   4,135      37,215       135.0       8.6      00:22:55
  5445       6   4,135      24,810       143.5       9.2      00:23:06
  5724       5   4,135      20,675       150.3       9.6      00:23:30
  5989      10   4,135      41,350       157.3      10.1      00:23:50
  6259       8   4,135      33,080       164.6      10.5      00:24:05
  6545       9   4,135      37,215       171.9      11.0      00:24:17
  6825       8   4,135      33,080       179.3      11.5      00:24:27
  7121       8   4,135      33,080       187.1      12.0      00:24:31
  7492       7   4,135      28,945       197.0      12.6      00:24:17
  7872       6   4,135      24,810       207.4      13.3      00:23:59
  8286       8   4,135      33,080       219.1      14.0      00:23:31
  8651       8   4,135      33,080       229.5      14.7      00:23:15
  8964       6   4,135      24,810       238.3      15.3      00:23:10
  9270      10   4,135      41,350       247.0      15.8      00:23:06
  9586       6   4,135      24,810       256.0      16.4      00:22:59
  9924       9   4,135      37,215       265.5      17.0      00:22:49
 10242       8   4,135      33,080       273.5      17.5      00:22:48
 10536       3   4,135      12,405       281.3      18.0      00:22:47
 10902       6   4,135      24,810       291.1      18.6      00:22:35
 11227       8   4,135      33,080       299.8      19.2      00:22:29
 11498       9   4,135      37,215       307.1      19.7      00:22:30
 11782       9   4,135      37,215       314.7      20.2      00:22:29
 12106      10   4,135      41,350       323.6      20.7      00:22:21
 12514       9   4,135      37,215       334.5      21.4      00:22:02
 12889       9   4,135      37,215       344.4      22.1      00:21:50
 13303       8   4,135      33,080       355.5      22.8      00:21:31
 13684       2   4,135       8,270       366.5      23.5      00:21:14
 13956       7   4,135      28,945       373.7      23.9      00:21:13
 14244       7   4,135      28,945       381.6      24.4      00:21:10
 14590      10   4,135      41,350       391.3      25.1      00:20:58
 14952       6   4,135      24,810       401.2      25.7      00:20:46
 15415       2   4,135       8,270       414.2      26.5      00:20:21
 15816       5   4,135      20,675       425.3      27.2      00:20:04
 16256       5   4,135      20,675       437.9      28.0      00:19:42
 16578       4   4,135      16,540       447.0      28.6      00:19:34
 16884       8   4,135      33,080       455.3      29.2      00:19:28
 17185       9   4,135      37,215       463.6      29.7      00:19:22
 17458       7   4,135      28,945       471.4      30.2      00:19:18
 17697       1   4,135       4,135       478.4      30.6      00:19:17
 18038       7   4,135      28,945       487.5      31.2      00:19:07
 18335       8   4,135      33,080       495.9      31.8      00:19:01
 18569       9   4,135      37,215       502.0      32.2      00:19:01
 18809       7   4,135      28,945       508.9      32.6      00:18:59
 19065       7   4,135      28,945       516.3      33.1      00:18:55
 19387       7   4,135      28,945       525.4      33.6      00:18:46
 19794       6   4,135      24,810       537.3      34.4      00:18:27
 20185       8   4,135      33,080       548.6      35.1      00:18:11
 20550       9   4,135      37,215       558.7      35.8      00:17:59
 20779       9   4,135      37,215       565.2      36.2      00:17:57
 21033       6   4,135      24,810       572.3      36.7      00:17:53
 21411      10   4,135      41,350       581.9      37.3      00:17:42
 21772      10   4,135      41,350       591.2      37.9      00:17:32
 22085       7   4,135      28,945       599.5      38.4      00:17:25
 22418       5   4,135      20,675       607.9      38.9      00:17:17
 22749      10   4,135      41,350       616.6      39.5      00:17:08
 23086      10   4,135      41,350       625.5      40.1      00:16:59
 23397       7   4,135      28,945       634.0      40.6      00:16:51
 23732       8   4,135      33,080       642.7      41.2      00:16:43
 24036       6   4,135      24,810       651.0      41.7      00:16:35
 24488       9   4,135      37,215       662.8      42.4      00:16:18
 24949       1   4,135       4,135       675.2      43.2      00:15:60
 25396       7   4,135      28,945       687.7      44.0      00:15:42
 25760       4   4,135      16,540       697.6      44.7      00:15:30
 26079       4   4,135      16,540       706.4      45.2      00:15:21
 26375       3   4,135      12,405       714.5      45.8      00:15:14
 26693      10   4,135      41,350       722.8      46.3      00:15:07
 26971       4   4,135      16,540       730.4      46.8      00:15:00
 27248       5   4,135      20,675       737.9      47.3      00:14:54
 27550       6   4,135      24,810       746.3      47.8      00:14:46
 27915      10   4,135      41,350       756.5      48.5      00:14:34
 28313       8   4,135      33,080       767.6      49.2      00:14:20
 28692       3   4,135      12,405       778.4      49.9      00:14:06
 28969       5   4,135      20,675       786.4      50.4      00:13:59
 29305       6   4,135      24,810       795.5      51.0      00:13:49
 29652       5   4,135      20,675       805.2      51.6      00:13:38
 29968       9   4,135      37,215       814.0      52.1      00:13:29
 30306       7   4,135      28,945       823.5      52.7      00:13:19
 30632       4   4,135      16,540       832.8      53.3      00:13:09
 31040       6   4,135      24,810       844.1      54.1      00:12:54
 31477      10   4,135      41,350       856.7      54.9      00:12:38
 31872      10   4,135      41,350       868.0      55.6      00:12:24
 32257       6   4,135      24,810       879.3      56.3      00:12:10
 32575       7   4,135      28,945       888.5      56.9      00:12:01
 32765      10   4,135      41,350       893.9      57.3      00:11:58
 33005       9   4,135      37,215       900.8      57.7      00:11:53
 33265      10   4,135      41,350       908.2      58.2      00:11:46
 33546       3   4,135      12,405       916.3      58.7      00:11:38
 33934       6   4,135      24,810       927.5      59.4      00:11:25
 34308      10   4,135      41,350       938.4      60.1      00:11:12
 34731      10   4,135      41,350       950.5      60.9      00:10:57
 35122       7   4,135      28,945       961.7      61.6      00:10:43
 35502       8   4,135      33,080       972.8      62.3      00:10:30
 35895       6   4,135      24,810       983.9      63.0      00:10:17
 36317       7   4,135      28,945       996.0      63.8      00:10:03
 36687       2   4,135       8,270     1,006.4      64.5      00:09:51
 37064       9   4,135      37,215     1,016.7      65.1      00:09:40
 37343       9   4,135      37,215     1,023.9      65.6      00:09:33
 37599       7   4,135      28,945     1,030.8      66.0      00:09:27
 37883       6   4,135      24,810     1,038.4      66.5      00:09:20
 38173       6   4,135      24,810     1,046.6      67.0      00:09:12
 38498      10   4,135      41,350     1,055.9      67.6      00:09:02
 38938       5   4,135      20,675     1,068.1      68.4      00:08:47
 39259       7   4,135      28,945     1,076.9      69.0      00:08:38
 39599      10   4,135      41,350     1,086.2      69.6      00:08:28
 39950      10   4,135      41,350     1,095.8      70.2      00:08:18
 40397       5   4,135      20,675     1,107.9      71.0      00:08:04
 40793       6   4,135      24,810     1,119.2      71.7      00:07:51
 41105       9   4,135      37,215     1,128.0      72.2      00:07:42
 41398       6   4,135      24,810     1,136.1      72.8      00:07:34
 41714       8   4,135      33,080     1,145.0      73.3      00:07:24
 41990       6   4,135      24,810     1,152.9      73.8      00:07:17
 42290       4   4,135      16,540     1,160.6      74.3      00:07:09
 42575       7   4,135      28,945     1,168.5      74.8      00:07:01
 42896       9   4,135      37,215     1,177.3      75.4      00:06:52
 43196      10   4,135      41,350     1,186.0      76.0      00:06:43
 43458       6   4,135      24,810     1,193.5      76.4      00:06:35
 43748      10   4,135      41,350     1,201.1      76.9      00:06:28
 44083       8   4,135      33,080     1,210.4      77.5      00:06:18
 44387       7   4,135      28,945     1,218.5      78.0      00:06:09
 44784       8   4,135      33,080     1,229.4      78.7      00:05:57
 45157       6   4,135      24,810     1,239.7      79.4      00:05:46
 45520       6   4,135      24,810     1,249.1      80.0      00:05:35
 45906       2   4,135       8,270     1,259.2      80.6      00:05:24
 46216      10   4,135      41,350     1,268.0      81.2      00:05:15
 46533       9   4,135      37,215     1,276.7      81.8      00:05:06
 46856       8   4,135      33,080     1,285.9      82.4      00:04:56
 47163       9   4,135      37,215     1,293.7      82.9      00:04:48
 47509       6   4,135      24,810     1,302.8      83.4      00:04:38
 47891       9   4,135      37,215     1,313.1      84.1      00:04:27
 48223      10   4,135      41,350     1,322.3      84.7      00:04:17
 48555      10   4,135      41,350     1,331.6      85.3      00:04:07
 48849       4   4,135      16,540     1,339.6      85.8      00:03:59
 49138      10   4,135      41,350     1,347.5      86.3      00:03:51
 49400       7   4,135      28,945     1,354.7      86.8      00:03:43
 49661      10   4,135      41,350     1,361.3      87.2      00:03:36
 49899       4   4,135      16,540     1,367.5      87.6      00:03:30
 50256       7   4,135      28,945     1,377.2      88.2      00:03:20
 50645       8   4,135      33,080     1,387.6      88.9      00:03:08
 50973      10   4,135      41,350     1,396.8      89.5      00:02:58
 51349       8   4,135      33,080     1,407.2      90.1      00:02:47
 51688       9   4,135      37,215     1,417.0      90.8      00:02:36
 51971       6   4,135      24,810     1,425.0      91.3      00:02:28
 52228       8   4,135      33,080     1,432.7      91.8      00:02:19
 52624      10   4,135      41,350     1,444.5      92.5      00:02:06
 53062       7   4,135      28,945     1,457.5      93.4      00:01:52
 53466      10   4,135      41,350     1,469.1      94.1      00:01:39
 53851       6   4,135      24,810     1,480.0      94.8      00:01:28
 54181       5   4,135      20,675     1,489.1      95.4      00:01:18
 54534       5   4,135      20,675     1,498.3      96.0      00:01:08
 54943       6   4,135      24,810     1,509.4      96.7      00:00:56
 55276       7   4,135      28,945     1,518.4      97.3      00:00:46
 55601       7   4,135      28,945     1,526.7      97.8      00:00:37
 55907       7   4,135      28,945     1,535.4      98.3      00:00:28
 56194      10   4,135      41,350     1,543.4      98.9      00:00:19
 56497       4   4,135      16,540     1,552.2      99.4      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1687.955
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
