
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A500_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   256       7   4,535      31,745         6.6       0.4      00:43:07
   572       8   4,535      36,280        15.2       0.9      00:37:27
   918       6   4,535      27,210        24.6       1.4      00:34:19
  1231       6   4,535      27,210        33.9       2.0      00:33:01
  1551       2   4,535       9,070        43.5       2.5      00:32:03
  1858       8   4,535      36,280        52.5       3.1      00:31:40
  2175       9   4,535      40,815        61.6       3.6      00:31:17
  2485       4   4,535      18,140        70.4       4.1      00:31:08
  2806      10   4,535      45,350        80.0       4.7      00:30:38
  3127       4   4,535      18,140        89.4       5.2      00:30:17
  3427      10   4,535      45,350        98.7       5.8      00:30:00
  3738       9   4,535      40,815       107.9       6.3      00:29:46
  3999       6   4,535      27,210       115.2       6.7      00:30:04
  4214      10   4,535      45,350       121.4       7.1      00:30:36
  4443       9   4,535      40,815       127.7       7.5      00:31:04
  4668       9   4,535      40,815       134.6       7.9      00:31:18
  4884       7   4,535      31,745       141.0       8.2      00:31:37
  5111       6   4,535      27,210       147.6       8.6      00:31:52
  5340      10   4,535      45,350       154.4       9.0      00:32:00
  5557       5   4,535      22,675       160.3       9.4      00:32:19
  5744       9   4,535      40,815       165.6       9.7      00:32:45
  5967      10   4,535      45,350       172.1      10.1      00:32:53
  6200       7   4,535      31,745       178.9      10.5      00:32:54
  6408       7   4,535      31,745       184.8      10.8      00:33:07
  6641      10   4,535      45,350       191.5      11.2      00:33:09
  6879       6   4,535      27,210       198.4      11.6      00:33:08
  7122       3   4,535      13,605       205.3      12.0      00:33:05
  7403       2   4,535       9,070       213.5      12.5      00:32:48
  7691       5   4,535      22,675       222.0      13.0      00:32:30
  7961       6   4,535      27,210       230.5      13.5      00:32:12
  8232       7   4,535      31,745       238.9      14.0      00:31:55
  8505       9   4,535      40,815       247.4      14.5      00:31:37
  8771       7   4,535      31,745       255.5      14.9      00:31:24
  9020      10   4,535      45,350       263.2      15.4      00:31:14
  9231      10   4,535      45,350       269.9      15.8      00:31:13
  9387       8   4,535      36,280       274.6      16.0      00:31:27
  9587       8   4,535      36,280       281.0      16.4      00:31:28
  9788       7   4,535      31,745       287.4      16.8      00:31:27
 10020       7   4,535      31,745       294.1      17.2      00:31:24
 10241       6   4,535      27,210       300.0      17.5      00:31:26
 10448       2   4,535       9,070       306.2      17.9      00:31:26
 10699       3   4,535      13,605       313.5      18.3      00:31:17
 10950       9   4,535      40,815       320.8      18.8      00:31:08
 11188       7   4,535      31,745       327.8      19.2      00:31:01
 11394       9   4,535      40,815       333.9      19.5      00:31:01
 11606      10   4,535      45,350       340.1      19.9      00:30:59
 11829       8   4,535      36,280       346.8      20.3      00:30:53
 12052       6   4,535      27,210       353.4      20.7      00:30:48
 12257       8   4,535      36,280       359.6      21.0      00:30:46
 12554       8   4,535      36,280       368.3      21.5      00:30:27
 12860      10   4,535      45,350       377.0      22.0      00:30:09
 13146       9   4,535      40,815       385.5      22.5      00:29:53
 13435      10   4,535      45,350       394.3      23.0      00:29:34
 13665      10   4,535      45,350       401.6      23.5      00:29:25
 13871       8   4,535      36,280       407.6      23.8      00:29:23
 14117       4   4,535      18,140       414.8      24.2      00:29:14
 14377       7   4,535      31,745       423.0      24.7      00:29:00
 14627       7   4,535      31,745       430.5      25.2      00:28:50
 14884       7   4,535      31,745       438.2      25.6      00:28:38
 15180       8   4,535      36,280       447.5      26.2      00:28:18
 15483       8   4,535      36,280       456.5      26.7      00:28:00
 15781       7   4,535      31,745       465.6      27.2      00:27:43
 16074       7   4,535      31,745       474.9      27.8      00:27:24
 16371       9   4,535      40,815       484.1      28.3      00:27:06
 16619       5   4,535      22,675       491.6      28.7      00:26:56
 16833       6   4,535      27,210       498.1      29.1      00:26:51
 17036       9   4,535      40,815       504.4      29.5      00:26:47
 17256       3   4,535      13,605       510.9      29.9      00:26:41
 17460       6   4,535      27,210       517.4      30.2      00:26:36
 17659       6   4,535      27,210       523.7      30.6      00:26:31
 17937       7   4,535      31,745       531.9      31.1      00:26:18
 18250       6   4,535      27,210       541.6      31.6      00:25:59
 18533       6   4,535      27,210       549.8      32.1      00:25:46
 18727       6   4,535      27,210       555.9      32.5      00:25:41
 18931      10   4,535      45,350       562.3      32.9      00:25:36
 19151      10   4,535      45,350       569.3      33.3      00:25:28
 19398       8   4,535      36,280       576.9      33.7      00:25:17
 19674       6   4,535      27,210       585.7      34.2      00:25:02
 19969       5   4,535      22,675       595.1      34.8      00:24:45
 20269      10   4,535      45,350       604.4      35.3      00:24:28
 20528       8   4,535      36,280       612.4      35.8      00:24:17
 20730       9   4,535      40,815       618.6      36.2      00:24:12
 20934      10   4,535      45,350       625.1      36.5      00:24:05
 21164       6   4,535      27,210       631.6      36.9      00:23:59
 21401       7   4,535      31,745       638.1      37.3      00:23:53
 21629       4   4,535      18,140       644.7      37.7      00:23:46
 21852      10   4,535      45,350       651.1      38.0      00:23:40
 22064       7   4,535      31,745       657.1      38.4      00:23:35
 22310      10   4,535      45,350       663.9      38.8      00:23:27
 22547       6   4,535      27,210       670.7      39.2      00:23:19
 22777       6   4,535      27,210       677.2      39.6      00:23:13
 23067       9   4,535      40,815       685.7      40.1      00:22:59
 23355       6   4,535      27,210       694.4      40.6      00:22:45
 23663       9   4,535      40,815       703.0      41.1      00:22:31
 23967       7   4,535      31,745       712.1      41.6      00:22:16
 24274       8   4,535      36,280       720.9      42.1      00:22:02
 24562       5   4,535      22,675       729.4      42.6      00:21:48
 24857       7   4,535      31,745       738.2      43.1      00:21:34
 25135       6   4,535      27,210       746.7      43.6      00:21:22
 25430       7   4,535      31,745       755.5      44.2      00:21:08
 25657       5   4,535      22,675       762.1      44.5      00:21:01
 25865       8   4,535      36,280       768.6      44.9      00:20:54
 26060       8   4,535      36,280       774.5      45.3      00:20:49
 26296       7   4,535      31,745       781.6      45.7      00:20:40
 26562       8   4,535      36,280       789.3      46.1      00:20:29
 26808       9   4,535      40,815       796.5      46.5      00:20:20
 27052       9   4,535      40,815       803.8      47.0      00:20:11
 27262       8   4,535      36,280       810.1      47.3      00:20:04
 27462       9   4,535      40,815       816.1      47.7      00:19:58
 27694       5   4,535      22,675       823.2      48.1      00:19:49
 27974       3   4,535      13,605       831.8      48.6      00:19:36
 28287      10   4,535      45,350       841.4      49.2      00:19:20
 28600       9   4,535      40,815       851.4      49.8      00:19:04
 28811      10   4,535      45,350       857.9      50.1      00:18:57
 29005      10   4,535      45,350       863.9      50.5      00:18:50
 29254       7   4,535      31,745       871.3      50.9      00:18:41
 29503      10   4,535      45,350       879.0      51.4      00:18:30
 29761       6   4,535      27,210       886.8      51.8      00:18:19
 29962      10   4,535      45,350       892.9      52.2      00:18:13
 30156       6   4,535      27,210       899.0      52.5      00:18:07
 30398       5   4,535      22,675       906.3      53.0      00:17:57
 30652       6   4,535      27,210       914.3      53.4      00:17:46
 30973       9   4,535      40,815       924.2      54.0      00:17:30
 31283      10   4,535      45,350       933.8      54.6      00:17:15
 31583       6   4,535      27,210       943.2      55.1      00:17:00
 31908       6   4,535      27,210       953.6      55.7      00:16:43
 32208       9   4,535      40,815       963.2      56.3      00:16:28
 32488       9   4,535      40,815       972.2      56.8      00:16:15
 32648      10   4,535      45,350       977.1      57.1      00:16:11
 32836       6   4,535      27,210       982.9      57.4      00:16:05
 33023       8   4,535      36,280       988.9      57.8      00:15:59
 33243       3   4,535      13,605       995.8      58.2      00:15:50
 33472       9   4,535      40,815     1,002.9      58.6      00:15:41
 33705       9   4,535      40,815     1,010.4      59.0      00:15:31
 33964      10   4,535      45,350     1,018.6      59.5      00:15:20
 34218       7   4,535      31,745     1,026.8      60.0      00:15:09
 34523       4   4,535      18,140     1,036.3      60.6      00:14:54
 34829       7   4,535      31,745     1,046.1      61.1      00:14:39
 35134       7   4,535      31,745     1,055.7      61.7      00:14:25
 35431       7   4,535      31,745     1,065.1      62.2      00:14:11
 35740       9   4,535      40,815     1,074.6      62.8      00:13:57
 36047       5   4,535      22,675     1,084.2      63.4      00:13:43
 36342       9   4,535      40,815     1,093.6      63.9      00:13:29
 36599      10   4,535      45,350     1,101.5      64.4      00:13:19
 36809       7   4,535      31,745     1,107.7      64.7      00:13:12
 37028       4   4,535      18,140     1,114.3      65.1      00:13:04
 37247       3   4,535      13,605     1,120.5      65.5      00:12:57
 37465       2   4,535       9,070     1,126.8      65.9      00:12:49
 37674       9   4,535      40,815     1,132.9      66.2      00:12:42
 37891       8   4,535      36,280     1,139.5      66.6      00:12:34
 38090       9   4,535      40,815     1,145.6      66.9      00:12:27
 38330       5   4,535      22,675     1,153.1      67.4      00:12:17
 38590       9   4,535      40,815     1,161.2      67.9      00:12:06
 38903       8   4,535      36,280     1,170.8      68.4      00:11:52
 39121       5   4,535      22,675     1,177.4      68.8      00:11:44
 39345       9   4,535      40,815     1,184.1      69.2      00:11:36
 39612       7   4,535      31,745     1,192.0      69.7      00:11:25
 39876       7   4,535      31,745     1,199.8      70.1      00:11:15
 40184       5   4,535      22,675     1,209.1      70.7      00:11:02
 40477       8   4,535      36,280     1,218.1      71.2      00:10:49
 40795       6   4,535      27,210     1,227.9      71.8      00:10:35
 41027       3   4,535      13,605     1,235.2      72.2      00:10:26
 41235       6   4,535      27,210     1,241.5      72.6      00:10:18
 41471       6   4,535      27,210     1,248.7      73.0      00:10:09
 41708       9   4,535      40,815     1,256.0      73.4      00:09:59
 41946       1   4,535       4,535     1,263.5      73.8      00:09:50
 42184      10   4,535      45,350     1,270.1      74.2      00:09:42
 42376       9   4,535      40,815     1,275.9      74.6      00:09:35
 42574       7   4,535      31,745     1,281.8      74.9      00:09:28
 42755       8   4,535      36,280     1,287.2      75.2      00:09:21
 42952       6   4,535      27,210     1,293.2      75.6      00:09:14
 43140       8   4,535      36,280     1,299.4      75.9      00:09:07
 43322      10   4,535      45,350     1,305.0      76.3      00:08:60
 43519       9   4,535      40,815     1,310.9      76.6      00:08:53
 43789       8   4,535      36,280     1,318.9      77.1      00:08:42
 44031      10   4,535      45,350     1,326.3      77.5      00:08:32
 44225       8   4,535      36,280     1,332.1      77.8      00:08:25
 44443      10   4,535      45,350     1,338.4      78.2      00:08:17
 44675      10   4,535      45,350     1,345.5      78.6      00:08:08
 44890      10   4,535      45,350     1,352.1      79.0      00:07:59
 45124       7   4,535      31,745     1,358.9      79.4      00:07:50
 45369       8   4,535      36,280     1,365.7      79.8      00:07:42
 45566       8   4,535      36,280     1,371.5      80.1      00:07:35
 45779       3   4,535      13,605     1,377.6      80.5      00:07:27
 45986       7   4,535      31,745     1,383.9      80.9      00:07:19
 46204       8   4,535      36,280     1,390.6      81.3      00:07:10
 46449       7   4,535      31,745     1,398.0      81.7      00:07:00
 46710       7   4,535      31,745     1,406.1      82.2      00:06:49
 46971       8   4,535      36,280     1,413.7      82.6      00:06:39
 47183       9   4,535      40,815     1,419.6      83.0      00:06:31
 47403       7   4,535      31,745     1,426.1      83.3      00:06:23
 47613      10   4,535      45,350     1,432.2      83.7      00:06:15
 47818       6   4,535      27,210     1,438.3      84.1      00:06:07
 48004       6   4,535      27,210     1,444.0      84.4      00:05:60
 48206       6   4,535      27,210     1,449.9      84.7      00:05:52
 48432       7   4,535      31,745     1,456.9      85.1      00:05:43
 48653      10   4,535      45,350     1,463.6      85.5      00:05:34
 48870       7   4,535      31,745     1,470.1      85.9      00:05:26
 49066       5   4,535      22,675     1,476.0      86.3      00:05:18
 49278      10   4,535      45,350     1,482.5      86.6      00:05:09
 49521       8   4,535      36,280     1,489.4      87.0      00:05:00
 49769       8   4,535      36,280     1,496.3      87.4      00:04:51
 49982       8   4,535      36,280     1,502.7      87.8      00:04:42
 50207       7   4,535      31,745     1,509.3      88.2      00:04:34
 50446       6   4,535      27,210     1,516.0      88.6      00:04:25
 50686       9   4,535      40,815     1,523.4      89.0      00:04:15
 50912       9   4,535      40,815     1,530.5      89.4      00:04:05
 51139       9   4,535      40,815     1,537.5      89.8      00:03:56
 51376       7   4,535      31,745     1,544.7      90.3      00:03:46
 51602       8   4,535      36,280     1,551.8      90.7      00:03:36
 51818       5   4,535      22,675     1,558.6      91.1      00:03:27
 52071       7   4,535      31,745     1,566.6      91.6      00:03:16
 52361       9   4,535      40,815     1,576.1      92.1      00:03:03
 52653       6   4,535      27,210     1,585.8      92.7      00:02:50
 52949       7   4,535      31,745     1,595.3      93.2      00:02:37
 53246       8   4,535      36,280     1,604.8      93.8      00:02:24
 53544       8   4,535      36,280     1,614.2      94.3      00:02:11
 53783       6   4,535      27,210     1,621.5      94.8      00:02:01
 53998       7   4,535      31,745     1,628.0      95.1      00:01:52
 54196      10   4,535      45,350     1,634.0      95.5      00:01:44
 54410       9   4,535      40,815     1,640.2      95.9      00:01:36
 54671       9   4,535      40,815     1,647.8      96.3      00:01:26
 54936       6   4,535      27,210     1,655.7      96.8      00:01:15
 55186       7   4,535      31,745     1,663.0      97.2      00:01:05
 55425       6   4,535      27,210     1,669.8      97.6      00:00:56
 55656       3   4,535      13,605     1,676.6      98.0      00:00:47
 55871       6   4,535      27,210     1,683.2      98.4      00:00:38
 56103       5   4,535      22,675     1,690.3      98.8      00:00:28
 56326       7   4,535      31,745     1,697.4      99.2      00:00:19
 56591       9   4,535      40,815     1,705.7      99.7      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 2318.868
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
