
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A500_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   211       2   4,535       9,070         5.5       0.3      00:52:05
   438       5   4,535      22,675        11.4       0.7      00:49:46
   674       6   4,535      27,210        17.9       1.0      00:47:18
   898       4   4,535      18,140        24.1       1.4      00:46:51
  1105      10   4,535      45,350        30.1       1.8      00:46:33
  1308       8   4,535      36,280        36.2       2.1      00:46:21
  1504       6   4,535      27,210        42.2       2.5      00:46:15
  1716      10   4,535      45,350        48.5       2.8      00:45:47
  1937       9   4,535      40,815        54.6       3.2      00:45:36
  2165       9   4,535      40,815        61.3       3.6      00:44:57
  2387       9   4,535      40,815        67.7       4.0      00:44:35
  2624       6   4,535      27,210        74.5       4.4      00:44:01
  2852      10   4,535      45,350        81.4       4.8      00:43:27
  3091       6   4,535      27,210        88.2       5.2      00:43:03
  3326       3   4,535      13,605        95.5       5.6      00:42:22
  3543       8   4,535      36,280       102.1       6.0      00:42:07
  3766      10   4,535      45,350       108.8       6.4      00:41:48
  3963       6   4,535      27,210       114.2       6.7      00:42:03
  4129       9   4,535      40,815       119.0       7.0      00:42:30
  4325       4   4,535      18,140       124.3       7.3      00:42:39
  4518       7   4,535      31,745       130.0       7.6      00:42:42
  4673       6   4,535      27,210       134.8       7.9      00:42:60
  4863       8   4,535      36,280       140.4       8.2      00:43:01
  5040      10   4,535      45,350       145.6       8.5      00:43:07
  5214      10   4,535      45,350       150.7       8.8      00:43:15
  5397       8   4,535      36,280       156.2       9.1      00:43:15
  5570      10   4,535      45,350       160.7       9.4      00:43:32
  5742      10   4,535      45,350       165.5       9.7      00:43:42
  5927      10   4,535      45,350       171.0      10.0      00:43:40
  6117      10   4,535      45,350       176.6      10.3      00:43:35
  6306       6   4,535      27,210       181.9      10.6      00:43:33
  6495      10   4,535      45,350       187.3      10.9      00:43:30
  6669       6   4,535      27,210       192.3      11.2      00:43:34
  6841       6   4,535      27,210       197.3      11.5      00:43:37
  7006       6   4,535      27,210       202.0      11.8      00:43:42
  7199       4   4,535      18,140       207.4      12.1      00:43:38
  7384       4   4,535      18,140       213.0      12.4      00:43:30
  7572       8   4,535      36,280       218.5      12.8      00:43:23
  7762       8   4,535      36,280       224.1      13.1      00:43:15
  7947       8   4,535      36,280       230.0      13.4      00:43:03
  8131       9   4,535      40,815       235.8      13.8      00:42:53
  8310       6   4,535      27,210       241.4      14.1      00:42:45
  8501       7   4,535      31,745       247.3      14.5      00:42:32
  8699       5   4,535      22,675       253.3      14.8      00:42:20
  8882      10   4,535      45,350       259.0      15.1      00:42:10
  9061       7   4,535      31,745       264.5      15.5      00:42:03
  9205       6   4,535      27,210       269.1      15.7      00:42:06
  9304       8   4,535      36,280       272.1      15.9      00:42:26
  9400       7   4,535      31,745       275.0      16.1      00:42:46
  9528       8   4,535      36,280       279.1      16.3      00:42:53
  9681       9   4,535      40,815       284.1      16.6      00:42:49
  9845       8   4,535      36,280       289.1      16.9      00:42:45
  9985       8   4,535      36,280       293.1      17.1      00:42:52
 10148       8   4,535      36,280       297.5      17.4      00:42:54
 10308       9   4,535      40,815       302.0      17.6      00:42:54
 10465       6   4,535      27,210       306.7      17.9      00:42:52
 10632      10   4,535      45,350       311.4      18.2      00:42:50
 10788      10   4,535      45,350       315.9      18.5      00:42:49
 10936       7   4,535      31,745       320.4      18.7      00:42:49
 11097       7   4,535      31,745       325.1      19.0      00:42:46
 11244       7   4,535      31,745       329.4      19.2      00:42:47
 11368       4   4,535      18,140       333.1      19.5      00:42:53
 11499       7   4,535      31,745       337.1      19.7      00:42:56
 11656       6   4,535      27,210       341.6      20.0      00:42:54
 11794       8   4,535      36,280       345.7      20.2      00:42:55
 11933       6   4,535      27,210       349.8      20.4      00:42:57
 12058       7   4,535      31,745       353.6      20.7      00:43:00
 12191       6   4,535      27,210       357.7      20.9      00:43:01
 12371       8   4,535      36,280       362.9      21.2      00:42:52
 12608       7   4,535      31,745       369.9      21.6      00:42:26
 12830       4   4,535      18,140       376.1      22.0      00:42:08
 13061       5   4,535      22,675       382.9      22.4      00:41:45
 13283       6   4,535      27,210       389.5      22.8      00:41:24
 13473       7   4,535      31,745       395.6      23.1      00:41:08
 13601      10   4,535      45,350       399.7      23.4      00:41:08
 13731       9   4,535      40,815       403.5      23.6      00:41:11
 13854       9   4,535      40,815       407.2      23.8      00:41:14
 13984       9   4,535      40,815       410.9      24.0      00:41:16
 14143       5   4,535      22,675       415.7      24.3      00:41:10
 14310       9   4,535      40,815       420.9      24.6      00:41:00
 14470       5   4,535      22,675       425.8      24.9      00:40:52
 14653       8   4,535      36,280       431.3      25.2      00:40:41
 14834       6   4,535      27,210       436.7      25.5      00:40:30
 15044       8   4,535      36,280       443.2      25.9      00:40:11
 15201       7   4,535      31,745       448.2      26.2      00:40:03
 15412       6   4,535      27,210       454.4      26.6      00:39:45
 15594       6   4,535      27,210       459.8      26.9      00:39:35
 15746      10   4,535      45,350       464.5      27.1      00:39:29
 15924       5   4,535      22,675       470.1      27.5      00:39:17
 16124       6   4,535      27,210       476.5      27.8      00:38:59
 16297       8   4,535      36,280       481.8      28.2      00:38:49
 16479       6   4,535      27,210       487.6      28.5      00:38:35
 16613       5   4,535      22,675       491.4      28.7      00:38:35
 16739       8   4,535      36,280       495.3      28.9      00:38:34
 16875       6   4,535      27,210       499.3      29.2      00:38:32
 16984       6   4,535      27,210       502.8      29.4      00:38:34
 17123       5   4,535      22,675       506.9      29.6      00:38:31
 17268      10   4,535      45,350       511.3      29.9      00:38:26
 17390       6   4,535      27,210       515.2      30.1      00:38:25
 17491      10   4,535      45,350       518.5      30.3      00:38:27
 17616       7   4,535      31,745       522.4      30.5      00:38:25
 17782       6   4,535      27,210       527.2      30.8      00:38:18
 17976       8   4,535      36,280       533.1      31.2      00:38:03
 18175       8   4,535      36,280       539.3      31.5      00:37:47
 18377       2   4,535       9,070       545.3      31.9      00:37:32
 18549       7   4,535      31,745       550.3      32.2      00:37:23
 18690       7   4,535      31,745       554.8      32.4      00:37:17
 18837       5   4,535      22,675       559.3      32.7      00:37:11
 18987       7   4,535      31,745       564.1      33.0      00:37:03
 19123       7   4,535      31,745       568.4      33.2      00:36:59
 19246       6   4,535      27,210       572.2      33.4      00:36:56
 19423       7   4,535      31,745       577.7      33.8      00:36:44
 19622       8   4,535      36,280       583.9      34.1      00:36:28
 19803       6   4,535      27,210       589.8      34.5      00:36:14
 20009      10   4,535      45,350       596.5      34.9      00:35:56
 20195       4   4,535      18,140       602.3      35.2      00:35:42
 20386       5   4,535      22,675       608.0      35.5      00:35:29
 20539       6   4,535      27,210       612.8      35.8      00:35:21
 20672       5   4,535      22,675       616.9      36.1      00:35:17
 20774       9   4,535      40,815       620.0      36.2      00:35:18
 20877      10   4,535      45,350       623.3      36.4      00:35:18
 20995       4   4,535      18,140       626.8      36.6      00:35:17
 21160       1   4,535       4,535       631.5      36.9      00:35:11
 21311      10   4,535      45,350       635.4      37.1      00:35:07
 21428       7   4,535      31,745       638.9      37.3      00:35:06
 21549       7   4,535      31,745       642.6      37.6      00:35:03
 21649       8   4,535      36,280       645.3      37.7      00:35:05
 21769       8   4,535      36,280       648.6      37.9      00:35:05
 21884       8   4,535      36,280       652.0      38.1      00:35:04
 22024      10   4,535      45,350       656.1      38.3      00:34:59
 22163       4   4,535      18,140       659.7      38.6      00:34:56
 22307       5   4,535      22,675       663.9      38.8      00:34:50
 22434      10   4,535      45,350       667.4      39.0      00:34:48
 22540       5   4,535      22,675       670.5      39.2      00:34:47
 22677       4   4,535      18,140       674.6      39.4      00:34:42
 22857       9   4,535      40,815       679.4      39.7      00:34:33
 23041       4   4,535      18,140       684.9      40.0      00:34:20
 23228       4   4,535      18,140       690.6      40.4      00:34:07
 23418       8   4,535      36,280       696.2      40.7      00:33:54
 23596       7   4,535      31,745       701.0      41.0      00:33:45
 23750       6   4,535      27,210       705.7      41.2      00:33:37
 23906       5   4,535      22,675       710.4      41.5      00:33:28
 24063       7   4,535      31,745       715.1      41.8      00:33:20
 24276       2   4,535       9,070       720.9      42.1      00:33:05
 24457       8   4,535      36,280       726.2      42.4      00:32:54
 24645       5   4,535      22,675       732.0      42.8      00:32:40
 24840       7   4,535      31,745       737.8      43.1      00:32:27
 25031       7   4,535      31,745       743.4      43.4      00:32:14
 25211       4   4,535      18,140       748.9      43.8      00:32:02
 25406       5   4,535      22,675       754.8      44.1      00:31:48
 25597       5   4,535      22,675       760.3      44.4      00:31:36
 25727       6   4,535      27,210       764.4      44.7      00:31:30
 25829       6   4,535      27,210       767.6      44.9      00:31:28
 25959       8   4,535      36,280       771.4      45.1      00:31:23
 26083       8   4,535      36,280       775.2      45.3      00:31:18
 26241      10   4,535      45,350       780.1      45.6      00:31:09
 26411       5   4,535      22,675       784.8      45.9      00:31:00
 26545       8   4,535      36,280       788.8      46.1      00:30:54
 26709       8   4,535      36,280       793.5      46.4      00:30:46
 26853      10   4,535      45,350       797.9      46.6      00:30:38
 27004       7   4,535      31,745       802.5      46.9      00:30:30
 27120       8   4,535      36,280       805.9      47.1      00:30:27
 27243       6   4,535      27,210       809.5      47.3      00:30:22
 27381      10   4,535      45,350       813.6      47.5      00:30:16
 27502       9   4,535      40,815       817.4      47.8      00:30:11
 27637       7   4,535      31,745       821.4      48.0      00:30:05
 27772       7   4,535      31,745       825.5      48.2      00:29:58
 27957       5   4,535      22,675       831.3      48.6      00:29:45
 28128       6   4,535      27,210       836.5      48.9      00:29:34
 28342       8   4,535      36,280       843.1      49.3      00:29:17
 28485      10   4,535      45,350       847.7      49.5      00:29:08
 28649       8   4,535      36,280       852.8      49.8      00:28:58
 28758       9   4,535      40,815       856.3      50.0      00:28:54
 28887       7   4,535      31,745       860.2      50.3      00:28:48
 28996       4   4,535      18,140       863.6      50.5      00:28:44
 29100       5   4,535      22,675       866.8      50.7      00:28:41
 29250       5   4,535      22,675       871.2      50.9      00:28:33
 29373      10   4,535      45,350       875.1      51.1      00:28:27
 29527       7   4,535      31,745       879.7      51.4      00:28:18
 29676       8   4,535      36,280       884.1      51.7      00:28:10
 29796       9   4,535      40,815       887.9      51.9      00:28:05
 29914       8   4,535      36,280       891.5      52.1      00:27:60
 30013       5   4,535      22,675       894.5      52.3      00:27:57
 30116       8   4,535      36,280       897.6      52.5      00:27:54
 30243      10   4,535      45,350       901.5      52.7      00:27:48
 30339       7   4,535      31,745       904.5      52.9      00:27:45
 30455       7   4,535      31,745       908.2      53.1      00:27:40
 30576       7   4,535      31,745       912.0      53.3      00:27:34
 30760       7   4,535      31,745       917.6      53.6      00:27:21
 30973       9   4,535      40,815       924.2      54.0      00:27:04
 31161       6   4,535      27,210       929.9      54.3      00:26:51
 31336       4   4,535      18,140       935.4      54.7      00:26:39
 31479      10   4,535      45,350       940.0      54.9      00:26:29
 31642       4   4,535      18,140       945.0      55.2      00:26:19
 31832      10   4,535      45,350       951.1      55.6      00:26:04
 32011      10   4,535      45,350       956.9      55.9      00:25:51
 32201       6   4,535      27,210       963.0      56.3      00:25:36
 32380       9   4,535      40,815       968.8      56.6      00:25:23
 32531       6   4,535      27,210       973.5      56.9      00:25:14
 32654       4   4,535      18,140       977.2      57.1      00:25:08
 32779       7   4,535      31,745       981.3      57.3      00:25:01
 32897       8   4,535      36,280       984.9      57.6      00:24:55
 33012      10   4,535      45,350       988.6      57.8      00:24:49
 33121       5   4,535      22,675       992.1      58.0      00:24:44
 33262       7   4,535      31,745       996.4      58.2      00:24:36
 33419       7   4,535      31,745     1,001.3      58.5      00:24:26
 33557       9   4,535      40,815     1,005.7      58.8      00:24:18
 33723       6   4,535      27,210     1,010.9      59.1      00:24:06
 33899       7   4,535      31,745     1,016.5      59.4      00:23:54
 34073       9   4,535      40,815     1,022.1      59.7      00:23:41
 34260       6   4,535      27,210     1,028.1      60.1      00:23:27
 34435      10   4,535      45,350     1,033.6      60.4      00:23:15
 34633       7   4,535      31,745     1,039.8      60.8      00:23:01
 34847       7   4,535      31,745     1,046.7      61.2      00:22:44
 35065      10   4,535      45,350     1,053.5      61.6      00:22:27
 35284       8   4,535      36,280     1,060.5      62.0      00:22:10
 35508       6   4,535      27,210     1,067.6      62.4      00:21:53
 35733       4   4,535      18,140     1,074.4      62.8      00:21:37
 35953      10   4,535      45,350     1,081.3      63.2      00:21:20
 36173       9   4,535      40,815     1,088.2      63.6      00:21:04
 36393       4   4,535      18,140     1,095.1      64.0      00:20:48
 36574       9   4,535      40,815     1,100.7      64.3      00:20:36
 36700       9   4,535      40,815     1,104.5      64.5      00:20:30
 36845      10   4,535      45,350     1,108.8      64.8      00:20:21
 37001       9   4,535      40,815     1,113.5      65.1      00:20:12
 37151       7   4,535      31,745     1,117.8      65.3      00:20:04
 37267       6   4,535      27,210     1,121.1      65.5      00:19:59
 37413       2   4,535       9,070     1,125.3      65.8      00:19:51
 37564      10   4,535      45,350     1,129.8      66.0      00:19:43
 37717       7   4,535      31,745     1,134.2      66.3      00:19:34
 37887       5   4,535      22,675     1,139.4      66.6      00:19:23
 38048       4   4,535      18,140     1,144.4      66.9      00:19:13
 38193       8   4,535      36,280     1,148.9      67.1      00:19:05
 38342       6   4,535      27,210     1,153.5      67.4      00:18:55
 38476       2   4,535       9,070     1,157.7      67.7      00:18:47
 38669       7   4,535      31,745     1,163.6      68.0      00:18:35
 38854       7   4,535      31,745     1,169.3      68.3      00:18:22
 38976       7   4,535      31,745     1,173.1      68.6      00:18:16
 39099       8   4,535      36,280     1,176.8      68.8      00:18:09
 39198       3   4,535      13,605     1,179.6      68.9      00:18:06
 39307       7   4,535      31,745     1,182.9      69.1      00:18:00
 39458       8   4,535      36,280     1,187.3      69.4      00:17:52
 39578       8   4,535      36,280     1,191.0      69.6      00:17:45
 39730       7   4,535      31,745     1,195.4      69.9      00:17:37
 39910      10   4,535      45,350     1,200.9      70.2      00:17:25
 40094       5   4,535      22,675     1,206.4      70.5      00:17:13
 40272       8   4,535      36,280     1,211.7      70.8      00:17:02
 40457       8   4,535      36,280     1,217.5      71.1      00:16:49
 40658       8   4,535      36,280     1,223.7      71.5      00:16:36
 40863       9   4,535      40,815     1,230.0      71.9      00:16:21
 40996       8   4,535      36,280     1,234.3      72.1      00:16:13
 41111       9   4,535      40,815     1,237.7      72.3      00:16:07
 41201       8   4,535      36,280     1,240.5      72.5      00:16:03
 41313       4   4,535      18,140     1,243.9      72.7      00:15:58
 41425       8   4,535      36,280     1,247.3      72.9      00:15:52
 41577       6   4,535      27,210     1,252.0      73.2      00:15:42
 41708       9   4,535      40,815     1,256.0      73.4      00:15:35
 41853       9   4,535      40,815     1,260.5      73.7      00:15:26
 42006       4   4,535      18,140     1,265.1      73.9      00:15:17
 42156       7   4,535      31,745     1,269.3      74.2      00:15:08
 42285       7   4,535      31,745     1,273.0      74.4      00:15:02
 42381       7   4,535      31,745     1,276.1      74.6      00:14:57
 42471      10   4,535      45,350     1,278.9      74.7      00:14:52
 42584       5   4,535      22,675     1,282.1      74.9      00:14:47
 42707       5   4,535      22,675     1,285.7      75.1      00:14:40
 42808       9   4,535      40,815     1,288.9      75.3      00:14:35
 42917       5   4,535      22,675     1,292.2      75.5      00:14:29
 43009       9   4,535      40,815     1,295.1      75.7      00:14:24
 43112       9   4,535      40,815     1,298.4      75.9      00:14:18
 43229       8   4,535      36,280     1,302.1      76.1      00:14:11
 43349       8   4,535      36,280     1,305.9      76.3      00:14:04
 43483       7   4,535      31,745     1,310.0      76.6      00:13:56
 43667       8   4,535      36,280     1,315.2      76.9      00:13:45
 43822       6   4,535      27,210     1,319.9      77.1      00:13:35
 44012      10   4,535      45,350     1,325.7      77.5      00:13:23
 44128       2   4,535       9,070     1,329.1      77.7      00:13:17
 44258       7   4,535      31,745     1,333.1      77.9      00:13:09
 44405       8   4,535      36,280     1,337.2      78.1      00:13:00
 44507       6   4,535      27,210     1,340.4      78.3      00:12:55
 44644       9   4,535      40,815     1,344.5      78.6      00:12:46
 44814       6   4,535      27,210     1,349.7      78.9      00:12:35
 44945       7   4,535      31,745     1,353.7      79.1      00:12:27
 45081       3   4,535      13,605     1,357.7      79.3      00:12:20
 45258       9   4,535      40,815     1,362.7      79.6      00:12:09
 45363       3   4,535      13,605     1,365.6      79.8      00:12:04
 45479       8   4,535      36,280     1,369.1      80.0      00:11:57
 45599       5   4,535      22,675     1,372.4      80.2      00:11:51
 45747      10   4,535      45,350     1,376.6      80.5      00:11:43
 45844       9   4,535      40,815     1,379.4      80.6      00:11:38
 45965       9   4,535      40,815     1,383.2      80.8      00:11:30
 46105       8   4,535      36,280     1,387.5      81.1      00:11:22
 46228       7   4,535      31,745     1,391.4      81.3      00:11:14
 46361       7   4,535      31,745     1,395.4      81.5      00:11:06
 46497      10   4,535      45,350     1,399.5      81.8      00:10:57
 46642       6   4,535      27,210     1,404.0      82.0      00:10:48
 46831       7   4,535      31,745     1,409.8      82.4      00:10:35
 46979       5   4,535      22,675     1,414.0      82.6      00:10:27
 47115       9   4,535      40,815     1,417.7      82.8      00:10:19
 47224       4   4,535      18,140     1,420.9      83.0      00:10:13
 47348       8   4,535      36,280     1,424.5      83.2      00:10:06
 47493       8   4,535      36,280     1,428.6      83.5      00:09:58
 47613      10   4,535      45,350     1,432.2      83.7      00:09:51
 47728       9   4,535      40,815     1,435.7      83.9      00:09:44
 47845       9   4,535      40,815     1,439.0      84.1      00:09:37
 47979       7   4,535      31,745     1,443.3      84.3      00:09:28
 48110      10   4,535      45,350     1,447.1      84.6      00:09:21
 48259       5   4,535      22,675     1,451.7      84.8      00:09:11
 48399       7   4,535      31,745     1,455.9      85.1      00:09:02
 48501       8   4,535      36,280     1,459.0      85.3      00:08:56
 48649       9   4,535      40,815     1,463.5      85.5      00:08:47
 48797      10   4,535      45,350     1,467.9      85.8      00:08:38
 48908       8   4,535      36,280     1,471.3      86.0      00:08:31
 49020       8   4,535      36,280     1,474.5      86.2      00:08:24
 49144       9   4,535      40,815     1,478.6      86.4      00:08:16
 49247       4   4,535      18,140     1,481.6      86.6      00:08:10
 49337       7   4,535      31,745     1,484.2      86.7      00:08:05
 49474       5   4,535      22,675     1,488.0      87.0      00:07:57
 49618       2   4,535       9,070     1,492.0      87.2      00:07:49
 49742       8   4,535      36,280     1,495.5      87.4      00:07:42
 49865       5   4,535      22,675     1,499.0      87.6      00:07:35
 49973       9   4,535      40,815     1,502.4      87.8      00:07:28
 50108      10   4,535      45,350     1,506.4      88.0      00:07:19
 50217       9   4,535      40,815     1,509.6      88.2      00:07:13
 50339       6   4,535      27,210     1,512.8      88.4      00:07:06
 50448       7   4,535      31,745     1,516.1      88.6      00:06:60
 50554      10   4,535      45,350     1,519.4      88.8      00:06:53
 50660       9   4,535      40,815     1,522.5      89.0      00:06:47
 50785       7   4,535      31,745     1,526.5      89.2      00:06:38
 50896       8   4,535      36,280     1,530.0      89.4      00:06:31
 51025       6   4,535      27,210     1,534.2      89.7      00:06:22
 51152       6   4,535      27,210     1,537.8      89.9      00:06:15
 51290      10   4,535      45,350     1,542.1      90.1      00:06:06
 51476      10   4,535      45,350     1,547.8      90.5      00:05:53
 51675       9   4,535      40,815     1,554.2      90.8      00:05:39
 51877      10   4,535      45,350     1,560.4      91.2      00:05:25
 52118      10   4,535      45,350     1,568.3      91.6      00:05:07
 52305       6   4,535      27,210     1,574.2      92.0      00:04:54
 52498       6   4,535      27,210     1,580.6      92.4      00:04:40
 52686       7   4,535      31,745     1,587.0      92.7      00:04:26
 52867       5   4,535      22,675     1,592.9      93.1      00:04:13
 52994       7   4,535      31,745     1,596.9      93.3      00:04:05
 53209       9   4,535      40,815     1,603.6      93.7      00:03:50
 53419       7   4,535      31,745     1,610.2      94.1      00:03:36
 53617       8   4,535      36,280     1,616.4      94.5      00:03:22
 53733       6   4,535      27,210     1,620.0      94.7      00:03:15
 53826       8   4,535      36,280     1,622.8      94.8      00:03:09
 53914       7   4,535      31,745     1,625.4      95.0      00:03:04
 54023       7   4,535      31,745     1,628.7      95.2      00:02:57
 54138      10   4,535      45,350     1,632.2      95.4      00:02:49
 54250       6   4,535      27,210     1,635.6      95.6      00:02:42
 54372       7   4,535      31,745     1,639.1      95.8      00:02:35
 54531      10   4,535      45,350     1,643.4      96.0      00:02:26
 54671       9   4,535      40,815     1,647.8      96.3      00:02:16
 54819       4   4,535      18,140     1,652.0      96.5      00:02:07
 54950       7   4,535      31,745     1,656.1      96.8      00:01:59
 55061       5   4,535      22,675     1,659.3      97.0      00:01:52
 55163       2   4,535       9,070     1,662.2      97.1      00:01:45
 55278       3   4,535      13,605     1,665.6      97.3      00:01:38
 55398       5   4,535      22,675     1,669.0      97.5      00:01:31
 55511       9   4,535      40,815     1,672.2      97.7      00:01:24
 55638       9   4,535      40,815     1,676.1      97.9      00:01:16
 55759       8   4,535      36,280     1,679.7      98.2      00:01:08
 55885       8   4,535      36,280     1,683.7      98.4      00:00:60
 56046       5   4,535      22,675     1,688.5      98.7      00:00:49
 56201       9   4,535      40,815     1,693.5      99.0      00:00:38
 56421       7   4,535      31,745     1,700.5      99.4      00:00:23
 56536       5   4,535      22,675     1,704.0      99.6      00:00:16
 56698       8   4,535      36,280     1,709.0      99.9      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 3712.653
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
