
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A900.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A900.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A900.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A900.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   474       8   4,935      39,480        13.4       0.7      00:23:04
   989       6   4,935      29,610        28.9       1.5      00:21:12
  1469       7   4,935      34,545        44.5       2.4      00:20:26
  1946      10   4,935      49,350        59.5       3.2      00:20:14
  2427       5   4,935      24,675        74.7       4.0      00:19:59
  2909       7   4,935      34,545        90.1       4.8      00:19:42
  3390       6   4,935      29,610       105.9       5.7      00:19:23
  3882       6   4,935      29,610       121.8       6.5      00:19:06
  4300       9   4,935      44,415       134.4       7.2      00:19:19
  4675       9   4,935      44,415       146.5       7.9      00:19:33
  5046      10   4,935      49,350       158.5       8.5      00:19:45
  5384      10   4,935      49,350       169.4       9.1      00:20:02
  5766       7   4,935      34,545       180.7       9.7      00:20:13
  6130       7   4,935      34,545       192.3      10.3      00:20:19
  6520       7   4,935      34,545       204.4      11.0      00:20:19
  6896       8   4,935      39,480       216.2      11.6      00:20:21
  7297       6   4,935      29,610       228.6      12.3      00:20:18
  7705      10   4,935      49,350       241.8      13.0      00:20:09
  8098       7   4,935      34,545       255.2      13.7      00:19:60
  8504       8   4,935      39,480       269.0      14.4      00:19:47
  8904       6   4,935      29,610       282.4      15.2      00:19:38
  9279      10   4,935      49,350       295.1      15.8      00:19:31
  9601       7   4,935      34,545       306.0      16.4      00:19:33
  9922       7   4,935      34,545       316.8      17.0      00:19:34
 10247      10   4,935      49,350       326.6      17.5      00:19:39
 10568       5   4,935      24,675       336.8      18.1      00:19:41
 10934       8   4,935      39,480       348.4      18.7      00:19:36
 11278       7   4,935      34,545       359.3      19.3      00:19:34
 11567       7   4,935      34,545       368.6      19.8      00:19:38
 11863       8   4,935      39,480       378.3      20.3      00:19:40
 12183       5   4,935      24,675       388.7      20.9      00:19:38
 12551       9   4,935      44,415       400.6      21.5      00:19:31
 13013      10   4,935      49,350       414.9      22.3      00:19:14
 13471       8   4,935      39,480       430.1      23.1      00:18:55
 13801       5   4,935      24,675       441.1      23.7      00:18:51
 14111       6   4,935      29,610       451.0      24.2      00:18:50
 14429       9   4,935      44,415       461.7      24.8      00:18:45
 14756       6   4,935      29,610       472.3      25.3      00:18:41
 15151       4   4,935      19,740       485.6      26.1      00:18:28
 15559       6   4,935      29,610       499.0      26.8      00:18:16
 16010       8   4,935      39,480       514.2      27.6      00:17:58
 16461       6   4,935      29,610       529.8      28.4      00:17:39
 16797       7   4,935      34,545       540.7      29.0      00:17:34
 17099       6   4,935      29,610       550.6      29.5      00:17:31
 17399       4   4,935      19,740       560.6      30.1      00:17:27
 17694       9   4,935      44,415       570.8      30.6      00:17:23
 18064       9   4,935      44,415       582.8      31.3      00:17:15
 18401       3   4,935      14,805       594.0      31.9      00:17:07
 18720      10   4,935      49,350       604.4      32.4      00:17:02
 19052       6   4,935      29,610       615.8      33.0      00:16:55
 19425      10   4,935      49,350       628.4      33.7      00:16:44
 19855       6   4,935      29,610       643.3      34.5      00:16:28
 20271       6   4,935      29,610       657.5      35.3      00:16:14
 20619       8   4,935      39,480       669.2      35.9      00:16:05
 20914       3   4,935      14,805       679.2      36.5      00:16:00
 21256       7   4,935      34,545       689.7      37.0      00:15:54
 21600       7   4,935      34,545       700.5      37.6      00:15:48
 21968       6   4,935      29,610       711.8      38.2      00:15:40
 22355       9   4,935      44,415       723.6      38.8      00:15:31
 22669       5   4,935      24,675       733.6      39.4      00:15:26
 22984       6   4,935      29,610       743.1      39.9      00:15:21
 23283       6   4,935      29,610       753.0      40.4      00:15:16
 23619      10   4,935      49,350       763.3      41.0      00:15:09
 23967       8   4,935      39,480       774.7      41.6      00:15:01
 24387       5   4,935      24,675       787.5      42.3      00:14:49
 24800      10   4,935      49,350       801.3      43.0      00:14:36
 25195       9   4,935      44,415       814.2      43.7      00:14:25
 25579       4   4,935      19,740       826.7      44.4      00:14:14
 25907       2   4,935       9,870       837.5      44.9      00:14:07
 26217       6   4,935      29,610       847.7      45.5      00:14:00
 26602       8   4,935      39,480       859.9      46.1      00:13:50
 27008       9   4,935      44,415       873.1      46.9      00:13:38
 27322       8   4,935      39,480       883.1      47.4      00:13:32
 27617       6   4,935      29,610       892.8      47.9      00:13:26
 27982       7   4,935      34,545       905.0      48.6      00:13:15
 28444       7   4,935      34,545       920.5      49.4      00:12:60
 28812       8   4,935      39,480       933.1      50.1      00:12:49
 29109       8   4,935      39,480       943.1      50.6      00:12:42
 29452      10   4,935      49,350       954.5      51.2      00:12:33
 29781      10   4,935      49,350       965.3      51.8      00:12:25
 30084       8   4,935      39,480       975.4      52.3      00:12:19
 30432       4   4,935      19,740       987.0      53.0      00:12:09
 30834       7   4,935      34,545     1,000.7      53.7      00:11:57
 31279       8   4,935      39,480     1,015.6      54.5      00:11:42
 31746       5   4,935      24,675     1,031.5      55.4      00:11:27
 32172       9   4,935      44,415     1,046.4      56.2      00:11:13
 32567       5   4,935      24,675     1,060.1      56.9      00:11:00
 32867       4   4,935      19,740     1,070.2      57.4      00:10:53
 33178       7   4,935      34,545     1,081.0      58.0      00:10:45
 33557       8   4,935      39,480     1,094.0      58.7      00:10:34
 33871       9   4,935      44,415     1,104.8      59.3      00:10:26
 34185       9   4,935      44,415     1,115.8      59.9      00:10:17
 34623       8   4,935      39,480     1,130.7      60.7      00:10:04
 35082       9   4,935      44,415     1,146.5      61.5      00:09:49
 35522      10   4,935      49,350     1,161.7      62.3      00:09:35
 35964       7   4,935      34,545     1,176.6      63.1      00:09:21
 36401       7   4,935      34,545     1,191.6      63.9      00:09:08
 36776       6   4,935      29,610     1,203.9      64.6      00:08:58
 37109       7   4,935      34,545     1,214.9      65.2      00:08:49
 37454       8   4,935      39,480     1,225.5      65.8      00:08:41
 37794      10   4,935      49,350     1,236.4      66.4      00:08:33
 38106      10   4,935      49,350     1,246.8      66.9      00:08:25
 38387       6   4,935      29,610     1,256.3      67.4      00:08:19
 38743       7   4,935      34,545     1,268.4      68.1      00:08:09
 39081       6   4,935      29,610     1,279.6      68.7      00:07:60
 39370      10   4,935      49,350     1,289.0      69.2      00:07:53
 39691       8   4,935      39,480     1,299.3      69.7      00:07:45
 40055       5   4,935      24,675     1,311.2      70.4      00:07:36
 40494       8   4,935      39,480     1,325.6      71.1      00:07:23
 40920       4   4,935      19,740     1,340.0      71.9      00:07:10
 41237       8   4,935      39,480     1,350.7      72.5      00:07:02
 41549       8   4,935      39,480     1,361.0      73.0      00:06:54
 41873       8   4,935      39,480     1,371.9      73.6      00:06:45
 42188      10   4,935      49,350     1,382.0      74.2      00:06:38
 42542       6   4,935      29,610     1,393.6      74.8      00:06:28
 42894      10   4,935      49,350     1,405.0      75.4      00:06:19
 43244       9   4,935      44,415     1,417.1      76.0      00:06:09
 43591       8   4,935      39,480     1,428.5      76.7      00:05:60
 43917       9   4,935      44,415     1,439.2      77.2      00:05:51
 44240       4   4,935      19,740     1,449.7      77.8      00:05:43
 44585      10   4,935      49,350     1,460.8      78.4      00:05:34
 44960       7   4,935      34,545     1,473.2      79.1      00:05:24
 45368       8   4,935      39,480     1,485.9      79.7      00:05:13
 45727       6   4,935      29,610     1,497.1      80.3      00:05:04
 46092      10   4,935      49,350     1,509.0      81.0      00:04:54
 46420       9   4,935      44,415     1,520.1      81.6      00:04:45
 46752       9   4,935      44,415     1,531.1      82.2      00:04:36
 47090       9   4,935      44,415     1,541.9      82.7      00:04:27
 47349       3   4,935      14,805     1,549.8      83.2      00:04:21
 47597       5   4,935      24,675     1,557.6      83.6      00:04:16
 47928       9   4,935      44,415     1,568.4      84.2      00:04:07
 48244       8   4,935      39,480     1,578.7      84.7      00:03:58
 48587       9   4,935      44,415     1,590.3      85.3      00:03:49
 48982       9   4,935      44,415     1,603.1      86.0      00:03:38
 49369       5   4,935      24,675     1,615.9      86.7      00:03:27
 49740       4   4,935      19,740     1,627.1      87.3      00:03:18
 50024       8   4,935      39,480     1,636.3      87.8      00:03:10
 50351       9   4,935      44,415     1,646.5      88.4      00:03:02
 50698       6   4,935      29,610     1,657.7      89.0      00:02:53
 51021       8   4,935      39,480     1,668.8      89.6      00:02:44
 51373       7   4,935      34,545     1,680.3      90.2      00:02:34
 51717       6   4,935      29,610     1,692.1      90.8      00:02:24
 52066       8   4,935      39,480     1,704.0      91.4      00:02:14
 52432      10   4,935      49,350     1,717.1      92.1      00:02:03
 52898       6   4,935      29,610     1,733.8      93.0      00:01:49
 53379       9   4,935      44,415     1,750.3      93.9      00:01:34
 53810       6   4,935      29,610     1,765.0      94.7      00:01:22
 54132      10   4,935      49,350     1,775.5      95.3      00:01:13
 54467       6   4,935      29,610     1,786.3      95.9      00:01:04
 54870       4   4,935      19,740     1,799.0      96.5      00:00:54
 55184       8   4,935      39,480     1,809.2      97.1      00:00:45
 55456       3   4,935      14,805     1,817.6      97.5      00:00:38
 55703       7   4,935      34,545     1,825.6      98.0      00:00:32
 55967       6   4,935      29,610     1,834.4      98.4      00:00:24
 56265       4   4,935      19,740     1,844.5      99.0      00:00:16
 56586       4   4,935      19,740     1,855.5      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 1576.437
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A900.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A900.csv saved

. 
. cap log close

. 
end of do-file
