
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data//Intermediate/blk_coords.dta /export/storage_co
> vidvaccine/Result/MaxVaxFixV/M10_K10000/Dollar/vaccinated/ca_Dollar_locations
> _total.dta /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K10000/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv 2000 30 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   9 Sep 2023, 16:55:01

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K10000/Dollar/vacc
> inated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K10000/Dollar/vacci
> nated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 30

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   505      10   4,035      40,350        11.6       0.8      00:21:40
  1053       7   4,035      28,245        25.4       1.7      00:19:42
  1595       9   4,035      36,315        39.8       2.6      00:18:41
  2163      10   4,035      40,350        54.3       3.6      00:18:04
  2692      10   4,035      40,350        67.8       4.5      00:17:54
  3205       8   4,035      32,280        81.5       5.3      00:17:43
  3743       9   4,035      36,315        96.0       6.3      00:17:22
  4152       4   4,035      16,140       106.3       7.0      00:17:48
  4547       8   4,035      32,280       116.3       7.6      00:18:11
  4925       4   4,035      16,140       126.4       8.3      00:18:27
  5286       7   4,035      28,245       135.7       8.9      00:18:47
  5778       1   4,035       4,035       148.0       9.7      00:18:36
  6338       3   4,035      12,105       162.5      10.7      00:18:10
  6935       6   4,035      24,210       177.8      11.7      00:17:41
  7536       5   4,035      20,175       193.3      12.7      00:17:13
  8112       6   4,035      24,210       209.1      13.7      00:16:47
  8692       6   4,035      24,210       225.0      14.8      00:16:22
  9255       4   4,035      16,140       240.6      15.8      00:16:01
  9833       7   4,035      28,245       256.7      16.8      00:15:39
 10281       7   4,035      28,245       267.8      17.6      00:15:39
 10697       6   4,035      24,210       278.6      18.3      00:15:39
 11128       2   4,035       8,070       289.9      19.0      00:15:37
 11512       6   4,035      24,210       300.1      19.7      00:15:39
 11880       5   4,035      20,175       309.7      20.3      00:15:42
 12257       8   4,035      32,280       319.8      21.0      00:15:42
 12773      10   4,035      40,350       333.1      21.9      00:15:30
 13246       7   4,035      28,245       345.5      22.7      00:15:22
 13650      10   4,035      40,350       356.7      23.4      00:15:17
 13973       6   4,035      24,210       365.1      24.0      00:15:21
 14427       3   4,035      12,105       377.4      24.8      00:15:12
 14914      10   4,035      40,350       390.5      25.6      00:15:01
 15440       5   4,035      20,175       404.9      26.6      00:14:45
 15950       9   4,035      36,315       418.8      27.5      00:14:32
 16454       5   4,035      20,175       433.0      28.4      00:14:17
 16822       2   4,035       8,070       442.7      29.1      00:14:16
 17263       5   4,035      20,175       454.5      29.8      00:14:08
 17709       4   4,035      16,140       467.0      30.7      00:13:58
 18239       6   4,035      24,210       481.4      31.6      00:13:44
 18829       6   4,035      24,210       497.1      32.6      00:13:26
 19423       9   4,035      36,315       513.7      33.7      00:13:07
 19972       8   4,035      32,280       529.4      34.7      00:12:51
 20561       6   4,035      24,210       545.6      35.8      00:12:34
 21151       4   4,035      16,140       561.5      36.9      00:12:18
 21608      10   4,035      40,350       573.0      37.6      00:12:11
 22059       7   4,035      28,245       584.3      38.4      00:12:04
 22511      10   4,035      40,350       595.7      39.1      00:11:57
 22932      10   4,035      40,350       606.1      39.8      00:11:52
 23322       6   4,035      24,210       616.8      40.5      00:11:46
 23769      10   4,035      40,350       628.2      41.2      00:11:39
 24252      10   4,035      40,350       640.8      42.1      00:11:30
 24826       5   4,035      20,175       655.8      43.0      00:11:16
 25376       7   4,035      28,245       670.5      44.0      00:11:02
 25823       7   4,035      28,245       682.5      44.8      00:10:54
 26221       9   4,035      36,315       693.2      45.5      00:10:48
 26674       7   4,035      28,245       704.8      46.3      00:10:40
 27150       5   4,035      20,175       717.5      47.1      00:10:30
 27759       6   4,035      24,210       733.8      48.2      00:10:14
 28362       8   4,035      32,280       750.4      49.3      00:09:58
 28950       6   4,035      24,210       766.8      50.3      00:09:43
 29556       7   4,035      28,245       783.2      51.4      00:09:28
 30016       8   4,035      32,280       795.6      52.2      00:09:19
 30407       9   4,035      36,315       806.3      52.9      00:09:12
 30846       9   4,035      36,315       818.6      53.7      00:09:03
 31381       6   4,035      24,210       833.2      54.7      00:08:51
 31899       8   4,035      32,280       847.8      55.6      00:08:39
 32341       7   4,035      28,245       860.4      56.5      00:08:29
 32867       4   4,035      16,140       875.1      57.4      00:08:17
 33465       7   4,035      28,245       891.8      58.5      00:08:02
 34042       7   4,035      28,245       908.1      59.6      00:07:48
 34620       6   4,035      24,210       924.4      60.7      00:07:34
 35183       6   4,035      24,210       940.3      61.7      00:07:21
 35766       7   4,035      28,245       956.4      62.8      00:07:07
 36365       4   4,035      16,140       973.3      63.9      00:06:53
 36867       5   4,035      20,175       986.8      64.8      00:06:43
 37331       9   4,035      36,315       998.8      65.6      00:06:34
 37771       6   4,035      24,210     1,010.3      66.3      00:06:27
 38184       8   4,035      32,280     1,021.6      67.1      00:06:19
 38598       4   4,035      16,140     1,033.1      67.8      00:06:11
 38979       5   4,035      20,175     1,043.4      68.5      00:06:04
 39559       7   4,035      28,245     1,058.8      69.5      00:05:52
 40135       4   4,035      16,140     1,074.1      70.5      00:05:39
 40692       9   4,035      36,315     1,089.4      71.5      00:05:27
 41256       8   4,035      32,280     1,104.9      72.5      00:05:15
 41835       5   4,035      20,175     1,120.7      73.6      00:05:02
 42263      10   4,035      40,350     1,131.9      74.3      00:04:54
 42649       8   4,035      32,280     1,142.2      75.0      00:04:48
 43031       7   4,035      28,245     1,152.5      75.6      00:04:40
 43406       7   4,035      28,245     1,163.1      76.3      00:04:33
 43820       6   4,035      24,210     1,174.0      77.1      00:04:25
 44225       9   4,035      36,315     1,185.0      77.8      00:04:17
 44625       7   4,035      28,245     1,195.5      78.5      00:04:10
 44965       6   4,035      24,210     1,204.7      79.1      00:04:04
 45403       3   4,035      12,105     1,215.8      79.8      00:03:56
 45827       6   4,035      24,210     1,226.7      80.5      00:03:48
 46244       6   4,035      24,210     1,238.1      81.3      00:03:39
 46648       6   4,035      24,210     1,249.1      82.0      00:03:31
 47202       4   4,035      16,140     1,263.4      82.9      00:03:20
 47627       3   4,035      12,105     1,274.4      83.6      00:03:12
 48083       5   4,035      20,175     1,286.6      84.4      00:03:03
 48584       9   4,035      36,315     1,300.2      85.3      00:02:52
 49068      10   4,035      40,350     1,313.0      86.2      00:02:42
 49604       9   4,035      36,315     1,327.0      87.1      00:02:31
 50205      10   4,035      40,350     1,342.6      88.1      00:02:19
 50600      10   4,035      40,350     1,352.8      88.8      00:02:11
 51010       7   4,035      28,245     1,364.1      89.5      00:02:03
 51472       7   4,035      28,245     1,376.6      90.4      00:01:53
 51935       7   4,035      28,245     1,389.6      91.2      00:01:43
 52396       8   4,035      32,280     1,402.8      92.1      00:01:33
 52828      10   4,035      40,350     1,415.6      92.9      00:01:23
 53286       5   4,035      20,175     1,428.6      93.8      00:01:13
 53791       7   4,035      28,245     1,442.6      94.7      00:01:02
 54169      10   4,035      40,350     1,452.8      95.4      00:00:55
 54621       7   4,035      28,245     1,464.3      96.1      00:00:46
 55073       9   4,035      36,315     1,476.4      96.9      00:00:37
 55549       9   4,035      36,315     1,488.5      97.7      00:00:27
 55990       7   4,035      28,245     1,500.5      98.5      00:00:18
 56415       8   4,035      32,280     1,512.3      99.3      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1182.461
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  11,327,730

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K10000/Dollar/vaccinat
    > ed/ca_blk_Dollar_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K10000/Dollar/vaccinate
> d/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
