
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A600_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   444       9   4,635      41,715        11.7       0.7      00:24:46
   863       7   4,635      32,445        23.6       1.3      00:24:26
  1265      10   4,635      46,350        35.5       2.0      00:24:09
  1679       7   4,635      32,445        48.3       2.8      00:23:31
  2107       8   4,635      37,080        60.7       3.5      00:23:12
  2532       9   4,635      41,715        73.1       4.2      00:22:58
  2948      10   4,635      46,350        85.7       4.9      00:22:40
  3357       9   4,635      41,715        98.4       5.6      00:22:24
  3780       8   4,635      37,080       111.5       6.4      00:22:05
  4127      10   4,635      46,350       121.4       6.9      00:22:23
  4433       8   4,635      37,080       130.1       7.4      00:22:51
  4763       6   4,635      27,810       140.3       8.0      00:22:59
  5095       5   4,635      23,175       150.2       8.6      00:23:07
  5400       3   4,635      13,905       159.6       9.1      00:23:17
  5704       6   4,635      27,810       167.8       9.6      00:23:36
  6010       5   4,635      23,175       176.9      10.1      00:23:44
  6298       7   4,635      32,445       185.5      10.6      00:23:55
  6600       6   4,635      27,810       194.4      11.1      00:24:03
  6874       7   4,635      32,445       202.4      11.6      00:24:15
  7206       8   4,635      37,080       212.0      12.1      00:24:13
  7540      10   4,635      46,350       222.2      12.7      00:24:06
  7880      10   4,635      46,350       232.7      13.3      00:23:57
  8221       8   4,635      37,080       243.6      13.9      00:23:44
  8564       9   4,635      41,715       254.6      14.5      00:23:32
  8941       5   4,635      23,175       266.4      15.2      00:23:14
  9292       8   4,635      37,080       277.6      15.9      00:23:01
  9586       6   4,635      27,810       286.9      16.4      00:22:59
  9900       9   4,635      41,715       296.9      17.0      00:22:53
 10202       8   4,635      37,080       305.4      17.5      00:22:54
 10492       6   4,635      27,810       314.1      17.9      00:22:53
 10877       7   4,635      32,445       325.5      18.6      00:22:39
 11233       4   4,635      18,540       336.2      19.2      00:22:28
 11524       6   4,635      27,810       345.1      19.7      00:22:26
 11839       9   4,635      41,715       354.5      20.3      00:22:20
 12163       9   4,635      41,715       364.5      20.8      00:22:13
 12539       6   4,635      27,810       375.9      21.5      00:21:58
 12978       7   4,635      32,445       388.6      22.2      00:21:38
 13363       5   4,635      23,175       400.4      22.9      00:21:23
 13680       8   4,635      37,080       410.7      23.5      00:21:14
 13974       1   4,635       4,635       419.4      24.0      00:21:11
 14365       5   4,635      23,175       431.6      24.7      00:20:54
 14722       5   4,635      23,175       442.6      25.3      00:20:42
 15120      10   4,635      46,350       455.1      26.0      00:20:25
 15566       5   4,635      23,175       468.9      26.8      00:20:04
 16013       7   4,635      32,445       483.1      27.6      00:19:42
 16449      10   4,635      46,350       497.2      28.4      00:19:21
 16799       9   4,635      41,715       507.9      29.0      00:19:11
 17124       8   4,635      37,080       517.8      29.6      00:19:04
 17439       8   4,635      37,080       527.8      30.2      00:18:57
 17742      10   4,635      46,350       537.5      30.7      00:18:50
 18117       8   4,635      37,080       549.1      31.4      00:18:37
 18484       8   4,635      37,080       560.1      32.0      00:18:27
 18902       9   4,635      41,715       573.4      32.8      00:18:09
 19318       7   4,635      32,445       586.8      33.5      00:17:52
 19724       9   4,635      41,715       600.0      34.3      00:17:36
 20143       7   4,635      32,445       613.7      35.1      00:17:19
 20539       4   4,635      18,540       625.9      35.8      00:17:05
 20821      10   4,635      46,350       634.9      36.3      00:17:00
 21100       8   4,635      37,080       643.5      36.8      00:16:56
 21455       9   4,635      41,715       653.5      37.3      00:16:48
 21806      10   4,635      46,350       663.6      37.9      00:16:40
 22158       6   4,635      27,810       673.8      38.5      00:16:32
 22482       6   4,635      27,810       683.2      39.0      00:16:25
 22830       7   4,635      32,445       693.2      39.6      00:16:17
 23182       6   4,635      27,810       704.0      40.2      00:16:07
 23446       8   4,635      37,080       712.1      40.7      00:16:03
 23753      10   4,635      46,350       721.0      41.2      00:15:58
 24049       8   4,635      37,080       730.1      41.7      00:15:51
 24442      10   4,635      46,350       741.4      42.4      00:15:40
 24837       5   4,635      23,175       753.6      43.1      00:15:27
 25222       5   4,635      23,175       765.6      43.7      00:15:15
 25621       6   4,635      27,810       777.6      44.4      00:15:02
 25909       8   4,635      37,080       786.6      44.9      00:14:56
 26213       9   4,635      41,715       796.0      45.5      00:14:48
 26539      10   4,635      46,350       805.6      46.0      00:14:41
 26875       7   4,635      32,445       815.8      46.6      00:14:32
 27178       9   4,635      41,715       825.1      47.1      00:14:25
 27458       8   4,635      37,080       833.6      47.6      00:14:19
 27710       6   4,635      27,810       841.4      48.1      00:14:14
 28062       5   4,635      23,175       852.4      48.7      00:14:04
 28510       5   4,635      23,175       866.8      49.5      00:13:47
 28827       8   4,635      37,080       876.9      50.1      00:13:38
 29067      10   4,635      46,350       884.5      50.5      00:13:34
 29397       9   4,635      41,715       894.7      51.1      00:13:24
 29796      10   4,635      46,350       907.1      51.8      00:13:11
 30104       8   4,635      37,080       916.7      52.4      00:13:03
 30432       4   4,635      18,540       927.0      53.0      00:12:54
 30844      10   4,635      46,350       940.3      53.7      00:12:39
 31293      10   4,635      46,350       954.3      54.5      00:12:23
 31748       3   4,635      13,905       968.9      55.4      00:12:07
 32184       8   4,635      37,080       983.2      56.2      00:11:51
 32601       9   4,635      41,715       996.8      57.0      00:11:36
 32917       5   4,635      23,175     1,006.8      57.5      00:11:28
 33261       6   4,635      27,810     1,017.9      58.2      00:11:17
 33685       9   4,635      41,715     1,031.7      58.9      00:11:03
 34104       6   4,635      27,810     1,045.1      59.7      00:10:49
 34539       8   4,635      37,080     1,059.4      60.5      00:10:33
 35014       6   4,635      27,810     1,074.7      61.4      00:10:17
 35478       9   4,635      41,715     1,089.7      62.3      00:10:01
 35959       8   4,635      37,080     1,104.9      63.1      00:09:45
 36429       6   4,635      27,810     1,120.0      64.0      00:09:29
 36816       7   4,635      32,445     1,131.9      64.7      00:09:18
 37192       7   4,635      32,445     1,143.3      65.3      00:09:08
 37516       8   4,635      37,080     1,152.9      65.9      00:08:60
 37849       9   4,635      41,715     1,163.0      66.4      00:08:51
 38190       8   4,635      37,080     1,173.7      67.1      00:08:41
 38531       7   4,635      32,445     1,184.6      67.7      00:08:32
 38858       8   4,635      37,080     1,194.8      68.3      00:08:23
 39192       9   4,635      41,715     1,205.1      68.9      00:08:14
 39574       6   4,635      27,810     1,216.7      69.5      00:08:03
 39967       9   4,635      41,715     1,228.8      70.2      00:07:52
 40440       9   4,635      41,715     1,243.3      71.0      00:07:37
 40917       8   4,635      37,080     1,258.4      71.9      00:07:22
 41292       6   4,635      27,810     1,270.3      72.6      00:07:11
 41660       5   4,635      23,175     1,281.8      73.2      00:07:01
 42002       6   4,635      27,810     1,292.6      73.9      00:06:51
 42381       5   4,635      23,175     1,303.7      74.5      00:06:41
 42756      10   4,635      46,350     1,315.3      75.2      00:06:31
 43091       8   4,635      37,080     1,325.9      75.8      00:06:21
 43430       7   4,635      32,445     1,336.9      76.4      00:06:12
 43781       4   4,635      18,540     1,347.3      77.0      00:06:02
 44107      10   4,635      46,350     1,357.6      77.6      00:05:53
 44466       7   4,635      32,445     1,368.2      78.2      00:05:44
 44830       7   4,635      32,445     1,379.5      78.8      00:05:34
 45265       9   4,635      41,715     1,392.7      79.6      00:05:21
 45638       7   4,635      32,445     1,403.5      80.2      00:05:12
 46020       9   4,635      41,715     1,415.1      80.9      00:05:01
 46386       9   4,635      41,715     1,426.7      81.5      00:04:51
 46803       7   4,635      32,445     1,439.6      82.3      00:04:39
 47172       9   4,635      41,715     1,450.4      82.9      00:04:29
 47551       7   4,635      32,445     1,461.5      83.5      00:04:19
 47901       6   4,635      27,810     1,472.2      84.1      00:04:10
 48235       7   4,635      32,445     1,482.5      84.7      00:04:00
 48585       8   4,635      37,080     1,493.5      85.3      00:03:51
 48930       8   4,635      37,080     1,504.1      85.9      00:03:41
 49284       5   4,635      23,175     1,515.1      86.6      00:03:31
 49648      10   4,635      46,350     1,525.5      87.2      00:03:22
 49974       3   4,635      13,905     1,535.2      87.7      00:03:14
 50284       9   4,635      41,715     1,544.5      88.3      00:03:05
 50645       8   4,635      37,080     1,555.4      88.9      00:02:56
 51003       7   4,635      32,445     1,566.8      89.5      00:02:45
 51375       9   4,635      41,715     1,578.2      90.2      00:02:35
 51747       6   4,635      27,810     1,590.3      90.9      00:02:24
 52123       9   4,635      41,715     1,602.3      91.6      00:02:13
 52476      10   4,635      46,350     1,614.1      92.2      00:02:02
 52830       8   4,635      37,080     1,626.2      92.9      00:01:51
 53205       8   4,635      37,080     1,638.3      93.6      00:01:40
 53651       9   4,635      41,715     1,652.7      94.4      00:01:27
 53918       5   4,635      23,175     1,661.0      94.9      00:01:20
 54172       8   4,635      37,080     1,668.9      95.4      00:01:13
 54474       3   4,635      13,905     1,677.8      95.9      00:01:05
 54850       7   4,635      32,445     1,689.1      96.5      00:00:55
 55215       3   4,635      13,905     1,700.1      97.1      00:00:45
 55549       9   4,635      41,715     1,709.9      97.7      00:00:36
 55867      10   4,635      46,350     1,719.7      98.3      00:00:28
 56222       6   4,635      27,810     1,730.9      98.9      00:00:17
 56592       9   4,635      41,715     1,742.9      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1584.758
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
