
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A800.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A800.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A800.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A800.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   342       5   4,835      24,175         9.6       0.5      00:31:54
   420       8   4,835      38,680        11.8       0.6      00:51:51
   612       6   4,835      29,010        17.3       0.9      00:52:44
   952      10   4,835      48,350        27.3       1.5      00:44:08
  1311       8   4,835      38,680        38.7       2.1      00:38:40
  1677       8   4,835      38,680        50.5       2.8      00:35:17
  2055       7   4,835      33,845        61.9       3.4      00:33:23
  2416       8   4,835      38,680        73.1       4.0      00:32:05
  2779       8   4,835      38,680        84.5       4.6      00:31:00
  3131       6   4,835      29,010        95.5       5.2      00:30:17
  3470       6   4,835      29,010       106.6       5.8      00:29:38
  3832       7   4,835      33,845       118.0       6.5      00:29:00
  4108       1   4,835       4,835       126.2       6.9      00:29:14
  4386       1   4,835       4,835       134.4       7.4      00:29:25
  4647      10   4,835      48,350       142.9       7.8      00:29:30
  4922       5   4,835      24,175       151.5       8.3      00:29:32
  5203       6   4,835      29,010       160.3       8.8      00:29:29
  5475       3   4,835      14,505       168.6       9.2      00:29:32
  5711       7   4,835      33,845       175.5       9.6      00:29:49
  5976       9   4,835      43,515       183.8      10.1      00:29:50
  6258       9   4,835      43,515       192.6      10.6      00:29:44
  6545       8   4,835      38,680       201.2      11.0      00:29:39
  6828      10   4,835      48,350       209.9      11.5      00:29:34
  7129       8   4,835      38,680       219.0      12.0      00:29:23
  7451       7   4,835      33,845       229.2      12.6      00:29:05
  7771       6   4,835      29,010       239.3      13.1      00:28:47
  8083       9   4,835      43,515       249.7      13.7      00:28:27
  8377       4   4,835      19,340       259.5      14.2      00:28:13
  8694       8   4,835      38,680       269.9      14.8      00:27:54
  8993       6   4,835      29,010       279.8      15.3      00:27:40
  9197       6   4,835      29,010       286.6      15.7      00:27:47
  9334      10   4,835      48,350       291.1      16.0      00:28:10
  9451       8   4,835      38,680       294.9      16.2      00:28:36
  9554       6   4,835      29,010       298.5      16.4      00:29:03
  9652       5   4,835      24,175       301.9      16.5      00:29:30
  9775       8   4,835      38,680       306.0      16.8      00:29:51
  9901       6   4,835      29,010       309.9      17.0      00:30:13
 10011       9   4,835      43,515       313.3      17.2      00:30:38
 10160       5   4,835      24,175       317.5      17.4      00:30:56
 10324       9   4,835      43,515       322.4      17.7      00:31:08
 10507       7   4,835      33,845       328.3      18.0      00:31:14
 10710       6   4,835      29,010       334.5      18.3      00:31:16
 10895       8   4,835      38,680       340.3      18.7      00:31:21
 11100      10   4,835      48,350       346.7      19.0      00:31:21
 11227       5   4,835      24,175       350.7      19.2      00:31:37
 11357       5   4,835      24,175       354.8      19.4      00:31:51
 11480       5   4,835      24,175       358.8      19.7      00:32:06
 11616       8   4,835      38,680       362.9      19.9      00:32:19
 11784       7   4,835      33,845       368.2      20.2      00:32:23
 11922      10   4,835      48,350       372.6      20.4      00:32:34
 12058       7   4,835      33,845       377.0      20.7      00:32:43
 12211       8   4,835      38,680       382.0      20.9      00:32:50
 12423       2   4,835       9,670       388.5      21.3      00:32:45
 12646      10   4,835      48,350       395.6      21.7      00:32:36
 12904       8   4,835      38,680       403.3      22.1      00:32:24
 13142       6   4,835      29,010       410.9      22.5      00:32:12
 13343       8   4,835      38,680       417.2      22.9      00:32:08
 13545       9   4,835      43,515       424.1      23.2      00:32:01
 13674       3   4,835      14,505       428.5      23.5      00:32:08
 13806       8   4,835      38,680       432.5      23.7      00:32:17
 13940       7   4,835      33,845       436.7      23.9      00:32:25
 14131       8   4,835      38,680       442.7      24.3      00:32:21
 14326       7   4,835      33,845       449.2      24.6      00:32:14
 14472      10   4,835      48,350       454.1      24.9      00:32:17
 14645       8   4,835      38,680       459.5      25.2      00:32:16
 14796       6   4,835      29,010       464.4      25.5      00:32:19
 14967       4   4,835      19,340       469.9      25.8      00:32:17
 15150       8   4,835      38,680       476.1      26.1      00:32:12
 15346       1   4,835       4,835       482.4      26.4      00:32:05
 15562       5   4,835      24,175       489.2      26.8      00:31:56
 15761       9   4,835      43,515       495.8      27.2      00:31:48
 15966      10   4,835      48,350       502.6      27.5      00:31:39
 16155       7   4,835      33,845       509.0      27.9      00:31:32
 16348       8   4,835      38,680       515.4      28.3      00:31:25
 16499       6   4,835      29,010       520.5      28.5      00:31:25
 16657       7   4,835      33,845       525.4      28.8      00:31:25
 16785      10   4,835      48,350       529.6      29.0      00:31:28
 16905       9   4,835      43,515       533.4      29.2      00:31:34
 17012       9   4,835      43,515       537.0      29.4      00:31:40
 17133       7   4,835      33,845       540.7      29.6      00:31:45
 17252       9   4,835      43,515       544.6      29.9      00:31:50
 17364      10   4,835      48,350       548.4      30.1      00:31:54
 17493       9   4,835      43,515       552.9      30.3      00:31:55
 17621       9   4,835      43,515       557.1      30.5      00:31:57
 17763       2   4,835       9,670       561.4      30.8      00:31:59
 17904       7   4,835      33,845       566.0      31.0      00:31:58
 18062       7   4,835      33,845       571.2      31.3      00:31:55
 18265      10   4,835      48,350       577.8      31.7      00:31:45
 18467       6   4,835      29,010       583.9      32.0      00:31:37
 18596       7   4,835      33,845       588.2      32.2      00:31:38
 18690       7   4,835      33,845       591.5      32.4      00:31:44
 18800       5   4,835      24,175       595.0      32.6      00:31:48
 18929       4   4,835      19,340       599.4      32.9      00:31:47
 19051       7   4,835      33,845       603.5      33.1      00:31:48
 19177      10   4,835      48,350       607.8      33.3      00:31:48
 19333       9   4,835      43,515       612.9      33.6      00:31:44
 19501       8   4,835      38,680       618.6      33.9      00:31:38
 19666       4   4,835      19,340       624.2      34.2      00:31:31
 19862       8   4,835      38,680       630.8      34.6      00:31:20
 20061       8   4,835      38,680       637.7      35.0      00:31:08
 20287       6   4,835      29,010       645.0      35.4      00:30:54
 20489      10   4,835      48,350       651.6      35.7      00:30:42
 20589       7   4,835      33,845       654.9      35.9      00:30:46
 20675      10   4,835      48,350       657.8      36.1      00:30:51
 20807       4   4,835      19,340       662.1      36.3      00:30:50
 20912      10   4,835      48,350       665.7      36.5      00:30:52
 21040       7   4,835      33,845       669.6      36.7      00:30:52
 21176       7   4,835      33,845       673.8      36.9      00:30:51
 21326       7   4,835      33,845       677.9      37.2      00:30:50
 21454       8   4,835      38,680       682.1      37.4      00:30:49
 21593       6   4,835      29,010       686.3      37.6      00:30:47
 21751       2   4,835       9,670       690.9      37.9      00:30:44
 21871       8   4,835      38,680       694.7      38.1      00:30:44
 22015       7   4,835      33,845       699.2      38.3      00:30:41
 22146       8   4,835      38,680       702.9      38.5      00:30:42
 22289       2   4,835       9,670       707.2      38.8      00:30:39
 22420       7   4,835      33,845       711.2      39.0      00:30:38
 22526       2   4,835       9,670       714.5      39.2      00:30:40
 22682       4   4,835      19,340       719.4      39.4      00:30:35
 22894       8   4,835      38,680       725.4      39.8      00:30:25
 23092      10   4,835      48,350       731.8      40.1      00:30:13
 23279       9   4,835      43,515       737.9      40.4      00:30:03
 23457       3   4,835      14,505       743.2      40.7      00:29:56
 23631       6   4,835      29,010       748.4      41.0      00:29:49
 23819       9   4,835      43,515       754.7      41.4      00:29:38
 24011      10   4,835      48,350       760.6      41.7      00:29:29
 24193       6   4,835      29,010       766.1      42.0      00:29:21
 24401       8   4,835      38,680       772.3      42.3      00:29:10
 24589       5   4,835      24,175       778.6      42.7      00:28:59
 24771       6   4,835      29,010       784.3      43.0      00:28:50
 24958       5   4,835      24,175       790.1      43.3      00:28:41
 25133       6   4,835      29,010       796.0      43.6      00:28:31
 25314      10   4,835      48,350       801.7      43.9      00:28:23
 25498       3   4,835      14,505       807.7      44.3      00:28:13
 25639       8   4,835      38,680       811.9      44.5      00:28:10
 25754       5   4,835      24,175       815.9      44.7      00:28:07
 25884       5   4,835      24,175       820.1      45.0      00:28:04
 26006       8   4,835      38,680       824.0      45.2      00:28:02
 26119       9   4,835      43,515       827.6      45.4      00:28:00
 26249       8   4,835      38,680       831.9      45.6      00:27:56
 26423       6   4,835      29,010       837.2      45.9      00:27:49
 26597       8   4,835      38,680       842.6      46.2      00:27:41
 26743       8   4,835      38,680       847.2      46.4      00:27:36
 26886       4   4,835      19,340       851.7      46.7      00:27:30
 27021       6   4,835      29,010       856.1      46.9      00:27:26
 27108      10   4,835      48,350       858.8      47.1      00:27:27
 27224       7   4,835      33,845       862.5      47.3      00:27:25
 27356      10   4,835      48,350       866.7      47.5      00:27:21
 27481      10   4,835      48,350       870.7      47.7      00:27:18
 27594       9   4,835      43,515       874.3      47.9      00:27:16
 27746       9   4,835      43,515       879.3      48.2      00:27:09
 27893       5   4,835      24,175       884.2      48.5      00:27:02
 28100       7   4,835      33,845       891.0      48.8      00:26:49
 28297       6   4,835      29,010       897.4      49.2      00:26:37
 28512       7   4,835      33,845       904.7      49.6      00:26:21
 28664       9   4,835      43,515       909.7      49.9      00:26:14
 28760       8   4,835      38,680       913.0      50.0      00:26:13
 28885       6   4,835      29,010       917.1      50.3      00:26:09
 29000      10   4,835      48,350       920.9      50.5      00:26:06
 29154       3   4,835      14,505       925.9      50.8      00:25:58
 29285       9   4,835      43,515       930.0      51.0      00:25:54
 29428       6   4,835      29,010       934.8      51.2      00:25:47
 29578       9   4,835      43,515       939.5      51.5      00:25:41
 29720       9   4,835      43,515       944.2      51.8      00:25:35
 29836       7   4,835      33,845       947.9      52.0      00:25:31
 29945       5   4,835      24,175       951.4      52.1      00:25:29
 30052       9   4,835      43,515       955.0      52.3      00:25:26
 30172       8   4,835      38,680       959.0      52.6      00:25:22
 30332       7   4,835      33,845       964.1      52.8      00:25:14
 30456      10   4,835      48,350       968.4      53.1      00:25:09
 30577       8   4,835      38,680       972.4      53.3      00:25:04
 30752      10   4,835      48,350       978.1      53.6      00:24:54
 30955       9   4,835      43,515       984.8      54.0      00:24:41
 31149       4   4,835      19,340       991.0      54.3      00:24:29
 31345       6   4,835      29,010       997.5      54.7      00:24:16
 31543       6   4,835      29,010     1,004.2      55.0      00:24:03
 31752      10   4,835      48,350     1,011.3      55.4      00:23:48
 31955       6   4,835      29,010     1,018.3      55.8      00:23:34
 32166       5   4,835      24,175     1,025.4      56.2      00:23:20
 32352       9   4,835      43,515     1,031.9      56.6      00:23:08
 32501      10   4,835      48,350     1,036.9      56.8      00:22:60
 32598       8   4,835      38,680     1,040.1      57.0      00:22:58
 32699       8   4,835      38,680     1,043.4      57.2      00:22:55
 32819       9   4,835      43,515     1,047.4      57.4      00:22:50
 32963       6   4,835      29,010     1,052.3      57.7      00:22:42
 33108       9   4,835      43,515     1,057.3      58.0      00:22:35
 33291       8   4,835      38,680     1,063.3      58.3      00:22:24
 33480       8   4,835      38,680     1,069.5      58.6      00:22:12
 33618       8   4,835      38,680     1,074.4      58.9      00:22:05
 33755       5   4,835      24,175     1,078.9      59.1      00:21:58
 33928      10   4,835      48,350     1,084.7      59.5      00:21:47
 34089       5   4,835      24,175     1,090.2      59.8      00:21:38
 34242       7   4,835      33,845     1,095.5      60.0      00:21:29
 34464       8   4,835      38,680     1,103.0      60.5      00:21:14
 34689       7   4,835      33,845     1,110.5      60.9      00:20:58
 34897       9   4,835      43,515     1,117.7      61.3      00:20:44
 35132      10   4,835      48,350     1,125.4      61.7      00:20:28
 35366       8   4,835      38,680     1,133.3      62.1      00:20:12
 35589       5   4,835      24,175     1,140.7      62.5      00:19:57
 35818       6   4,835      29,010     1,148.3      62.9      00:19:42
 36042      10   4,835      48,350     1,155.7      63.3      00:19:27
 36289      10   4,835      48,350     1,164.2      63.8      00:19:10
 36530       9   4,835      43,515     1,172.0      64.2      00:18:54
 36668       8   4,835      38,680     1,176.6      64.5      00:18:47
 36836       5   4,835      24,175     1,181.8      64.8      00:18:39
 36996       4   4,835      19,340     1,187.0      65.1      00:18:30
 37187       3   4,835      14,505     1,192.8      65.4      00:18:20
 37358       7   4,835      33,845     1,198.1      65.7      00:18:11
 37533       8   4,835      38,680     1,203.6      66.0      00:18:02
 37690       5   4,835      24,175     1,208.4      66.2      00:17:55
 37825       8   4,835      38,680     1,212.7      66.5      00:17:48
 37981       6   4,835      29,010     1,217.7      66.7      00:17:40
 38156       6   4,835      29,010     1,223.7      67.1      00:17:30
 38338      10   4,835      48,350     1,229.6      67.4      00:17:19
 38530       7   4,835      33,845     1,236.1      67.8      00:17:07
 38787       8   4,835      38,680     1,244.4      68.2      00:16:50
 38985       8   4,835      38,680     1,251.0      68.6      00:16:38
 39125       9   4,835      43,515     1,255.5      68.8      00:16:32
 39292       5   4,835      24,175     1,260.7      69.1      00:16:23
 39506       9   4,835      43,515     1,267.4      69.5      00:16:10
 39740      10   4,835      48,350     1,274.8      69.9      00:15:56
 39999       8   4,835      38,680     1,283.2      70.3      00:15:40
 40270       6   4,835      29,010     1,291.8      70.8      00:15:23
 40503       7   4,835      33,845     1,299.6      71.2      00:15:08
 40756       5   4,835      24,175     1,307.9      71.7      00:14:52
 40973       6   4,835      29,010     1,315.2      72.1      00:14:38
 41130       4   4,835      19,340     1,320.2      72.4      00:14:30
 41300       5   4,835      24,175     1,325.8      72.7      00:14:21
 41509       5   4,835      24,175     1,332.6      73.0      00:14:08
 41727       8   4,835      38,680     1,339.7      73.4      00:13:55
 41946       1   4,835       4,835     1,347.0      73.8      00:13:42
 42157       6   4,835      29,010     1,353.3      74.2      00:13:31
 42398       9   4,835      43,515     1,361.1      74.6      00:13:16
 42650      10   4,835      48,350     1,368.9      75.0      00:13:02
 42886       9   4,835      43,515     1,376.6      75.5      00:12:47
 43109       9   4,835      43,515     1,384.2      75.9      00:12:33
 43329       9   4,835      43,515     1,391.6      76.3      00:12:20
 43577      10   4,835      48,350     1,399.5      76.7      00:12:06
 43947      10   4,835      48,350     1,411.4      77.4      00:11:42
 44193       9   4,835      43,515     1,419.3      77.8      00:11:28
 44440      10   4,835      48,350     1,426.9      78.2      00:11:14
 44767       8   4,835      38,680     1,437.4      78.8      00:10:54
 45074       7   4,835      33,845     1,447.3      79.3      00:10:36
 45393       4   4,835      19,340     1,456.9      79.9      00:10:18
 45678       7   4,835      33,845     1,465.5      80.3      00:10:02
 45998       8   4,835      38,680     1,475.8      80.9      00:09:43
 46275      10   4,835      48,350     1,485.1      81.4      00:09:27
 46576       9   4,835      43,515     1,494.7      81.9      00:09:09
 46930       9   4,835      43,515     1,506.1      82.6      00:08:48
 47217       7   4,835      33,845     1,514.6      83.0      00:08:33
 47511       4   4,835      19,340     1,523.6      83.5      00:08:17
 47773      10   4,835      48,350     1,532.0      84.0      00:08:03
 48046      10   4,835      48,350     1,540.9      84.5      00:07:47
 48300       6   4,835      29,010     1,549.1      84.9      00:07:33
 48575       9   4,835      43,515     1,558.0      85.4      00:07:18
 48881       8   4,835      38,680     1,567.7      85.9      00:07:01
 49154       8   4,835      38,680     1,576.7      86.4      00:06:45
 49400      10   4,835      48,350     1,584.2      86.8      00:06:33
 49562       9   4,835      43,515     1,589.1      87.1      00:06:25
 49831       5   4,835      24,175     1,597.2      87.5      00:06:11
 50081      10   4,835      48,350     1,605.2      88.0      00:05:58
 50345       4   4,835      19,340     1,613.1      88.4      00:05:44
 50571       7   4,835      33,845     1,620.4      88.8      00:05:32
 50799       6   4,835      29,010     1,627.9      89.2      00:05:20
 50970       7   4,835      33,845     1,633.8      89.6      00:05:10
 51081       4   4,835      19,340     1,637.4      89.8      00:05:05
 51245       7   4,835      33,845     1,642.6      90.0      00:04:57
 51378       7   4,835      33,845     1,647.0      90.3      00:04:50
 51505      10   4,835      48,350     1,651.1      90.5      00:04:43
 51677       6   4,835      29,010     1,657.1      90.8      00:04:34
 51930       7   4,835      33,845     1,665.4      91.3      00:04:20
 52165       6   4,835      29,010     1,673.7      91.7      00:04:06
 52464       4   4,835      19,340     1,684.0      92.3      00:03:48
 52776       6   4,835      29,010     1,695.0      92.9      00:03:30
 53103       8   4,835      38,680     1,706.1      93.5      00:03:11
 53469       7   4,835      33,845     1,718.4      94.2      00:02:51
 53768       8   4,835      38,680     1,728.3      94.7      00:02:35
 53940       8   4,835      38,680     1,733.8      95.0      00:02:26
 54097      10   4,835      48,350     1,738.8      95.3      00:02:18
 54316       7   4,835      33,845     1,745.9      95.7      00:02:06
 54609      10   4,835      48,350     1,754.8      96.2      00:01:52
 54923       9   4,835      43,515     1,764.8      96.7      00:01:36
 55179      10   4,835      48,350     1,772.8      97.2      00:01:23
 55408       5   4,835      24,175     1,779.7      97.6      00:01:11
 55609       8   4,835      38,680     1,785.9      97.9      00:01:02
 55848       5   4,835      24,175     1,793.8      98.3      00:00:49
 56132      10   4,835      48,350     1,803.1      98.8      00:00:34
 56406       8   4,835      38,680     1,812.4      99.3      00:00:19
 56745      10   4,835      48,350     1,823.7     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 2908.141
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A800.csv saved

. 
. cap log close

. 
end of do-file
