
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_logdistabove0.8_A500.dta /export/storage_covidva
> ccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_logdistabove0.8_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove0.8_A500.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.8_A500.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   343       1   4,535       4,535         9.0       0.5      00:31:32
   796       4   4,535      18,140        21.5       1.3      00:26:09
  1235       9   4,535      40,815        34.1       2.0      00:24:39
  1659       9   4,535      40,815        46.8       2.7      00:23:46
  2060       8   4,535      36,280        58.2       3.4      00:23:43
  2524       6   4,535      27,210        71.5       4.2      00:22:58
  2905       5   4,535      22,675        82.9       4.8      00:22:57
  3365      10   4,535      45,350        96.8       5.7      00:22:16
  3830       5   4,535      22,675       110.6       6.5      00:21:44
  4159       5   4,535      22,675       119.8       7.0      00:22:10
  4474       7   4,535      31,745       128.7       7.5      00:22:35
  4675       6   4,535      27,210       134.8       7.9      00:23:25
  4989      10   4,535      45,350       144.1       8.4      00:23:37
  5293       6   4,535      27,210       152.9       8.9      00:23:49
  5558       9   4,535      40,815       160.4       9.4      00:24:13
  5875      10   4,535      45,350       169.3       9.9      00:24:20
  6210       8   4,535      36,280       179.2      10.5      00:24:15
  6502       7   4,535      31,745       187.5      11.0      00:24:25
  6859       7   4,535      31,745       197.8      11.6      00:24:16
  7282       6   4,535      27,210       209.8      12.3      00:23:54
  7691       5   4,535      22,675       222.0      13.0      00:23:31
  8084      10   4,535      45,350       234.3      13.7      00:23:09
  8456       6   4,535      27,210       245.9      14.4      00:22:53
  8852       5   4,535      22,675       258.0      15.1      00:22:34
  9243       7   4,535      31,745       270.2      15.8      00:22:15
  9544       9   4,535      40,815       279.6      16.3      00:22:13
  9863       9   4,535      40,815       289.5      16.9      00:22:08
 10244       3   4,535      13,605       300.1      17.5      00:21:59
 10604       5   4,535      22,675       310.6      18.1      00:21:50
 10954       5   4,535      22,675       321.0      18.8      00:21:42
 11303      10   4,535      45,350       331.1      19.4      00:21:34
 11581       5   4,535      22,675       339.3      19.8      00:21:36
 11881       8   4,535      36,280       348.3      20.4      00:21:33
 12168       9   4,535      40,815       357.0      20.9      00:21:32
 12574       9   4,535      40,815       368.8      21.6      00:21:16
 13009      10   4,535      45,350       381.4      22.3      00:20:57
 13417       9   4,535      40,815       393.7      23.0      00:20:40
 13761       6   4,535      27,210       404.3      23.6      00:20:30
 14082       7   4,535      31,745       413.7      24.2      00:20:25
 14484       7   4,535      31,745       426.2      24.9      00:20:08
 14890      10   4,535      45,350       438.3      25.6      00:19:53
 15241       5   4,535      22,675       449.3      26.3      00:19:42
 15624      10   4,535      45,350       460.7      26.9      00:19:29
 16010      10   4,535      45,350       472.8      27.6      00:19:14
 16422       7   4,535      31,745       485.8      28.4      00:18:57
 16741      10   4,535      45,350       495.4      29.0      00:18:51
 17054       9   4,535      40,815       504.9      29.5      00:18:45
 17372       8   4,535      36,280       514.6      30.1      00:18:38
 17708      10   4,535      45,350       525.2      30.7      00:18:28
 18067       5   4,535      22,675       535.9      31.3      00:18:18
 18460       5   4,535      22,675       547.5      32.0      00:18:06
 18920       4   4,535      18,140       562.0      32.8      00:17:45
 19399      10   4,535      45,350       576.9      33.7      00:17:24
 19837       9   4,535      40,815       590.9      34.5      00:17:06
 20218       4   4,535      18,140       602.9      35.2      00:16:53
 20543       5   4,535      22,675       612.9      35.8      00:16:45
 20855       6   4,535      27,210       622.6      36.4      00:16:38
 21147       5   4,535      22,675       631.2      36.9      00:16:34
 21418       7   4,535      31,745       638.6      37.3      00:16:33
 21731       9   4,535      40,815       647.5      37.8      00:16:27
 22072       6   4,535      27,210       657.2      38.4      00:16:20
 22411       8   4,535      36,280       666.8      39.0      00:16:13
 22740       7   4,535      31,745       676.1      39.5      00:16:06
 23044       9   4,535      40,815       685.0      40.0      00:16:00
 23285       6   4,535      27,210       692.4      40.5      00:15:58
 23566       9   4,535      40,815       700.1      40.9      00:15:55
 23829      10   4,535      45,350       708.2      41.4      00:15:51
 24074       8   4,535      36,280       715.4      41.8      00:15:48
 24498      10   4,535      45,350       727.5      42.5      00:15:35
 24895      10   4,535      45,350       739.3      43.2      00:15:22
 25282       6   4,535      27,210       751.0      43.9      00:15:09
 25654       8   4,535      36,280       762.0      44.5      00:14:58
 25928       7   4,535      31,745       770.5      45.0      00:14:53
 26278       7   4,535      31,745       781.2      45.7      00:14:42
 26694       9   4,535      40,815       793.1      46.3      00:14:30
 27073       6   4,535      27,210       804.4      47.0      00:14:18
 27327       7   4,535      31,745       812.1      47.5      00:14:14
 27665      10   4,535      45,350       822.3      48.1      00:14:05
 28108       5   4,535      22,675       835.9      48.9      00:13:48
 28579       6   4,535      27,210       850.7      49.7      00:13:30
 28815      10   4,535      45,350       858.0      50.1      00:13:27
 29017       8   4,535      36,280       864.3      50.5      00:13:25
 29287       9   4,535      40,815       872.4      51.0      00:13:19
 29656      10   4,535      45,350       883.4      51.6      00:13:08
 29913       7   4,535      31,745       891.4      52.1      00:13:03
 30160       9   4,535      40,815       899.1      52.5      00:12:58
 30467       5   4,535      22,675       908.7      53.1      00:12:50
 30846       7   4,535      31,745       920.4      53.8      00:12:37
 31251       7   4,535      31,745       932.7      54.5      00:12:24
 31669       9   4,535      40,815       945.9      55.3      00:12:09
 32113      10   4,535      45,350       960.1      56.1      00:11:53
 32529       8   4,535      36,280       973.4      56.9      00:11:38
 32815       6   4,535      27,210       982.3      57.4      00:11:31
 33116       8   4,535      36,280       991.9      58.0      00:11:23
 33489       8   4,535      36,280     1,003.5      58.6      00:11:11
 33885       5   4,535      22,675     1,016.1      59.4      00:10:58
 34276       9   4,535      40,815     1,028.7      60.1      00:10:45
 34745      10   4,535      45,350     1,043.5      61.0      00:10:28
 35202       6   4,535      27,210     1,057.8      61.8      00:10:12
 35652       8   4,535      36,280     1,072.0      62.6      00:09:57
 36094       9   4,535      40,815     1,085.7      63.5      00:09:43
 36522      10   4,535      45,350     1,099.0      64.2      00:09:29
 36828       4   4,535      18,140     1,108.2      64.8      00:09:21
 37136       4   4,535      18,140     1,117.4      65.3      00:09:14
 37453       9   4,535      40,815     1,126.5      65.8      00:09:06
 37761       9   4,535      40,815     1,135.5      66.4      00:08:58
 38093      10   4,535      45,350     1,145.7      67.0      00:08:49
 38441       6   4,535      27,210     1,156.6      67.6      00:08:39
 38920       7   4,535      31,745     1,171.3      68.5      00:08:23
 39250      10   4,535      45,350     1,181.1      69.0      00:08:14
 39638      10   4,535      45,350     1,192.7      69.7      00:08:03
 40076       7   4,535      31,745     1,205.8      70.5      00:07:50
 40396       8   4,535      36,280     1,215.5      71.0      00:07:42
 40771      10   4,535      45,350     1,227.2      71.7      00:07:30
 41119       8   4,535      36,280     1,238.0      72.3      00:07:20
 41487       4   4,535      18,140     1,249.2      73.0      00:07:10
 41825       7   4,535      31,745     1,259.6      73.6      00:07:00
 42109       7   4,535      31,745     1,268.0      74.1      00:06:53
 42415       6   4,535      27,210     1,277.2      74.6      00:06:45
 42746       5   4,535      22,675     1,286.9      75.2      00:06:36
 43075       7   4,535      31,745     1,297.3      75.8      00:06:27
 43378       6   4,535      27,210     1,306.8      76.4      00:06:18
 43622       7   4,535      31,745     1,314.0      76.8      00:06:12
 43839       8   4,535      36,280     1,320.5      77.2      00:06:07
 44091       3   4,535      13,605     1,328.0      77.6      00:06:01
 44285       6   4,535      27,210     1,333.9      78.0      00:05:57
 44570      10   4,535      45,350     1,342.3      78.4      00:05:50
 44914       4   4,535      18,140     1,352.7      79.1      00:05:40
 45263       8   4,535      36,280     1,362.9      79.6      00:05:30
 45465      10   4,535      45,350     1,368.7      80.0      00:05:26
 45712       8   4,535      36,280     1,375.6      80.4      00:05:20
 46051       2   4,535       9,070     1,385.8      81.0      00:05:10
 46335       7   4,535      31,745     1,394.7      81.5      00:05:02
 46657      10   4,535      45,350     1,404.4      82.1      00:04:53
 46977       9   4,535      40,815     1,413.9      82.6      00:04:44
 47310      10   4,535      45,350     1,423.3      83.2      00:04:35
 47560       7   4,535      31,745     1,430.6      83.6      00:04:29
 47751       4   4,535      18,140     1,436.3      83.9      00:04:24
 47893       9   4,535      40,815     1,440.6      84.2      00:04:22
 48047       3   4,535      13,605     1,445.3      84.5      00:04:18
 48201      10   4,535      45,350     1,449.8      84.7      00:04:15
 48400       7   4,535      31,745     1,455.9      85.1      00:04:09
 48641       6   4,535      27,210     1,463.2      85.5      00:04:03
 48949       9   4,535      40,815     1,472.5      86.1      00:03:54
 49206      10   4,535      45,350     1,480.5      86.5      00:03:46
 49431       7   4,535      31,745     1,486.9      86.9      00:03:41
 49662       3   4,535      13,605     1,493.2      87.3      00:03:35
 49859       6   4,535      27,210     1,498.8      87.6      00:03:30
 50031       9   4,535      40,815     1,504.2      87.9      00:03:25
 50257       9   4,535      40,815     1,510.6      88.3      00:03:19
 50432       4   4,535      18,140     1,515.6      88.6      00:03:15
 50623       6   4,535      27,210     1,521.4      88.9      00:03:10
 50806       6   4,535      27,210     1,527.1      89.2      00:03:05
 50991       8   4,535      36,280     1,533.1      89.6      00:02:59
 51182       9   4,535      40,815     1,538.8      89.9      00:02:54
 51419       7   4,535      31,745     1,546.0      90.4      00:02:47
 51747       9   4,535      40,815     1,556.5      91.0      00:02:36
 52088       9   4,535      40,815     1,567.2      91.6      00:02:25
 52461       7   4,535      31,745     1,579.4      92.3      00:02:13
 52853      10   4,535      45,350     1,592.4      93.1      00:01:60
 53289       8   4,535      36,280     1,606.1      93.9      00:01:45
 53677      10   4,535      45,350     1,618.3      94.6      00:01:33
 53959      10   4,535      45,350     1,626.8      95.1      00:01:25
 54265       9   4,535      40,815     1,636.1      95.6      00:01:15
 54606       5   4,535      22,675     1,645.8      96.2      00:01:06
 54926       6   4,535      27,210     1,655.4      96.7      00:00:56
 55268       8   4,535      36,280     1,665.4      97.3      00:00:46
 55540       9   4,535      40,815     1,673.0      97.8      00:00:38
 55776       8   4,535      36,280     1,680.2      98.2      00:00:31
 56100       9   4,535      40,815     1,690.2      98.8      00:00:21
 56346       5   4,535      22,675     1,698.0      99.2      00:00:13
 56675       6   4,535      27,210     1,708.3      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 1731.257
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.8_A500.csv sa
> ved

. 
. cap log close

. 
end of do-file
