
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A600.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A600.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A600.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A600.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   312       9   4,635      41,715         8.4       0.5      00:34:33
   664       6   4,635      27,810        18.0       1.0      00:32:06
  1010      10   4,635      46,350        28.0       1.6      00:30:49
  1316       8   4,635      37,080        37.3       2.1      00:30:41
  1646       5   4,635      23,175        47.4       2.7      00:29:60
  1989       9   4,635      41,715        57.4       3.3      00:29:32
  2340       7   4,635      32,445        67.8       3.9      00:28:60
  2684       5   4,635      23,175        77.9       4.5      00:28:39
  3042       6   4,635      27,810        88.6       5.1      00:28:09
  3387       6   4,635      27,810        99.5       5.7      00:27:40
  3743       6   4,635      27,810       110.5       6.3      00:27:14
  4061       3   4,635      13,905       119.6       6.8      00:27:17
  4348       8   4,635      37,080       127.7       7.3      00:27:33
  4614       7   4,635      32,445       135.9       7.8      00:27:44
  4881       9   4,635      41,715       144.0       8.2      00:27:54
  5155       2   4,635       9,270       152.2       8.7      00:28:01
  5413       7   4,635      32,445       160.1       9.2      00:28:10
  5651       6   4,635      27,810       166.5       9.5      00:28:33
  5896       8   4,635      37,080       173.7       9.9      00:28:46
  6182       6   4,635      27,810       182.3      10.4      00:28:42
  6445       8   4,635      37,080       190.0      10.9      00:28:46
  6707       2   4,635       9,270       197.5      11.3      00:28:51
  6961       8   4,635      37,080       205.1      11.7      00:28:54
  7274       9   4,635      41,715       214.2      12.2      00:28:43
  7584       9   4,635      41,715       223.8      12.8      00:28:27
  7893       5   4,635      23,175       233.3      13.3      00:28:12
  8176       9   4,635      41,715       242.4      13.9      00:28:01
  8460      10   4,635      46,350       251.4      14.4      00:27:51
  8752       7   4,635      32,445       260.5      14.9      00:27:40
  9043       8   4,635      37,080       269.7      15.4      00:27:28
  9292       8   4,635      37,080       277.8      15.9      00:27:25
  9489       9   4,635      41,715       284.0      16.2      00:27:34
  9698       7   4,635      32,445       290.9      16.6      00:27:37
  9920       9   4,635      41,715       297.7      17.0      00:27:41
 10157       7   4,635      32,445       304.3      17.4      00:27:44
 10396       5   4,635      23,175       311.3      17.8      00:27:45
 10644       9   4,635      41,715       318.6      18.2      00:27:44
 10907       6   4,635      27,810       326.6      18.7      00:27:38
 11154       7   4,635      32,445       334.0      19.1      00:27:35
 11371       7   4,635      32,445       340.5      19.5      00:27:37
 11574       6   4,635      27,810       346.6      19.8      00:27:42
 11789       6   4,635      27,810       353.2      20.2      00:27:43
 12006       7   4,635      32,445       359.8      20.6      00:27:43
 12224       8   4,635      37,080       366.5      21.0      00:27:43
 12503       7   4,635      32,445       374.9      21.4      00:27:32
 12841      10   4,635      46,350       384.8      22.0      00:27:14
 13158       7   4,635      32,445       394.4      22.6      00:26:57
 13466      10   4,635      46,350       404.1      23.1      00:26:41
 13694      10   4,635      46,350       411.4      23.5      00:26:36
 13892      10   4,635      46,350       417.2      23.9      00:26:39
 14161       7   4,635      32,445       425.4      24.3      00:26:30
 14433      10   4,635      46,350       434.0      24.8      00:26:19
 14718       7   4,635      32,445       442.7      25.3      00:26:07
 15022       6   4,635      27,810       452.2      25.9      00:25:51
 15339       7   4,635      32,445       462.2      26.4      00:25:34
 15678       7   4,635      32,445       472.5      27.0      00:25:16
 15998       5   4,635      23,175       482.8      27.6      00:24:58
 16324       9   4,635      41,715       493.3      28.2      00:24:39
 16600       5   4,635      23,175       501.8      28.7      00:24:29
 16843       9   4,635      41,715       509.4      29.1      00:24:23
 17061       8   4,635      37,080       516.2      29.5      00:24:19
 17287       9   4,635      41,715       523.2      29.9      00:24:15
 17487       9   4,635      41,715       529.8      30.3      00:24:12
 17714       5   4,635      23,175       536.9      30.7      00:24:08
 17994       2   4,635       9,270       545.4      31.2      00:23:57
 18309       4   4,635      18,540       555.3      31.8      00:23:41
 18570       5   4,635      23,175       563.1      32.2      00:23:34
 18771       9   4,635      41,715       569.6      32.6      00:23:31
 19012       5   4,635      23,175       577.4      33.0      00:23:23
 19249       6   4,635      27,810       584.9      33.4      00:23:16
 19558       5   4,635      23,175       594.8      34.0      00:23:00
 19884       8   4,635      37,080       605.4      34.6      00:22:43
 20201       6   4,635      27,810       615.7      35.2      00:22:26
 20506       6   4,635      27,810       625.2      35.7      00:22:13
 20703       8   4,635      37,080       631.4      36.1      00:22:10
 20911       6   4,635      27,810       638.1      36.5      00:22:06
 21160       1   4,635       4,635       645.4      36.9      00:22:00
 21420       6   4,635      27,810       652.7      37.3      00:21:54
 21651       6   4,635      27,810       659.6      37.7      00:21:48
 21892       8   4,635      37,080       666.6      38.1      00:21:43
 22144       9   4,635      41,715       673.8      38.5      00:21:36
 22391      10   4,635      46,350       680.9      38.9      00:21:30
 22619      10   4,635      46,350       687.8      39.3      00:21:24
 22911       4   4,635      18,540       695.9      39.8      00:21:15
 23216       5   4,635      23,175       705.4      40.3      00:21:01
 23530      10   4,635      46,350       714.5      40.9      00:20:49
 23826       4   4,635      18,540       723.7      41.4      00:20:36
 24141       5   4,635      23,175       732.9      41.9      00:20:23
 24447       8   4,635      37,080       741.9      42.4      00:20:11
 24750       6   4,635      27,810       751.3      43.0      00:19:58
 25069       6   4,635      27,810       761.0      43.5      00:19:44
 25373      10   4,635      46,350       770.4      44.0      00:19:32
 25643       6   4,635      27,810       778.5      44.5      00:19:22
 25781       6   4,635      27,810       783.0      44.8      00:19:23
 25991       9   4,635      41,715       789.4      45.1      00:19:18
 26202      10   4,635      46,350       796.0      45.5      00:19:12
 26474       8   4,635      37,080       804.0      46.0      00:19:03
 26745       7   4,635      32,445       812.2      46.4      00:18:53
 27011       2   4,635       9,270       820.4      46.9      00:18:43
 27216       8   4,635      37,080       826.5      47.3      00:18:39
 27415       7   4,635      32,445       832.6      47.6      00:18:34
 27600      10   4,635      46,350       838.4      47.9      00:18:31
 27842       7   4,635      32,445       846.0      48.4      00:18:22
 28151      10   4,635      46,350       855.7      48.9      00:18:09
 28459       7   4,635      32,445       865.5      49.5      00:17:55
 28707       9   4,635      41,715       873.5      49.9      00:17:45
 28896       8   4,635      37,080       879.5      50.3      00:17:41
 29094       9   4,635      41,715       885.8      50.6      00:17:35
 29353       3   4,635      13,905       893.7      51.1      00:17:26
 29619       5   4,635      23,175       901.8      51.6      00:17:16
 29820       3   4,635      13,905       908.3      51.9      00:17:10
 30007       8   4,635      37,080       914.1      52.3      00:17:06
 30194       7   4,635      32,445       920.0      52.6      00:17:01
 30409       7   4,635      32,445       926.7      53.0      00:16:54
 30650      10   4,635      46,350       934.4      53.4      00:16:45
 30936       3   4,635      13,905       943.4      53.9      00:16:33
 31247       5   4,635      23,175       953.2      54.5      00:16:19
 31548       6   4,635      27,810       962.9      55.1      00:16:06
 31840       7   4,635      32,445       972.4      55.6      00:15:53
 32116       9   4,635      41,715       981.4      56.1      00:15:41
 32412       8   4,635      37,080       991.2      56.7      00:15:27
 32626       6   4,635      27,810       998.0      57.1      00:15:20
 32824       8   4,635      37,080     1,004.2      57.4      00:15:15
 33011       8   4,635      37,080     1,010.4      57.8      00:15:09
 33235       9   4,635      41,715     1,017.5      58.2      00:15:01
 33492      10   4,635      46,350     1,025.7      58.7      00:14:51
 33736       5   4,635      23,175     1,033.6      59.1      00:14:41
 33989       8   4,635      37,080     1,041.8      59.6      00:14:31
 34239       8   4,635      37,080     1,050.1      60.0      00:14:21
 34536       6   4,635      27,810     1,059.6      60.6      00:14:08
 34841       8   4,635      37,080     1,069.6      61.2      00:13:54
 35147      10   4,635      46,350     1,079.4      61.7      00:13:41
 35449       5   4,635      23,175     1,089.2      62.3      00:13:28
 35770       6   4,635      27,810     1,099.3      62.9      00:13:14
 36074      10   4,635      46,350     1,109.0      63.4      00:13:01
 36395       9   4,635      41,715     1,119.3      64.0      00:12:47
 36647       8   4,635      37,080     1,127.3      64.5      00:12:37
 36861       5   4,635      23,175     1,133.8      64.8      00:12:31
 37057       8   4,635      37,080     1,139.8      65.2      00:12:25
 37303      10   4,635      46,350     1,146.8      65.6      00:12:17
 37531      10   4,635      46,350     1,153.7      66.0      00:12:09
 37738       8   4,635      37,080     1,159.9      66.3      00:12:03
 37953       6   4,635      27,810     1,166.5      66.7      00:11:56
 38176      10   4,635      46,350     1,173.6      67.1      00:11:48
 38401       7   4,635      32,445     1,180.9      67.5      00:11:39
 38690       7   4,635      32,445     1,190.0      68.0      00:11:28
 38975      10   4,635      46,350     1,198.9      68.6      00:11:16
 39191       8   4,635      37,080     1,205.4      68.9      00:11:09
 39435      10   4,635      46,350     1,212.8      69.3      00:11:00
 39696       6   4,635      27,810     1,220.7      69.8      00:10:51
 39978      10   4,635      46,350     1,229.5      70.3      00:10:40
 40293       6   4,635      27,810     1,239.0      70.8      00:10:27
 40577       7   4,635      32,445     1,248.1      71.4      00:10:16
 40882       5   4,635      23,175     1,257.7      71.9      00:10:03
 41084       8   4,635      37,080     1,264.2      72.3      00:09:56
 41319       7   4,635      32,445     1,271.6      72.7      00:09:47
 41560       9   4,635      41,715     1,279.1      73.1      00:09:38
 41793       5   4,635      23,175     1,286.4      73.6      00:09:30
 41997       6   4,635      27,810     1,292.7      73.9      00:09:23
 42232      10   4,635      46,350     1,299.6      74.3      00:09:15
 42445       3   4,635      13,905     1,306.2      74.7      00:09:07
 42657       9   4,635      41,715     1,312.6      75.1      00:08:60
 42852       6   4,635      27,810     1,318.7      75.4      00:08:53
 43064       9   4,635      41,715     1,325.5      75.8      00:08:45
 43285       8   4,635      37,080     1,332.6      76.2      00:08:37
 43494       2   4,635       9,270     1,339.1      76.6      00:08:29
 43814       6   4,635      27,810     1,348.8      77.1      00:08:17
 44103       6   4,635      27,810     1,357.7      77.6      00:08:05
 44289       2   4,635       9,270     1,363.4      78.0      00:07:59
 44521      10   4,635      46,350     1,370.4      78.4      00:07:51
 44772       9   4,635      41,715     1,378.1      78.8      00:07:41
 45000       8   4,635      37,080     1,385.2      79.2      00:07:33
 45267       9   4,635      41,715     1,393.0      79.7      00:07:23
 45466       2   4,635       9,270     1,398.9      80.0      00:07:17
 45693       6   4,635      27,810     1,405.4      80.4      00:07:09
 45934       6   4,635      27,810     1,412.6      80.8      00:07:00
 46166       6   4,635      27,810     1,420.0      81.2      00:06:51
 46393       3   4,635      13,905     1,427.1      81.6      00:06:42
 46644       4   4,635      18,540     1,435.0      82.1      00:06:33
 46909       4   4,635      18,540     1,443.3      82.5      00:06:22
 47122       8   4,635      37,080     1,449.2      82.9      00:06:15
 47330       7   4,635      32,445     1,455.3      83.2      00:06:08
 47543       5   4,635      23,175     1,461.6      83.6      00:06:01
 47757       7   4,635      32,445     1,468.2      84.0      00:05:53
 47965       4   4,635      18,540     1,474.6      84.3      00:05:45
 48162       3   4,635      13,905     1,480.6      84.7      00:05:38
 48391       4   4,635      18,540     1,487.8      85.1      00:05:29
 48634       6   4,635      27,810     1,495.3      85.5      00:05:20
 48853       9   4,635      41,715     1,502.0      85.9      00:05:11
 49059      10   4,635      46,350     1,508.3      86.2      00:05:04
 49252       9   4,635      41,715     1,514.4      86.6      00:04:56
 49477       9   4,635      41,715     1,521.0      87.0      00:04:49
 49710       5   4,635      23,175     1,527.5      87.3      00:04:40
 49948       3   4,635      13,905     1,534.7      87.8      00:04:31
 50183       3   4,635      13,905     1,541.8      88.2      00:04:23
 50396       7   4,635      32,445     1,548.0      88.5      00:04:15
 50591       6   4,635      27,810     1,554.0      88.9      00:04:08
 50804       4   4,635      18,540     1,560.7      89.2      00:03:59
 50988       7   4,635      32,445     1,566.8      89.6      00:03:52
 51188       7   4,635      32,445     1,572.9      89.9      00:03:44
 51415       4   4,635      18,540     1,580.0      90.3      00:03:35
 51628       6   4,635      27,810     1,586.9      90.7      00:03:27
 51858       8   4,635      37,080     1,594.3      91.2      00:03:17
 52133       5   4,635      23,175     1,603.4      91.7      00:03:06
 52424       9   4,635      41,715     1,613.0      92.2      00:02:53
 52717       5   4,635      23,175     1,623.0      92.8      00:02:40
 52993       9   4,635      41,715     1,632.0      93.3      00:02:29
 53285       8   4,635      37,080     1,641.4      93.9      00:02:17
 53576       6   4,635      27,810     1,650.8      94.4      00:02:05
 53800       8   4,635      37,080     1,657.8      94.8      00:01:56
 54005       7   4,635      32,445     1,664.1      95.2      00:01:48
 54220      10   4,635      46,350     1,670.8      95.5      00:01:39
 54444       6   4,635      27,810     1,677.3      95.9      00:01:31
 54736       8   4,635      37,080     1,686.1      96.4      00:01:20
 55018       6   4,635      27,810     1,694.6      96.9      00:01:09
 55263      10   4,635      46,350     1,702.0      97.3      00:00:60
 55519       6   4,635      27,810     1,709.3      97.7      00:00:50
 55749       8   4,635      37,080     1,716.5      98.1      00:00:41
 55987       6   4,635      27,810     1,724.0      98.6      00:00:32
 56250       7   4,635      32,445     1,732.3      99.1      00:00:21
 56523       5   4,635      23,175     1,741.2      99.6      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 2230.881
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A600.csv saved

. 
. cap log close

. 
end of do-file
