
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A800.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A800.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A800.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A800.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   367       7   4,835      33,845        10.1       0.6      00:29:56
   726       8   4,835      38,680        20.5       1.1      00:29:21
  1112       4   4,835      19,340        32.1       1.8      00:27:55
  1425       5   4,835      24,175        42.2       2.3      00:28:14
  1765      10   4,835      48,350        53.0       2.9      00:27:55
  2078       4   4,835      19,340        62.4       3.4      00:28:18
  2403       6   4,835      29,010        72.5       4.0      00:28:15
  2737      10   4,835      48,350        82.8       4.5      00:28:05
  3048       4   4,835      19,340        92.4       5.1      00:28:11
  3400       6   4,835      29,010       104.0       5.7      00:27:37
  3730       6   4,835      29,010       114.6       6.3      00:27:25
  4056       7   4,835      33,845       124.5       6.8      00:27:23
  4233       7   4,835      33,845       129.8       7.1      00:28:21
  4475       9   4,835      43,515       137.0       7.5      00:28:49
  4679      10   4,835      48,350       143.7       7.9      00:29:20
  4962       3   4,835      14,505       152.6       8.4      00:29:18
  5216       4   4,835      19,340       160.5       8.8      00:29:27
  5474       4   4,835      19,340       168.5       9.2      00:29:34
  5681       9   4,835      43,515       174.4       9.6      00:30:03
  5930      10   4,835      48,350       182.0      10.0      00:30:09
  6194       7   4,835      33,845       190.2      10.4      00:30:09
  6432       6   4,835      29,010       197.6      10.8      00:30:16
  6689       5   4,835      24,175       205.4      11.2      00:30:18
  6901       7   4,835      33,845       212.0      11.6      00:30:31
  7221       6   4,835      29,010       221.6      12.1      00:30:13
  7549       7   4,835      33,845       232.1      12.7      00:29:49
  7867       9   4,835      43,515       242.3      13.3      00:29:28
  8141       8   4,835      38,680       251.5      13.8      00:29:16
  8468       7   4,835      33,845       262.4      14.4      00:28:51
  8757       6   4,835      29,010       271.8      14.9      00:28:39
  9068       9   4,835      43,515       282.0      15.4      00:28:20
  9281       9   4,835      43,515       289.2      15.8      00:28:24
  9493      10   4,835      48,350       296.1      16.2      00:28:28
  9718       7   4,835      33,845       303.8      16.6      00:28:26
  9943       4   4,835      19,340       311.0      17.0      00:28:28
 10237      10   4,835      48,350       319.7      17.5      00:28:19
 10438       9   4,835      43,515       325.9      17.9      00:28:26
 10715      10   4,835      48,350       334.5      18.3      00:28:17
 10938       9   4,835      43,515       341.5      18.7      00:28:18
 11154       6   4,835      29,010       348.2      19.1      00:28:21
 11314       6   4,835      29,010       353.1      19.3      00:28:33
 11455      10   4,835      48,350       357.8      19.6      00:28:47
 11701       5   4,835      24,175       365.4      20.0      00:28:42
 11903       9   4,835      43,515       371.8      20.4      00:28:44
 12111       3   4,835      14,505       378.5      20.7      00:28:44
 12314       7   4,835      33,845       384.9      21.1      00:28:46
 12653       7   4,835      33,845       395.6      21.7      00:28:23
 12966       7   4,835      33,845       404.9      22.2      00:28:08
 13291       9   4,835      43,515       415.3      22.8      00:27:47
 13588      10   4,835      48,350       425.3      23.3      00:27:30
 13799      10   4,835      48,350       432.1      23.7      00:27:28
 14022       1   4,835       4,835       439.0      24.0      00:27:26
 14225       8   4,835      38,680       445.6      24.4      00:27:25
 14491      10   4,835      48,350       454.4      24.9      00:27:13
 14728       8   4,835      38,680       461.9      25.3      00:27:07
 15005       8   4,835      38,680       471.0      25.8      00:26:54
 15292       4   4,835      19,340       480.4      26.3      00:26:40
 15618       6   4,835      29,010       490.8      26.9      00:26:21
 15924      10   4,835      48,350       500.9      27.4      00:26:04
 16224       6   4,835      29,010       511.0      28.0      00:25:47
 16504       9   4,835      43,515       520.5      28.5      00:25:33
 16737       6   4,835      29,010       527.8      28.9      00:25:28
 16962       8   4,835      38,680       535.0      29.3      00:25:23
 17156       4   4,835      19,340       541.2      29.6      00:25:22
 17370       8   4,835      38,680       548.3      30.0      00:25:18
 17544       5   4,835      24,175       554.3      30.4      00:25:17
 17826      10   4,835      48,350       563.2      30.8      00:25:05
 18099       4   4,835      19,340       572.2      31.3      00:24:53
 18438       3   4,835      14,505       583.0      31.9      00:24:34
 18673       8   4,835      38,680       590.6      32.4      00:24:27
 18872       9   4,835      43,515       597.1      32.7      00:24:24
 19094       5   4,835      24,175       604.7      33.1      00:24:17
 19276       6   4,835      29,010       610.7      33.5      00:24:15
 19603       7   4,835      33,845       621.7      34.1      00:23:56
 19898       7   4,835      33,845       631.7      34.6      00:23:41
 20171       6   4,835      29,010       641.0      35.1      00:23:28
 20450      10   4,835      48,350       650.1      35.6      00:23:15
 20643       9   4,835      43,515       656.5      36.0      00:23:12
 20862       4   4,835      19,340       663.7      36.4      00:23:06
 21069       8   4,835      38,680       670.3      36.7      00:23:02
 21341      10   4,835      48,350       678.0      37.1      00:22:54
 21539       6   4,835      29,010       684.5      37.5      00:22:50
 21837       9   4,835      43,515       693.3      38.0      00:22:39
 22026       6   4,835      29,010       699.1      38.3      00:22:36
 22303       7   4,835      33,845       707.3      38.7      00:22:27
 22523       8   4,835      38,680       714.1      39.1      00:22:21
 22745       2   4,835       9,670       720.9      39.5      00:22:16
 23065      10   4,835      48,350       730.7      40.0      00:22:02
 23340       7   4,835      33,845       739.6      40.5      00:21:50
 23639       7   4,835      33,845       748.5      41.0      00:21:38
 23918       4   4,835      19,340       757.6      41.5      00:21:26
 24248      10   4,835      48,350       767.7      42.1      00:21:11
 24546      10   4,835      48,350       776.8      42.6      00:20:58
 24836       7   4,835      33,845       786.1      43.1      00:20:46
 25138       9   4,835      43,515       795.8      43.6      00:20:32
 25481       5   4,835      24,175       806.9      44.2      00:20:15
 25683       6   4,835      29,010       813.0      44.5      00:20:11
 25898       3   4,835      14,505       820.2      44.9      00:20:04
 26075       4   4,835      19,340       825.9      45.2      00:20:01
 26311      10   4,835      48,350       833.6      45.7      00:19:53
 26583       6   4,835      29,010       841.8      46.1      00:19:43
 26853       6   4,835      29,010       850.2      46.6      00:19:33
 27085       9   4,835      43,515       857.7      47.0      00:19:25
 27299       8   4,835      38,680       864.5      47.4      00:19:19
 27491       5   4,835      24,175       870.6      47.7      00:19:14
 27674       3   4,835      14,505       876.6      48.0      00:19:10
 27888      10   4,835      48,350       883.7      48.4      00:19:03
 28198       8   4,835      38,680       893.7      49.0      00:18:49
 28536       6   4,835      29,010       905.0      49.6      00:18:31
 28747       9   4,835      43,515       912.1      50.0      00:18:24
 28944       5   4,835      24,175       918.6      50.3      00:18:18
 29082       7   4,835      33,845       923.2      50.6      00:18:17
 29334       7   4,835      33,845       931.2      51.0      00:18:08
 29537       9   4,835      43,515       937.9      51.4      00:18:01
 29780       8   4,835      38,680       945.7      51.8      00:17:53
 29944       6   4,835      29,010       951.0      52.1      00:17:49
 30174       9   4,835      43,515       958.6      52.5      00:17:41
 30372       7   4,835      33,845       965.0      52.9      00:17:35
 30597       9   4,835      43,515       972.6      53.3      00:17:26
 30866       7   4,835      33,845       981.5      53.8      00:17:14
 31269       9   4,835      43,515       994.7      54.5      00:16:53
 31570      10   4,835      48,350     1,004.8      55.0      00:16:39
 31871       7   4,835      33,845     1,014.9      55.6      00:16:25
 32218       4   4,835      19,340     1,026.8      56.2      00:16:07
 32528       4   4,835      19,340     1,037.4      56.8      00:15:52
 32720      10   4,835      48,350     1,043.7      57.2      00:15:46
 32898       8   4,835      38,680     1,049.6      57.5      00:15:41
 33085       6   4,835      29,010     1,056.0      57.8      00:15:35
 33294      10   4,835      48,350     1,063.0      58.2      00:15:28
 33542       7   4,835      33,845     1,071.2      58.7      00:15:18
 33757       4   4,835      19,340     1,078.5      59.1      00:15:10
 34001       5   4,835      24,175     1,086.8      59.5      00:14:60
 34280       8   4,835      38,680     1,096.3      60.1      00:14:47
 34635       8   4,835      38,680     1,108.2      60.7      00:14:29
 34938       9   4,835      43,515     1,118.6      61.3      00:14:15
 35252       8   4,835      38,680     1,129.1      61.8      00:14:01
 35580       8   4,835      38,680     1,140.0      62.4      00:13:46
 35950       5   4,835      24,175     1,152.3      63.1      00:13:28
 36352       4   4,835      19,340     1,165.8      63.9      00:13:08
 36705       6   4,835      29,010     1,177.3      64.5      00:12:53
 37007       6   4,835      29,010     1,187.0      65.0      00:12:40
 37281       9   4,835      43,515     1,195.4      65.5      00:12:30
 37482       9   4,835      43,515     1,201.6      65.8      00:12:24
 37685       9   4,835      43,515     1,208.0      66.2      00:12:18
 37917       5   4,835      24,175     1,215.3      66.6      00:12:10
 38160       8   4,835      38,680     1,223.3      67.0      00:12:01
 38394       6   4,835      29,010     1,231.0      67.4      00:11:52
 38700       8   4,835      38,680     1,241.2      68.0      00:11:38
 39046       9   4,835      43,515     1,252.6      68.6      00:11:23
 39297       4   4,835      19,340     1,260.4      69.0      00:11:14
 39600       7   4,835      33,845     1,270.1      69.6      00:11:02
 39880       6   4,835      29,010     1,279.0      70.1      00:10:51
 40265       3   4,835      14,505     1,291.3      70.7      00:10:35
 40683       7   4,835      33,845     1,305.0      71.5      00:10:16
 41008       4   4,835      19,340     1,315.9      72.1      00:10:02
 41244       6   4,835      29,010     1,323.6      72.5      00:09:53
 41565       7   4,835      33,845     1,334.0      73.1      00:09:40
 41830       9   4,835      43,515     1,342.7      73.5      00:09:30
 42092       9   4,835      43,515     1,351.1      74.0      00:09:20
 42412       7   4,835      33,845     1,361.0      74.6      00:09:07
 42683       7   4,835      33,845     1,369.7      75.0      00:08:57
 42923      10   4,835      48,350     1,377.4      75.4      00:08:48
 43180       7   4,835      33,845     1,386.2      75.9      00:08:38
 43430       7   4,835      33,845     1,394.6      76.4      00:08:28
 43708       3   4,835      14,505     1,403.1      76.9      00:08:18
 43991      10   4,835      48,350     1,412.4      77.4      00:08:07
 44247       8   4,835      38,680     1,420.6      77.8      00:07:57
 44484      10   4,835      48,350     1,427.9      78.2      00:07:49
 44770       7   4,835      33,845     1,437.1      78.7      00:07:38
 45075       8   4,835      38,680     1,447.0      79.3      00:07:26
 45417       5   4,835      24,175     1,457.3      79.8      00:07:13
 45675      10   4,835      48,350     1,465.2      80.3      00:07:04
 45919       8   4,835      38,680     1,472.7      80.7      00:06:55
 46157       8   4,835      38,680     1,480.7      81.1      00:06:46
 46452      10   4,835      48,350     1,490.2      81.6      00:06:35
 46767       7   4,835      33,845     1,500.7      82.2      00:06:22
 47072       9   4,835      43,515     1,510.0      82.7      00:06:11
 47318       8   4,835      38,680     1,517.4      83.1      00:06:02
 47560       6   4,835      29,010     1,524.9      83.5      00:05:54
 47818       9   4,835      43,515     1,533.1      84.0      00:05:44
 48091       6   4,835      29,010     1,542.0      84.5      00:05:34
 48388       5   4,835      24,175     1,551.6      85.0      00:05:22
 48677       5   4,835      24,175     1,560.9      85.5      00:05:11
 48951       7   4,835      33,845     1,569.6      86.0      00:05:01
 49236       3   4,835      14,505     1,579.1      86.5      00:04:49
 49502       4   4,835      19,340     1,587.1      86.9      00:04:40
 49749       5   4,835      24,175     1,594.4      87.3      00:04:32
 50003       9   4,835      43,515     1,602.4      87.8      00:04:22
 50332       9   4,835      43,515     1,612.5      88.3      00:04:10
 50632      10   4,835      48,350     1,622.0      88.8      00:03:59
 50906       8   4,835      38,680     1,631.0      89.3      00:03:48
 51142       7   4,835      33,845     1,638.9      89.8      00:03:39
 51485       7   4,835      33,845     1,650.0      90.4      00:03:26
 51783       9   4,835      43,515     1,660.1      90.9      00:03:14
 52086       9   4,835      43,515     1,670.2      91.5      00:03:02
 52413       8   4,835      38,680     1,681.6      92.1      00:02:48
 52771       7   4,835      33,845     1,694.3      92.8      00:02:33
 53167       8   4,835      38,680     1,707.8      93.5      00:02:17
 53557       7   4,835      33,845     1,720.8      94.3      00:02:01
 53869       6   4,835      29,010     1,731.1      94.8      00:01:49
 54162      10   4,835      48,350     1,740.5      95.3      00:01:38
 54457       8   4,835      38,680     1,749.8      95.8      00:01:28
 54805       5   4,835      24,175     1,760.6      96.4      00:01:15
 55107       5   4,835      24,175     1,770.1      97.0      00:01:04
 55396      10   4,835      48,350     1,779.0      97.4      00:00:54
 55656       7   4,835      33,845     1,786.9      97.9      00:00:45
 55903       6   4,835      29,010     1,795.1      98.3      00:00:35
 56202       8   4,835      38,680     1,804.9      98.9      00:00:24
 56483       9   4,835      43,515     1,814.5      99.4      00:00:13
 56796       5   4,835      24,175     1,824.9     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 2110.248
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A800.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A800.csv saved

. 
. cap log close

. 
end of do-file
