
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A300_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   237       2   4,335       8,670         5.9       0.4      00:46:07
   471       5   4,335      21,675        11.8       0.7      00:46:05
   651       8   4,335      34,680        16.5       1.0      00:49:17
   822       8   4,335      34,680        21.3       1.3      00:50:38
  1063       5   4,335      21,675        27.7       1.7      00:48:30
  1299       7   4,335      30,345        34.3       2.1      00:46:45
  1517       6   4,335      26,010        40.7       2.5      00:45:50
  1762       3   4,335      13,005        47.5       2.9      00:44:39
  2010       5   4,335      21,675        54.2       3.3      00:43:53
  2256      10   4,335      43,350        61.1       3.7      00:43:02
  2495       7   4,335      30,345        67.6       4.1      00:42:37
  2722      10   4,335      43,350        74.0       4.5      00:42:18
  2949       4   4,335      17,340        80.3       4.9      00:42:04
  3174       8   4,335      34,680        86.9       5.3      00:41:42
  3390       3   4,335      13,005        93.2       5.7      00:41:29
  3612       7   4,335      30,345        99.5       6.1      00:41:16
  3842       8   4,335      34,680       106.1       6.5      00:40:56
  3986       8   4,335      34,680       109.8       6.7      00:41:47
  4149       8   4,335      34,680       114.3       7.0      00:42:15
  4320       8   4,335      34,680       118.7       7.3      00:42:41
  4480       9   4,335      39,015       123.2       7.5      00:43:04
  4641       9   4,335      39,015       127.9       7.8      00:43:19
  4800       8   4,335      34,680       132.4       8.1      00:43:38
  4945      10   4,335      43,350       136.5       8.3      00:44:03
  5066       2   4,335       8,670       139.9       8.6      00:44:41
  5200       6   4,335      26,010       143.7       8.8      00:45:07
  5356      10   4,335      43,350       148.1       9.1      00:45:19
  5506       6   4,335      26,010       151.9       9.3      00:45:44
  5643       5   4,335      21,675       155.5       9.5      00:46:08
  5771       3   4,335      13,005       159.0       9.7      00:46:34
  5907       9   4,335      39,015       162.8      10.0      00:46:53
  6026       7   4,335      30,345       166.3      10.2      00:47:17
  6150       9   4,335      39,015       169.7      10.4      00:47:40
  6285       8   4,335      34,680       173.4      10.6      00:47:57
  6430       5   4,335      21,675       177.3      10.8      00:48:09
  6601       7   4,335      30,345       181.9      11.1      00:48:06
  6771       8   4,335      34,680       186.6      11.4      00:48:03
  6896       3   4,335      13,005       190.1      11.6      00:48:19
  7091       8   4,335      34,680       195.5      11.9      00:48:03
  7286      10   4,335      43,350       200.7      12.3      00:47:49
  7498       4   4,335      17,340       206.7      12.6      00:47:22
  7708       6   4,335      26,010       212.7      13.0      00:46:59
  7909       5   4,335      21,675       218.7      13.4      00:46:34
  8099       7   4,335      30,345       224.4      13.7      00:46:16
  8276       5   4,335      21,675       229.6      14.0      00:46:04
  8493       9   4,335      39,015       236.2      14.4      00:45:34
  8677       9   4,335      39,015       241.5      14.8      00:45:22
  8855       4   4,335      17,340       246.7      15.1      00:45:10
  9002       8   4,335      34,680       251.1      15.4      00:45:10
  9207       6   4,335      26,010       257.3      15.7      00:44:47
  9314       7   4,335      30,345       260.4      15.9      00:45:02
  9452       9   4,335      39,015       264.4      16.2      00:45:05
  9597       8   4,335      34,680       268.9      16.4      00:45:02
  9738      10   4,335      43,350       273.2      16.7      00:45:02
  9870      10   4,335      43,350       277.0      16.9      00:45:07
 10015       9   4,335      39,015       281.0      17.2      00:45:09
 10196       8   4,335      34,680       285.6      17.5      00:45:03
 10331      10   4,335      43,350       289.3      17.7      00:45:08
 10504      10   4,335      43,350       294.3      18.0      00:44:59
 10716       8   4,335      34,680       300.1      18.3      00:44:39
 10906       6   4,335      26,010       305.4      18.7      00:44:26
 11045       8   4,335      34,680       309.3      18.9      00:44:27
 11198       7   4,335      30,345       313.6      19.2      00:44:24
 11323      10   4,335      43,350       317.1      19.4      00:44:30
 11405      10   4,335      43,350       319.5      19.5      00:44:47
 11505       3   4,335      13,005       322.3      19.7      00:44:59
 11676       7   4,335      30,345       327.1      20.0      00:44:50
 11790       7   4,335      30,345       330.3      20.2      00:44:56
 11919       8   4,335      34,680       334.0      20.4      00:44:59
 12056       9   4,335      39,015       338.0      20.7      00:44:57
 12167       8   4,335      34,680       341.2      20.9      00:45:03
 12319       7   4,335      30,345       345.3      21.1      00:45:00
 12573       5   4,335      21,675       352.5      21.6      00:44:27
 12847      10   4,335      43,350       360.1      22.0      00:43:51
 13123      10   4,335      43,350       367.9      22.5      00:43:14
 13371       4   4,335      17,340       374.9      22.9      00:42:45
 13552       4   4,335      17,340       380.4      23.3      00:42:30
 13682       5   4,335      21,675       384.4      23.5      00:42:28
 13788       6   4,335      26,010       387.3      23.7      00:42:36
 13908       9   4,335      39,015       390.6      23.9      00:42:39
 14070       7   4,335      30,345       395.2      24.2      00:42:32
 14236      10   4,335      43,350       400.1      24.5      00:42:22
 14412       9   4,335      39,015       405.2      24.8      00:42:09
 14539       6   4,335      26,010       409.0      25.0      00:42:09
 14724       6   4,335      26,010       414.2      25.3      00:41:56
 14874       1   4,335       4,335       418.6      25.6      00:41:50
 15109       8   4,335      34,680       425.6      26.0      00:41:22
 15309       7   4,335      30,345       431.4      26.4      00:41:05
 15531       6   4,335      26,010       437.8      26.8      00:40:44
 15740       5   4,335      21,675       443.8      27.1      00:40:26
 15994       3   4,335      13,005       451.4      27.6      00:39:56
 16237      10   4,335      43,350       458.8      28.0      00:39:28
 16474       9   4,335      39,015       466.0      28.5      00:39:02
 16644       4   4,335      17,340       470.6      28.8      00:38:55
 16796       4   4,335      17,340       475.1      29.0      00:38:49
 16896       9   4,335      39,015       477.9      29.2      00:38:53
 17052       9   4,335      39,015       482.6      29.5      00:38:46
 17204       9   4,335      39,015       486.9      29.8      00:38:40
 17355       7   4,335      30,345       491.4      30.0      00:38:33
 17486       8   4,335      34,680       495.5      30.3      00:38:29
 17635       6   4,335      26,010       499.9      30.6      00:38:23
 17833       5   4,335      21,675       505.4      30.9      00:38:09
 17987       6   4,335      26,010       509.9      31.2      00:38:02
 18232       3   4,335      13,005       517.2      31.6      00:37:37
 18471      10   4,335      43,350       523.7      32.0      00:37:17
 18607       8   4,335      34,680       527.8      32.3      00:37:13
 18761       7   4,335      30,345       532.5      32.6      00:37:04
 18938       9   4,335      39,015       537.7      32.9      00:36:53
 19099       8   4,335      34,680       542.6      33.2      00:36:44
 19240       6   4,335      26,010       546.8      33.4      00:36:38
 19406      10   4,335      43,350       551.7      33.7      00:36:28
 19630       7   4,335      30,345       558.5      34.1      00:36:08
 19851       8   4,335      34,680       565.2      34.6      00:35:47
 20077       7   4,335      30,345       572.3      35.0      00:35:25
 20357      10   4,335      43,350       580.2      35.5      00:34:59
 20528       8   4,335      34,680       585.4      35.8      00:34:48
 20693      10   4,335      43,350       590.3      36.1      00:34:39
 20846       5   4,335      21,675       594.8      36.4      00:34:32
 21024       4   4,335      17,340       599.9      36.7      00:34:21
 21156       7   4,335      30,345       603.6      36.9      00:34:19
 21314       1   4,335       4,335       607.5      37.1      00:34:15
 21480       7   4,335      30,345       612.3      37.4      00:34:06
 21661       8   4,335      34,680       617.3      37.7      00:33:56
 21872      10   4,335      43,350       622.9      38.1      00:33:43
 22030       4   4,335      17,340       627.3      38.4      00:33:36
 22227       9   4,335      39,015       632.5      38.7      00:33:25
 22419       6   4,335      26,010       637.6      39.0      00:33:15
 22641      10   4,335      43,350       643.9      39.4      00:32:58
 22888       5   4,335      21,675       650.2      39.8      00:32:42
 23146       7   4,335      30,345       657.7      40.2      00:32:19
 23403       8   4,335      34,680       665.1      40.7      00:31:58
 23699       8   4,335      34,680       673.0      41.1      00:31:34
 23947       3   4,335      13,005       680.1      41.6      00:31:15
 24147      10   4,335      43,350       685.6      41.9      00:31:03
 24389       9   4,335      39,015       692.1      42.3      00:30:47
 24647       8   4,335      34,680       699.8      42.8      00:30:25
 24881       7   4,335      30,345       706.4      43.2      00:30:08
 25103       5   4,335      21,675       712.7      43.6      00:29:53
 25351       4   4,335      17,340       719.9      44.0      00:29:34
 25573      10   4,335      43,350       726.1      44.4      00:29:19
 25748      10   4,335      43,350       731.3      44.7      00:29:09
 25902       9   4,335      39,015       735.8      45.0      00:29:02
 26070       9   4,335      39,015       740.6      45.3      00:28:54
 26272       8   4,335      34,680       746.6      45.6      00:28:41
 26512       6   4,335      26,010       753.0      46.0      00:28:25
 26743       8   4,335      34,680       759.5      46.4      00:28:10
 26971      10   4,335      43,350       766.2      46.8      00:27:53
 27134       5   4,335      21,675       770.8      47.1      00:27:46
 27305      10   4,335      43,350       775.6      47.4      00:27:38
 27433       6   4,335      26,010       779.2      47.6      00:27:34
 27554       9   4,335      39,015       782.8      47.9      00:27:31
 27720       9   4,335      39,015       787.6      48.2      00:27:22
 27879      10   4,335      43,350       792.4      48.4      00:27:14
 28081       5   4,335      21,675       798.3      48.8      00:27:01
 28311       7   4,335      30,345       805.0      49.2      00:26:45
 28529       9   4,335      39,015       811.7      49.6      00:26:29
 28704       6   4,335      26,010       816.8      49.9      00:26:19
 28824       7   4,335      30,345       820.4      50.2      00:26:15
 28982      10   4,335      43,350       825.1      50.4      00:26:07
 29160       9   4,335      39,015       830.3      50.8      00:25:57
 29395       7   4,335      30,345       837.2      51.2      00:25:41
 29602       4   4,335      17,340       843.0      51.5      00:25:28
 29783       7   4,335      30,345       848.3      51.9      00:25:18
 29923       9   4,335      39,015       852.4      52.1      00:25:12
 30087       7   4,335      30,345       857.2      52.4      00:25:03
 30248       9   4,335      39,015       862.0      52.7      00:24:55
 30424       7   4,335      30,345       867.2      53.0      00:24:45
 30582       7   4,335      30,345       872.0      53.3      00:24:36
 30799       7   4,335      30,345       878.4      53.7      00:24:22
 31053       5   4,335      21,675       885.6      54.1      00:24:05
 31323       7   4,335      30,345       893.8      54.6      00:23:44
 31590       7   4,335      30,345       901.8      55.1      00:23:24
 31852       6   4,335      26,010       909.8      55.6      00:23:05
 32095       7   4,335      30,345       917.2      56.1      00:22:48
 32339       9   4,335      39,015       924.8      56.5      00:22:30
 32542       7   4,335      30,345       930.9      56.9      00:22:17
 32698      10   4,335      43,350       935.5      57.2      00:22:09
 32876       5   4,335      21,675       940.8      57.5      00:21:59
 33011       8   4,335      34,680       945.0      57.8      00:21:53
 33133      10   4,335      43,350       948.7      58.0      00:21:48
 33322       6   4,335      26,010       954.3      58.3      00:21:37
 33529       5   4,335      21,675       960.5      58.7      00:21:24
 33727       9   4,335      39,015       966.5      59.1      00:21:11
 33925       6   4,335      26,010       972.5      59.5      00:20:59
 34135       6   4,335      26,010       979.0      59.9      00:20:45
 34384       6   4,335      26,010       986.5      60.3      00:20:28
 34664       9   4,335      39,015       994.9      60.8      00:20:08
 34901       7   4,335      30,345     1,002.2      61.3      00:19:52
 35138      10   4,335      43,350     1,009.3      61.7      00:19:37
 35397       8   4,335      34,680     1,017.1      62.2      00:19:19
 35683       8   4,335      34,680     1,025.6      62.7      00:18:60
 35956       8   4,335      34,680     1,033.7      63.2      00:18:42
 36225       9   4,335      39,015     1,041.8      63.7      00:18:24
 36500       1   4,335       4,335     1,049.9      64.2      00:18:06
 36665       9   4,335      39,015     1,054.8      64.5      00:17:57
 36803       8   4,335      34,680     1,058.7      64.7      00:17:52
 36961       4   4,335      17,340     1,063.2      65.0      00:17:44
 37157       8   4,335      34,680     1,068.7      65.3      00:17:34
 37307       6   4,335      26,010     1,072.7      65.6      00:17:28
 37453       9   4,335      39,015     1,076.8      65.8      00:17:21
 37591       8   4,335      34,680     1,080.8      66.1      00:17:15
 37764       5   4,335      21,675     1,085.5      66.4      00:17:07
 37964       5   4,335      21,675     1,091.3      66.7      00:16:56
 38127       6   4,335      26,010     1,096.2      67.0      00:16:47
 38287       9   4,335      39,015     1,100.9      67.3      00:16:39
 38458       7   4,335      30,345     1,106.1      67.6      00:16:29
 38695       4   4,335      17,340     1,113.1      68.1      00:16:15
 38966       5   4,335      21,675     1,121.0      68.5      00:15:58
 39163      10   4,335      43,350     1,126.6      68.9      00:15:47
 39418       5   4,335      21,675     1,133.8      69.3      00:15:33
 39641       9   4,335      39,015     1,140.2      69.7      00:15:20
 39882       5   4,335      21,675     1,147.1      70.1      00:15:06
 40198       7   4,335      30,345     1,156.2      70.7      00:14:46
 40488       7   4,335      30,345     1,164.7      71.2      00:14:28
 40738       6   4,335      26,010     1,172.0      71.7      00:14:13
 40910       9   4,335      39,015     1,177.2      72.0      00:14:04
 41107       5   4,335      21,675     1,183.0      72.3      00:13:53
 41316       6   4,335      26,010     1,189.1      72.7      00:13:41
 41503       8   4,335      34,680     1,194.6      73.0      00:13:31
 41722       9   4,335      39,015     1,201.0      73.4      00:13:19
 41893       9   4,335      39,015     1,206.2      73.7      00:13:09
 42076       7   4,335      30,345     1,211.2      74.1      00:13:00
 42286       4   4,335      17,340     1,216.9      74.4      00:12:50
 42451       7   4,335      30,345     1,221.8      74.7      00:12:41
 42643       6   4,335      26,010     1,227.2      75.0      00:12:31
 42807      10   4,335      43,350     1,232.0      75.3      00:12:23
 42966       4   4,335      17,340     1,236.6      75.6      00:12:15
 43108       8   4,335      34,680     1,241.0      75.9      00:12:07
 43237       8   4,335      34,680     1,244.9      76.1      00:12:01
 43350       9   4,335      39,015     1,248.3      76.3      00:11:56
 43475       7   4,335      30,345     1,251.9      76.5      00:11:50
 43743       8   4,335      34,680     1,259.4      77.0      00:11:35
 43961      10   4,335      43,350     1,265.8      77.4      00:11:23
 44154      10   4,335      43,350     1,271.3      77.7      00:11:13
 44305       7   4,335      30,345     1,275.6      78.0      00:11:05
 44457       7   4,335      30,345     1,279.9      78.2      00:10:58
 44650       5   4,335      21,675     1,285.4      78.6      00:10:48
 44845       8   4,335      34,680     1,291.1      78.9      00:10:37
 45055       8   4,335      34,680     1,297.1      79.3      00:10:26
 45291       8   4,335      34,680     1,303.4      79.7      00:10:14
 45482       7   4,335      30,345     1,308.8      80.0      00:10:04
 45702       4   4,335      17,340     1,314.6      80.4      00:09:53
 45895       8   4,335      34,680     1,320.0      80.7      00:09:43
 46105       8   4,335      34,680     1,326.3      81.1      00:09:31
 46327       7   4,335      30,345     1,332.9      81.5      00:09:18
 46534       9   4,335      39,015     1,338.9      81.9      00:09:07
 46791       8   4,335      34,680     1,346.5      82.3      00:08:52
 47028       9   4,335      39,015     1,352.9      82.7      00:08:40
 47231       8   4,335      34,680     1,358.4      83.0      00:08:30
 47421       4   4,335      17,340     1,363.6      83.4      00:08:20
 47567       9   4,335      39,015     1,367.7      83.6      00:08:13
 47687       6   4,335      26,010     1,371.2      83.8      00:08:08
 47844      10   4,335      43,350     1,375.5      84.1      00:08:00
 47981       5   4,335      21,675     1,379.7      84.3      00:07:53
 48160       8   4,335      34,680     1,384.7      84.7      00:07:44
 48378       9   4,335      39,015     1,391.1      85.0      00:07:32
 48688       6   4,335      26,010     1,400.1      85.6      00:07:14
 48917       7   4,335      30,345     1,406.6      86.0      00:07:01
 49098       6   4,335      26,010     1,411.9      86.3      00:06:52
 49287       5   4,335      21,675     1,417.4      86.7      00:06:42
 49530       9   4,335      39,015     1,424.0      87.1      00:06:29
 49710       5   4,335      21,675     1,428.7      87.3      00:06:21
 49860       8   4,335      34,680     1,432.8      87.6      00:06:14
 50020      10   4,335      43,350     1,437.4      87.9      00:06:05
 50213       9   4,335      39,015     1,442.9      88.2      00:05:55
 50418       8   4,335      34,680     1,448.4      88.6      00:05:45
 50603       8   4,335      34,680     1,453.8      88.9      00:05:35
 50770       7   4,335      30,345     1,458.8      89.2      00:05:26
 50906       6   4,335      26,010     1,462.8      89.4      00:05:19
 51056      10   4,335      43,350     1,467.4      89.7      00:05:11
 51222       9   4,335      39,015     1,472.0      90.0      00:05:02
 51455       5   4,335      21,675     1,478.9      90.4      00:04:49
 51764       6   4,335      26,010     1,488.4      91.0      00:04:31
 52078       6   4,335      26,010     1,497.8      91.6      00:04:13
 52380       9   4,335      39,015     1,507.2      92.1      00:03:55
 52632       8   4,335      34,680     1,515.2      92.6      00:03:40
 52892       8   4,335      34,680     1,523.3      93.1      00:03:25
 53186       9   4,335      39,015     1,532.2      93.7      00:03:08
 53468       9   4,335      39,015     1,540.7      94.2      00:02:53
 53720       9   4,335      39,015     1,548.1      94.6      00:02:39
 53869       5   4,335      21,675     1,552.4      94.9      00:02:31
 54053       5   4,335      21,675     1,557.7      95.2      00:02:22
 54206      10   4,335      43,350     1,562.3      95.5      00:02:13
 54376       7   4,335      30,345     1,567.0      95.8      00:02:05
 54541       5   4,335      21,675     1,571.2      96.1      00:01:57
 54695       6   4,335      26,010     1,575.8      96.3      00:01:49
 54895       7   4,335      30,345     1,581.4      96.7      00:01:39
 55109      10   4,335      43,350     1,587.5      97.1      00:01:28
 55326       9   4,335      39,015     1,593.4      97.4      00:01:17
 55513      10   4,335      43,350     1,598.5      97.7      00:01:08
 55683       7   4,335      30,345     1,603.4      98.0      00:00:59
 55868      10   4,335      43,350     1,608.9      98.4      00:00:49
 56096       8   4,335      34,680     1,615.6      98.8      00:00:37
 56314       8   4,335      34,680     1,622.1      99.2      00:00:25
 56591       9   4,335      39,015     1,630.5      99.7      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 2977.829
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
