
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A100_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   279       7   4,135      28,945         6.6       0.4      00:39:10
   548       2   4,135       8,270        13.2       0.8      00:39:17
   795       7   4,135      28,945        19.6       1.3      00:39:20
  1052       6   4,135      24,810        26.1       1.7      00:39:16
  1270       4   4,135      16,540        31.9       2.0      00:39:57
  1480       9   4,135      37,215        37.8       2.4      00:40:23
  1712       2   4,135       8,270        44.1       2.8      00:40:11
  1948       9   4,135      37,215        50.1       3.2      00:40:17
  2184       5   4,135      20,675        56.4       3.6      00:40:05
  2424       6   4,135      24,810        62.7       4.0      00:39:53
  2671       9   4,135      37,215        69.2       4.4      00:39:35
  2883       9   4,135      37,215        75.0       4.8      00:39:41
  3116       7   4,135      28,945        81.2       5.2      00:39:34
  3328       7   4,135      28,945        87.2       5.6      00:39:30
  3570       9   4,135      37,215        93.9       6.0      00:39:08
  3804       8   4,135      33,080       100.2       6.4      00:38:56
  3979       6   4,135      24,810       104.5       6.7      00:39:32
  4145      10   4,135      41,350       108.9       7.0      00:40:05
  4298       6   4,135      24,810       112.7       7.2      00:40:47
  4457       9   4,135      37,215       116.9       7.5      00:41:16
  4607       7   4,135      28,945       121.0       7.8      00:41:43
  4742       6   4,135      24,810       124.8       8.0      00:42:16
  4884       7   4,135      28,945       128.6       8.2      00:42:47
  5015       9   4,135      37,215       132.1       8.5      00:43:22
  5124      10   4,135      41,350       134.9       8.6      00:44:08
  5258       8   4,135      33,080       138.4       8.9      00:44:37
  5397       8   4,135      33,080       142.4       9.1      00:44:54
  5531       6   4,135      24,810       145.5       9.3      00:45:29
  5646       6   4,135      24,810       148.4       9.5      00:46:05
  5763       4   4,135      16,540       151.5       9.7      00:46:36
  5917      10   4,135      41,350       155.6      10.0      00:46:46
  6075      10   4,135      41,350       159.9      10.2      00:46:49
  6242       7   4,135      28,945       164.3      10.5      00:46:51
  6397       6   4,135      24,810       168.2      10.8      00:47:00
  6537      10   4,135      41,350       171.9      11.0      00:47:15
  6680       6   4,135      24,810       175.6      11.3      00:47:26
  6843       8   4,135      33,080       179.9      11.5      00:47:26
  7008       3   4,135      12,405       184.2      11.8      00:47:26
  7168       7   4,135      28,945       188.3      12.1      00:47:30
  7319       5   4,135      20,675       192.4      12.3      00:47:32
  7510       8   4,135      33,080       197.5      12.7      00:47:16
  7670       1   4,135       4,135       201.9      12.9      00:47:14
  7825      10   4,135      41,350       206.2      13.2      00:47:12
  8009       8   4,135      33,080       211.5      13.6      00:46:54
  8164       6   4,135      24,810       216.0      13.8      00:46:49
  8335       9   4,135      37,215       220.8      14.1      00:46:39
  8519      10   4,135      41,350       226.0      14.5      00:46:22
  8713       8   4,135      33,080       231.4      14.8      00:46:05
  8880       9   4,135      37,215       236.1      15.1      00:45:56
  9081       7   4,135      28,945       241.8      15.5      00:45:35
  9233       7   4,135      28,945       246.1      15.8      00:45:31
  9336       4   4,135      16,540       249.0      16.0      00:45:47
  9448       4   4,135      16,540       252.1      16.2      00:45:58
  9577       6   4,135      24,810       255.9      16.4      00:46:00
  9728       5   4,135      20,675       260.3      16.7      00:45:55
  9882       7   4,135      28,945       264.5      17.0      00:45:51
 10034       4   4,135      16,540       268.5      17.2      00:45:50
 10189      10   4,135      41,350       272.3      17.5      00:45:51
 10328       8   4,135      33,080       275.9      17.7      00:45:54
 10436      10   4,135      41,350       278.9      17.9      00:46:04
 10606      10   4,135      41,350       283.2      18.2      00:45:58
 10764       5   4,135      20,675       287.4      18.4      00:45:53
 10939       7   4,135      28,945       292.2      18.7      00:45:42
 11111      10   4,135      41,350       296.8      19.0      00:45:32
 11245       4   4,135      16,540       300.4      19.3      00:45:35
 11382       8   4,135      33,080       304.1      19.5      00:45:35
 11492       7   4,135      28,945       307.2      19.7      00:45:42
 11638       7   4,135      28,945       311.0      19.9      00:45:40
 11784       7   4,135      28,945       314.9      20.2      00:45:37
 11940       7   4,135      28,945       319.1      20.5      00:45:31
 12077       9   4,135      37,215       323.0      20.7      00:45:28
 12196       9   4,135      37,215       326.3      20.9      00:45:32
 12389       4   4,135      16,540       331.3      21.2      00:45:16
 12638       8   4,135      33,080       338.1      21.7      00:44:43
 12899      10   4,135      41,350       344.8      22.1      00:44:12
 13137       8   4,135      33,080       351.2      22.5      00:43:44
 13388       9   4,135      37,215       358.1      23.0      00:43:13
 13570      10   4,135      41,350       363.4      23.3      00:42:57
 13707       3   4,135      12,405       367.3      23.5      00:42:53
 13852       9   4,135      37,215       371.2      23.8      00:42:51
 14048       8   4,135      33,080       376.3      24.1      00:42:36
 14221       6   4,135      24,810       381.2      24.4      00:42:24
 14355       7   4,135      28,945       385.0      24.7      00:42:21
 14516      10   4,135      41,350       389.5      25.0      00:42:13
 14665       7   4,135      28,945       393.6      25.2      00:42:08
 14840       9   4,135      37,215       398.3      25.5      00:41:57
 15045       8   4,135      33,080       404.1      25.9      00:41:37
 15271       3   4,135      12,405       410.4      26.3      00:41:13
 15481       9   4,135      37,215       416.2      26.7      00:40:54
 15692       4   4,135      16,540       421.9      27.0      00:40:36
 15918       9   4,135      37,215       428.5      27.5      00:40:11
 16153       6   4,135      24,810       435.2      27.9      00:39:45
 16384      10   4,135      41,350       441.8      28.3      00:39:21
 16569       8   4,135      33,080       447.0      28.6      00:39:09
 16727       4   4,135      16,540       451.2      28.9      00:39:02
 16893       6   4,135      24,810       455.8      29.2      00:38:54
 17063       5   4,135      20,675       460.6      29.5      00:38:43
 17176       8   4,135      33,080       463.6      29.7      00:38:46
 17318      10   4,135      41,350       467.7      30.0      00:38:40
 17406       3   4,135      12,405       470.2      30.1      00:38:46
 17545       7   4,135      28,945       474.3      30.4      00:38:40
 17690       6   4,135      24,810       478.3      30.7      00:38:35
 17859       9   4,135      37,215       482.8      30.9      00:38:26
 17993       6   4,135      24,810       486.5      31.2      00:38:23
 18218       8   4,135      33,080       493.0      31.6      00:38:01
 18445       6   4,135      24,810       498.9      32.0      00:37:42
 18587       6   4,135      24,810       502.8      32.2      00:37:38
 18714       8   4,135      33,080       506.5      32.5      00:37:34
 18865       7   4,135      28,945       510.7      32.7      00:37:27
 18990       8   4,135      33,080       514.5      33.0      00:37:23
 19123       7   4,135      28,945       518.2      33.2      00:37:19
 19279      10   4,135      41,350       522.6      33.5      00:37:11
 19492       7   4,135      28,945       528.8      33.9      00:36:52
 19719       9   4,135      37,215       535.4      34.3      00:36:30
 19947       9   4,135      37,215       542.0      34.7      00:36:07
 20205       5   4,135      20,675       549.4      35.2      00:35:41
 20449       6   4,135      24,810       556.1      35.6      00:35:19
 20582       9   4,135      37,215       559.9      35.9      00:35:15
 20725       9   4,135      37,215       563.9      36.1      00:35:09
 20867       6   4,135      24,810       568.0      36.4      00:35:03
 21012       3   4,135      12,405       572.0      36.7      00:34:57
 21184       8   4,135      33,080       576.4      36.9      00:34:49
 21346       7   4,135      28,945       580.4      37.2      00:34:44
 21507       3   4,135      12,405       584.8      37.5      00:34:35
 21706       9   4,135      37,215       589.8      37.8      00:34:24
 21898      10   4,135      41,350       594.8      38.1      00:34:11
 22093       7   4,135      28,945       599.7      38.4      00:34:00
 22300       8   4,135      33,080       605.1      38.8      00:33:47
 22495       8   4,135      33,080       610.3      39.1      00:33:35
 22680       6   4,135      24,810       615.2      39.4      00:33:24
 22901       9   4,135      37,215       620.6      39.8      00:33:10
 23123      10   4,135      41,350       626.7      40.2      00:32:53
 23380       9   4,135      37,215       633.7      40.6      00:32:31
 23604       6   4,135      24,810       639.4      41.0      00:32:16
 23875       8   4,135      33,080       646.9      41.5      00:31:52
 24139       5   4,135      20,675       653.7      41.9      00:31:32
 24394       6   4,135      24,810       660.3      42.3      00:31:13
 24620      10   4,135      41,350       666.7      42.7      00:30:55
 24836       5   4,135      20,675       672.5      43.1      00:30:40
 25034       4   4,135      16,540       677.9      43.4      00:30:28
 25222       5   4,135      20,675       683.1      43.8      00:30:16
 25418       7   4,135      28,945       688.5      44.1      00:30:03
 25582       6   4,135      24,810       692.9      44.4      00:29:56
 25741       7   4,135      28,945       697.4      44.7      00:29:47
 25899       4   4,135      16,540       701.8      45.0      00:29:39
 26023       9   4,135      37,215       705.1      45.2      00:29:36
 26178       6   4,135      24,810       709.4      45.5      00:29:29
 26347       7   4,135      28,945       714.1      45.8      00:29:19
 26541       7   4,135      28,945       719.1      46.1      00:29:08
 26734       8   4,135      33,080       724.2      46.4      00:28:57
 26928       7   4,135      28,945       729.6      46.8      00:28:44
 27088       9   4,135      37,215       733.9      47.0      00:28:37
 27250       6   4,135      24,810       738.3      47.3      00:28:29
 27359       4   4,135      16,540       741.3      47.5      00:28:27
 27515       4   4,135      16,540       745.6      47.8      00:28:19
 27691      10   4,135      41,350       750.5      48.1      00:28:09
 27859      10   4,135      41,350       755.3      48.4      00:27:59
 28059       7   4,135      28,945       760.8      48.8      00:27:46
 28285       9   4,135      37,215       767.2      49.2      00:27:29
 28475       6   4,135      24,810       772.6      49.5      00:27:16
 28660       2   4,135       8,270       777.8      49.9      00:27:05
 28781       8   4,135      33,080       781.3      50.1      00:26:60
 28937       8   4,135      33,080       785.8      50.4      00:26:52
 29082       9   4,135      37,215       789.8      50.6      00:26:45
 29286      10   4,135      41,350       795.4      51.0      00:26:32
 29457      10   4,135      41,350       800.3      51.3      00:26:21
 29664       6   4,135      24,810       805.8      51.6      00:26:09
 29802      10   4,135      41,350       809.8      51.9      00:26:02
 29930       4   4,135      16,540       813.3      52.1      00:25:57
 30063       6   4,135      24,810       817.0      52.4      00:25:51
 30226       4   4,135      16,540       821.6      52.7      00:25:42
 30398       5   4,135      20,675       826.4      53.0      00:25:32
 30571       8   4,135      33,080       831.4      53.3      00:25:21
 30800       6   4,135      24,810       837.9      53.7      00:25:05
 31018       3   4,135      12,405       843.8      54.1      00:24:50
 31229       9   4,135      37,215       849.9      54.5      00:24:36
 31431       6   4,135      24,810       855.7      54.8      00:24:22
 31649       7   4,135      28,945       861.8      55.2      00:24:07
 31831       7   4,135      28,945       867.2      55.6      00:23:55
 32061       7   4,135      28,945       873.9      56.0      00:23:38
 32263       8   4,135      33,080       879.8      56.4      00:23:24
 32479       6   4,135      24,810       886.2      56.8      00:23:09
 32595       8   4,135      33,080       889.4      57.0      00:23:04
 32722       6   4,135      24,810       893.0      57.2      00:22:59
 32850       8   4,135      33,080       896.6      57.5      00:22:53
 32985       9   4,135      37,215       900.6      57.7      00:22:47
 33110       5   4,135      20,675       904.3      58.0      00:22:41
 33273       6   4,135      24,810       908.8      58.3      00:22:32
 33478      10   4,135      41,350       914.6      58.6      00:22:18
 33666       6   4,135      24,810       920.2      59.0      00:22:06
 33851       9   4,135      37,215       925.5      59.3      00:21:54
 33997       7   4,135      28,945       929.7      59.6      00:21:46
 34104      10   4,135      41,350       932.9      59.8      00:21:42
 34206      10   4,135      41,350       935.9      60.0      00:21:38
 34435      10   4,135      41,350       942.4      60.4      00:21:22
 34662      10   4,135      41,350       948.9      60.8      00:21:07
 34883       7   4,135      28,945       955.4      61.2      00:20:51
 35126       6   4,135      24,810       962.3      61.7      00:20:34
 35362       6   4,135      24,810       969.1      62.1      00:20:18
 35618       4   4,135      16,540       976.4      62.6      00:19:60
 35841      10   4,135      41,350       982.7      63.0      00:19:45
 36080       9   4,135      37,215       989.5      63.4      00:19:29
 36327       6   4,135      24,810       996.7      63.9      00:19:11
 36549      10   4,135      41,350     1,002.9      64.3      00:18:57
 36729       8   4,135      33,080     1,007.8      64.6      00:18:47
 36875       5   4,135      20,675     1,011.9      64.9      00:18:40
 37044       4   4,135      16,540     1,016.5      65.1      00:18:31
 37231       6   4,135      24,810     1,021.3      65.5      00:18:21
 37383       9   4,135      37,215     1,025.3      65.7      00:18:14
 37527       9   4,135      37,215     1,029.1      66.0      00:18:07
 37686       6   4,135      24,810     1,033.3      66.2      00:17:59
 37864       5   4,135      20,675     1,038.3      66.5      00:17:49
 38037       3   4,135      12,405     1,043.1      66.9      00:17:39
 38245       7   4,135      28,945     1,048.9      67.2      00:17:26
 38436       4   4,135      16,540     1,054.4      67.6      00:17:15
 38654       9   4,135      37,215     1,060.6      68.0      00:17:01
 38892       6   4,135      24,810     1,067.2      68.4      00:16:46
 39045      10   4,135      41,350     1,071.5      68.7      00:16:37
 39186       9   4,135      37,215     1,075.2      68.9      00:16:31
 39357       6   4,135      24,810     1,079.9      69.2      00:16:22
 39553       8   4,135      33,080     1,085.2      69.6      00:16:10
 39705       9   4,135      37,215     1,089.3      69.8      00:16:03
 39907      10   4,135      41,350     1,094.9      70.2      00:15:51
 40160       9   4,135      37,215     1,101.8      70.6      00:15:35
 40414      10   4,135      41,350     1,108.9      71.1      00:15:19
 40649       8   4,135      33,080     1,115.5      71.5      00:15:04
 40876       6   4,135      24,810     1,121.9      71.9      00:14:50
 41017       9   4,135      37,215     1,126.0      72.2      00:14:42
 41141       3   4,135      12,405     1,129.4      72.4      00:14:36
 41346       5   4,135      20,675     1,135.1      72.7      00:14:24
 41548       7   4,135      28,945     1,140.7      73.1      00:14:12
 41735       4   4,135      16,540     1,146.0      73.5      00:14:01
 41902       6   4,135      24,810     1,150.8      73.8      00:13:52
 42052       6   4,135      24,810     1,154.7      74.0      00:13:44
 42180      10   4,135      41,350     1,158.0      74.2      00:13:39
 42334      10   4,135      41,350     1,162.1      74.5      00:13:31
 42539       1   4,135       4,135     1,167.8      74.8      00:13:19
 42746       5   4,135      20,675     1,173.4      75.2      00:13:07
 42953       6   4,135      24,810     1,179.2      75.6      00:12:55
 43111       8   4,135      33,080     1,183.9      75.9      00:12:45
 43254      10   4,135      41,350     1,188.0      76.1      00:12:38
 43384       4   4,135      16,540     1,191.7      76.4      00:12:31
 43576       9   4,135      37,215     1,196.8      76.7      00:12:20
 43857       7   4,135      28,945     1,204.5      77.2      00:12:03
 44108       9   4,135      37,215     1,211.3      77.6      00:11:48
 44268       5   4,135      20,675     1,215.8      77.9      00:11:39
 44504       8   4,135      33,080     1,222.1      78.3      00:11:26
 44765       4   4,135      16,540     1,229.3      78.8      00:11:10
 45032       9   4,135      37,215     1,236.7      79.3      00:10:53
 45361       5   4,135      20,675     1,245.1      79.8      00:10:35
 45602       3   4,135      12,405     1,251.4      80.2      00:10:21
 45890      10   4,135      41,350     1,259.0      80.7      00:10:05
 46164       7   4,135      28,945     1,266.8      81.2      00:09:48
 46483       8   4,135      33,080     1,275.6      81.8      00:09:28
 46836      10   4,135      41,350     1,285.6      82.4      00:09:06
 47071       9   4,135      37,215     1,291.6      82.8      00:08:54
 47346       5   4,135      20,675     1,298.8      83.2      00:08:39
 47652       6   4,135      24,810     1,307.0      83.8      00:08:21
 47936       5   4,135      20,675     1,314.8      84.3      00:08:05
 48245       8   4,135      33,080     1,323.2      84.8      00:07:47
 48517       9   4,135      37,215     1,330.8      85.3      00:07:31
 48856       8   4,135      33,080     1,340.1      85.9      00:07:12
 49182       7   4,135      28,945     1,349.3      86.5      00:06:52
 49468       8   4,135      33,080     1,356.6      87.0      00:06:37
 49810       5   4,135      20,675     1,365.4      87.5      00:06:19
 50122       7   4,135      28,945     1,373.9      88.1      00:06:02
 50434       4   4,135      16,540     1,382.0      88.6      00:05:45
 50750       9   4,135      37,215     1,390.9      89.1      00:05:27
 51043       3   4,135      12,405     1,399.4      89.7      00:05:10
 51405       8   4,135      33,080     1,409.2      90.3      00:04:50
 51752       7   4,135      28,945     1,419.3      91.0      00:04:30
 52088       9   4,135      37,215     1,428.9      91.6      00:04:11
 52478       5   4,135      20,675     1,440.6      92.3      00:03:47
 52926       6   4,135      24,810     1,453.9      93.2      00:03:21
 53329       5   4,135      20,675     1,465.6      93.9      00:02:58
 53695       7   4,135      28,945     1,476.0      94.6      00:02:38
 54037       4   4,135      16,540     1,485.5      95.2      00:02:20
 54377       9   4,135      37,215     1,494.7      95.8      00:02:02
 54799       6   4,135      24,810     1,505.8      96.5      00:01:41
 55100       7   4,135      28,945     1,514.1      97.0      00:01:26
 55354       7   4,135      28,945     1,520.6      97.5      00:01:13
 55619      10   4,135      41,350     1,527.6      97.9      00:01:00
 55847       8   4,135      33,080     1,534.1      98.3      00:00:48
 56181       7   4,135      28,945     1,543.5      98.9      00:00:31
 56526       6   4,135      24,810     1,553.4      99.6      00:00:12

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 2871.372
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
