
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A200_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   276       7   4,235      29,645         6.7       0.4      00:39:40
   582       5   4,235      21,175        14.4       0.9      00:36:43
   888       5   4,235      21,175        22.2       1.4      00:35:32
  1158       9   4,235      38,115        29.6       1.9      00:35:21
  1453       3   4,235      12,705        37.9       2.4      00:34:20
  1756       2   4,235       8,470        46.3       2.9      00:33:34
  2074       8   4,235      33,880        54.7       3.4      00:32:59
  2406       4   4,235      16,940        63.8       4.0      00:32:08
  2729       6   4,235      25,410        72.5       4.5      00:31:35
  3073       5   4,235      21,175        81.7       5.1      00:30:57
  3391       8   4,235      33,880        91.1       5.7      00:30:22
  3711       5   4,235      21,175       100.0       6.3      00:29:59
  4011       9   4,235      38,115       107.9       6.8      00:29:57
  4267       5   4,235      21,175       114.6       7.2      00:30:14
  4542       6   4,235      25,410       122.1       7.6      00:30:16
  4757       7   4,235      29,645       128.2       8.0      00:30:37
  5002       2   4,235       8,470       134.9       8.4      00:30:46
  5267       9   4,235      38,115       142.1       8.9      00:30:48
  5495       5   4,235      21,175       148.1       9.3      00:31:03
  5732      10   4,235      42,350       154.3       9.7      00:31:15
  5990      10   4,235      42,350       161.4      10.1      00:31:13
  6216       9   4,235      38,115       167.6      10.5      00:31:21
  6445       8   4,235      33,880       173.6      10.9      00:31:30
  6651       4   4,235      16,940       179.1      11.2      00:31:45
  6882       7   4,235      29,645       185.3      11.6      00:31:49
  7147      10   4,235      42,350       192.2      12.0      00:31:45
  7400       5   4,235      21,175       199.4      12.5      00:31:38
  7697       8   4,235      33,880       207.5      13.0      00:31:20
  7970       3   4,235      12,705       215.5      13.5      00:31:04
  8204       9   4,235      38,115       222.3      13.9      00:30:60
  8455       7   4,235      29,645       229.6      14.4      00:30:51
  8739       6   4,235      25,410       237.7      14.9      00:30:35
  9034       5   4,235      21,175       246.2      15.4      00:30:15
  9283       9   4,235      38,115       253.6      15.9      00:30:06
  9488       8   4,235      33,880       259.4      16.2      00:30:09
  9720       8   4,235      33,880       266.4      16.7      00:30:03
  9961       4   4,235      16,940       273.1      17.1      00:29:59
 10192       9   4,235      38,115       279.0      17.5      00:30:00
 10403       6   4,235      25,410       284.6      17.8      00:30:03
 10644       9   4,235      38,115       291.1      18.2      00:29:59
 10907       6   4,235      25,410       298.4      18.7      00:29:49
 11163       5   4,235      21,175       305.4      19.1      00:29:41
 11387       6   4,235      25,410       311.6      19.5      00:29:39
 11609       9   4,235      38,115       317.7      19.9      00:29:37
 11832       6   4,235      25,410       323.9      20.3      00:29:33
 12045       9   4,235      38,115       329.9      20.6      00:29:32
 12293       4   4,235      16,940       336.7      21.1      00:29:24
 12596       6   4,235      25,410       345.1      21.6      00:29:06
 12914       8   4,235      33,880       353.5      22.1      00:28:48
 13239       3   4,235      12,705       362.5      22.7      00:28:27
 13523       7   4,235      29,645       371.0      23.2      00:28:11
 13769       8   4,235      33,880       377.8      23.6      00:28:03
 14028       9   4,235      38,115       384.9      24.1      00:27:54
 14296       6   4,235      25,410       392.6      24.6      00:27:42
 14575      10   4,235      42,350       400.5      25.1      00:27:28
 14841       5   4,235      21,175       408.0      25.5      00:27:17
 15151       7   4,235      29,645       417.0      26.1      00:26:58
 15499       5   4,235      21,175       426.8      26.7      00:26:35
 15846       6   4,235      25,410       436.6      27.3      00:26:13
 16154       5   4,235      21,175       445.8      27.9      00:25:54
 16439       6   4,235      25,410       454.2      28.4      00:25:39
 16698       9   4,235      38,115       461.4      28.9      00:25:30
 16934      10   4,235      42,350       468.0      29.3      00:25:24
 17165      10   4,235      42,350       474.5      29.7      00:25:19
 17370       6   4,235      25,410       480.5      30.1      00:25:15
 17575       6   4,235      25,410       486.7      30.5      00:25:10
 17852      10   4,235      42,350       494.3      30.9      00:24:59
 18139      10   4,235      42,350       502.6      31.5      00:24:45
 18500       5   4,235      21,175       512.4      32.1      00:24:25
 18714       8   4,235      33,880       518.8      32.5      00:24:19
 18939      10   4,235      42,350       525.3      32.9      00:24:13
 19186       4   4,235      16,940       532.6      33.3      00:24:04
 19491       7   4,235      29,645       541.5      33.9      00:23:47
 19845       8   4,235      33,880       552.0      34.5      00:23:25
 20182       5   4,235      21,175       562.1      35.2      00:23:05
 20499       7   4,235      29,645       571.1      35.7      00:22:50
 20736       8   4,235      33,880       577.9      36.2      00:22:42
 20983       6   4,235      25,410       585.0      36.6      00:22:34
 21257       7   4,235      29,645       592.1      37.1      00:22:25
 21570       7   4,235      29,645       600.6      37.6      00:22:11
 21854       6   4,235      25,410       608.0      38.1      00:22:02
 22133       7   4,235      29,645       615.3      38.5      00:21:52
 22413       8   4,235      33,880       622.7      39.0      00:21:43
 22673       9   4,235      38,115       629.9      39.4      00:21:34
 22918       5   4,235      21,175       636.0      39.8      00:21:28
 23158       8   4,235      33,880       642.9      40.2      00:21:20
 23398       8   4,235      33,880       649.6      40.7      00:21:13
 23636       8   4,235      33,880       655.7      41.0      00:21:08
 23839       8   4,235      33,880       661.6      41.4      00:21:02
 24081       1   4,235       4,235       668.2      41.8      00:20:55
 24404       9   4,235      38,115       676.6      42.3      00:20:42
 24687       6   4,235      25,410       684.8      42.9      00:20:30
 24973       8   4,235      33,880       692.5      43.3      00:20:19
 25286       6   4,235      25,410       701.4      43.9      00:20:04
 25553       6   4,235      25,410       708.9      44.4      00:19:54
 25748      10   4,235      42,350       714.4      44.7      00:19:50
 25971       9   4,235      38,115       720.7      45.1      00:19:43
 26214       9   4,235      38,115       727.7      45.5      00:19:35
 26462       3   4,235      12,705       734.4      46.0      00:19:27
 26765      10   4,235      42,350       742.7      46.5      00:19:14
 26948       9   4,235      38,115       747.9      46.8      00:19:11
 27143       7   4,235      29,645       753.3      47.1      00:19:06
 27355       7   4,235      29,645       759.1      47.5      00:19:01
 27577       6   4,235      25,410       765.4      47.9      00:18:54
 27814       7   4,235      29,645       772.2      48.3      00:18:45
 28080       8   4,235      33,880       779.8      48.8      00:18:35
 28369       7   4,235      29,645       788.1      49.3      00:18:22
 28652       3   4,235      12,705       796.5      49.8      00:18:09
 28844       7   4,235      29,645       802.1      50.2      00:18:04
 29036       7   4,235      29,645       807.6      50.5      00:17:59
 29318       8   4,235      33,880       815.6      51.0      00:17:47
 29616       3   4,235      12,705       823.9      51.6      00:17:35
 29857       6   4,235      25,410       830.9      52.0      00:17:26
 30104       9   4,235      38,115       837.9      52.4      00:17:16
 30375       4   4,235      16,940       845.6      52.9      00:17:05
 30657       3   4,235      12,705       853.9      53.4      00:16:53
 30978       9   4,235      38,115       863.2      54.0      00:16:38
 31296       7   4,235      29,645       872.4      54.6      00:16:24
 31616       7   4,235      29,645       881.7      55.2      00:16:09
 31915       9   4,235      38,115       890.7      55.7      00:15:55
 32212       5   4,235      21,175       899.6      56.3      00:15:41
 32497       8   4,235      33,880       908.1      56.8      00:15:29
 32694       7   4,235      29,645       913.7      57.2      00:15:23
 32888       9   4,235      38,115       919.5      57.5      00:15:17
 33081       9   4,235      38,115       925.3      57.9      00:15:11
 33313      10   4,235      42,350       932.0      58.3      00:15:02
 33523       7   4,235      29,645       938.2      58.7      00:14:55
 33775      10   4,235      42,350       945.6      59.2      00:14:45
 34052       8   4,235      33,880       953.8      59.7      00:14:33
 34355      10   4,235      42,350       962.9      60.3      00:14:19
 34622       5   4,235      21,175       970.7      60.7      00:14:08
 34955       8   4,235      33,880       980.6      61.4      00:13:53
 35284       8   4,235      33,880       990.3      62.0      00:13:38
 35594       6   4,235      25,410       999.3      62.5      00:13:25
 35902       7   4,235      29,645     1,008.3      63.1      00:13:11
 36244       9   4,235      38,115     1,018.3      63.7      00:12:56
 36560      10   4,235      42,350     1,027.4      64.3      00:12:42
 36824       6   4,235      25,410     1,034.8      64.8      00:12:33
 37056       3   4,235      12,705     1,041.4      65.2      00:12:25
 37330      10   4,235      42,350     1,048.6      65.6      00:12:15
 37592       8   4,235      33,880     1,055.9      66.1      00:12:05
 37861       5   4,235      21,175     1,063.3      66.5      00:11:56
 38128       8   4,235      33,880     1,070.9      67.0      00:11:45
 38331       9   4,235      38,115     1,076.8      67.4      00:11:38
 38631       5   4,235      21,175     1,085.6      67.9      00:11:26
 38936      10   4,235      42,350     1,094.3      68.5      00:11:14
 39200       7   4,235      29,645     1,101.6      68.9      00:11:04
 39515       9   4,235      38,115     1,110.4      69.5      00:10:51
 39811      10   4,235      42,350     1,118.7      70.0      00:10:40
 40127       6   4,235      25,410     1,127.5      70.6      00:10:27
 40443       6   4,235      25,410     1,136.5      71.1      00:10:14
 40779      10   4,235      42,350     1,146.3      71.7      00:10:00
 41024       8   4,235      33,880     1,153.4      72.2      00:09:51
 41278      10   4,235      42,350     1,160.6      72.6      00:09:42
 41546       9   4,235      38,115     1,168.3      73.1      00:09:31
 41837       8   4,235      33,880     1,176.6      73.6      00:09:20
 42070       5   4,235      21,175     1,183.1      74.0      00:09:12
 42322      10   4,235      42,350     1,189.8      74.5      00:09:03
 42474       7   4,235      29,645     1,194.4      74.7      00:08:59
 42666       9   4,235      38,115     1,199.6      75.1      00:08:53
 42872       5   4,235      21,175     1,205.4      75.4      00:08:45
 43029      10   4,235      42,350     1,210.0      75.7      00:08:41
 43259       7   4,235      29,645     1,216.9      76.2      00:08:32
 43396       7   4,235      29,645     1,220.9      76.4      00:08:28
 43628       6   4,235      25,410     1,227.2      76.8      00:08:20
 43905       8   4,235      33,880     1,235.0      77.3      00:08:09
 44154      10   4,235      42,350     1,242.0      77.7      00:07:60
 44275       9   4,235      38,115     1,245.4      77.9      00:07:57
 44413      10   4,235      42,350     1,249.0      78.2      00:07:53
 44623       6   4,235      25,410     1,255.0      78.5      00:07:46
 44853       6   4,235      25,410     1,261.6      78.9      00:07:37
 45053       7   4,235      29,645     1,267.1      79.3      00:07:30
 45280       8   4,235      33,880     1,273.1      79.7      00:07:22
 45492       8   4,235      33,880     1,278.9      80.0      00:07:15
 45723       9   4,235      38,115     1,284.9      80.4      00:07:07
 45928       7   4,235      29,645     1,290.6      80.8      00:07:00
 46161      10   4,235      42,350     1,297.3      81.2      00:06:51
 46349       8   4,235      33,880     1,302.7      81.5      00:06:44
 46517       6   4,235      25,410     1,307.5      81.8      00:06:39
 46772       9   4,235      38,115     1,314.8      82.3      00:06:29
 46946       4   4,235      16,940     1,319.6      82.6      00:06:23
 47110       3   4,235      12,705     1,323.8      82.8      00:06:18
 47237      10   4,235      42,350     1,327.2      83.1      00:06:14
 47389       1   4,235       4,235     1,331.3      83.3      00:06:09
 47528       5   4,235      21,175     1,335.0      83.5      00:06:05
 47680       8   4,235      33,880     1,339.4      83.8      00:05:60
 47850       8   4,235      33,880     1,344.0      84.1      00:05:54
 48008       9   4,235      38,115     1,348.6      84.4      00:05:48
 48190       3   4,235      12,705     1,353.6      84.7      00:05:42
 48415       5   4,235      21,175     1,360.0      85.1      00:05:33
 48686       9   4,235      38,115     1,367.7      85.6      00:05:22
 48911       7   4,235      29,645     1,374.0      86.0      00:05:14
 49126       7   4,235      29,645     1,380.2      86.4      00:05:05
 49355       4   4,235      16,940     1,386.4      86.8      00:04:57
 49594       8   4,235      33,880     1,392.7      87.2      00:04:48
 49791       6   4,235      25,410     1,397.9      87.5      00:04:41
 50004       4   4,235      16,940     1,403.8      87.9      00:04:33
 50200       7   4,235      29,645     1,409.3      88.2      00:04:26
 50389       7   4,235      29,645     1,414.2      88.5      00:04:19
 50574       6   4,235      25,410     1,419.4      88.8      00:04:12
 50747      10   4,235      42,350     1,424.4      89.1      00:04:05
 50904       8   4,235      33,880     1,429.0      89.4      00:03:59
 51093      10   4,235      42,350     1,434.5      89.8      00:03:52
 51287       6   4,235      25,410     1,439.9      90.1      00:03:44
 51527       5   4,235      21,175     1,446.9      90.5      00:03:35
 51772       9   4,235      38,115     1,454.2      91.0      00:03:24
 52024      10   4,235      42,350     1,461.5      91.5      00:03:14
 52266       7   4,235      29,645     1,468.9      91.9      00:03:03
 52552       5   4,235      21,175     1,477.7      92.5      00:02:50
 52832       9   4,235      38,115     1,486.4      93.0      00:02:38
 53094       8   4,235      33,880     1,494.1      93.5      00:02:27
 53384       7   4,235      29,645     1,502.6      94.0      00:02:15
 53655      10   4,235      42,350     1,510.6      94.5      00:02:04
 53824       6   4,235      25,410     1,515.4      94.8      00:01:57
 53986       8   4,235      33,880     1,519.9      95.1      00:01:51
 54143       6   4,235      25,410     1,524.4      95.4      00:01:45
 54300       8   4,235      33,880     1,528.8      95.7      00:01:38
 54518       5   4,235      21,175     1,534.3      96.0      00:01:31
 54754       7   4,235      29,645     1,541.0      96.4      00:01:21
 54970       7   4,235      29,645     1,547.1      96.8      00:01:13
 55155       6   4,235      25,410     1,552.1      97.1      00:01:05
 55347       6   4,235      25,410     1,557.2      97.5      00:00:58
 55509       9   4,235      38,115     1,561.5      97.7      00:00:52
 55663       4   4,235      16,940     1,565.9      98.0      00:00:46
 55811       6   4,235      25,410     1,570.1      98.3      00:00:40
 56001       9   4,235      38,115     1,575.7      98.6      00:00:32
 56178       7   4,235      29,645     1,580.7      98.9      00:00:25
 56366       9   4,235      38,115     1,586.3      99.3      00:00:17
 56595       4   4,235      16,940     1,593.0      99.7      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 2313.579
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
