
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A600.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A600.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A600.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A600.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
    98       3   4,635      13,905         2.5       0.1      01:57:58
   309       9   4,635      41,715         8.3       0.5      01:10:27
   670      10   4,635      46,350        18.2       1.0      00:47:42
  1030       7   4,635      32,445        28.6       1.6      00:40:16
  1382       9   4,635      41,715        39.3       2.2      00:36:22
  1737       3   4,635      13,905        50.1       2.9      00:34:00
  2086       5   4,635      23,175        60.3       3.4      00:32:46
  2446       8   4,635      37,080        70.9       4.1      00:31:38
  2828       7   4,635      32,445        82.5       4.7      00:30:22
  3208       7   4,635      32,445        93.9       5.4      00:29:27
  3577      10   4,635      46,350       105.4       6.0      00:28:40
  3946       4   4,635      18,540       116.2       6.6      00:28:09
  4257       3   4,635      13,905       125.3       7.2      00:28:09
  4547       7   4,635      32,445       133.8       7.6      00:28:14
  4830       8   4,635      37,080       142.4       8.1      00:28:16
  5118       9   4,635      41,715       151.0       8.6      00:28:16
  5377       6   4,635      27,810       159.1       9.1      00:28:23
  5683       9   4,635      41,715       167.4       9.6      00:28:24
  5970      10   4,635      46,350       176.0      10.1      00:28:22
  6257      10   4,635      46,350       184.6      10.6      00:28:18
  6540       7   4,635      32,445       192.8      11.0      00:28:19
  6826       6   4,635      27,810       201.2      11.5      00:28:16
  7142       5   4,635      23,175       210.2      12.0      00:28:07
  7466      10   4,635      46,350       220.2      12.6      00:27:50
  7797      10   4,635      46,350       230.2      13.2      00:27:32
  8117       7   4,635      32,445       240.5      13.8      00:27:14
  8446       8   4,635      37,080       251.0      14.4      00:26:54
  8770       8   4,635      37,080       261.1      14.9      00:26:38
  9081       7   4,635      32,445       271.0      15.5      00:26:24
  9274       5   4,635      23,175       277.2      15.8      00:26:36
  9413       9   4,635      41,715       281.5      16.1      00:26:59
  9545       8   4,635      37,080       285.8      16.3      00:27:22
  9659       9   4,635      41,715       289.7      16.6      00:27:46
  9776       6   4,635      27,810       293.3      16.8      00:28:11
  9916       9   4,635      41,715       297.5      17.0      00:28:32
 10051       3   4,635      13,905       301.5      17.2      00:28:53
 10190       5   4,635      23,175       305.2      17.5      00:29:15
 10336       5   4,635      23,175       309.5      17.7      00:29:32
 10483       4   4,635      18,540       314.0      18.0      00:29:47
 10694       6   4,635      27,810       320.2      18.3      00:29:49
 10904       9   4,635      41,715       326.5      18.7      00:29:51
 11089       5   4,635      23,175       332.0      19.0      00:29:57
 11223       7   4,635      32,445       336.0      19.2      00:30:13
 11335       4   4,635      18,540       339.4      19.4      00:30:32
 11463       7   4,635      32,445       343.4      19.6      00:30:47
 11582       5   4,635      23,175       346.8      19.8      00:31:05
 11681      10   4,635      46,350       349.9      20.0      00:31:24
 11826       7   4,635      32,445       354.4      20.3      00:31:34
 11964       5   4,635      23,175       358.4      20.5      00:31:47
 12091       5   4,635      23,175       362.5      20.7      00:31:58
 12210       4   4,635      18,540       366.1      20.9      00:32:12
 12391       6   4,635      27,810       371.5      21.2      00:32:14
 12593       5   4,635      23,175       377.5      21.6      00:32:11
 12825       4   4,635      18,540       384.3      22.0      00:32:03
 13027       8   4,635      37,080       390.4      22.3      00:31:60
 13250       8   4,635      37,080       397.1      22.7      00:31:52
 13463       8   4,635      37,080       404.0      23.1      00:31:43
 13606      10   4,635      46,350       408.7      23.4      00:31:47
 13729       8   4,635      37,080       412.3      23.6      00:31:58
 13855       5   4,635      23,175       416.2      23.8      00:32:07
 14011       5   4,635      23,175       420.7      24.1      00:32:12
 14133       8   4,635      37,080       424.5      24.3      00:32:20
 14261       4   4,635      18,540       428.5      24.5      00:32:27
 14421       8   4,635      37,080       433.6      24.8      00:32:27
 14583       5   4,635      23,175       438.6      25.1      00:32:28
 14749       8   4,635      37,080       443.7      25.4      00:32:28
 14941       8   4,635      37,080       449.6      25.7      00:32:22
 15155       6   4,635      27,810       456.5      26.1      00:32:11
 15341      10   4,635      46,350       462.3      26.4      00:32:06
 15551       7   4,635      32,445       468.7      26.8      00:31:58
 15751       8   4,635      37,080       474.9      27.2      00:31:50
 15967      10   4,635      46,350       481.8      27.6      00:31:39
 16167       9   4,635      41,715       488.3      27.9      00:31:30
 16364       7   4,635      32,445       494.6      28.3      00:31:22
 16562       3   4,635      13,905       500.8      28.6      00:31:15
 16761       9   4,635      41,715       506.9      29.0      00:31:07
 16900      10   4,635      46,350       511.1      29.2      00:31:10
 17015      10   4,635      46,350       514.9      29.4      00:31:15
 17125       3   4,635      13,905       518.1      29.6      00:31:22
 17252       9   4,635      41,715       522.1      29.9      00:31:25
 17365       7   4,635      32,445       525.7      30.1      00:31:30
 17487       9   4,635      41,715       529.8      30.3      00:31:32
 17610       7   4,635      32,445       533.7      30.5      00:31:35
 17754       5   4,635      23,175       538.0      30.8      00:31:36
 17907       2   4,635       9,270       542.7      31.0      00:31:35
 18093       3   4,635      13,905       548.6      31.4      00:31:27
 18290       4   4,635      18,540       554.7      31.7      00:31:18
 18461       7   4,635      32,445       559.6      32.0      00:31:16
 18569      10   4,635      46,350       563.1      32.2      00:31:20
 18679       7   4,635      32,445       566.7      32.4      00:31:23
 18828       7   4,635      32,445       571.3      32.7      00:31:22
 18982       8   4,635      37,080       576.4      33.0      00:31:17
 19104       5   4,635      23,175       580.3      33.2      00:31:19
 19244       8   4,635      37,080       584.7      33.4      00:31:17
 19436       8   4,635      37,080       590.8      33.8      00:31:08
 19601       6   4,635      27,810       596.2      34.1      00:31:02
 19767       6   4,635      27,810       601.7      34.4      00:30:55
 19985      10   4,635      46,350       608.7      34.8      00:30:41
 20207       5   4,635      23,175       615.9      35.2      00:30:27
 20456       2   4,635       9,270       623.5      35.7      00:30:10
 20595       8   4,635      37,080       628.1      35.9      00:30:08
 20719      10   4,635      46,350       631.9      36.1      00:30:09
 20847       9   4,635      41,715       636.0      36.4      00:30:08
 20963       4   4,635      18,540       639.7      36.6      00:30:09
 21110       9   4,635      41,715       644.0      36.8      00:30:07
 21264       9   4,635      41,715       648.2      37.1      00:30:06
 21419       5   4,635      23,175       652.7      37.3      00:30:03
 21569       7   4,635      32,445       657.3      37.6      00:29:59
 21750       4   4,635      18,540       662.3      37.9      00:29:54
 21914      10   4,635      46,350       667.2      38.2      00:29:49
 22078       5   4,635      23,175       671.9      38.4      00:29:45
 22213       8   4,635      37,080       675.9      38.6      00:29:44
 22350       3   4,635      13,905       679.8      38.9      00:29:43
 22487       3   4,635      13,905       683.8      39.1      00:29:41
 22617       6   4,635      27,810       687.7      39.3      00:29:40
 22815       6   4,635      27,810       693.0      39.6      00:29:33
 23029       8   4,635      37,080       699.6      40.0      00:29:20
 23225       6   4,635      27,810       705.7      40.4      00:29:10
 23434       9   4,635      41,715       711.9      40.7      00:28:59
 23611       6   4,635      27,810       716.9      41.0      00:28:53
 23780      10   4,635      46,350       722.2      41.3      00:28:46
 23962      10   4,635      46,350       727.7      41.6      00:28:38
 24189       9   4,635      41,715       734.3      42.0      00:28:25
 24416       7   4,635      32,445       740.9      42.4      00:28:12
 24621       9   4,635      41,715       747.4      42.7      00:28:00
 24798       7   4,635      32,445       752.7      43.0      00:27:53
 25000       7   4,635      32,445       758.8      43.4      00:27:42
 25189      10   4,635      46,350       764.8      43.7      00:27:32
 25386      10   4,635      46,350       770.8      44.1      00:27:22
 25565       7   4,635      32,445       776.1      44.4      00:27:14
 25700       7   4,635      32,445       780.3      44.6      00:27:11
 25823       6   4,635      27,810       784.3      44.8      00:27:09
 25961      10   4,635      46,350       788.4      45.1      00:27:05
 26086      10   4,635      46,350       792.4      45.3      00:27:03
 26219       8   4,635      37,080       796.6      45.5      00:26:59
 26373       8   4,635      37,080       801.1      45.8      00:26:54
 26555       8   4,635      37,080       806.6      46.1      00:26:46
 26737       7   4,635      32,445       811.9      46.4      00:26:38
 26933       7   4,635      32,445       818.0      46.8      00:26:27
 27086       5   4,635      23,175       822.6      47.0      00:26:22
 27201      10   4,635      46,350       826.1      47.2      00:26:20
 27324       7   4,635      32,445       829.9      47.5      00:26:18
 27450       6   4,635      27,810       833.7      47.7      00:26:15
 27575       6   4,635      27,810       837.7      47.9      00:26:12
 27701       9   4,635      41,715       841.5      48.1      00:26:09
 27851       7   4,635      32,445       846.3      48.4      00:26:02
 28067       7   4,635      32,445       853.0      48.8      00:25:49
 28285       9   4,635      41,715       859.9      49.2      00:25:35
 28483       9   4,635      41,715       866.3      49.5      00:25:23
 28654       7   4,635      32,445       871.7      49.8      00:25:14
 28764       4   4,635      18,540       875.3      50.1      00:25:12
 28904       5   4,635      23,175       879.7      50.3      00:25:07
 29040       8   4,635      37,080       884.1      50.5      00:25:02
 29188       5   4,635      23,175       888.5      50.8      00:24:56
 29344       9   4,635      41,715       893.5      51.1      00:24:49
 29498       5   4,635      23,175       898.3      51.4      00:24:42
 29669       7   4,635      32,445       903.4      51.7      00:24:34
 29790       6   4,635      27,810       907.2      51.9      00:24:31
 29922       7   4,635      32,445       911.3      52.1      00:24:26
 30017       9   4,635      41,715       914.4      52.3      00:24:25
 30135       8   4,635      37,080       918.1      52.5      00:24:22
 30259       9   4,635      41,715       922.0      52.7      00:24:18
 30407       8   4,635      37,080       926.6      53.0      00:24:11
 30569       9   4,635      41,715       931.9      53.3      00:24:03
 30766       7   4,635      32,445       938.1      53.6      00:23:51
 30952       9   4,635      41,715       943.9      54.0      00:23:40
 31170       7   4,635      32,445       950.7      54.4      00:23:27
 31367       7   4,635      32,445       957.0      54.7      00:23:15
 31567       6   4,635      27,810       963.4      55.1      00:23:02
 31787       9   4,635      41,715       970.6      55.5      00:22:48
 31995       5   4,635      23,175       977.4      55.9      00:22:34
 32185       9   4,635      41,715       983.7      56.2      00:22:22
 32376       9   4,635      41,715       990.0      56.6      00:22:11
 32523       9   4,635      41,715       994.7      56.9      00:22:04
 32626       6   4,635      27,810       998.0      57.1      00:22:01
 32754       9   4,635      41,715     1,002.1      57.3      00:21:56
 32908      10   4,635      46,350     1,007.0      57.6      00:21:48
 33028       9   4,635      41,715     1,010.9      57.8      00:21:44
 33159      10   4,635      46,350     1,015.1      58.0      00:21:38
 33303      10   4,635      46,350     1,019.7      58.3      00:21:32
 33438       4   4,635      18,540     1,023.9      58.5      00:21:26
 33558       7   4,635      32,445     1,027.9      58.8      00:21:21
 33679       6   4,635      27,810     1,031.9      59.0      00:21:16
 33832       8   4,635      37,080     1,036.8      59.3      00:21:08
 34003       7   4,635      32,445     1,042.3      59.6      00:20:59
 34113      10   4,635      46,350     1,046.0      59.8      00:20:54
 34263       9   4,635      41,715     1,050.9      60.1      00:20:46
 34473       8   4,635      37,080     1,057.7      60.5      00:20:33
 34689       7   4,635      32,445     1,064.6      60.9      00:20:19
 34894       9   4,635      41,715     1,071.4      61.3      00:20:06
 35113       7   4,635      32,445     1,078.2      61.7      00:19:52
 35328       8   4,635      37,080     1,085.2      62.1      00:19:38
 35552       7   4,635      32,445     1,092.4      62.5      00:19:24
 35781      10   4,635      46,350     1,099.6      62.9      00:19:09
 35987       6   4,635      27,810     1,106.3      63.3      00:18:57
 36196       9   4,635      41,715     1,112.9      63.6      00:18:44
 36412       5   4,635      23,175     1,119.9      64.0      00:18:30
 36588      10   4,635      46,350     1,125.4      64.3      00:18:21
 36725       4   4,635      18,540     1,129.6      64.6      00:18:15
 36890      10   4,635      46,350     1,134.7      64.9      00:18:06
 37068       7   4,635      32,445     1,140.1      65.2      00:17:57
 37210       8   4,635      37,080     1,144.1      65.4      00:17:51
 37325       9   4,635      41,715     1,147.5      65.6      00:17:48
 37484       6   4,635      27,810     1,152.2      65.9      00:17:40
 37589       7   4,635      32,445     1,155.5      66.1      00:17:36
 37788       8   4,635      37,080     1,161.4      66.4      00:17:26
 38009       7   4,635      32,445     1,168.2      66.8      00:17:12
 38177       6   4,635      27,810     1,173.6      67.1      00:17:03
 38351       4   4,635      18,540     1,179.2      67.4      00:16:53
 38535       6   4,635      27,810     1,185.2      67.8      00:16:42
 38758       4   4,635      18,540     1,192.1      68.2      00:16:29
 38954      10   4,635      46,350     1,198.2      68.5      00:16:18
 39102       8   4,635      37,080     1,202.9      68.8      00:16:10
 39253      10   4,635      46,350     1,207.3      69.0      00:16:03
 39465       5   4,635      23,175     1,213.7      69.4      00:15:51
 39665       4   4,635      18,540     1,219.8      69.7      00:15:40
 39849       8   4,635      37,080     1,225.5      70.1      00:15:30
 40118       4   4,635      18,540     1,233.7      70.5      00:15:13
 40392       4   4,635      18,540     1,242.2      71.0      00:14:56
 40672      10   4,635      46,350     1,251.1      71.5      00:14:38
 40968       8   4,635      37,080     1,260.6      72.1      00:14:19
 41165       5   4,635      23,175     1,266.7      72.4      00:14:08
 41404       8   4,635      37,080     1,274.2      72.9      00:13:54
 41584       5   4,635      23,175     1,279.8      73.2      00:13:44
 41816      10   4,635      46,350     1,287.1      73.6      00:13:30
 42043       2   4,635       9,270     1,294.1      74.0      00:13:17
 42228       8   4,635      37,080     1,299.5      74.3      00:13:08
 42401       9   4,635      41,715     1,304.9      74.6      00:12:58
 42589       5   4,635      23,175     1,310.5      74.9      00:12:49
 42780       8   4,635      37,080     1,316.4      75.3      00:12:38
 42982       6   4,635      27,810     1,322.8      75.6      00:12:27
 43182      10   4,635      46,350     1,329.4      76.0      00:12:15
 43440       5   4,635      23,175     1,337.6      76.5      00:11:59
 43796       6   4,635      27,810     1,348.3      77.1      00:11:38
 44141      10   4,635      46,350     1,358.8      77.7      00:11:17
 44371       4   4,635      18,540     1,365.7      78.1      00:11:04
 44715       6   4,635      27,810     1,376.3      78.7      00:10:44
 45046       3   4,635      13,905     1,386.6      79.3      00:10:24
 45333       4   4,635      18,540     1,394.8      79.8      00:10:09
 45548       8   4,635      37,080     1,401.2      80.1      00:09:57
 45846      10   4,635      46,350     1,409.9      80.6      00:09:41
 46142       5   4,635      23,175     1,419.3      81.2      00:09:24
 46449       7   4,635      32,445     1,428.8      81.7      00:09:06
 46754       8   4,635      37,080     1,438.4      82.2      00:08:48
 47046       9   4,635      41,715     1,447.1      82.7      00:08:33
 47281       5   4,635      23,175     1,453.8      83.1      00:08:21
 47535       8   4,635      37,080     1,461.3      83.6      00:08:08
 47742       6   4,635      27,810     1,467.8      83.9      00:07:57
 47942       7   4,635      32,445     1,473.9      84.3      00:07:46
 48131       5   4,635      23,175     1,479.6      84.6      00:07:36
 48352       7   4,635      32,445     1,486.6      85.0      00:07:24
 48663      10   4,635      46,350     1,496.2      85.6      00:07:07
 48940       8   4,635      37,080     1,504.7      86.0      00:06:52
 49205      10   4,635      46,350     1,513.1      86.5      00:06:37
 49472      10   4,635      46,350     1,520.8      87.0      00:06:24
 49708       9   4,635      41,715     1,527.5      87.3      00:06:12
 49953       8   4,635      37,080     1,534.9      87.8      00:05:59
 50132       6   4,635      27,810     1,540.3      88.1      00:05:50
 50383      10   4,635      46,350     1,547.5      88.5      00:05:38
 50614       9   4,635      41,715     1,554.7      88.9      00:05:26
 50863       9   4,635      41,715     1,562.6      89.3      00:05:12
 51086       8   4,635      37,080     1,569.8      89.8      00:04:60
 51373       9   4,635      41,715     1,578.7      90.3      00:04:45
 51678       9   4,635      41,715     1,588.6      90.8      00:04:27
 51972       7   4,635      32,445     1,597.8      91.4      00:04:11
 52280       8   4,635      37,080     1,608.1      92.0      00:03:54
 52601       7   4,635      32,445     1,619.0      92.6      00:03:35
 52923       5   4,635      23,175     1,629.7      93.2      00:03:17
 53230       9   4,635      41,715     1,639.7      93.8      00:02:60
 53558       8   4,635      37,080     1,650.2      94.4      00:02:42
 53810       5   4,635      23,175     1,658.1      94.8      00:02:29
 54043       7   4,635      32,445     1,665.3      95.2      00:02:17
 54269       9   4,635      41,715     1,672.3      95.6      00:02:05
 54512       7   4,635      32,445     1,679.1      96.0      00:01:54
 54799       6   4,635      27,810     1,687.9      96.5      00:01:40
 55081      10   4,635      46,350     1,696.5      97.0      00:01:25
 55393       8   4,635      37,080     1,705.6      97.5      00:01:10
 55652       4   4,635      18,540     1,713.4      98.0      00:00:58
 55889       6   4,635      27,810     1,720.9      98.4      00:00:46
 56177      10   4,635      46,350     1,730.0      98.9      00:00:31
 56421       7   4,635      32,445     1,737.9      99.4      00:00:18
 56690       7   4,635      32,445     1,746.5      99.9      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 2838.725
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A600.csv saved

. 
. cap log close

. 
end of do-file
