
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_Do
> llar_locations_total_fixR100.dta /export/storage_covidvaccine/Result/MaxVaxHP
> IDistBLP/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR1
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  30 Oct 2023, 17:56:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capc
> oef/Dollar/vaccinated/ca_Dollar_locations_total_fixR100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capco
> ef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   418       6   4,035      24,210         9.6       0.6      00:26:14
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   393       7   4,035      28,245         9.1       0.6      00:27:53
   854       1   4,035       4,035        20.3       1.3      00:24:40
   818       8   4,035      32,280        19.6       1.3      00:25:38
  1268       3   4,035      12,105        31.0       2.0      00:24:05
  1252       7   4,035      28,245        30.6       2.0      00:24:28
  1673      10   4,035      40,350        41.9       2.7      00:23:38
  1679       7   4,035      28,245        42.1       2.8      00:23:32
  2087       7   4,035      28,245        52.3       3.4      00:23:28
  2107       8   4,035      32,280        52.9       3.5      00:23:14
  2505      10   4,035      40,350        63.0       4.1      00:23:12
  2544       7   4,035      28,245        63.9       4.2      00:22:52
  2923       6   4,035      24,210        74.0       4.9      00:22:52
  2990       8   4,035      32,280        75.6       5.0      00:22:24
  3338       7   4,035      28,245        85.1       5.6      00:22:33
  3414       8   4,035      32,280        87.2       5.7      00:21:60
  3752       3   4,035      12,105        96.2       6.3      00:22:16
  3831       5   4,035      20,175        98.3       6.5      00:21:47
  4134       7   4,035      28,245       105.8       6.9      00:22:21
  4206      10   4,035      40,350       107.7       7.1      00:21:56
  4512      10   4,035      40,350       115.4       7.6      00:22:24
  4594       5   4,035      20,175       117.5       7.7      00:21:57
  4866       4   4,035      16,140       124.8       8.2      00:22:27
  4962       3   4,035      12,105       127.3       8.4      00:21:57
  5223       6   4,035      24,210       134.2       8.8      00:22:28
  5344       3   4,035      12,105       137.3       9.0      00:21:54
  5558       8   4,035      32,280       142.5       9.4      00:22:38
  5650       9   4,035      36,315       144.7       9.5      00:22:15
  5824       7   4,035      28,245       149.2       9.8      00:23:04
  5934       7   4,035      28,245       152.0      10.0      00:22:35
  6088       7   4,035      28,245       156.2      10.2      00:23:23
  6233       8   4,035      32,280       159.9      10.5      00:22:46
  6358       9   4,035      36,315       163.0      10.7      00:23:42
  6502       3   4,035      12,105       166.7      10.9      00:23:06
  6601       8   4,035      32,280       169.2      11.1      00:24:03
  6802       5   4,035      20,175       174.3      11.4      00:23:15
  6907       7   4,035      28,245       177.1      11.6      00:24:07
  7184       9   4,035      36,315       184.0      12.1      00:23:05
  7281       8   4,035      32,280       186.5      12.2      00:23:56
  7581       9   4,035      36,315       194.5      12.8      00:22:48
  7642       7   4,035      28,245       196.2      12.9      00:23:43
  7975       9   4,035      36,315       205.3      13.5      00:22:31
  7995       9   4,035      36,315       205.8      13.5      00:23:30
  8361       2   4,035       8,070       216.0      14.2      00:22:14
  8348       7   4,035      28,245       215.6      14.1      00:23:18
  8749       6   4,035      24,210       226.6      14.9      00:21:58
  8705       6   4,035      24,210       225.3      14.8      00:23:05
  9106       7   4,035      28,245       236.4      15.5      00:21:48
  9050       4   4,035      16,140       234.9      15.4      00:22:54
  9341       9   4,035      36,315       242.9      15.9      00:21:60
  9337       6   4,035      24,210       242.8      15.9      00:22:54
  9608       9   4,035      36,315       250.4      16.4      00:22:04
  9595       8   4,035      32,280       250.0      16.4      00:22:58
  9901       4   4,035      16,140       258.5      17.0      00:22:03
  9878       5   4,035      20,175       257.8      16.9      00:22:57
 10199       7   4,035      28,245       265.8      17.4      00:22:07
 10173      10   4,035      40,350       265.2      17.4      00:22:59
 10515       6   4,035      24,210       274.1      18.0      00:22:04
 10494       6   4,035      24,210       273.5      18.0      00:22:54
 10850      10   4,035      40,350       282.6      18.5      00:21:59
 10828       8   4,035      32,280       282.0      18.5      00:22:47
 11153       9   4,035      36,315       290.5      19.1      00:21:58
 11148       3   4,035      12,105       290.4      19.1      00:22:41
 11446       8   4,035      32,280       298.3      19.6      00:21:56
 11429       8   4,035      32,280       297.8      19.5      00:22:40
 11779       8   4,035      32,280       306.9      20.1      00:21:50
 11742       3   4,035      12,105       306.0      20.1      00:22:35
 12135       9   4,035      36,315       316.6      20.8      00:21:38
 12095       7   4,035      28,245       315.5      20.7      00:22:23
 12543       6   4,035      24,210       327.3      21.5      00:21:21
 12463       7   4,035      28,245       325.0      21.3      00:22:10
 12984       6   4,035      24,210       338.4      22.2      00:21:03
 12856       8   4,035      32,280       335.2      22.0      00:21:54
 13386       8   4,035      32,280       349.2      22.9      00:20:46
 13236       8   4,035      32,280       345.2      22.7      00:21:39
 13663       7   4,035      28,245       357.0      23.4      00:20:43
 13566       4   4,035      16,140       354.3      23.3      00:21:29
 13921       9   4,035      36,315       363.8      23.9      00:20:45
 13804       4   4,035      16,140       360.7      23.7      00:21:32
 14267       9   4,035      36,315       373.1      24.5      00:20:35
 14083       6   4,035      24,210       368.0      24.2      00:21:30
 14626       8   4,035      32,280       382.8      25.1      00:20:24
 14413       3   4,035      12,105       377.1      24.7      00:21:19
 15004       9   4,035      36,315       393.0      25.8      00:20:10
 14755       9   4,035      36,315       386.2      25.3      00:21:09
 15375       8   4,035      32,280       403.2      26.5      00:19:57
 15101       8   4,035      32,280       395.7      26.0      00:20:56
 15782       5   4,035      20,175       414.1      27.2      00:19:41
 15481       6   4,035      24,210       406.0      26.6      00:20:41
 16194       6   4,035      24,210       425.6      27.9      00:19:23
 15877      10   4,035      40,350       416.7      27.3      00:20:24
 16581       8   4,035      32,280       436.3      28.6      00:19:08
 16248       4   4,035      16,140       427.1      28.0      00:20:09
 16888       6   4,035      24,210       444.4      29.2      00:19:03
 16589       9   4,035      36,315       436.5      28.6      00:19:58
 17218      10   4,035      40,350       453.3      29.8      00:18:55
 16870       9   4,035      36,315       444.0      29.1      00:19:54
 17541       9   4,035      36,315       462.6      30.4      00:18:46
 17176       5   4,035      20,175       452.2      29.7      00:19:47
 17931       9   4,035      36,315       472.9      31.0      00:18:33
 17449      10   4,035      40,350       459.8      30.2      00:19:42
 18231       5   4,035      20,175       481.2      31.6      00:18:26
 17733      10   4,035      40,350       467.7      30.7      00:19:36
 18543       7   4,035      28,245       489.2      32.1      00:18:21
 18081       8   4,035      32,280       477.0      31.3      00:19:25
 18829       6   4,035      24,210       497.1      32.6      00:18:16
 18347       8   4,035      32,280       484.3      31.8      00:19:21
 19177      10   4,035      40,350       507.0      33.3      00:18:04
 18633       8   4,035      32,280       491.7      32.3      00:19:16
 19560       5   4,035      20,175       517.7      34.0      00:17:50
 18917       7   4,035      28,245       499.6      32.8      00:19:10
 19956      10   4,035      40,350       528.9      34.7      00:17:35
 19242      10   4,035      40,350       508.8      33.4      00:18:59
 20370       9   4,035      36,315       540.3      35.5      00:17:19
 19621       4   4,035      16,140       519.3      34.1      00:18:44
 20684       3   4,035      12,105       549.0      36.0      00:17:11
 20019      10   4,035      40,350       530.7      34.8      00:18:26
 20966       5   4,035      20,175       556.8      36.5      00:17:06
 20410      10   4,035      40,350       541.4      35.5      00:18:11
 21290       4   4,035      16,140       564.7      37.1      00:17:00
 20704       8   4,035      32,280       549.5      36.1      00:18:03
 21592       8   4,035      32,280       572.5      37.6      00:16:55
 20966       5   4,035      20,175       556.8      36.5      00:17:59
 21894       7   4,035      28,245       580.1      38.1      00:16:50
 21301       6   4,035      24,210       565.0      37.1      00:17:51
 22210       9   4,035      36,315       588.0      38.6      00:16:44
 21591       8   4,035      32,280       572.5      37.6      00:17:45
 22515       5   4,035      20,175       595.8      39.1      00:16:38
 21889       7   4,035      28,245       580.0      38.1      00:17:40
 22841       9   4,035      36,315       603.8      39.6      00:16:32
 22181       6   4,035      24,210       587.2      38.5      00:17:34
 23133       7   4,035      28,245       611.6      40.1      00:16:26
 22481       8   4,035      32,280       594.8      39.0      00:17:28
 23466       7   4,035      28,245       620.4      40.7      00:16:17
 22779       8   4,035      32,280       602.3      39.5      00:17:22
 23809      10   4,035      40,350       629.3      41.3      00:16:08
 23048      10   4,035      40,350       609.3      40.0      00:17:17
 24168       9   4,035      36,315       638.6      41.9      00:15:58
 23338       2   4,035       8,070       617.1      40.5      00:17:10
 24613       5   4,035      20,175       650.2      42.7      00:15:42
 23675       7   4,035      28,245       625.6      41.1      00:17:01
 25036       8   4,035      32,280       661.3      43.4      00:15:27
 23993      10   4,035      40,350       634.1      41.6      00:16:52
 25451       8   4,035      32,280       672.6      44.1      00:15:13
 24377       5   4,035      20,175       643.7      42.2      00:16:40
 25760       4   4,035      16,140       680.7      44.7      00:15:05
 24788       9   4,035      36,315       654.8      43.0      00:16:23
 26070       9   4,035      36,315       689.1      45.2      00:14:58
 25187       4   4,035      16,140       665.5      43.7      00:16:09
 26453       8   4,035      32,280       699.1      45.9      00:14:46
 25577      10   4,035      40,350       675.9      44.4      00:15:55
 26856       7   4,035      28,245       709.6      46.6      00:14:33
 25821       7   4,035      28,245       682.5      44.8      00:15:51
 27193       3   4,035      12,105       718.7      47.2      00:14:24
 26126       4   4,035      16,140       690.7      45.3      00:15:42
 27493       4   4,035      16,140       726.6      47.7      00:14:17
 26488       6   4,035      24,210       700.1      46.0      00:15:31
 27805       9   4,035      36,315       735.1      48.2      00:14:09
 26863       5   4,035      20,175       709.8      46.6      00:15:19
 28145       7   4,035      28,245       744.5      48.9      00:13:59
 27158       6   4,035      24,210       717.8      47.1      00:15:11
 28507      10   4,035      40,350       754.5      49.5      00:13:47
 27388       6   4,035      24,210       723.8      47.5      00:15:08
 28805       6   4,035      24,210       762.8      50.1      00:13:39
 27630       6   4,035      24,210       730.3      47.9      00:15:03
 29106       4   4,035      16,140       771.1      50.6      00:13:31
 27864       8   4,035      32,280       736.8      48.4      00:14:59
 29421       8   4,035      32,280       779.6      51.2      00:13:23
 28210       5   4,035      20,175       746.2      49.0      00:14:47
 29752      10   4,035      40,350       788.4      51.7      00:13:14
 28562       4   4,035      16,140       756.1      49.6      00:14:35
 30067       7   4,035      28,245       797.1      52.3      00:13:05
 28824       9   4,035      36,315       763.3      50.1      00:14:28
 30384       9   4,035      36,315       805.7      52.9      00:12:56
 29121      10   4,035      40,350       771.5      50.6      00:14:19
 30722       8   4,035      32,280       815.1      53.5      00:12:46
 29446       9   4,035      36,315       780.3      51.2      00:14:09
 31134       6   4,035      24,210       826.3      54.2      00:12:32
 29759       7   4,035      28,245       788.7      51.8      00:14:00
 31515       6   4,035      24,210       837.0      54.9      00:12:20
 30047       8   4,035      32,280       796.5      52.3      00:13:52
 31912       6   4,035      24,210       848.2      55.7      00:12:06
 30352       9   4,035      36,315       804.8      52.8      00:13:43
 32309       6   4,035      24,210       859.5      56.4      00:11:52
 30634      10   4,035      40,350       812.7      53.3      00:13:35
 32650       9   4,035      36,315       869.0      57.0      00:11:42
 31008       8   4,035      32,280       822.9      54.0      00:13:22
 32924       7   4,035      28,245       876.7      57.5      00:11:35
 31373       8   4,035      32,280       832.9      54.7      00:13:09
 33189       6   4,035      24,210       884.1      58.0      00:11:28
 31731       7   4,035      28,245       843.0      55.3      00:12:56
 33542       7   4,035      28,245       894.0      58.7      00:11:17
 32093       5   4,035      20,175       853.3      56.0      00:12:43
 33885       7   4,035      28,245       903.7      59.3      00:11:07
 32459       7   4,035      28,245       863.9      56.7      00:12:30
 34220       6   4,035      24,210       913.3      59.9      00:10:56
 32740       8   4,035      32,280       871.5      57.2      00:12:22
 34618       7   4,035      28,245       924.4      60.7      00:10:43
 32962       3   4,035      12,105       877.8      57.6      00:12:17
 35033      10   4,035      40,350       936.1      61.4      00:10:29
 33202       7   4,035      28,245       884.5      58.1      00:12:11
 35449       9   4,035      36,315       947.8      62.2      00:10:15
 33514      10   4,035      40,350       893.1      58.6      00:12:01
 35870       7   4,035      28,245       959.4      63.0      00:10:01
 33830       7   4,035      28,245       902.1      59.2      00:11:51
 36277       7   4,035      28,245       970.8      63.7      00:09:48
 34138       4   4,035      16,140       910.9      59.8      00:11:41
 36641      10   4,035      40,350       980.9      64.4      00:09:36
 34469       5   4,035      20,175       920.2      60.4      00:11:30
 36949       8   4,035      32,280       989.2      64.9      00:09:28
 34846       9   4,035      36,315       930.9      61.1      00:11:16
 37272       7   4,035      28,245       997.3      65.5      00:09:20
 35237       4   4,035      16,140       941.8      61.8      00:11:02
 37551      10   4,035      40,350     1,004.5      65.9      00:09:14
 35620      10   4,035      40,350       952.5      62.5      00:10:49
 37837       5   4,035      20,175     1,012.0      66.4      00:09:07
 35978       6   4,035      24,210       962.4      63.2      00:10:37
 38101       6   4,035      24,210     1,019.3      66.9      00:09:00
 36324       9   4,035      36,315       972.1      63.8      00:10:25
 38367       6   4,035      24,210     1,026.6      67.4      00:08:53
 36645       9   4,035      36,315       981.0      64.4      00:10:15
 38669       7   4,035      28,245     1,035.0      67.9      00:08:45
 36918      10   4,035      40,350       988.3      64.9      00:10:08
 39023       7   4,035      28,245     1,044.7      68.6      00:08:34
 37184      10   4,035      40,350       995.1      65.3      00:10:01
 39298       8   4,035      32,280     1,051.9      69.0      00:08:28
 37446       8   4,035      32,280     1,001.8      65.8      00:09:55
 39584       7   4,035      28,245     1,059.5      69.5      00:08:20
 37702       6   4,035      24,210     1,008.5      66.2      00:09:48
 39886       5   4,035      20,175     1,067.5      70.1      00:08:12
 37954       5   4,035      20,175     1,015.2      66.6      00:09:42
 40274       5   4,035      20,175     1,077.8      70.7      00:08:01
 38192       8   4,035      32,280     1,021.8      67.1      00:09:36
 40665       6   4,035      24,210     1,088.7      71.5      00:07:48
 38435       5   4,035      20,175     1,028.6      67.5      00:09:29
 41019       5   4,035      20,175     1,098.5      72.1      00:07:37
 38767       7   4,035      28,245     1,037.7      68.1      00:09:18
 41266       5   4,035      20,175     1,105.2      72.5      00:07:31
 39088       6   4,035      24,210     1,046.4      68.7      00:09:08
 41543       5   4,035      20,175     1,112.7      73.0      00:07:24
 39351       8   4,035      32,280     1,053.3      69.1      00:09:01
 41835       5   4,035      20,175     1,120.7      73.6      00:07:16
 39628       8   4,035      32,280     1,060.7      69.6      00:08:53
 42135       6   4,035      24,210     1,128.6      74.1      00:07:08
 39943       7   4,035      28,245     1,069.1      70.2      00:08:44
 42455       8   4,035      32,280     1,137.1      74.6      00:06:59
 40348       7   4,035      28,245     1,079.8      70.9      00:08:31
 42741       5   4,035      20,175     1,144.6      75.1      00:06:51
 40724       9   4,035      36,315     1,090.2      71.6      00:08:18
 43001      10   4,035      40,350     1,151.7      75.6      00:06:44
 41036       7   4,035      28,245     1,098.9      72.1      00:08:08
 43278       5   4,035      20,175     1,159.6      76.1      00:06:36
 41283      10   4,035      40,350     1,105.6      72.6      00:08:01
 43565       9   4,035      36,315     1,167.3      76.6      00:06:28
 41558       8   4,035      32,280     1,113.1      73.1      00:07:53
 43850       4   4,035      16,140     1,174.9      77.1      00:06:21
 41825      10   4,035      40,350     1,120.4      73.5      00:07:45
 44146      10   4,035      40,350     1,182.7      77.6      00:06:12
 42079       8   4,035      32,280     1,127.2      74.0      00:07:38
 44385       8   4,035      32,280     1,189.0      78.0      00:06:06
 42388       6   4,035      24,210     1,135.1      74.5      00:07:29
 44685       8   4,035      32,280     1,197.1      78.6      00:05:58
 42658      10   4,035      40,350     1,142.4      75.0      00:07:21
 44974      10   4,035      40,350     1,204.9      79.1      00:05:50
 42925       7   4,035      28,245     1,149.6      75.5      00:07:14
 45323       3   4,035      12,105     1,213.8      79.7      00:05:40
 43188       2   4,035       8,070     1,157.1      75.9      00:07:05
 45633       6   4,035      24,210     1,221.7      80.2      00:05:32
 43443       5   4,035      20,175     1,164.2      76.4      00:06:58
 45928      10   4,035      40,350     1,229.3      80.7      00:05:24
 43695       8   4,035      32,280     1,170.7      76.8      00:06:51
 46203       6   4,035      24,210     1,236.9      81.2      00:05:16
 43941       7   4,035      28,245     1,177.3      77.3      00:06:44
 46493       6   4,035      24,210     1,244.8      81.7      00:05:07
 44189       9   4,035      36,315     1,183.9      77.7      00:06:37
 46840       8   4,035      32,280     1,254.4      82.3      00:04:57
 44406       9   4,035      36,315     1,189.5      78.1      00:06:31
 47111       6   4,035      24,210     1,261.2      82.8      00:04:50
 44666       8   4,035      32,280     1,196.6      78.5      00:06:23
 47390       9   4,035      36,315     1,268.3      83.2      00:04:42
 44935       8   4,035      32,280     1,203.9      79.0      00:06:15
 47685       6   4,035      24,210     1,276.0      83.7      00:04:34
 45221       8   4,035      32,280     1,211.3      79.5      00:06:07
 48019       9   4,035      36,315     1,284.9      84.3      00:04:24
 45516       7   4,035      28,245     1,218.8      80.0      00:05:58
 48360       7   4,035      28,245     1,294.1      84.9      00:04:14
 45782       9   4,035      36,315     1,225.5      80.4      00:05:51
 48687       6   4,035      24,210     1,302.9      85.5      00:04:04
 46033       4   4,035      16,140     1,232.3      80.9      00:05:43
 49056       7   4,035      28,245     1,312.7      86.2      00:03:53
 46302       7   4,035      28,245     1,239.8      81.4      00:05:35
 49425       9   4,035      36,315     1,322.5      86.8      00:03:42
 46579       7   4,035      28,245     1,247.2      81.9      00:05:26
 49729       4   4,035      16,140     1,330.1      87.3      00:03:34
 46923       7   4,035      28,245     1,256.6      82.5      00:05:15
 50014       4   4,035      16,140     1,337.6      87.8      00:03:26
 47163       9   4,035      36,315     1,262.4      82.9      00:05:09
 50318      10   4,035      40,350     1,345.4      88.3      00:03:18
 47431       7   4,035      28,245     1,269.4      83.3      00:05:01
 50637       5   4,035      20,175     1,353.8      88.9      00:03:08
 47714       6   4,035      24,210     1,276.8      83.8      00:04:52
 50952       7   4,035      28,245     1,362.5      89.4      00:02:59
 48050       6   4,035      24,210     1,285.8      84.4      00:04:42
 51275       9   4,035      36,315     1,371.2      90.0      00:02:49
 48380       5   4,035      20,175     1,294.7      85.0      00:04:31
 51610       4   4,035      16,140     1,380.4      90.6      00:02:39
 48712       4   4,035      16,140     1,303.6      85.6      00:04:20
 51916       7   4,035      28,245     1,389.1      91.2      00:02:29
 49088       6   4,035      24,210     1,313.6      86.2      00:04:08
 52227       7   4,035      28,245     1,398.0      91.8      00:02:19
 49451      10   4,035      40,350     1,323.2      86.8      00:03:57
 52609       8   4,035      32,280     1,409.1      92.5      00:02:07
 49714       6   4,035      24,210     1,329.7      87.3      00:03:49
 53007      10   4,035      40,350     1,420.7      93.2      00:01:54
 49967      10   4,035      40,350     1,336.2      87.7      00:03:42
 53415       6   4,035      24,210     1,432.1      94.0      00:01:41
 50232       3   4,035      12,105     1,343.2      88.2      00:03:34
 53789       7   4,035      28,245     1,442.5      94.7      00:01:30
 50531       7   4,035      28,245     1,350.9      88.7      00:03:25
 54112       8   4,035      32,280     1,451.1      95.2      00:01:20
 50827       9   4,035      36,315     1,359.0      89.2      00:03:15
 54429       7   4,035      28,245     1,459.6      95.8      00:01:11
 51106       4   4,035      16,140     1,366.8      89.7      00:03:06
 54782       6   4,035      24,210     1,468.7      96.4      00:01:01
 51410      10   4,035      40,350     1,374.9      90.2      00:02:57
 55125      10   4,035      40,350     1,477.7      97.0      00:00:51
 51707       5   4,035      20,175     1,383.3      90.8      00:02:47
 55435       8   4,035      32,280     1,485.6      97.5      00:00:42
 52009       8   4,035      32,280     1,391.6      91.3      00:02:37
 55751       6   4,035      24,210     1,493.9      98.1      00:00:33
 52313       8   4,035      32,280     1,400.4      91.9      00:02:26
 56044       8   4,035      32,280     1,502.0      98.6      00:00:24
 52682       4   4,035      16,140     1,411.3      92.6      00:02:13
 56339       8   4,035      32,280     1,510.1      99.1      00:00:15
 53052       7   4,035      28,245     1,422.0      93.3      00:02:00
 56646       6   4,035      24,210     1,518.7      99.7      00:00:05
 53433       6   4,035      24,210     1,432.6      94.0      00:01:48

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1693.28
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 53770      10   4,035      40,350     1,442.0      94.6      00:01:36
 54049       4   4,035      16,140     1,449.5      95.1      00:01:28
 54333      10   4,035      40,350     1,457.2      95.6      00:01:19
 54665       4   4,035      16,140     1,465.6      96.2      00:01:09
 54988       6   4,035      24,210     1,474.2      96.8      00:00:58
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR100.csv saved

. 
. cap log close

. 
end of do-file
 55252       3   4,035      12,105     1,481.1      97.2      00:00:50
 55540       2   4,035       8,070     1,488.3      97.7      00:00:42
 55834       9   4,035      36,315     1,496.1      98.2      00:00:33
 56125       5   4,035      20,175     1,504.1      98.7      00:00:23
 56385       9   4,035      36,315     1,511.5      99.2      00:00:14
 56671       7   4,035      28,245     1,519.5      99.7      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1814.258
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/
    > Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR100.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR100.csv saved

. 
. cap log close

. 
end of do-file
