
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A700_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   310       8   4,735      37,880         8.5       0.5      00:35:01
   596       5   4,735      23,675        16.5       0.9      00:35:49
   849       4   4,735      18,940        23.9       1.3      00:37:01
  1127      10   4,735      47,350        32.2       1.8      00:36:25
  1381       8   4,735      37,880        40.1       2.2      00:36:22
  1622       6   4,735      28,410        47.7       2.7      00:36:33
  1866      10   4,735      47,350        55.0       3.1      00:36:49
  2119       9   4,735      42,615        62.6       3.5      00:36:49
  2364       8   4,735      37,880        70.0       3.9      00:36:52
  2622       9   4,735      42,615        77.7       4.4      00:36:42
  2903      10   4,735      47,350        86.5       4.8      00:36:06
  3201       7   4,735      33,145        95.7       5.4      00:35:24
  3476       6   4,735      28,410       104.5       5.9      00:34:55
  3767       8   4,735      37,880       113.7       6.4      00:34:24
  4015       8   4,735      37,880       120.8       6.8      00:34:33
  4231       7   4,735      33,145       127.2       7.1      00:34:52
  4450      10   4,735      47,350       133.6       7.5      00:35:08
  4664       8   4,735      37,880       140.4       7.9      00:35:15
  4899       6   4,735      28,410       147.7       8.3      00:35:13
  5109       7   4,735      33,145       154.0       8.6      00:35:25
  5334       6   4,735      28,410       161.0       9.0      00:35:26
  5518      10   4,735      47,350       166.3       9.3      00:35:48
  5710       6   4,735      28,410       171.9       9.6      00:36:05
  5914       3   4,735      14,205       178.0      10.0      00:36:13
  6142       6   4,735      28,410       185.1      10.4      00:36:08
  6358      10   4,735      47,350       191.4      10.7      00:36:11
  6593      10   4,735      47,350       198.5      11.1      00:36:05
  6806       8   4,735      37,880       204.9      11.5      00:36:06
  7050       5   4,735      23,675       212.2      11.9      00:35:56
  7321       7   4,735      33,145       220.4      12.3      00:35:37
  7568       8   4,735      37,880       228.1      12.8      00:35:23
  7836       6   4,735      28,410       236.4      13.2      00:35:02
  8097       8   4,735      37,880       245.0      13.7      00:34:40
  8349       7   4,735      33,145       253.3      14.2      00:34:23
  8584       8   4,735      37,880       260.9      14.6      00:34:11
  8840      10   4,735      47,350       269.1      15.1      00:33:55
  9072       9   4,735      42,615       276.6      15.5      00:33:44
  9292       8   4,735      37,880       283.8      15.9      00:33:37
  9464       8   4,735      37,880       289.2      16.2      00:33:44
  9650      10   4,735      47,350       295.6      16.5      00:33:42
  9840       7   4,735      33,145       301.7      16.9      00:33:43
 10037       5   4,735      23,675       307.6      17.2      00:33:45
 10241       6   4,735      28,410       313.3      17.5      00:33:48
 10431       6   4,735      28,410       319.2      17.9      00:33:48
 10657       5   4,735      23,675       325.9      18.2      00:33:42
 10898      10   4,735      47,350       333.3      18.7      00:33:31
 11142       9   4,735      42,615       340.8      19.1      00:33:19
 11351       7   4,735      33,145       347.3      19.4      00:33:14
 11549       4   4,735      18,940       353.3      19.8      00:33:13
 11762       6   4,735      28,410       359.9      20.1      00:33:07
 11974       4   4,735      18,940       366.5      20.5      00:33:01
 12179       3   4,735      14,205       373.1      20.9      00:32:55
 12431       6   4,735      28,410       380.6      21.3      00:32:43
 12708       5   4,735      23,675       389.3      21.8      00:32:23
 12991       8   4,735      37,880       397.7      22.3      00:32:06
 13275       6   4,735      28,410       406.5      22.8      00:31:46
 13540       2   4,735       9,470       415.2      23.2      00:31:27
 13748       6   4,735      28,410       421.8      23.6      00:31:21
 13943       9   4,735      42,615       427.8      23.9      00:31:19
 14175       2   4,735       9,470       435.0      24.3      00:31:09
 14419       4   4,735      18,940       442.9      24.8      00:30:55
 14658       3   4,735      14,205       450.4      25.2      00:30:44
 14918      10   4,735      47,350       458.6      25.7      00:30:29
 15184      10   4,735      47,350       467.4      26.2      00:30:11
 15479      10   4,735      47,350       476.5      26.7      00:29:51
 15761       9   4,735      42,615       485.5      27.2      00:29:33
 16034       9   4,735      42,615       494.5      27.7      00:29:15
 16338       6   4,735      28,410       504.4      28.2      00:28:52
 16592      10   4,735      47,350       512.5      28.7      00:28:40
 16819       7   4,735      33,145       519.7      29.1      00:28:31
 17027       7   4,735      33,145       526.4      29.5      00:28:24
 17234       4   4,735      18,940       532.7      29.8      00:28:19
 17425       8   4,735      37,880       539.0      30.2      00:28:14
 17602       7   4,735      33,145       545.0      30.5      00:28:10
 17824       7   4,735      33,145       551.8      30.9      00:28:03
 18080      10   4,735      47,350       560.0      31.3      00:27:49
 18373       6   4,735      28,410       569.3      31.9      00:27:31
 18591       6   4,735      28,410       575.9      32.2      00:27:24
 18777       5   4,735      23,675       582.1      32.6      00:27:19
 18984       6   4,735      28,410       588.9      33.0      00:27:11
 19181       9   4,735      42,615       595.3      33.3      00:27:05
 19432       7   4,735      33,145       603.5      33.8      00:26:52
 19714       4   4,735      18,940       612.9      34.3      00:26:34
 19999      10   4,735      47,350       622.4      34.8      00:26:15
 20282       8   4,735      37,880       631.5      35.3      00:25:59
 20533       9   4,735      42,615       639.6      35.8      00:25:46
 20729      10   4,735      47,350       645.8      36.1      00:25:41
 20915       9   4,735      42,615       652.0      36.5      00:25:35
 21152       5   4,735      23,675       659.1      36.9      00:25:26
 21362       8   4,735      37,880       665.1      37.2      00:25:22
 21548       5   4,735      23,675       670.9      37.6      00:25:17
 21796       4   4,735      18,940       678.0      37.9      00:25:08
 21962      10   4,735      47,350       683.1      38.2      00:25:06
 22157       7   4,735      33,145       688.7      38.5      00:25:03
 22358       6   4,735      28,410       694.7      38.9      00:24:57
 22576       8   4,735      37,880       701.2      39.2      00:24:50
 22804      10   4,735      47,350       707.7      39.6      00:24:43
 23085       5   4,735      23,675       716.4      40.1      00:24:28
 23363       7   4,735      33,145       725.2      40.6      00:24:13
 23653      10   4,735      47,350       733.7      41.1      00:23:59
 23935       3   4,735      14,205       742.5      41.6      00:23:44
 24193       6   4,735      28,410       750.2      42.0      00:23:33
 24480       9   4,735      42,615       758.9      42.5      00:23:18
 24772       6   4,735      28,410       768.1      43.0      00:23:03
 25049       8   4,735      37,880       776.7      43.5      00:22:49
 25248       9   4,735      42,615       783.1      43.8      00:22:42
 25487       8   4,735      37,880       790.7      44.3      00:22:31
 25712       7   4,735      33,145       797.5      44.6      00:22:23
 25911       9   4,735      42,615       804.0      45.0      00:22:16
 26127       4   4,735      18,940       810.7      45.4      00:22:08
 26411       5   4,735      23,675       819.4      45.9      00:21:53
 26692       7   4,735      33,145       828.0      46.3      00:21:40
 26941       8   4,735      37,880       835.9      46.8      00:21:29
 27152       5   4,735      23,675       842.5      47.2      00:21:21
 27322       7   4,735      33,145       847.7      47.4      00:21:17
 27505       9   4,735      42,615       853.5      47.8      00:21:11
 27723       9   4,735      42,615       860.4      48.2      00:21:03
 27988       9   4,735      42,615       868.9      48.6      00:20:49
 28294       6   4,735      28,410       878.8      49.2      00:20:33
 28602       8   4,735      37,880       889.0      49.8      00:20:15
 28799       5   4,735      23,675       895.3      50.1      00:20:08
 28987       7   4,735      33,145       901.4      50.5      00:20:01
 29224       3   4,735      14,205       908.7      50.9      00:19:51
 29468       4   4,735      18,940       916.7      51.3      00:19:40
 29712      10   4,735      47,350       924.3      51.7      00:19:29
 29907      10   4,735      47,350       930.5      52.1      00:19:22
 30100       2   4,735       9,470       936.7      52.4      00:19:15
 30302       8   4,735      37,880       943.2      52.8      00:19:07
 30492       9   4,735      42,615       949.6      53.1      00:19:00
 30752      10   4,735      47,350       957.9      53.6      00:18:48
 31049       8   4,735      37,880       967.2      54.1      00:18:33
 31343       6   4,735      28,410       976.8      54.7      00:18:17
 31635       5   4,735      23,675       986.4      55.2      00:18:02
 31917       5   4,735      23,675       995.9      55.7      00:17:47
 32205       8   4,735      37,880     1,005.6      56.3      00:17:31
 32472       9   4,735      42,615     1,014.6      56.8      00:17:17
 32642       7   4,735      33,145     1,020.0      57.1      00:17:12
 32830       4   4,735      18,940     1,026.1      57.4      00:17:05
 33023       8   4,735      37,880     1,032.5      57.8      00:16:58
 33237       8   4,735      37,880     1,039.5      58.2      00:16:49
 33481       6   4,735      28,410     1,047.4      58.6      00:16:38
 33722       6   4,735      28,410     1,055.5      59.1      00:16:26
 33950       7   4,735      33,145     1,063.1      59.5      00:16:16
 34190      10   4,735      47,350     1,071.2      60.0      00:16:04
 34468       7   4,735      33,145     1,080.3      60.5      00:15:50
 34753       6   4,735      28,410     1,089.7      61.0      00:15:36
 35034       6   4,735      28,410     1,098.9      61.5      00:15:22
 35325       9   4,735      42,615     1,108.5      62.0      00:15:08
 35622       6   4,735      28,410     1,118.3      62.6      00:14:53
 35924       7   4,735      33,145     1,128.0      63.1      00:14:38
 36214       8   4,735      37,880     1,137.5      63.7      00:14:24
 36507       8   4,735      37,880     1,147.0      64.2      00:14:10
 36643       2   4,735       9,470     1,151.5      64.4      00:14:06
 36832       4   4,735      18,940     1,157.3      64.8      00:13:60
 37044       4   4,735      18,940     1,164.0      65.1      00:13:51
 37253       8   4,735      37,880     1,170.2      65.5      00:13:44
 37471       7   4,735      33,145     1,176.7      65.9      00:13:36
 37679       8   4,735      37,880     1,183.0      66.2      00:13:28
 37883       8   4,735      37,880     1,189.6      66.6      00:13:20
 38078       7   4,735      33,145     1,195.8      66.9      00:13:13
 38290       6   4,735      28,410     1,202.6      67.3      00:13:04
 38532      10   4,735      47,350     1,210.6      67.8      00:12:53
 38814       7   4,735      33,145     1,219.6      68.3      00:12:40
 39055       5   4,735      23,675     1,227.3      68.7      00:12:29
 39260       7   4,735      33,145     1,233.5      69.0      00:12:22
 39508      10   4,735      47,350     1,241.3      69.5      00:12:11
 39742       9   4,735      42,615     1,248.5      69.9      00:12:02
 40019       7   4,735      33,145     1,257.3      70.4      00:11:49
 40293       6   4,735      28,410     1,265.7      70.8      00:11:37
 40571       4   4,735      18,940     1,274.8      71.4      00:11:24
 40851       7   4,735      33,145     1,283.9      71.9      00:11:11
 41031       9   4,735      42,615     1,289.8      72.2      00:11:04
 41191      10   4,735      47,350     1,294.9      72.5      00:10:59
 41399      10   4,735      47,350     1,301.5      72.8      00:10:50
 41598       9   4,735      42,615     1,307.9      73.2      00:10:42
 41800       8   4,735      37,880     1,314.3      73.6      00:10:34
 41977       5   4,735      23,675     1,320.1      73.9      00:10:27
 42151      10   4,735      47,350     1,325.2      74.2      00:10:21
 42350       9   4,735      42,615     1,331.2      74.5      00:10:14
 42517       8   4,735      37,880     1,336.7      74.8      00:10:08
 42714       5   4,735      23,675     1,342.7      75.2      00:09:60
 42909       7   4,735      33,145     1,348.9      75.5      00:09:52
 43075       7   4,735      33,145     1,354.5      75.8      00:09:45
 43228      10   4,735      47,350     1,359.5      76.1      00:09:40
 43392       9   4,735      42,615     1,364.9      76.4      00:09:33
 43599       7   4,735      33,145     1,371.2      76.7      00:09:25
 43890       8   4,735      37,880     1,380.4      77.3      00:09:12
 44148       7   4,735      33,145     1,388.4      77.7      00:09:01
 44314       7   4,735      33,145     1,393.5      78.0      00:08:55
 44527      10   4,735      47,350     1,400.1      78.4      00:08:46
 44761      10   4,735      47,350     1,407.5      78.8      00:08:36
 44984       7   4,735      33,145     1,414.6      79.2      00:08:26
 45243       8   4,735      37,880     1,422.4      79.6      00:08:15
 45425       7   4,735      33,145     1,427.7      79.9      00:08:09
 45627       9   4,735      42,615     1,433.7      80.2      00:08:01
 45842      10   4,735      47,350     1,440.2      80.6      00:07:53
 46050      10   4,735      47,350     1,446.9      81.0      00:07:44
 46237       6   4,735      28,410     1,453.1      81.3      00:07:36
 46446       7   4,735      33,145     1,459.5      81.7      00:07:27
 46678       7   4,735      33,145     1,467.1      82.1      00:07:17
 46922       7   4,735      33,145     1,474.8      82.5      00:07:06
 47138       9   4,735      42,615     1,480.9      82.9      00:06:58
 47330       7   4,735      33,145     1,486.7      83.2      00:06:51
 47544       6   4,735      28,410     1,493.1      83.6      00:06:42
 47748       4   4,735      18,940     1,499.6      83.9      00:06:33
 47938       8   4,735      37,880     1,505.6      84.3      00:06:26
 48157       5   4,735      23,675     1,512.4      84.7      00:06:16
 48379       7   4,735      33,145     1,519.5      85.1      00:06:07
 48629      10   4,735      47,350     1,527.4      85.5      00:05:56
 48840       9   4,735      42,615     1,534.0      85.9      00:05:47
 49037       7   4,735      33,145     1,540.2      86.2      00:05:39
 49235       7   4,735      33,145     1,546.6      86.6      00:05:30
 49442       4   4,735      18,940     1,552.7      86.9      00:05:22
 49664       9   4,735      42,615     1,559.2      87.3      00:05:13
 49870       8   4,735      37,880     1,565.3      87.6      00:05:05
 50057       7   4,735      33,145     1,571.3      87.9      00:04:57
 50292       7   4,735      33,145     1,578.3      88.3      00:04:47
 50523       4   4,735      18,940     1,585.4      88.7      00:04:37
 50724       6   4,735      28,410     1,591.8      89.1      00:04:29
 50938       5   4,735      23,675     1,598.9      89.5      00:04:19
 51168       6   4,735      28,410     1,606.2      89.9      00:04:09
 51376       7   4,735      33,145     1,612.8      90.3      00:03:60
 51590      10   4,735      47,350     1,619.8      90.7      00:03:50
 51800       6   4,735      28,410     1,626.8      91.1      00:03:41
 52050       8   4,735      37,880     1,635.0      91.5      00:03:29
 52335       7   4,735      33,145     1,644.7      92.1      00:03:16
 52605       9   4,735      42,615     1,654.1      92.6      00:03:02
 52894       4   4,735      18,940     1,663.9      93.1      00:02:49
 53185      10   4,735      47,350     1,673.6      93.7      00:02:35
 53475       9   4,735      42,615     1,683.0      94.2      00:02:22
 53730       5   4,735      23,675     1,691.4      94.7      00:02:10
 53932       8   4,735      37,880     1,697.7      95.0      00:02:02
 54136       7   4,735      33,145     1,704.1      95.4      00:01:53
 54325       3   4,735      14,205     1,710.1      95.7      00:01:45
 54596       5   4,735      23,675     1,718.0      96.2      00:01:34
 54877       4   4,735      18,940     1,726.8      96.6      00:01:22
 55109      10   4,735      47,350     1,734.0      97.1      00:01:12
 55361      10   4,735      47,350     1,741.5      97.5      00:01:02
 55606      10   4,735      47,350     1,748.8      97.9      00:00:52
 55812       6   4,735      28,410     1,755.4      98.3      00:00:43
 56061       6   4,735      28,410     1,763.5      98.7      00:00:32
 56289       8   4,735      37,880     1,771.0      99.1      00:00:21
 56535      10   4,735      47,350     1,779.1      99.6      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 2449.905
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
