
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A700.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A700.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A700.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A700.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   355       9   4,735      42,615         9.6       0.5      00:31:02
   718       7   4,735      33,145        19.8       1.1      00:29:45
  1079       7   4,735      33,145        30.6       1.7      00:28:46
  1448       7   4,735      33,145        42.1       2.4      00:27:41
  1778       6   4,735      28,410        52.2       2.9      00:27:44
  2115       8   4,735      37,880        62.3       3.5      00:27:47
  2478       7   4,735      33,145        73.2       4.1      00:27:26
  2837       4   4,735      18,940        84.4       4.7      00:27:00
  3191       9   4,735      42,615        95.2       5.3      00:26:45
  3540       7   4,735      33,145       106.3       5.9      00:26:27
  3893       9   4,735      42,615       117.2       6.6      00:26:12
  4132       9   4,735      42,615       124.1       6.9      00:26:52
  4397       8   4,735      37,880       131.8       7.4      00:27:18
  4625       7   4,735      33,145       139.0       7.8      00:27:45
  4831       8   4,735      37,880       145.4       8.1      00:28:19
  5040       5   4,735      23,675       151.8       8.5      00:28:48
  5317       7   4,735      33,145       160.2       9.0      00:28:51
  5549       6   4,735      28,410       167.0       9.3      00:29:11
  5790       4   4,735      18,940       174.0       9.7      00:29:26
  6003       8   4,735      37,880       180.5      10.1      00:29:45
  6222       9   4,735      42,615       187.3      10.5      00:29:60
  6459       6   4,735      28,410       194.3      10.9      00:30:09
  6730       5   4,735      23,675       202.3      11.3      00:30:08
  7056      10   4,735      47,350       212.2      11.9      00:29:47
  7384       4   4,735      18,940       222.2      12.4      00:29:26
  7716       8   4,735      37,880       232.4      13.0      00:29:04
  8024       3   4,735      14,205       242.4      13.6      00:28:45
  8300      10   4,735      47,350       251.4      14.1      00:28:35
  8582       9   4,735      42,615       260.6      14.6      00:28:23
  8882       5   4,735      23,675       270.2      15.1      00:28:09
  9156       8   4,735      37,880       279.1      15.6      00:27:60
  9389       8   4,735      37,880       286.7      16.0      00:27:60
  9601       7   4,735      33,145       293.6      16.4      00:28:04
  9808       7   4,735      33,145       300.5      16.8      00:28:07
 10018       9   4,735      42,615       306.8      17.2      00:28:14
 10227       5   4,735      23,675       312.8      17.5      00:28:22
 10450      10   4,735      47,350       319.6      17.9      00:28:24
 10698      10   4,735      47,350       327.0      18.3      00:28:22
 11008       7   4,735      33,145       336.6      18.8      00:28:05
 11250       5   4,735      23,675       343.9      19.2      00:28:03
 11487       9   4,735      42,615       351.3      19.7      00:28:00
 11733       9   4,735      42,615       358.8      20.1      00:27:57
 12003       5   4,735      23,675       367.2      20.5      00:27:48
 12236       7   4,735      33,145       374.6      21.0      00:27:44
 12538       9   4,735      42,615       383.9      21.5      00:27:29
 12884      10   4,735      47,350       394.2      22.0      00:27:10
 13219      10   4,735      47,350       404.6      22.6      00:26:51
 13541       7   4,735      33,145       415.1      23.2      00:26:31
 13700       9   4,735      42,615       420.2      23.5      00:26:39
 13942       5   4,735      23,675       427.5      23.9      00:26:35
 14170       4   4,735      18,940       434.6      24.3      00:26:32
 14440      10   4,735      47,350       443.3      24.8      00:26:21
 14659       5   4,735      23,675       450.2      25.2      00:26:18
 14936       8   4,735      37,880       458.9      25.7      00:26:08
 15260       7   4,735      33,145       469.5      26.3      00:25:48
 15615       5   4,735      23,675       480.5      26.9      00:25:27
 15942       9   4,735      42,615       491.2      27.5      00:25:08
 16292       9   4,735      42,615       502.7      28.1      00:24:46
 16600       6   4,735      28,410       512.5      28.7      00:24:31
 16878       6   4,735      28,410       521.2      29.2      00:24:21
 17063      10   4,735      47,350       527.2      29.5      00:24:22
 17301       9   4,735      42,615       534.7      29.9      00:24:16
 17506      10   4,735      47,350       541.6      30.3      00:24:13
 17726       5   4,735      23,675       548.6      30.7      00:24:09
 18004      10   4,735      47,350       557.2      31.2      00:23:59
 18328      10   4,735      47,350       567.7      31.8      00:23:42
 18615       8   4,735      37,880       576.4      32.2      00:23:31
 18764       5   4,735      23,675       581.4      32.5      00:23:34
 19032       5   4,735      23,675       590.2      33.0      00:23:23
 19248       8   4,735      37,880       597.3      33.4      00:23:19
 19547       6   4,735      28,410       607.0      34.0      00:23:04
 19863       9   4,735      42,615       617.5      34.5      00:22:48
 20162       8   4,735      37,880       627.5      35.1      00:22:33
 20471       8   4,735      37,880       637.3      35.6      00:22:19
 20633       5   4,735      23,675       642.6      35.9      00:22:20
 20788       4   4,735      18,940       647.5      36.2      00:22:22
 20927       5   4,735      23,675       652.1      36.5      00:22:24
 21212       8   4,735      37,880       660.6      36.9      00:22:14
 21442       7   4,735      33,145       667.2      37.3      00:22:10
 21662       5   4,735      23,675       673.8      37.7      00:22:06
 21904      10   4,735      47,350       681.0      38.1      00:21:60
 22144       9   4,735      42,615       688.0      38.5      00:21:54
 22415       7   4,735      33,145       696.0      38.9      00:21:45
 22635       8   4,735      37,880       702.8      39.3      00:21:40
 22959       7   4,735      33,145       712.1      39.8      00:21:27
 23231      10   4,735      47,350       720.8      40.3      00:21:16
 23581       4   4,735      18,940       731.3      40.9      00:21:00
 23870       9   4,735      42,615       740.4      41.4      00:20:48
 24212       8   4,735      37,880       750.6      42.0      00:20:33
 24525      10   4,735      47,350       760.1      42.5      00:20:20
 24869       7   4,735      33,145       770.9      43.1      00:20:03
 25174       6   4,735      28,410       780.6      43.7      00:19:50
 25499       8   4,735      37,880       790.7      44.2      00:19:35
 25688       1   4,735       4,735       796.4      44.5      00:19:33
 25863       6   4,735      28,410       802.2      44.9      00:19:30
 26091       9   4,735      42,615       809.4      45.3      00:19:23
 26357      10   4,735      47,350       817.6      45.7      00:19:14
 26645       7   4,735      33,145       826.2      46.2      00:19:03
 26893      10   4,735      47,350       834.0      46.6      00:18:55
 27154       8   4,735      37,880       842.1      47.1      00:18:46
 27297       9   4,735      42,615       846.5      47.3      00:18:46
 27465      10   4,735      47,350       851.8      47.6      00:18:44
 27641       9   4,735      42,615       857.4      48.0      00:18:41
 27924       9   4,735      42,615       866.5      48.5      00:18:28
 28228       7   4,735      33,145       876.2      49.0      00:18:15
 28541      10   4,735      47,350       886.5      49.6      00:18:00
 28753       8   4,735      37,880       893.4      50.0      00:17:54
 28989       7   4,735      33,145       901.1      50.4      00:17:45
 29181       7   4,735      33,145       907.2      50.7      00:17:41
 29432      10   4,735      47,350       915.2      51.2      00:17:31
 29672       1   4,735       4,735       922.5      51.6      00:17:24
 29852       6   4,735      28,410       928.5      51.9      00:17:19
 30050       7   4,735      33,145       934.8      52.3      00:17:14
 30216       8   4,735      37,880       940.2      52.6      00:17:10
 30428       7   4,735      33,145       946.8      53.0      00:17:04
 30660       6   4,735      28,410       954.5      53.4      00:16:55
 30959       9   4,735      42,615       964.1      53.9      00:16:42
 31262       7   4,735      33,145       973.9      54.5      00:16:29
 31573       5   4,735      23,675       984.1      55.0      00:16:14
 31860      10   4,735      47,350       993.6      55.6      00:16:02
 32214       8   4,735      37,880     1,005.4      56.2      00:15:44
 32490      10   4,735      47,350     1,014.7      56.8      00:15:32
 32674       6   4,735      28,410     1,020.6      57.1      00:15:27
 32836       7   4,735      33,145     1,026.0      57.4      00:15:23
 33081       6   4,735      28,410     1,034.0      57.8      00:15:13
 33291       6   4,735      28,410     1,040.9      58.2      00:15:06
 33521       8   4,735      37,880     1,048.3      58.6      00:14:58
 33715       7   4,735      33,145     1,054.9      59.0      00:14:52
 33972       5   4,735      23,675     1,063.3      59.5      00:14:41
 34208       9   4,735      42,615     1,071.3      59.9      00:14:32
 34549       8   4,735      37,880     1,082.5      60.5      00:14:16
 34862       9   4,735      42,615     1,092.9      61.1      00:14:01
 35254       5   4,735      23,675     1,105.8      61.8      00:13:42
 35573       6   4,735      28,410     1,116.3      62.4      00:13:28
 35914       5   4,735      23,675     1,127.3      63.1      00:13:13
 36212       2   4,735       9,470     1,137.0      63.6      00:13:00
 36561       9   4,735      42,615     1,148.3      64.2      00:12:45
 36864       9   4,735      42,615     1,157.9      64.8      00:12:33
 37126       8   4,735      37,880     1,166.2      65.2      00:12:23
 37411      10   4,735      47,350     1,174.5      65.7      00:12:13
 37696       7   4,735      33,145     1,183.3      66.2      00:12:02
 37972       8   4,735      37,880     1,191.9      66.7      00:11:52
 38206       9   4,735      42,615     1,199.5      67.1      00:11:43
 38434      10   4,735      47,350     1,207.0      67.5      00:11:35
 38744       6   4,735      28,410     1,217.0      68.1      00:11:22
 39052       8   4,735      37,880     1,226.9      68.6      00:11:09
 39313       9   4,735      42,615     1,234.8      69.1      00:10:60
 39634       6   4,735      28,410     1,244.9      69.6      00:10:47
 39973       2   4,735       9,470     1,255.5      70.2      00:10:33
 40357       7   4,735      33,145     1,267.4      70.9      00:10:17
 40697       4   4,735      18,940     1,278.5      71.5      00:10:03
 41007       3   4,735      14,205     1,288.6      72.1      00:09:50
 41259       5   4,735      23,675     1,296.7      72.5      00:09:41
 41592       9   4,735      42,615     1,307.3      73.1      00:09:27
 41886       6   4,735      28,410     1,316.7      73.6      00:09:16
 42156       7   4,735      33,145     1,325.0      74.1      00:09:06
 42457       5   4,735      23,675     1,334.5      74.6      00:08:55
 42800       7   4,735      33,145     1,345.0      75.2      00:08:41
 43137       7   4,735      33,145     1,356.1      75.8      00:08:27
 43427       4   4,735      18,940     1,365.6      76.4      00:08:16
 43708       3   4,735      14,205     1,374.1      76.9      00:08:06
 43964       9   4,735      42,615     1,382.3      77.3      00:07:56
 44213       6   4,735      28,410     1,390.1      77.8      00:07:47
 44466       7   4,735      33,145     1,397.7      78.2      00:07:39
 44743       5   4,735      23,675     1,406.5      78.7      00:07:28
 45029      10   4,735      47,350     1,415.7      79.2      00:07:17
 45371       5   4,735      23,675     1,425.7      79.7      00:07:05
 45624       8   4,735      37,880     1,433.4      80.2      00:06:56
 45919       8   4,735      37,880     1,442.3      80.7      00:06:46
 46206       7   4,735      33,145     1,451.6      81.2      00:06:35
 46508      10   4,735      47,350     1,461.2      81.7      00:06:23
 46855       9   4,735      42,615     1,472.5      82.4      00:06:09
 47115       9   4,735      42,615     1,480.1      82.8      00:06:01
 47370       6   4,735      28,410     1,487.7      83.2      00:05:52
 47616       8   4,735      37,880     1,495.2      83.6      00:05:43
 47878       8   4,735      37,880     1,503.3      84.1      00:05:34
 48106       6   4,735      28,410     1,510.6      84.5      00:05:26
 48376       5   4,735      23,675     1,519.2      85.0      00:05:16
 48665       5   4,735      23,675     1,528.2      85.5      00:05:05
 48945       9   4,735      42,615     1,537.0      86.0      00:04:54
 49209       9   4,735      42,615     1,545.6      86.4      00:04:44
 49480       9   4,735      42,615     1,553.7      86.9      00:04:35
 49719       4   4,735      18,940     1,560.5      87.3      00:04:27
 49928      10   4,735      47,350     1,566.8      87.6      00:04:20
 50189       9   4,735      42,615     1,575.0      88.1      00:04:11
 50438       6   4,735      28,410     1,582.3      88.5      00:04:02
 50673       6   4,735      28,410     1,589.7      88.9      00:03:54
 50914       9   4,735      42,615     1,597.6      89.4      00:03:44
 51139       8   4,735      37,880     1,604.9      89.8      00:03:36
 51424       8   4,735      37,880     1,613.9      90.3      00:03:25
 51694       8   4,735      37,880     1,622.8      90.8      00:03:15
 51966       8   4,735      37,880     1,631.6      91.3      00:03:04
 52211       6   4,735      28,410     1,640.0      91.7      00:02:54
 52541       4   4,735      18,940     1,651.3      92.4      00:02:41
 52959       6   4,735      28,410     1,665.5      93.2      00:02:24
 53366       5   4,735      23,675     1,679.0      93.9      00:02:07
 53772       6   4,735      28,410     1,692.2      94.6      00:01:52
 54086      10   4,735      47,350     1,702.2      95.2      00:01:40
 54356       8   4,735      37,880     1,710.7      95.7      00:01:30
 54657       7   4,735      33,145     1,719.5      96.2      00:01:20
 54994      10   4,735      47,350     1,730.1      96.8      00:01:07
 55345       2   4,735       9,470     1,740.6      97.4      00:00:55
 55682       8   4,735      37,880     1,750.9      97.9      00:00:43
 56037       9   4,735      42,615     1,762.3      98.6      00:00:30
 56381       4   4,735      18,940     1,773.5      99.2      00:00:17
 56686       6   4,735      28,410     1,783.6      99.8      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 2073.676
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A700.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A700.csv saved

. 
. cap log close

. 
end of do-file
