
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A100.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Apr 2024, 11:57:41

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   395       4   4,135      16,540         9.3       0.6      00:27:45
   804       7   4,135      28,945        19.7       1.3      00:26:04
  1241       6   4,135      24,810        31.1       2.0      00:24:39
  1667      10   4,135      41,350        42.7       2.7      00:23:44
  2112       5   4,135      20,675        54.3       3.5      00:23:08
  2551       7   4,135      28,945        65.7       4.2      00:22:46
  2951       1   4,135       4,135        76.6       4.9      00:22:39
  3325       7   4,135      28,945        86.9       5.6      00:22:39
  3780       8   4,135      33,080        99.4       6.4      00:22:04
  4189       9   4,135      37,215       110.0       7.0      00:22:01
  4599       8   4,135      33,080       120.6       7.7      00:21:56
  4951       9   4,135      37,215       130.2       8.3      00:22:00
  5317       7   4,135      28,945       139.9       9.0      00:22:02
  5644       6   4,135      24,810       148.2       9.5      00:22:17
  6022       6   4,135      24,810       158.2      10.1      00:22:12
  6424       7   4,135      28,945       168.7      10.8      00:22:02
  6781       9   4,135      37,215       178.1      11.4      00:22:02
  7177       8   4,135      33,080       188.4      12.1      00:21:54
  7617      10   4,135      41,350       200.4      12.8      00:21:32
  8050      10   4,135      41,350       212.5      13.6      00:21:11
  8487       8   4,135      33,080       224.9      14.4      00:20:49
  8921      10   4,135      41,350       237.1      15.2      00:20:30
  9290      10   4,135      41,350       247.6      15.9      00:20:22
  9609      10   4,135      41,350       256.7      16.4      00:20:22
  9986       8   4,135      33,080       267.1      17.1      00:20:13
 10349       7   4,135      28,945       276.3      17.7      00:20:11
 10729       5   4,135      20,675       286.4      18.3      00:20:04
 11147       8   4,135      33,080       297.6      19.1      00:19:51
 11457       6   4,135      24,810       306.0      19.6      00:19:52
 11757       4   4,135      16,540       313.9      20.1      00:19:54
 12096       7   4,135      28,945       323.3      20.7      00:19:49
 12508       5   4,135      20,675       334.4      21.4      00:19:37
 12995       8   4,135      33,080       347.1      22.2      00:19:17
 13472       6   4,135      24,810       360.4      23.1      00:18:55
 13817       6   4,135      24,810       370.0      23.7      00:18:49
 14190       7   4,135      28,945       380.2      24.3      00:18:41
 14603       8   4,135      33,080       391.7      25.1      00:18:27
 15033       5   4,135      20,675       403.5      25.8      00:18:12
 15518      10   4,135      41,350       417.1      26.7      00:17:52
 15982       8   4,135      33,080       430.1      27.5      00:17:34
 16415       8   4,135      33,080       442.5      28.3      00:17:19
 16738       9   4,135      37,215       451.4      28.9      00:17:15
 17031      10   4,135      41,350       459.5      29.4      00:17:13
 17304       8   4,135      33,080       467.0      29.9      00:17:13
 17607       8   4,135      33,080       475.9      30.5      00:17:08
 18019       2   4,135       8,270       487.0      31.2      00:16:57
 18433       9   4,135      37,215       498.4      31.9      00:16:44
 18893       9   4,135      37,215       511.3      32.7      00:16:28
 19330       7   4,135      28,945       523.9      33.6      00:16:12
 19762       8   4,135      33,080       536.4      34.4      00:15:57
 20220       7   4,135      28,945       549.6      35.2      00:15:41
 20636       6   4,135      24,810       561.2      35.9      00:15:28
 20941       9   4,135      37,215       569.9      36.5      00:15:24
 21330       1   4,135       4,135       579.6      37.1      00:15:16
 21722       5   4,135      20,675       590.0      37.8      00:15:07
 22111       5   4,135      20,675       600.0      38.4      00:14:59
 22488       8   4,135      33,080       609.7      39.1      00:14:51
 22833       8   4,135      33,080       618.5      39.6      00:14:46
 23185       5   4,135      20,675       628.2      40.2      00:14:38
 23561       5   4,135      20,675       638.0      40.9      00:14:30
 23992       4   4,135      16,540       649.8      41.6      00:14:17
 24442      10   4,135      41,350       661.4      42.4      00:14:05
 24858       8   4,135      33,080       672.9      43.1      00:13:53
 25268       5   4,135      20,675       684.2      43.8      00:13:42
 25681      10   4,135      41,350       695.3      44.5      00:13:31
 26022       8   4,135      33,080       704.8      45.1      00:13:23
 26389       3   4,135      12,405       714.8      45.8      00:13:15
 26832       6   4,135      24,810       726.6      46.5      00:13:02
 27235       8   4,135      33,080       737.6      47.2      00:12:52
 27599      10   4,135      41,350       747.6      47.9      00:12:43
 28009       6   4,135      24,810       759.1      48.6      00:12:32
 28441       9   4,135      37,215       771.2      49.4      00:12:19
 28756       9   4,135      37,215       780.3      50.0      00:12:12
 29019       7   4,135      28,945       787.7      50.5      00:12:08
 29340       6   4,135      24,810       796.5      51.0      00:12:01
 29649       8   4,135      33,080       805.1      51.6      00:11:55
 29976       5   4,135      20,675       814.2      52.1      00:11:48
 30307       6   4,135      24,810       823.5      52.7      00:11:40
 30623       8   4,135      33,080       832.6      53.3      00:11:33
 31052       9   4,135      37,215       844.5      54.1      00:11:20
 31480       9   4,135      37,215       856.8      54.9      00:11:07
 31901       7   4,135      28,945       868.9      55.7      00:10:55
 32294       6   4,135      24,810       880.3      56.4      00:10:43
 32633       6   4,135      24,810       890.1      57.0      00:10:34
 32881      10   4,135      41,350       897.2      57.5      00:10:30
 33163       8   4,135      33,080       905.4      58.0      00:10:24
 33565       8   4,135      33,080       916.8      58.7      00:10:13
 33966       6   4,135      24,810       928.4      59.5      00:10:01
 34340       6   4,135      24,810       939.4      60.2      00:09:50
 34788       9   4,135      37,215       952.3      61.0      00:09:37
 35246       8   4,135      33,080       965.4      61.8      00:09:23
 35700       9   4,135      37,215       978.4      62.7      00:09:09
 36158       8   4,135      33,080       991.5      63.5      00:08:55
 36595       9   4,135      37,215     1,003.8      64.3      00:08:43
 36968       7   4,135      28,945     1,014.2      65.0      00:08:33
 37297      10   4,135      41,350     1,022.8      65.5      00:08:26
 37601       7   4,135      28,945     1,030.9      66.0      00:08:20
 37898       8   4,135      33,080     1,038.9      66.5      00:08:14
 38219       6   4,135      24,810     1,047.9      67.1      00:08:06
 38509       9   4,135      37,215     1,056.2      67.6      00:07:59
 38970       6   4,135      24,810     1,069.1      68.5      00:07:46
 39287       8   4,135      33,080     1,077.6      69.0      00:07:39
 39655       7   4,135      28,945     1,087.7      69.7      00:07:29
 40091       7   4,135      28,945     1,099.6      70.4      00:07:17
 40552       5   4,135      20,675     1,112.4      71.2      00:07:04
 40983       9   4,135      37,215     1,124.7      72.0      00:06:52
 41321       6   4,135      24,810     1,134.1      72.6      00:06:44
 41667      10   4,135      41,350     1,143.8      73.3      00:06:35
 41946       8   4,135      33,080     1,151.7      73.8      00:06:28
 42259       7   4,135      28,945     1,159.8      74.3      00:06:21
 42572       5   4,135      20,675     1,168.4      74.8      00:06:14
 42913       6   4,135      24,810     1,177.8      75.4      00:06:05
 43235       6   4,135      24,810     1,187.1      76.0      00:05:57
 43610       5   4,135      20,675     1,197.4      76.7      00:05:47
 43946      10   4,135      41,350     1,206.7      77.3      00:05:39
 44232       5   4,135      20,675     1,214.5      77.8      00:05:32
 44511      10   4,135      41,350     1,222.0      78.3      00:05:25
 44828       8   4,135      33,080     1,230.7      78.8      00:05:18
 45168       7   4,135      28,945     1,240.0      79.4      00:05:09
 45518       8   4,135      33,080     1,249.1      80.0      00:05:00
 45850       6   4,135      24,810     1,257.7      80.6      00:04:53
 46189      10   4,135      41,350     1,267.2      81.2      00:04:44
 46544      10   4,135      41,350     1,277.1      81.8      00:04:34
 46961       2   4,135       8,270     1,288.8      82.5      00:04:23
 47319       9   4,135      37,215     1,297.8      83.1      00:04:14
 47663       7   4,135      28,945     1,306.9      83.7      00:04:06
 47957       9   4,135      37,215     1,315.0      84.2      00:03:58
 48233       9   4,135      37,215     1,322.5      84.7      00:03:52
 48497       6   4,135      24,810     1,329.9      85.2      00:03:45
 48764      10   4,135      41,350     1,337.3      85.6      00:03:38
 49044      10   4,135      41,350     1,344.8      86.1      00:03:31
 49318       7   4,135      28,945     1,352.6      86.6      00:03:24
 49648      10   4,135      41,350     1,361.0      87.2      00:03:16
 50004      10   4,135      41,350     1,370.5      87.8      00:03:07
 50406       9   4,135      37,215     1,380.9      88.4      00:02:57
 50786       5   4,135      20,675     1,391.5      89.1      00:02:46
 51199       9   4,135      37,215     1,403.1      89.9      00:02:35
 51523       7   4,135      28,945     1,412.1      90.4      00:02:26
 51880       9   4,135      37,215     1,422.5      91.1      00:02:16
 52239       5   4,135      20,675     1,433.1      91.8      00:02:06
 52597       8   4,135      33,080     1,443.7      92.5      00:01:55
 52940       9   4,135      37,215     1,454.0      93.1      00:01:45
 53288      10   4,135      41,350     1,464.1      93.8      00:01:35
 53734       9   4,135      37,215     1,476.7      94.6      00:01:23
 54036      10   4,135      41,350     1,485.1      95.1      00:01:15
 54310      10   4,135      41,350     1,492.6      95.6      00:01:07
 54680       7   4,135      28,945     1,502.3      96.2      00:00:58
 55063       6   4,135      24,810     1,512.6      96.9      00:00:48
 55410       8   4,135      33,080     1,521.8      97.5      00:00:39
 55733       9   4,135      37,215     1,530.5      98.0      00:00:30
 56036      10   4,135      41,350     1,539.0      98.6      00:00:22
 56380       7   4,135      28,945     1,548.8      99.2      00:00:12
 56732      10   4,135      41,350     1,558.8      99.8      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1542.47
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100.csv saved

. 
. cap log close

. 
end of do-file
