
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A300_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   233       5   4,335      21,675         5.8       0.4      00:46:56
   492       6   4,335      26,010        12.3       0.8      00:43:58
   723       7   4,335      30,345        18.4       1.1      00:43:55
   942      10   4,335      43,350        24.2       1.5      00:44:28
  1156       4   4,335      17,340        30.3       1.9      00:44:18
  1358       2   4,335       8,670        36.1       2.2      00:44:27
  1566       6   4,335      26,010        42.0       2.6      00:44:19
  1767       6   4,335      26,010        47.7       2.9      00:44:31
  1975       4   4,335      17,340        53.3       3.3      00:44:36
  2187       8   4,335      34,680        59.2       3.6      00:44:27
  2408       7   4,335      30,345        65.3       4.0      00:44:10
  2652       9   4,335      39,015        72.0       4.4      00:43:30
  2873       2   4,335       8,670        78.4       4.8      00:43:09
  3101       8   4,335      34,680        84.6       5.2      00:42:52
  3323       9   4,335      39,015        91.2       5.6      00:42:24
  3529       8   4,335      34,680        97.2       5.9      00:42:18
  3746       7   4,335      30,345       103.4       6.3      00:42:04
  3916       9   4,335      39,015       108.0       6.6      00:42:31
  4058       7   4,335      30,345       111.8       6.8      00:43:14
  4183       7   4,335      30,345       115.3       7.0      00:44:04
  4321       9   4,335      39,015       118.8       7.3      00:44:49
  4466       8   4,335      34,680       122.8       7.5      00:45:17
  4597      10   4,335      43,350       126.6       7.7      00:45:49
  4724       8   4,335      34,680       130.4       8.0      00:46:19
  4868       9   4,335      39,015       134.3       8.2      00:46:42
  5030       6   4,335      26,010       138.9       8.5      00:46:49
  5193       8   4,335      34,680       143.5       8.8      00:46:56
  5353       8   4,335      34,680       148.0       9.0      00:47:01
  5499       5   4,335      21,675       151.7       9.3      00:47:24
  5632       9   4,335      39,015       155.2       9.5      00:47:49
  5723       8   4,335      34,680       157.6       9.6      00:48:36
  5844       6   4,335      26,010       161.0       9.8      00:49:00
  5975       5   4,335      21,675       164.7      10.1      00:49:15
  6148       4   4,335      17,340       169.6      10.4      00:49:07
  6292       7   4,335      30,345       173.5      10.6      00:49:17
  6425       9   4,335      39,015       177.1      10.8      00:49:32
  6544       9   4,335      39,015       180.4      11.0      00:49:54
  6666       9   4,335      39,015       183.7      11.2      00:50:13
  6819       5   4,335      21,675       188.0      11.5      00:50:13
  6954       7   4,335      30,345       191.7      11.7      00:50:23
  7146       2   4,335       8,670       196.7      12.0      00:50:08
  7323       8   4,335      34,680       201.8      12.3      00:49:53
  7480      10   4,335      43,350       206.3      12.6      00:49:48
  7667       7   4,335      30,345       211.6      12.9      00:49:30
  7855       5   4,335      21,675       217.1      13.3      00:49:10
  8031      10   4,335      43,350       222.4      13.6      00:48:52
  8207       5   4,335      21,675       227.6      13.9      00:48:36
  8383      10   4,335      43,350       232.9      14.2      00:48:21
  8562       3   4,335      13,005       238.2      14.6      00:48:04
  8723       9   4,335      39,015       242.9      14.8      00:47:57
  8894      10   4,335      43,350       248.0      15.2      00:47:44
  8995       6   4,335      26,010       250.9      15.3      00:47:60
  9100       5   4,335      21,675       254.0      15.5      00:48:13
  9246       9   4,335      39,015       258.4      15.8      00:48:08
  9393      10   4,335      43,350       262.7      16.1      00:48:05
  9530      10   4,335      43,350       266.8      16.3      00:48:04
  9642       4   4,335      17,340       270.3      16.5      00:48:10
  9755       9   4,335      39,015       273.7      16.7      00:48:17
  9864       8   4,335      34,680       276.8      16.9      00:48:27
  9978      10   4,335      43,350       280.0      17.1      00:48:36
 10121       5   4,335      21,675       283.6      17.3      00:48:38
 10251      10   4,335      43,350       287.1      17.6      00:48:43
 10394       4   4,335      17,340       291.1      17.8      00:48:41
 10550       5   4,335      21,675       295.5      18.1      00:48:33
 10706       6   4,335      26,010       299.8      18.3      00:48:27
 10888       8   4,335      34,680       304.9      18.6      00:48:11
 11021      10   4,335      43,350       308.7      18.9      00:48:11
 11158      10   4,335      43,350       312.5      19.1      00:48:10
 11276       5   4,335      21,675       315.7      19.3      00:48:16
 11393       6   4,335      26,010       319.1      19.5      00:48:19
 11487       4   4,335      17,340       321.9      19.7      00:48:29
 11606      10   4,335      43,350       325.1      19.9      00:48:34
 11715       4   4,335      17,340       328.2      20.1      00:48:40
 11834       5   4,335      21,675       331.7      20.3      00:48:41
 11964       5   4,335      21,675       335.2      20.5      00:48:41
 12106      10   4,335      43,350       339.4      20.8      00:48:34
 12262       3   4,335      13,005       343.8      21.0      00:48:24
 12434       8   4,335      34,680       348.5      21.3      00:48:12
 12647       7   4,335      30,345       354.7      21.7      00:47:44
 12851       8   4,335      34,680       360.2      22.0      00:47:24
 13040       9   4,335      39,015       365.5      22.3      00:47:05
 13276       5   4,335      21,675       372.2      22.8      00:46:35
 13519       4   4,335      17,340       379.6      23.2      00:45:57
 13642       7   4,335      30,345       383.2      23.4      00:45:56
 13754       5   4,335      21,675       386.3      23.6      00:45:59
 13883       4   4,335      17,340       390.0      23.8      00:45:57
 14011       5   4,335      21,675       393.5      24.1      00:45:57
 14139       7   4,335      30,345       397.2      24.3      00:45:54
 14262       7   4,335      30,345       400.8      24.5      00:45:52
 14403       3   4,335      13,005       405.0      24.8      00:45:46
 14547       6   4,335      26,010       409.2      25.0      00:45:38
 14710       7   4,335      30,345       413.8      25.3      00:45:27
 14854       6   4,335      26,010       418.0      25.6      00:45:20
 15060       8   4,335      34,680       424.1      25.9      00:44:56
 15277       9   4,335      39,015       430.5      26.3      00:44:30
 15497       6   4,335      26,010       436.9      26.7      00:44:04
 15720       6   4,335      26,010       443.1      27.1      00:43:40
 15931       5   4,335      21,675       449.6      27.5      00:43:15
 16179       8   4,335      34,680       457.1      27.9      00:42:42
 16402       7   4,335      30,345       463.7      28.4      00:42:17
 16572      10   4,335      43,350       468.6      28.7      00:42:05
 16717       9   4,335      39,015       472.8      28.9      00:41:58
 16875       6   4,335      26,010       477.3      29.2      00:41:49
 17001       8   4,335      34,680       481.1      29.4      00:41:45
 17143       7   4,335      30,345       485.0      29.7      00:41:40
 17272       9   4,335      39,015       488.9      29.9      00:41:36
 17405       9   4,335      39,015       492.9      30.1      00:41:31
 17537       8   4,335      34,680       497.1      30.4      00:41:24
 17670       3   4,335      13,005       500.9      30.6      00:41:19
 17868       9   4,335      39,015       506.4      31.0      00:41:02
 18076       9   4,335      39,015       512.5      31.3      00:40:42
 18337       8   4,335      34,680       520.2      31.8      00:40:11
 18520       8   4,335      34,680       525.1      32.1      00:39:59
 18633       8   4,335      34,680       528.6      32.3      00:39:57
 18778       6   4,335      26,010       533.0      32.6      00:39:49
 18912       8   4,335      34,680       536.9      32.8      00:39:43
 19021       8   4,335      34,680       540.3      33.0      00:39:41
 19124       9   4,335      39,015       543.3      33.2      00:39:42
 19209       6   4,335      26,010       545.9      33.4      00:39:45
 19327       4   4,335      17,340       549.3      33.6      00:39:42
 19478       4   4,335      17,340       553.9      33.9      00:39:32
 19655       9   4,335      39,015       559.3      34.2      00:39:17
 19841       8   4,335      34,680       565.0      34.5      00:39:00
 20010      10   4,335      43,350       570.2      34.9      00:38:46
 20206       6   4,335      26,010       576.0      35.2      00:38:29
 20392       8   4,335      34,680       581.4      35.5      00:38:14
 20517       6   4,335      26,010       585.0      35.8      00:38:10
 20605       8   4,335      34,680       587.7      35.9      00:38:11
 20706       4   4,335      17,340       590.7      36.1      00:38:11
 20798       5   4,335      21,675       593.4      36.3      00:38:13
 20914       5   4,335      21,675       596.9      36.5      00:38:09
 21046       7   4,335      30,345       600.6      36.7      00:38:04
 21194       7   4,335      30,345       604.5      37.0      00:37:58
 21320       7   4,335      30,345       607.6      37.1      00:37:56
 21444       5   4,335      21,675       611.2      37.4      00:37:52
 21561       8   4,335      34,680       614.5      37.6      00:37:49
 21694       1   4,335       4,335       618.0      37.8      00:37:45
 21806       6   4,335      26,010       621.0      38.0      00:37:43
 21931       4   4,335      17,340       624.5      38.2      00:37:39
 22057       9   4,335      39,015       628.0      38.4      00:37:35
 22195       5   4,335      21,675       631.6      38.6      00:37:30
 22320       5   4,335      21,675       634.9      38.8      00:37:27
 22464       3   4,335      13,005       638.8      39.1      00:37:20
 22618       6   4,335      26,010       643.2      39.3      00:37:11
 22802       3   4,335      13,005       647.8      39.6      00:36:60
 22972       5   4,335      21,675       652.6      39.9      00:36:48
 23145       3   4,335      13,005       657.7      40.2      00:36:34
 23339       9   4,335      39,015       663.3      40.6      00:36:18
 23549      10   4,335      43,350       668.8      40.9      00:36:02
 23735       6   4,335      26,010       674.1      41.2      00:35:48
 23933       7   4,335      30,345       679.7      41.6      00:35:32
 24148       5   4,335      21,675       685.6      41.9      00:35:14
 24365       3   4,335      13,005       691.4      42.3      00:34:58
 24533       4   4,335      17,340       696.4      42.6      00:34:45
 24717       3   4,335      13,005       701.8      42.9      00:34:30
 24908       8   4,335      34,680       707.0      43.2      00:34:17
 25078       9   4,335      39,015       712.1      43.5      00:34:04
 25258       9   4,335      39,015       717.2      43.8      00:33:51
 25463      10   4,335      43,350       723.1      44.2      00:33:34
 25626      10   4,335      43,350       727.6      44.5      00:33:25
 25738       7   4,335      30,345       731.0      44.7      00:33:20
 25858       9   4,335      39,015       734.6      44.9      00:33:15
 25988       6   4,335      26,010       738.2      45.1      00:33:09
 26121       8   4,335      34,680       742.1      45.4      00:33:02
 26270       9   4,335      39,015       746.5      45.6      00:32:53
 26439       4   4,335      17,340       751.1      45.9      00:32:42
 26562       8   4,335      34,680       754.5      46.1      00:32:38
 26671       6   4,335      26,010       757.4      46.3      00:32:35
 26763       7   4,335      30,345       760.2      46.5      00:32:34
 26911       7   4,335      30,345       764.3      46.7      00:32:25
 27060       6   4,335      26,010       768.5      47.0      00:32:17
 27170       7   4,335      30,345       771.8      47.2      00:32:13
 27307       6   4,335      26,010       775.7      47.4      00:32:06
 27444       6   4,335      26,010       779.6      47.7      00:31:58
 27604       7   4,335      30,345       784.2      47.9      00:31:48
 27741      10   4,335      43,350       788.2      48.2      00:31:40
 27894      10   4,335      43,350       792.8      48.5      00:31:29
 28067       7   4,335      30,345       797.8      48.8      00:31:17
 28229       5   4,335      21,675       802.5      49.1      00:31:06
 28377       5   4,335      21,675       807.0      49.3      00:30:56
 28538       9   4,335      39,015       812.0      49.6      00:30:43
 28682       8   4,335      34,680       816.2      49.9      00:30:35
 28780       9   4,335      39,015       819.1      50.1      00:30:32
 28885       6   4,335      26,010       822.2      50.3      00:30:28
 29000      10   4,335      43,350       825.6      50.5      00:30:22
 29101       3   4,335      13,005       828.6      50.7      00:30:19
 29243      10   4,335      43,350       832.5      50.9      00:30:11
 29382       8   4,335      34,680       836.8      51.2      00:30:02
 29585       7   4,335      30,345       842.5      51.5      00:29:46
 29731       6   4,335      26,010       846.8      51.8      00:29:37
 29846       7   4,335      30,345       850.2      52.0      00:29:32
 29948       9   4,335      39,015       853.1      52.2      00:29:28
 30062       9   4,335      39,015       856.5      52.4      00:29:23
 30187       8   4,335      34,680       860.2      52.6      00:29:16
 30373       7   4,335      30,345       865.6      52.9      00:29:02
 30550       8   4,335      34,680       871.0      53.2      00:28:48
 30752      10   4,335      43,350       877.0      53.6      00:28:31
 30956       9   4,335      39,015       883.0      54.0      00:28:15
 31176      10   4,335      43,350       889.4      54.4      00:27:57
 31391      10   4,335      43,350       895.8      54.8      00:27:39
 31603       4   4,335      17,340       902.2      55.2      00:27:21
 31788       9   4,335      39,015       907.8      55.5      00:27:06
 31978       7   4,335      30,345       913.7      55.9      00:26:50
 32174       8   4,335      34,680       919.6      56.2      00:26:35
 32379       9   4,335      39,015       926.0      56.6      00:26:17
 32522       9   4,335      39,015       930.3      56.9      00:26:08
 32645       7   4,335      30,345       933.9      57.1      00:26:02
 32737       4   4,335      17,340       936.7      57.3      00:25:58
 32851       6   4,335      26,010       940.0      57.5      00:25:53
 32952       7   4,335      30,345       943.2      57.7      00:25:48
 33034       7   4,335      30,345       945.7      57.8      00:25:46
 33127       4   4,335      17,340       948.5      58.0      00:25:42
 33257       9   4,335      39,015       952.3      58.2      00:25:35
 33406       7   4,335      30,345       956.7      58.5      00:25:25
 33567       9   4,335      39,015       961.7      58.8      00:25:13
 33711       9   4,335      39,015       966.0      59.1      00:25:03
 33822       8   4,335      34,680       969.4      59.3      00:24:58
 33928      10   4,335      43,350       972.6      59.5      00:24:52
 34056       9   4,335      39,015       976.5      59.7      00:24:44
 34205       5   4,335      21,675       981.1      60.0      00:24:34
 34416       8   4,335      34,680       987.4      60.4      00:24:17
 34625       8   4,335      34,680       993.7      60.8      00:24:00
 34820       9   4,335      39,015       999.7      61.1      00:23:44
 35040       2   4,335       8,670     1,006.2      61.5      00:23:27
 35284       8   4,335      34,680     1,013.7      62.0      00:23:06
 35528       6   4,335      26,010     1,021.0      62.4      00:22:46
 35772       7   4,335      30,345     1,028.2      62.9      00:22:27
 35954       7   4,335      30,345     1,033.6      63.2      00:22:13
 36165       7   4,335      30,345     1,040.0      63.6      00:21:57
 36375       9   4,335      39,015     1,046.3      64.0      00:21:41
 36549      10   4,335      43,350     1,051.4      64.3      00:21:29
 36685       8   4,335      34,680     1,055.3      64.5      00:21:21
 36820       7   4,335      30,345     1,059.1      64.8      00:21:13
 36965       5   4,335      21,675     1,063.4      65.0      00:21:05
 37109       4   4,335      17,340     1,067.5      65.3      00:20:56
 37237       6   4,335      26,010     1,070.8      65.5      00:20:50
 37364       4   4,335      17,340     1,074.3      65.7      00:20:43
 37483       6   4,335      26,010     1,077.6      65.9      00:20:37
 37600       8   4,335      34,680     1,081.0      66.1      00:20:31
 37696       7   4,335      30,345     1,083.6      66.2      00:20:28
 37839       8   4,335      34,680     1,087.7      66.5      00:20:19
 37998       6   4,335      26,010     1,092.3      66.8      00:20:09
 38149       6   4,335      26,010     1,096.9      67.1      00:19:58
 38286       8   4,335      34,680     1,100.9      67.3      00:19:50
 38384       8   4,335      34,680     1,103.9      67.5      00:19:45
 38569       8   4,335      34,680     1,109.5      67.8      00:19:32
 38781       8   4,335      34,680     1,115.6      68.2      00:19:16
 38972      10   4,335      43,350     1,121.2      68.5      00:19:03
 39102       8   4,335      34,680     1,125.0      68.8      00:18:55
 39228       4   4,335      17,340     1,128.4      69.0      00:18:49
 39368       8   4,335      34,680     1,132.5      69.2      00:18:40
 39525       7   4,335      30,345     1,136.9      69.5      00:18:30
 39711       2   4,335       8,670     1,142.1      69.8      00:18:18
 39888      10   4,335      43,350     1,147.3      70.1      00:18:06
 40121       5   4,335      21,675     1,154.0      70.5      00:17:49
 40351       7   4,335      30,345     1,160.5      71.0      00:17:32
 40540       5   4,335      21,675     1,166.2      71.3      00:17:19
 40737       8   4,335      34,680     1,172.0      71.7      00:17:05
 40926      10   4,335      43,350     1,177.8      72.0      00:16:51
 41040       2   4,335       8,670     1,181.1      72.2      00:16:45
 41188       7   4,335      30,345     1,185.4      72.5      00:16:35
 41328       3   4,335      13,005     1,189.5      72.7      00:16:27
 41464       7   4,335      30,345     1,193.5      73.0      00:16:18
 41614       6   4,335      26,010     1,197.9      73.2      00:16:09
 41751      10   4,335      43,350     1,201.9      73.5      00:16:00
 41876      10   4,335      43,350     1,205.7      73.7      00:15:53
 42005       8   4,335      34,680     1,209.3      73.9      00:15:45
 42146       2   4,335       8,670     1,213.1      74.2      00:15:37
 42284       6   4,335      26,010     1,216.8      74.4      00:15:30
 42413       6   4,335      26,010     1,220.8      74.6      00:15:21
 42549       8   4,335      34,680     1,224.6      74.9      00:15:13
 42686       7   4,335      30,345     1,228.5      75.1      00:15:05
 42808       9   4,335      39,015     1,232.0      75.3      00:14:58
 42926       7   4,335      30,345     1,235.4      75.5      00:14:51
 43063       6   4,335      26,010     1,239.6      75.8      00:14:42
 43195       8   4,335      34,680     1,243.7      76.0      00:14:33
 43348       7   4,335      30,345     1,248.3      76.3      00:14:23
 43474       8   4,335      34,680     1,251.9      76.5      00:14:16
 43698      10   4,335      43,350     1,258.1      76.9      00:14:01
 43921       8   4,335      34,680     1,264.7      77.3      00:13:45
 44132       7   4,335      30,345     1,270.6      77.7      00:13:31
 44293       5   4,335      21,675     1,275.2      78.0      00:13:20
 44457       7   4,335      30,345     1,279.9      78.2      00:13:10
 44583       8   4,335      34,680     1,283.5      78.5      00:13:02
 44742       9   4,335      39,015     1,288.0      78.7      00:12:52
 44870       6   4,335      26,010     1,291.9      79.0      00:12:44
 45004       7   4,335      30,345     1,295.7      79.2      00:12:36
 45198       9   4,335      39,015     1,301.1      79.5      00:12:24
 45360       8   4,335      34,680     1,305.3      79.8      00:12:15
 45479       8   4,335      34,680     1,308.7      80.0      00:12:08
 45609      10   4,335      43,350     1,312.2      80.2      00:12:00
 45768      10   4,335      43,350     1,316.5      80.5      00:11:51
 45939      10   4,335      43,350     1,321.4      80.8      00:11:40
 46082       9   4,335      39,015     1,325.5      81.0      00:11:31
 46213       6   4,335      26,010     1,329.6      81.3      00:11:22
 46342       7   4,335      30,345     1,333.4      81.5      00:11:14
 46498       7   4,335      30,345     1,337.8      81.8      00:11:04
 46685       6   4,335      26,010     1,343.3      82.1      00:10:51
 46897       4   4,335      17,340     1,349.6      82.5      00:10:36
 47065       6   4,335      26,010     1,353.9      82.8      00:10:27
 47223       9   4,335      39,015     1,358.2      83.0      00:10:18
 47355      10   4,335      43,350     1,361.9      83.3      00:10:10
 47480       3   4,335      13,005     1,365.2      83.5      00:10:03
 47607       8   4,335      34,680     1,368.8      83.7      00:09:55
 47724       6   4,335      26,010     1,372.3      83.9      00:09:48
 47856       7   4,335      30,345     1,375.9      84.1      00:09:40
 47980       8   4,335      34,680     1,379.7      84.3      00:09:32
 48147       6   4,335      26,010     1,384.3      84.6      00:09:22
 48310       9   4,335      39,015     1,389.2      84.9      00:09:11
 48467       5   4,335      21,675     1,393.7      85.2      00:09:00
 48641       6   4,335      26,010     1,398.7      85.5      00:08:49
 48805       7   4,335      30,345     1,403.4      85.8      00:08:39
 48931      10   4,335      43,350     1,407.0      86.0      00:08:31
 49085       8   4,335      34,680     1,411.4      86.3      00:08:21
 49198       9   4,335      39,015     1,415.0      86.5      00:08:13
 49336       6   4,335      26,010     1,418.7      86.7      00:08:05
 49451       4   4,335      17,340     1,421.8      86.9      00:07:59
 49572       3   4,335      13,005     1,425.0      87.1      00:07:52
 49703       5   4,335      21,675     1,428.5      87.3      00:07:45
 49849       8   4,335      34,680     1,432.5      87.6      00:07:36
 49964       8   4,335      34,680     1,435.9      87.8      00:07:28
 50095       7   4,335      30,345     1,439.6      88.0      00:07:20
 50231       7   4,335      30,345     1,443.3      88.2      00:07:12
 50353       4   4,335      17,340     1,446.5      88.4      00:07:06
 50486       7   4,335      30,345     1,450.4      88.7      00:06:57
 50624       7   4,335      30,345     1,454.3      88.9      00:06:48
 50750       9   4,335      39,015     1,458.2      89.1      00:06:40
 50890       8   4,335      34,680     1,462.3      89.4      00:06:30
 51014       7   4,335      30,345     1,466.2      89.6      00:06:22
 51185       7   4,335      30,345     1,471.0      89.9      00:06:11
 51375      10   4,335      43,350     1,476.6      90.3      00:05:58
 51582       7   4,335      30,345     1,482.7      90.6      00:05:44
 51805       6   4,335      26,010     1,489.5      91.1      00:05:28
 52034      10   4,335      43,350     1,496.4      91.5      00:05:12
 52260       8   4,335      34,680     1,503.4      91.9      00:04:56
 52460       8   4,335      34,680     1,509.7      92.3      00:04:42
 52680       6   4,335      26,010     1,516.8      92.7      00:04:25
 52892       8   4,335      34,680     1,523.3      93.1      00:04:10
 53113       6   4,335      26,010     1,530.0      93.5      00:03:55
 53361      10   4,335      43,350     1,537.4      94.0      00:03:38
 53595      10   4,335      43,350     1,544.5      94.4      00:03:22
 53737       8   4,335      34,680     1,548.7      94.7      00:03:13
 53872      10   4,335      43,350     1,552.5      94.9      00:03:05
 54003       8   4,335      34,680     1,556.3      95.1      00:02:56
 54125       5   4,335      21,675     1,559.9      95.4      00:02:48
 54255       8   4,335      34,680     1,563.6      95.6      00:02:40
 54378       2   4,335       8,670     1,567.0      95.8      00:02:33
 54531      10   4,335      43,350     1,571.0      96.0      00:02:24
 54676       8   4,335      34,680     1,575.3      96.3      00:02:14
 54864       6   4,335      26,010     1,580.5      96.6      00:02:03
 55006       7   4,335      30,345     1,584.5      96.9      00:01:54
 55179      10   4,335      43,350     1,589.4      97.2      00:01:43
 55340       6   4,335      26,010     1,593.8      97.4      00:01:33
 55465       9   4,335      39,015     1,597.3      97.7      00:01:25
 55568       8   4,335      34,680     1,600.0      97.8      00:01:20
 55701       8   4,335      34,680     1,604.0      98.1      00:01:11
 55855      10   4,335      43,350     1,608.5      98.3      00:01:01
 56016       7   4,335      30,345     1,613.2      98.6      00:00:50
 56151       7   4,335      30,345     1,617.2      98.9      00:00:41
 56279       6   4,335      26,010     1,621.1      99.1      00:00:33
 56448       8   4,335      34,680     1,626.3      99.4      00:00:21
 56721       9   4,335      39,015     1,634.4      99.9      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 3646.711
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
