
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A900.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A900.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A900.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A900.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   308       7   4,935      34,545         8.8       0.5      00:35:18
   670      10   4,935      49,350        19.4       1.0      00:31:45
  1036       5   4,935      24,675        30.6       1.6      00:29:58
  1379       5   4,935      24,675        41.7       2.2      00:29:08
  1742      10   4,935      49,350        53.5       2.9      00:28:13
  2096       8   4,935      39,480        64.5       3.5      00:27:55
  2449       3   4,935      14,805        75.6       4.1      00:27:37
  2801      10   4,935      49,350        87.0       4.7      00:27:16
  3161       5   4,935      24,675        98.4       5.3      00:26:55
  3518       8   4,935      39,480       110.3       5.9      00:26:31
  3878       9   4,935      44,415       121.9       6.5      00:26:13
  4166       8   4,935      39,480       130.7       7.0      00:26:33
  4454       6   4,935      29,610       139.4       7.5      00:26:50
  4708       7   4,935      34,545       147.8       7.9      00:27:06
  4976       8   4,935      39,480       156.4       8.4      00:27:19
  5244       4   4,935      19,740       164.8       8.9      00:27:31
  5522       8   4,935      39,480       173.4       9.3      00:27:38
  5813       4   4,935      19,740       182.3       9.8      00:27:42
  6090       4   4,935      19,740       191.3      10.3      00:27:42
  6366      10   4,935      49,350       199.8      10.7      00:27:47
  6627       8   4,935      39,480       207.9      11.2      00:27:54
  6899      10   4,935      49,350       216.5      11.6      00:27:55
  7211       8   4,935      39,480       226.0      12.1      00:27:48
  7523       9   4,935      44,415       236.2      12.7      00:27:35
  7821       3   4,935      14,805       245.9      13.2      00:27:26
  8110       9   4,935      44,415       255.8      13.7      00:27:15
  8357       9   4,935      44,415       264.2      14.2      00:27:16
  8561       9   4,935      44,415       271.2      14.6      00:27:25
  8743       3   4,935      14,805       277.1      14.9      00:27:42
  8893       6   4,935      29,610       282.2      15.2      00:28:02
  9043       8   4,935      39,480       287.2      15.4      00:28:23
  9185      10   4,935      49,350       292.1      15.7      00:28:43
  9276       9   4,935      44,415       295.2      15.9      00:29:14
  9401       5   4,935      24,675       299.3      16.1      00:29:39
  9513       5   4,935      24,675       303.2      16.3      00:30:03
  9648       8   4,935      39,480       308.0      16.5      00:30:21
  9811       6   4,935      29,610       313.4      16.8      00:30:32
  9973       3   4,935      14,805       318.5      17.1      00:30:45
 10118       4   4,935      19,740       322.8      17.3      00:31:03
 10279       2   4,935       9,870       327.7      17.6      00:31:17
 10406       9   4,935      44,415       331.8      17.8      00:31:35
 10519       8   4,935      39,480       335.5      18.0      00:31:55
 10659       7   4,935      34,545       339.8      18.2      00:32:11
 10826       7   4,935      34,545       345.0      18.5      00:32:19
 10972       9   4,935      44,415       349.9      18.8      00:32:29
 11135       7   4,935      34,545       354.9      19.1      00:32:38
 11263       5   4,935      24,675       359.1      19.3      00:32:52
 11371       7   4,935      34,545       362.6      19.5      00:33:10
 11470       5   4,935      24,675       365.8      19.6      00:33:29
 11571       8   4,935      39,480       368.9      19.8      00:33:48
 11668       5   4,935      24,675       372.1      20.0      00:34:07
 11767       5   4,935      24,675       375.3      20.2      00:34:26
 11889       7   4,935      34,545       379.3      20.4      00:34:37
 11997      10   4,935      49,350       382.7      20.6      00:34:53
 12102       8   4,935      39,480       386.3      20.7      00:35:08
 12198       8   4,935      39,480       389.4      20.9      00:35:24
 12344       6   4,935      29,610       394.0      21.2      00:35:30
 12547       3   4,935      14,805       400.6      21.5      00:35:22
 12733      10   4,935      49,350       406.4      21.8      00:35:19
 12940       3   4,935      14,805       412.7      22.2      00:35:13
 13148      10   4,935      49,350       419.6      22.5      00:35:03
 13365       4   4,935      19,740       426.6      22.9      00:34:52
 13541       9   4,935      44,415       432.8      23.2      00:34:47
 13646       2   4,935       9,870       436.4      23.4      00:34:57
 13780       4   4,935      19,740       440.6      23.7      00:35:03
 13900       3   4,935      14,805       444.4      23.9      00:35:12
 14040      10   4,935      49,350       448.9      24.1      00:35:16
 14177       6   4,935      29,610       453.4      24.4      00:35:19
 14317       9   4,935      44,415       458.2      24.6      00:35:20
 14439       8   4,935      39,480       462.3      24.8      00:35:26
 14583       5   4,935      24,675       467.0      25.1      00:35:28
 14732       6   4,935      29,610       471.8      25.3      00:35:28
 14847       4   4,935      19,740       475.6      25.5      00:35:35
 15045       8   4,935      39,480       482.3      25.9      00:35:24
 15276       5   4,935      24,675       490.0      26.3      00:35:07
 15510       5   4,935      24,675       497.7      26.7      00:34:50
 15706       8   4,935      39,480       504.0      27.1      00:34:41
 15908       7   4,935      34,545       511.0      27.4      00:34:29
 16104       6   4,935      29,610       517.8      27.8      00:34:18
 16310       6   4,935      29,610       524.7      28.2      00:34:06
 16495       2   4,935       9,870       531.1      28.5      00:33:57
 16664       3   4,935      14,805       536.5      28.8      00:33:53
 16824       8   4,935      39,480       541.8      29.1      00:33:49
 16954       9   4,935      44,415       546.2      29.3      00:33:51
 17069       3   4,935      14,805       549.8      29.5      00:33:55
 17204       9   4,935      44,415       554.3      29.8      00:33:56
 17318      10   4,935      49,350       558.2      30.0      00:33:59
 17430      10   4,935      49,350       562.0      30.2      00:34:03
 17542       8   4,935      39,480       566.0      30.4      00:34:05
 17667       8   4,935      39,480       570.2      30.6      00:34:06
 17828       9   4,935      44,415       575.2      30.9      00:34:03
 17966      10   4,935      49,350       579.7      31.1      00:34:02
 18161      10   4,935      49,350       586.4      31.5      00:33:50
 18314       5   4,935      24,675       591.4      31.8      00:33:46
 18490      10   4,935      49,350       596.8      32.1      00:33:41
 18610      10   4,935      49,350       600.9      32.3      00:33:41
 18718       5   4,935      24,675       604.7      32.5      00:33:44
 18845       6   4,935      29,610       608.9      32.7      00:33:44
 18953       9   4,935      44,415       612.7      32.9      00:33:45
 19084       6   4,935      29,610       617.1      33.1      00:33:44
 19197      10   4,935      49,350       621.0      33.4      00:33:45
 19378       6   4,935      29,610       627.1      33.7      00:33:35
 19571       5   4,935      24,675       633.8      34.0      00:33:23
 19744       8   4,935      39,480       639.9      34.4      00:33:13
 19940       9   4,935      44,415       646.6      34.7      00:33:00
 20139       5   4,935      24,675       653.5      35.1      00:32:47
 20336       6   4,935      29,610       659.9      35.4      00:32:36
 20499       7   4,935      34,545       665.4      35.7      00:32:29
 20608      10   4,935      49,350       669.2      35.9      00:32:29
 20728       7   4,935      34,545       673.1      36.1      00:32:30
 20849       6   4,935      29,610       677.2      36.4      00:32:28
 20964       4   4,935      19,740       681.1      36.6      00:32:29
 21113      10   4,935      49,350       685.8      36.8      00:32:25
 21255       5   4,935      24,675       690.0      37.1      00:32:23
 21409      10   4,935      49,350       694.6      37.3      00:32:19
 21570       7   4,935      34,545       699.8      37.6      00:32:13
 21703       9   4,935      44,415       703.8      37.8      00:32:12
 21844       9   4,935      44,415       708.2      38.0      00:32:09
 21981       5   4,935      24,675       712.5      38.3      00:32:07
 22122       5   4,935      24,675       716.6      38.5      00:32:05
 22260      10   4,935      49,350       721.0      38.7      00:32:02
 22413       8   4,935      39,480       725.7      39.0      00:31:57
 22527       9   4,935      44,415       729.3      39.2      00:31:57
 22660       7   4,935      34,545       733.6      39.4      00:31:54
 22803       8   4,935      39,480       737.5      39.6      00:31:53
 22983       5   4,935      24,675       743.3      39.9      00:31:43
 23182       5   4,935      24,675       749.9      40.3      00:31:30
 23354      10   4,935      49,350       755.6      40.6      00:31:21
 23539       9   4,935      44,415       761.0      40.9      00:31:13
 23732       8   4,935      39,480       767.3      41.2      00:31:01
 23910       7   4,935      34,545       773.2      41.5      00:30:51
 24113       4   4,935      19,740       779.5      41.9      00:30:40
 24315       7   4,935      34,545       785.6      42.2      00:30:29
 24495       8   4,935      39,480       791.5      42.5      00:30:19
 24690       7   4,935      34,545       798.1      42.9      00:30:06
 24856       3   4,935      14,805       803.3      43.1      00:29:59
 25039       7   4,935      34,545       809.2      43.5      00:29:48
 25221       8   4,935      39,480       815.3      43.8      00:29:38
 25414       9   4,935      44,415       821.6      44.1      00:29:26
 25595       5   4,935      24,675       827.3      44.4      00:29:17
 25730       5   4,935      24,675       831.9      44.7      00:29:12
 25862       3   4,935      14,805       836.3      44.9      00:29:08
 26003       4   4,935      19,740       840.9      45.2      00:29:02
 26117       6   4,935      29,610       844.7      45.4      00:29:00
 26262       5   4,935      24,675       849.5      45.6      00:28:54
 26398       9   4,935      44,415       853.7      45.8      00:28:50
 26534       4   4,935      19,740       858.0      46.1      00:28:46
 26659       6   4,935      29,610       861.9      46.3      00:28:43
 26819       6   4,935      29,610       867.1      46.6      00:28:36
 26985       3   4,935      14,805       872.7      46.9      00:28:26
 27121       6   4,935      29,610       877.0      47.1      00:28:22
 27233       6   4,935      29,610       880.6      47.3      00:28:20
 27337       5   4,935      24,675       884.0      47.5      00:28:19
 27441       9   4,935      44,415       887.4      47.7      00:28:17
 27557      10   4,935      49,350       891.3      47.9      00:28:14
 27680      10   4,935      49,350       895.3      48.1      00:28:10
 27790      10   4,935      49,350       899.0      48.3      00:28:08
 27903       8   4,935      39,480       902.9      48.5      00:28:05
 28069      10   4,935      49,350       908.3      48.8      00:27:56
 28266       9   4,935      44,415       914.9      49.1      00:27:42
 28469      10   4,935      49,350       921.9      49.5      00:27:28
 28631       6   4,935      29,610       927.4      49.8      00:27:18
 28739       7   4,935      34,545       931.1      50.0      00:27:16
 28871       5   4,935      24,675       935.6      50.2      00:27:10
 28971       8   4,935      39,480       938.9      50.4      00:27:08
 29089       8   4,935      39,480       942.9      50.6      00:27:04
 29236       6   4,935      29,610       947.5      50.9      00:26:58
 29372       5   4,935      24,675       952.2      51.1      00:26:51
 29493       6   4,935      29,610       956.2      51.4      00:26:47
 29643       6   4,935      29,610       960.9      51.6      00:26:40
 29753       6   4,935      29,610       964.7      51.8      00:26:36
 29867       6   4,935      29,610       968.5      52.0      00:26:33
 30000       8   4,935      39,480       973.0      52.3      00:26:26
 30118       7   4,935      34,545       976.9      52.5      00:26:22
 30255      10   4,935      49,350       981.5      52.7      00:26:16
 30398       5   4,935      24,675       986.3      53.0      00:26:09
 30519       5   4,935      24,675       990.5      53.2      00:26:03
 30675      10   4,935      49,350       995.7      53.5      00:25:55
 30849       8   4,935      39,480     1,001.7      53.8      00:25:43
 31044       4   4,935      19,740     1,007.9      54.1      00:25:31
 31193       6   4,935      29,610     1,013.1      54.4      00:25:22
 31382       6   4,935      29,610     1,019.4      54.7      00:25:10
 31589       7   4,935      34,545     1,026.6      55.1      00:24:55
 31788       9   4,935      44,415     1,033.4      55.5      00:24:41
 31958       8   4,935      39,480     1,039.5      55.8      00:24:29
 32142      10   4,935      49,350     1,045.8      56.2      00:24:17
 32317       8   4,935      39,480     1,052.0      56.5      00:24:05
 32487       4   4,935      19,740     1,057.9      56.8      00:23:54
 32598       8   4,935      39,480     1,061.6      57.0      00:23:50
 32722       6   4,935      29,610     1,065.8      57.2      00:23:45
 32840      10   4,935      49,350     1,069.8      57.5      00:23:40
 32952       7   4,935      34,545     1,073.7      57.7      00:23:35
 33066       9   4,935      44,415     1,077.6      57.9      00:23:30
 33222      10   4,935      49,350     1,082.9      58.2      00:23:21
 33357       8   4,935      39,480     1,087.5      58.4      00:23:14
 33477       7   4,935      34,545     1,091.5      58.6      00:23:09
 33627       6   4,935      29,610     1,096.9      58.9      00:22:59
 33761      10   4,935      49,350     1,101.4      59.2      00:22:52
 33924       7   4,935      34,545     1,107.0      59.5      00:22:42
 34038       8   4,935      39,480     1,111.0      59.7      00:22:37
 34168       5   4,935      24,675     1,115.6      59.9      00:22:30
 34366       9   4,935      44,415     1,122.5      60.3      00:22:16
 34576      10   4,935      49,350     1,129.6      60.7      00:22:01
 34793       8   4,935      39,480     1,137.2      61.1      00:21:45
 34991       7   4,935      34,545     1,143.9      61.4      00:21:32
 35179       6   4,935      29,610     1,150.4      61.8      00:21:19
 35366       8   4,935      39,480     1,156.8      62.1      00:21:07
 35551       6   4,935      29,610     1,163.0      62.5      00:20:55
 35759       9   4,935      44,415     1,170.1      62.8      00:20:41
 35967       5   4,935      24,675     1,177.1      63.2      00:20:26
 36185       7   4,935      34,545     1,184.6      63.6      00:20:11
 36366       5   4,935      24,675     1,190.9      64.0      00:19:59
 36541       9   4,935      44,415     1,196.6      64.3      00:19:49
 36669       3   4,935      14,805     1,200.9      64.5      00:19:42
 36806       7   4,935      34,545     1,205.3      64.7      00:19:36
 36945       6   4,935      29,610     1,210.0      65.0      00:19:28
 37098       7   4,935      34,545     1,214.9      65.2      00:19:20
 37197       6   4,935      29,610     1,217.7      65.4      00:19:18
 37282       6   4,935      29,610     1,220.4      65.5      00:19:16
 37381      10   4,935      49,350     1,223.6      65.7      00:19:12
 37490       4   4,935      19,740     1,227.0      65.9      00:19:08
 37604       6   4,935      29,610     1,230.8      66.1      00:19:03
 37748       8   4,935      39,480     1,235.3      66.3      00:18:56
 37921       8   4,935      39,480     1,241.0      66.6      00:18:45
 38132       9   4,935      44,415     1,248.1      67.0      00:18:31
 38334       5   4,935      24,675     1,254.9      67.4      00:18:17
 38548       8   4,935      39,480     1,262.3      67.8      00:18:03
 38750      10   4,935      49,350     1,269.0      68.1      00:17:50
 38950       9   4,935      44,415     1,275.6      68.5      00:17:37
 39075       6   4,935      29,610     1,279.8      68.7      00:17:30
 39200       7   4,935      34,545     1,283.7      68.9      00:17:25
 39374       7   4,935      34,545     1,289.4      69.2      00:17:14
 39581       4   4,935      19,740     1,296.2      69.6      00:17:01
 39776      10   4,935      49,350     1,302.3      69.9      00:16:49
 39953       7   4,935      34,545     1,308.3      70.3      00:16:38
 40148       7   4,935      34,545     1,314.6      70.6      00:16:27
 40366      10   4,935      49,350     1,321.7      71.0      00:16:12
 40570       9   4,935      44,415     1,328.7      71.4      00:15:59
 40780       7   4,935      34,545     1,335.8      71.7      00:15:45
 40954       7   4,935      34,545     1,341.7      72.1      00:15:34
 41066       2   4,935       9,870     1,345.4      72.3      00:15:29
 41163       6   4,935      29,610     1,348.6      72.4      00:15:25
 41273       7   4,935      34,545     1,352.3      72.6      00:15:19
 41388      10   4,935      49,350     1,356.0      72.8      00:15:14
 41505       6   4,935      29,610     1,360.0      73.0      00:15:08
 41639       8   4,935      39,480     1,364.5      73.3      00:15:00
 41776       8   4,935      39,480     1,369.1      73.5      00:14:53
 41908       5   4,935      24,675     1,373.7      73.8      00:14:45
 42047       2   4,935       9,870     1,377.9      74.0      00:14:38
 42197       5   4,935      24,675     1,382.6      74.2      00:14:30
 42370       6   4,935      29,610     1,388.2      74.6      00:14:20
 42549       8   4,935      39,480     1,394.1      74.9      00:14:09
 42727       9   4,935      44,415     1,399.8      75.2      00:13:59
 42873       7   4,935      34,545     1,404.7      75.4      00:13:50
 42990       9   4,935      44,415     1,408.6      75.6      00:13:44
 43105       8   4,935      39,480     1,412.7      75.9      00:13:37
 43255       9   4,935      44,415     1,417.9      76.1      00:13:28
 43435       8   4,935      39,480     1,424.0      76.5      00:13:17
 43676      10   4,935      49,350     1,431.5      76.9      00:13:02
 43854       6   4,935      29,610     1,437.5      77.2      00:12:51
 44031      10   4,935      49,350     1,443.2      77.5      00:12:40
 44152       6   4,935      29,610     1,447.2      77.7      00:12:34
 44241       7   4,935      34,545     1,450.1      77.9      00:12:30
 44350       6   4,935      29,610     1,453.5      78.1      00:12:25
 44506       7   4,935      34,545     1,458.6      78.3      00:12:16
 44681       3   4,935      14,805     1,464.4      78.6      00:12:05
 44860       9   4,935      44,415     1,470.3      79.0      00:11:54
 45034       8   4,935      39,480     1,476.0      79.3      00:11:44
 45227       9   4,935      44,415     1,482.1      79.6      00:11:32
 45365      10   4,935      49,350     1,486.1      79.8      00:11:26
 45513      10   4,935      49,350     1,490.8      80.1      00:11:17
 45670       7   4,935      34,545     1,495.6      80.3      00:11:09
 45807       6   4,935      29,610     1,500.0      80.6      00:11:01
 45939      10   4,935      49,350     1,504.3      80.8      00:10:54
 46075       4   4,935      19,740     1,508.8      81.0      00:10:46
 46195       7   4,935      34,545     1,513.0      81.3      00:10:39
 46330      10   4,935      49,350     1,517.5      81.5      00:10:31
 46447       6   4,935      29,610     1,521.2      81.7      00:10:25
 46584       7   4,935      34,545     1,525.9      81.9      00:10:17
 46742       4   4,935      19,740     1,531.2      82.2      00:10:07
 46901       7   4,935      34,545     1,536.5      82.5      00:09:58
 47052       8   4,935      39,480     1,540.9      82.8      00:09:50
 47197       7   4,935      34,545     1,545.3      83.0      00:09:42
 47294       9   4,935      44,415     1,548.4      83.2      00:09:38
 47384       9   4,935      44,415     1,551.3      83.3      00:09:33
 47511       4   4,935      19,740     1,555.1      83.5      00:09:27
 47612      10   4,935      49,350     1,558.4      83.7      00:09:21
 47746       7   4,935      34,545     1,562.9      83.9      00:09:13
 47932       9   4,935      44,415     1,569.0      84.3      00:09:02
 48139      10   4,935      49,350     1,575.7      84.6      00:08:49
 48338       8   4,935      39,480     1,582.4      85.0      00:08:36
 48508       7   4,935      34,545     1,588.0      85.3      00:08:26
 48738       6   4,935      29,610     1,595.5      85.7      00:08:11
 48890       8   4,935      39,480     1,600.4      85.9      00:08:02
 49015       7   4,935      34,545     1,604.4      86.2      00:07:55
 49131       5   4,935      24,675     1,608.5      86.4      00:07:48
 49280       7   4,935      34,545     1,613.3      86.6      00:07:40
 49483       5   4,935      24,675     1,619.6      87.0      00:07:28
 49678       4   4,935      19,740     1,625.5      87.3      00:07:17
 49799       6   4,935      29,610     1,629.2      87.5      00:07:10
 49894       4   4,935      19,740     1,632.3      87.7      00:07:05
 49995       9   4,935      44,415     1,635.6      87.8      00:06:60
 50149       7   4,935      34,545     1,640.6      88.1      00:06:51
 50316       4   4,935      19,740     1,645.6      88.4      00:06:41
 50507       8   4,935      39,480     1,651.9      88.7      00:06:30
 50673       9   4,935      44,415     1,657.2      89.0      00:06:20
 50859       4   4,935      19,740     1,663.6      89.3      00:06:08
 51010       5   4,935      24,675     1,669.0      89.6      00:05:58
 51154       8   4,935      39,480     1,673.5      89.9      00:05:49
 51268       6   4,935      29,610     1,677.3      90.1      00:05:43
 51440       8   4,935      39,480     1,683.1      90.4      00:05:32
 51641       8   4,935      39,480     1,690.1      90.8      00:05:19
 51830      10   4,935      49,350     1,696.5      91.1      00:05:07
 52025       9   4,935      44,415     1,703.1      91.5      00:04:54
 52206       6   4,935      29,610     1,709.7      91.8      00:04:42
 52438       7   4,935      34,545     1,717.8      92.3      00:04:26
 52679       9   4,935      44,415     1,726.7      92.7      00:04:09
 52960       6   4,935      29,610     1,736.5      93.3      00:03:51
 53247       7   4,935      34,545     1,746.4      93.8      00:03:32
 53475       9   4,935      44,415     1,754.1      94.2      00:03:18
 53675       7   4,935      34,545     1,760.9      94.6      00:03:05
 53767       9   4,935      44,415     1,764.0      94.7      00:02:60
 53921       9   4,935      44,415     1,769.0      95.0      00:02:51
 54075      10   4,935      49,350     1,774.0      95.3      00:02:41
 54239       7   4,935      34,545     1,779.5      95.6      00:02:31
 54395       8   4,935      39,480     1,784.5      95.8      00:02:22
 54565       4   4,935      19,740     1,789.5      96.1      00:02:13
 54736       8   4,935      39,480     1,795.2      96.4      00:02:03
 54918       7   4,935      34,545     1,801.0      96.7      00:01:52
 55089      10   4,935      49,350     1,806.6      97.0      00:01:42
 55259       4   4,935      19,740     1,812.0      97.3      00:01:32
 55390       6   4,935      29,610     1,815.9      97.5      00:01:25
 55536       3   4,935      14,805     1,820.4      97.8      00:01:17
 55666       6   4,935      29,610     1,824.8      98.0      00:01:08
 55836       8   4,935      39,480     1,830.5      98.3      00:00:58
 55999       7   4,935      34,545     1,836.0      98.6      00:00:48
 56160       7   4,935      34,545     1,841.4      98.9      00:00:38
 56383       7   4,935      34,545     1,849.1      99.3      00:00:24
 56657       7   4,935      34,545     1,858.4      99.8      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 3413.647
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A900.csv saved

. 
. cap log close

. 
end of do-file
