
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A300.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A300.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   284       5   4,335      21,675         7.1       0.4      00:38:31
   554       9   4,335      39,015        14.0       0.9      00:38:46
   849       4   4,335      17,340        21.8       1.3      00:37:01
  1114       4   4,335      17,340        29.0       1.8      00:36:55
  1398       9   4,335      39,015        37.2       2.3      00:35:50
  1677       8   4,335      34,680        45.3       2.8      00:35:10
  1996       3   4,335      13,005        53.8       3.3      00:34:20
  2281       9   4,335      39,015        61.9       3.8      00:33:59
  2585      10   4,335      43,350        70.1       4.3      00:33:32
  2852      10   4,335      43,350        77.8       4.8      00:33:25
  3131       6   4,335      26,010        85.6       5.2      00:33:16
  3386       8   4,335      34,680        93.1       5.7      00:33:13
  3650       7   4,335      30,345       100.6       6.2      00:33:07
  3885       7   4,335      30,345       107.2       6.6      00:33:19
  4081       9   4,335      39,015       112.4       6.9      00:33:56
  4231       7   4,335      30,345       116.5       7.1      00:34:52
  4454       6   4,335      26,010       122.4       7.5      00:35:06
  4647      10   4,335      43,350       128.1       7.8      00:35:23
  4802       8   4,335      34,680       132.4       8.1      00:36:02
  4966       8   4,335      34,680       137.1       8.4      00:36:32
  5165      10   4,335      43,350       142.6       8.7      00:36:45
  5336       8   4,335      34,680       147.4       9.0      00:37:08
  5507      10   4,335      43,350       151.9       9.3      00:37:33
  5676       6   4,335      26,010       156.4       9.6      00:37:57
  5879       5   4,335      21,675       161.9       9.9      00:38:02
  6019       6   4,335      26,010       166.1      10.2      00:38:28
  6159       3   4,335      13,005       169.9      10.4      00:38:57
  6281       3   4,335      13,005       173.3      10.6      00:39:31
  6429       7   4,335      30,345       177.2      10.8      00:39:54
  6572       8   4,335      34,680       181.2      11.1      00:40:16
  6732      10   4,335      43,350       185.5      11.3      00:40:32
  6914       8   4,335      34,680       190.7      11.7      00:40:33
  7165       9   4,335      39,015       197.3      12.1      00:40:13
  7428      10   4,335      43,350       204.8      12.5      00:39:43
  7679       7   4,335      30,345       211.8      13.0      00:39:20
  7904       8   4,335      34,680       218.6      13.4      00:39:02
  8087       8   4,335      34,680       224.1      13.7      00:38:59
  8327       4   4,335      17,340       231.2      14.1      00:38:36
  8523       7   4,335      30,345       237.1      14.5      00:38:29
  8720       4   4,335      17,340       242.7      14.8      00:38:23
  8945       6   4,335      26,010       249.5      15.3      00:38:05
  9168       7   4,335      30,345       256.1      15.7      00:37:49
  9292       8   4,335      34,680       259.8      15.9      00:38:04
  9429       9   4,335      39,015       263.8      16.1      00:38:15
  9582       7   4,335      30,345       268.4      16.4      00:38:19
  9746       5   4,335      21,675       273.4      16.7      00:38:19
  9905       4   4,335      17,340       278.0      17.0      00:38:23
 10096       1   4,335       4,335       283.1      17.3      00:38:21
 10325      10   4,335      43,350       289.1      17.7      00:38:09
 10529       5   4,335      21,675       294.9      18.0      00:38:01
 10745       9   4,335      39,015       300.8      18.4      00:37:50
 10972       9   4,335      39,015       307.4      18.8      00:37:34
 11143       9   4,335      39,015       312.0      19.1      00:37:35
 11306       8   4,335      34,680       316.6      19.4      00:37:37
 11462       9   4,335      39,015       321.1      19.6      00:37:39
 11651       9   4,335      39,015       326.4      20.0      00:37:33
 11859       7   4,335      30,345       332.3      20.3      00:37:22
 12038       6   4,335      26,010       337.4      20.6      00:37:18
 12177       6   4,335      26,010       341.5      20.9      00:37:23
 12349       2   4,335       8,670       346.2      21.2      00:37:22
 12642       5   4,335      21,675       354.5      21.7      00:36:51
 12955       6   4,335      26,010       363.0      22.2      00:36:21
 13236      10   4,335      43,350       371.0      22.7      00:35:54
 13513       7   4,335      30,345       379.4      23.2      00:35:26
 13641       7   4,335      30,345       383.2      23.4      00:35:31
 13763       4   4,335      17,340       386.6      23.6      00:35:39
 13892      10   4,335      43,350       390.2      23.9      00:35:45
 14037       5   4,335      21,675       394.2      24.1      00:35:48
 14189       8   4,335      34,680       398.7      24.4      00:35:47
 14387       5   4,335      21,675       404.6      24.7      00:35:37
 14628       9   4,335      39,015       411.5      25.2      00:35:18
 14883       8   4,335      34,680       418.8      25.6      00:34:58
 15159       5   4,335      21,675       427.1      26.1      00:34:32
 15374       9   4,335      39,015       433.4      26.5      00:34:19
 15619       5   4,335      21,675       440.2      26.9      00:34:03
 15897       3   4,335      13,005       448.5      27.4      00:33:38
 16182      10   4,335      43,350       457.2      27.9      00:33:11
 16456       8   4,335      34,680       465.4      28.5      00:32:47
 16639       7   4,335      30,345       470.4      28.8      00:32:43
 16782       7   4,335      30,345       474.7      29.0      00:32:42
 16945       6   4,335      26,010       479.5      29.3      00:32:39
 17119       9   4,335      39,015       484.4      29.6      00:32:35
 17268      10   4,335      43,350       488.8      29.9      00:32:34
 17411       5   4,335      21,675       493.0      30.1      00:32:33
 17553       8   4,335      34,680       497.5      30.4      00:32:31
 17673       5   4,335      21,675       501.0      30.6      00:32:34
 17796       7   4,335      30,345       504.3      30.8      00:32:38
 18028      10   4,335      43,350       511.1      31.2      00:32:22
 18333      10   4,335      43,350       520.1      31.8      00:31:55
 18576      10   4,335      43,350       526.8      32.2      00:31:40
 18771       9   4,335      39,015       532.8      32.6      00:31:30
 18987       7   4,335      30,345       539.2      33.0      00:31:17
 19148       7   4,335      30,345       544.1      33.3      00:31:12
 19315       7   4,335      30,345       549.0      33.6      00:31:06
 19554       6   4,335      26,010       556.2      34.0      00:30:49
 19837       9   4,335      39,015       564.8      34.5      00:30:26
 20097      10   4,335      43,350       572.9      35.0      00:30:05
 20335       8   4,335      34,680       579.6      35.4      00:29:51
 20537       8   4,335      34,680       585.7      35.8      00:29:40
 20699       9   4,335      39,015       590.5      36.1      00:29:36
 20855       6   4,335      26,010       595.1      36.4      00:29:32
 21026       6   4,335      26,010       600.0      36.7      00:29:26
 21226       7   4,335      30,345       605.3      37.0      00:29:19
 21439      10   4,335      43,350       611.1      37.4      00:29:09
 21641       9   4,335      39,015       616.6      37.7      00:29:01
 21847       4   4,335      17,340       622.2      38.0      00:28:52
 22039       3   4,335      13,005       627.5      38.4      00:28:45
 22287       6   4,335      26,010       634.1      38.8      00:28:31
 22498       5   4,335      21,675       639.9      39.1      00:28:22
 22652       7   4,335      30,345       644.2      39.4      00:28:19
 22886       8   4,335      34,680       650.2      39.7      00:28:08
 23154       9   4,335      39,015       657.9      40.2      00:27:50
 23401       2   4,335       8,670       665.0      40.7      00:27:35
 23657       4   4,335      17,340       671.8      41.1      00:27:21
 23914       7   4,335      30,345       679.2      41.5      00:27:04
 24204       8   4,335      34,680       687.2      42.0      00:26:46
 24452      10   4,335      43,350       694.0      42.4      00:26:32
 24683       8   4,335      34,680       700.9      42.8      00:26:19
 24887       5   4,335      21,675       706.5      43.2      00:26:10
 25132      10   4,335      43,350       713.7      43.6      00:25:55
 25393       9   4,335      39,015       721.1      44.1      00:25:39
 25645      10   4,335      43,350       728.1      44.5      00:25:25
 25824      10   4,335      43,350       733.5      44.8      00:25:17
 25990       8   4,335      34,680       738.3      45.1      00:25:12
 26160       7   4,335      30,345       743.2      45.4      00:25:06
 26370       2   4,335       8,670       749.1      45.8      00:24:56
 26590       9   4,335      39,015       755.2      46.2      00:24:45
 26825       8   4,335      34,680       761.8      46.6      00:24:33
 27023       8   4,335      34,680       767.6      46.9      00:24:23
 27184       9   4,335      39,015       772.2      47.2      00:24:18
 27329       5   4,335      21,675       776.3      47.5      00:24:15
 27489       8   4,335      34,680       780.9      47.7      00:24:09
 27703       6   4,335      26,010       787.1      48.1      00:23:58
 27906      10   4,335      43,350       793.2      48.5      00:23:48
 28138       7   4,335      30,345       799.9      48.9      00:23:35
 28375       6   4,335      26,010       806.9      49.3      00:23:21
 28607       8   4,335      34,680       814.0      49.8      00:23:07
 28769       8   4,335      34,680       818.8      50.1      00:23:01
 28945       7   4,335      30,345       824.0      50.4      00:22:53
 29157       5   4,335      21,675       830.2      50.8      00:22:43
 29380       6   4,335      26,010       836.7      51.2      00:22:31
 29598       9   4,335      39,015       842.9      51.5      00:22:20
 29780       8   4,335      34,680       848.2      51.9      00:22:12
 29926       6   4,335      26,010       852.5      52.1      00:22:07
 30092       9   4,335      39,015       857.4      52.4      00:22:00
 30318       8   4,335      34,680       864.0      52.8      00:21:48
 30516       9   4,335      39,015       870.0      53.2      00:21:38
 30787       6   4,335      26,010       878.0      53.7      00:21:21
 31055       7   4,335      30,345       885.7      54.1      00:21:06
 31327       6   4,335      26,010       893.9      54.6      00:20:49
 31620       5   4,335      21,675       902.7      55.2      00:20:30
 31890       8   4,335      34,680       911.0      55.7      00:20:13
 32164       7   4,335      30,345       919.3      56.2      00:19:56
 32415       8   4,335      34,680       927.2      56.7      00:19:40
 32572       8   4,335      34,680       931.7      57.0      00:19:35
 32668       9   4,335      39,015       934.6      57.1      00:19:34
 32800      10   4,335      43,350       938.6      57.4      00:19:29
 32928       5   4,335      21,675       942.4      57.6      00:19:26
 33074       6   4,335      26,010       946.9      57.9      00:19:20
 33246      10   4,335      43,350       952.0      58.2      00:19:12
 33429       7   4,335      30,345       957.4      58.5      00:19:04
 33577       6   4,335      26,010       962.0      58.8      00:18:58
 33708       5   4,335      21,675       965.9      59.1      00:18:54
 33837       8   4,335      34,680       969.8      59.3      00:18:49
 34000       9   4,335      39,015       974.7      59.6      00:18:42
 34137       9   4,335      39,015       979.0      59.9      00:18:37
 34313       7   4,335      30,345       984.4      60.2      00:18:28
 34562       8   4,335      34,680       991.8      60.6      00:18:14
 34786       7   4,335      30,345       998.7      61.1      00:18:01
 35014       8   4,335      34,680     1,005.5      61.5      00:17:49
 35256      10   4,335      43,350     1,012.8      61.9      00:17:35
 35478       9   4,335      39,015     1,019.6      62.3      00:17:23
 35678       9   4,335      39,015     1,025.4      62.7      00:17:13
 35906       8   4,335      34,680     1,032.2      63.1      00:17:00
 36106       4   4,335      17,340     1,038.2      63.5      00:16:50
 36313       5   4,335      21,675     1,044.5      63.9      00:16:39
 36520       9   4,335      39,015     1,050.5      64.2      00:16:29
 36659       6   4,335      26,010     1,054.6      64.5      00:16:24
 36829       9   4,335      39,015     1,059.4      64.8      00:16:17
 36981       9   4,335      39,015     1,063.8      65.0      00:16:11
 37139       7   4,335      30,345     1,068.2      65.3      00:16:05
 37257      10   4,335      43,350     1,071.4      65.5      00:16:01
 37407       8   4,335      34,680     1,075.5      65.8      00:15:56
 37554       6   4,335      26,010     1,079.7      66.0      00:15:50
 37718       9   4,335      39,015     1,084.2      66.3      00:15:44
 37882       8   4,335      34,680     1,089.0      66.6      00:15:37
 38053       8   4,335      34,680     1,094.1      66.9      00:15:29
 38218       7   4,335      30,345     1,098.9      67.2      00:15:21
 38398       7   4,335      30,345     1,104.4      67.5      00:15:12
 38560      10   4,335      43,350     1,109.2      67.8      00:15:05
 38772       9   4,335      39,015     1,115.3      68.2      00:14:54
 38975      10   4,335      43,350     1,121.3      68.6      00:14:43
 39097       7   4,335      30,345     1,124.8      68.8      00:14:39
 39219       7   4,335      30,345     1,128.2      69.0      00:14:35
 39348       6   4,335      26,010     1,131.9      69.2      00:14:31
 39494       8   4,335      34,680     1,136.0      69.5      00:14:25
 39631       6   4,335      26,010     1,139.9      69.7      00:14:19
 39800       8   4,335      34,680     1,144.8      70.0      00:14:12
 40020       7   4,335      30,345     1,151.1      70.4      00:14:00
 40256      10   4,335      43,350     1,157.8      70.8      00:13:48
 40490      10   4,335      43,350     1,164.8      71.2      00:13:35
 40721       6   4,335      26,010     1,171.6      71.6      00:13:23
 40945       7   4,335      30,345     1,178.3      72.0      00:13:10
 41077      10   4,335      43,350     1,182.1      72.3      00:13:05
 41200       7   4,335      30,345     1,185.8      72.5      00:13:00
 41362       9   4,335      39,015     1,190.4      72.8      00:12:53
 41504       3   4,335      13,005     1,194.6      73.0      00:12:47
 41637       6   4,335      26,010     1,198.5      73.3      00:12:41
 41774       7   4,335      30,345     1,202.5      73.5      00:12:35
 41946       1   4,335       4,335     1,207.7      73.8      00:12:27
 42120       9   4,335      39,015     1,212.4      74.1      00:12:19
 42300       7   4,335      30,345     1,217.3      74.4      00:12:11
 42448       5   4,335      21,675     1,221.8      74.7      00:12:04
 42579       7   4,335      30,345     1,225.4      74.9      00:11:59
 42683       5   4,335      21,675     1,228.4      75.1      00:11:55
 42798       7   4,335      30,345     1,231.7      75.3      00:11:51
 42928       5   4,335      21,675     1,235.5      75.5      00:11:45
 43097       9   4,335      39,015     1,240.7      75.9      00:11:36
 43253       9   4,335      39,015     1,245.4      76.1      00:11:29
 43386       8   4,335      34,680     1,249.4      76.4      00:11:22
 43553       7   4,335      30,345     1,254.1      76.7      00:11:15
 43783       6   4,335      26,010     1,260.6      77.1      00:11:03
 44000       3   4,335      13,005     1,266.9      77.5      00:10:51
 44171       5   4,335      21,675     1,271.8      77.8      00:10:43
 44369       7   4,335      30,345     1,277.2      78.1      00:10:34
 44531       8   4,335      34,680     1,282.0      78.4      00:10:26
 44738       7   4,335      30,345     1,287.9      78.7      00:10:15
 44879       6   4,335      26,010     1,292.1      79.0      00:10:08
 45021       6   4,335      26,010     1,296.2      79.2      00:10:02
 45203       6   4,335      26,010     1,301.2      79.6      00:09:53
 45378       5   4,335      21,675     1,305.8      79.8      00:09:46
 45552       8   4,335      34,680     1,310.6      80.1      00:09:37
 45748       3   4,335      13,005     1,315.9      80.5      00:09:28
 45929      10   4,335      43,350     1,321.1      80.8      00:09:19
 46116       7   4,335      30,345     1,326.6      81.1      00:09:09
 46301       9   4,335      39,015     1,332.2      81.4      00:08:59
 46490       9   4,335      39,015     1,337.5      81.8      00:08:50
 46706       8   4,335      34,680     1,343.9      82.2      00:08:38
 46898       8   4,335      34,680     1,349.6      82.5      00:08:28
 47082       7   4,335      30,345     1,354.4      82.8      00:08:20
 47271      10   4,335      43,350     1,359.4      83.1      00:08:11
 47441       8   4,335      34,680     1,364.1      83.4      00:08:03
 47585       8   4,335      34,680     1,368.2      83.6      00:07:57
 47730       7   4,335      30,345     1,372.4      83.9      00:07:50
 47866       7   4,335      30,345     1,376.2      84.1      00:07:43
 47977       9   4,335      39,015     1,379.5      84.3      00:07:38
 48124       7   4,335      30,345     1,383.7      84.6      00:07:31
 48289       7   4,335      30,345     1,388.5      84.9      00:07:23
 48485       6   4,335      26,010     1,394.2      85.2      00:07:13
 48723       8   4,335      34,680     1,401.1      85.7      00:06:60
 48896       9   4,335      39,015     1,406.0      86.0      00:06:51
 49092       9   4,335      39,015     1,411.7      86.3      00:06:41
 49216       3   4,335      13,005     1,415.5      86.5      00:06:35
 49363       9   4,335      39,015     1,419.4      86.8      00:06:28
 49497       4   4,335      17,340     1,423.0      87.0      00:06:22
 49658       7   4,335      30,345     1,427.3      87.3      00:06:15
 49803       7   4,335      30,345     1,431.2      87.5      00:06:08
 49932       8   4,335      34,680     1,434.9      87.7      00:06:02
 50057       7   4,335      30,345     1,438.5      87.9      00:05:56
 50166       8   4,335      34,680     1,441.6      88.1      00:05:51
 50304       9   4,335      39,015     1,445.3      88.4      00:05:45
 50452       7   4,335      30,345     1,449.3      88.6      00:05:38
 50588       9   4,335      39,015     1,453.4      88.9      00:05:31
 50740       6   4,335      26,010     1,457.8      89.1      00:05:23
 50876       9   4,335      39,015     1,461.9      89.4      00:05:16
 51013       9   4,335      39,015     1,466.2      89.6      00:05:09
 51210       5   4,335      21,675     1,471.6      90.0      00:04:59
 51427       9   4,335      39,015     1,478.1      90.4      00:04:47
 51673       9   4,335      39,015     1,485.6      90.8      00:04:33
 51933      10   4,335      43,350     1,493.3      91.3      00:04:18
 52160       9   4,335      39,015     1,500.4      91.7      00:04:05
 52393       9   4,335      39,015     1,507.6      92.2      00:03:52
 52639       7   4,335      30,345     1,515.5      92.7      00:03:37
 52887       9   4,335      39,015     1,523.2      93.1      00:03:23
 53150      10   4,335      43,350     1,531.1      93.6      00:03:09
 53346       6   4,335      26,010     1,536.9      94.0      00:02:58
 53587       9   4,335      39,015     1,544.2      94.4      00:02:45
 53768       8   4,335      34,680     1,549.6      94.7      00:02:35
 53934       6   4,335      26,010     1,554.3      95.0      00:02:27
 54136       7   4,335      30,345     1,560.2      95.4      00:02:16
 54308       6   4,335      26,010     1,565.2      95.7      00:02:07
 54470       9   4,335      39,015     1,569.4      95.9      00:01:60
 54648       5   4,335      21,675     1,574.4      96.3      00:01:51
 54793       9   4,335      39,015     1,578.5      96.5      00:01:43
 54945       5   4,335      21,675     1,582.9      96.8      00:01:35
 55140       7   4,335      30,345     1,588.4      97.1      00:01:25
 55271       7   4,335      30,345     1,592.0      97.3      00:01:19
 55454      10   4,335      43,350     1,597.0      97.6      00:01:10
 55641       4   4,335      17,340     1,602.2      98.0      00:01:01
 55784       8   4,335      34,680     1,606.3      98.2      00:00:53
 55925       8   4,335      34,680     1,610.6      98.5      00:00:46
 56054       7   4,335      30,345     1,614.3      98.7      00:00:39
 56191      10   4,335      43,350     1,618.5      98.9      00:00:31
 56351       9   4,335      39,015     1,623.3      99.2      00:00:22
 56483       7   4,335      30,345     1,627.3      99.5      00:00:15
 56670      10   4,335      43,350     1,632.9      99.8      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 2985.981
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300.csv saved

. 
. cap log close

. 
end of do-file
