
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar//vaccinated/ca_Dollar_loc
> ations_total_8000_5_4q_mnl.dta /export/storage_covidvaccine/Result/MNL_partia
> l_new/M5_K8000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_8000_5_4q_mnl.c
> sv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dolla
> r//vaccinated/ca_Dollar_locations_total_8000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar
> //vaccinated/ca_blk_Dollar_dist_total_8000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   396      10   4,035      40,350         9.1       0.6      00:27:37
   822       9   4,035      36,315        19.7       1.3      00:25:27
  1235       8   4,035      32,280        30.1       2.0      00:24:47
  1601       5   4,035      20,175        39.9       2.6      00:24:47
  1966       9   4,035      36,315        49.2       3.2      00:24:59
  2395      10   4,035      40,350        60.3       4.0      00:24:18
  2781       7   4,035      28,245        70.3       4.6      00:24:08
  3204       8   4,035      32,280        81.5       5.3      00:23:38
  3581       7   4,035      28,245        91.7       6.0      00:23:27
  3967       5   4,035      20,175       101.6       6.7      00:23:22
  4285       8   4,035      32,280       109.5       7.2      00:23:42
  4501      10   4,035      40,350       115.1       7.6      00:24:30
  4786       9   4,035      36,315       122.8       8.1      00:24:45
  5018       4   4,035      16,140       128.8       8.5      00:25:18
  5316       9   4,035      36,315       136.5       9.0      00:25:26
  5576       3   4,035      12,105       143.0       9.4      00:25:47
  5824       7   4,035      28,245       149.2       9.8      00:26:08
  6096       5   4,035      20,175       156.3      10.3      00:26:16
  6315       9   4,035      36,315       161.9      10.6      00:26:40
  6576       4   4,035      16,140       168.5      11.1      00:26:50
  6788       6   4,035      24,210       173.9      11.4      00:27:11
  7012       9   4,035      36,315       179.8      11.8      00:27:26
  7292       8   4,035      32,280       186.8      12.3      00:27:28
  7629       1   4,035       4,035       195.8      12.9      00:27:09
  7947       7   4,035      28,245       204.5      13.4      00:26:55
  8239       7   4,035      28,245       212.6      14.0      00:26:45
  8537       8   4,035      32,280       220.9      14.5      00:26:35
  8826       7   4,035      28,245       228.7      15.0      00:26:28
  9142      10   4,035      40,350       237.4      15.6      00:26:13
  9361       3   4,035      12,105       243.4      16.0      00:26:20
  9618      10   4,035      40,350       250.8      16.5      00:26:16
  9839       6   4,035      24,210       256.9      16.9      00:26:21
 10104       8   4,035      32,280       263.6      17.3      00:26:20
 10341       9   4,035      36,315       269.3      17.7      00:26:26
 10629      10   4,035      40,350       276.8      18.2      00:26:19
 10866       5   4,035      20,175       283.0      18.6      00:26:21
 11170       9   4,035      36,315       291.0      19.1      00:26:10
 11354      10   4,035      40,350       295.8      19.4      00:26:20
 11576       8   4,035      32,280       301.6      19.8      00:26:23
 11797       7   4,035      28,245       307.5      20.2      00:26:25
 12028      10   4,035      40,350       313.6      20.6      00:26:25
 12268       6   4,035      24,210       320.1      21.0      00:26:23
 12608       9   4,035      36,315       328.9      21.6      00:26:05
 12980       7   4,035      28,245       338.3      22.2      00:25:44
 13316       8   4,035      32,280       347.3      22.8      00:25:27
 13666       7   4,035      28,245       357.1      23.4      00:25:05
 13875       8   4,035      32,280       362.6      23.8      00:25:08
 14138       5   4,035      20,175       369.5      24.2      00:25:02
 14362       6   4,035      24,210       375.7      24.7      00:25:00
 14652       9   4,035      36,315       383.5      25.2      00:24:49
 14890      10   4,035      40,350       389.9      25.6      00:24:46
 15298      10   4,035      40,350       401.1      26.3      00:24:18
 15660       7   4,035      28,245       410.7      27.0      00:23:59
 16053       9   4,035      36,315       421.7      27.7      00:23:34
 16403       9   4,035      36,315       431.4      28.3      00:23:15
 16700       4   4,035      16,140       439.5      28.8      00:23:04
 16970       6   4,035      24,210       446.7      29.3      00:22:57
 17171       6   4,035      24,210       452.0      29.7      00:22:58
 17387       5   4,035      20,175       458.1      30.1      00:22:55
 17585       9   4,035      36,315       463.7      30.4      00:22:54
 17893       9   4,035      36,315       471.9      31.0      00:22:42
 18247       3   4,035      12,105       481.6      31.6      00:22:24
 18577       5   4,035      20,175       490.1      32.2      00:22:11
 18793       6   4,035      24,210       496.2      32.6      00:22:08
 19048       8   4,035      32,280       503.4      33.0      00:21:60
 19231       4   4,035      16,140       508.5      33.4      00:22:00
 19602       8   4,035      32,280       518.8      34.1      00:21:40
 19941       8   4,035      32,280       528.4      34.7      00:21:23
 20337       6   4,035      24,210       539.4      35.4      00:21:02
 20620       6   4,035      24,210       547.2      35.9      00:20:51
 20900       8   4,035      32,280       554.9      36.4      00:20:42
 21171      10   4,035      40,350       562.0      36.9      00:20:35
 21459       5   4,035      20,175       569.0      37.3      00:20:27
 21737       9   4,035      36,315       576.0      37.8      00:20:20
 22029       7   4,035      28,245       583.6      38.3      00:20:10
 22335       5   4,035      20,175       591.1      38.8      00:20:01
 22629       8   4,035      32,280       598.7      39.3      00:19:52
 22909       5   4,035      20,175       605.5      39.7      00:19:45
 23248       7   4,035      28,245       614.7      40.3      00:19:30
 23562       6   4,035      24,210       622.6      40.9      00:19:20
 23861       9   4,035      36,315       630.7      41.4      00:19:09
 24076      10   4,035      40,350       636.3      41.8      00:19:06
 24420      10   4,035      40,350       644.8      42.3      00:18:53
 24820      10   4,035      40,350       655.7      43.0      00:18:34
 25244       8   4,035      32,280       667.0      43.8      00:18:14
 25585       9   4,035      36,315       676.1      44.4      00:18:00
 25901       8   4,035      32,280       684.6      44.9      00:17:48
 26269       8   4,035      32,280       694.6      45.6      00:17:32
 26693      10   4,035      40,350       705.3      46.3      00:17:15
 27070       5   4,035      20,175       715.4      47.0      00:16:59
 27368       8   4,035      32,280       723.3      47.5      00:16:49
 27629       7   4,035      28,245       730.3      47.9      00:16:41
 27991      10   4,035      40,350       740.2      48.6      00:16:26
 28424       7   4,035      28,245       752.1      49.4      00:16:06
 28803       8   4,035      32,280       762.8      50.1      00:15:49
 29129       8   4,035      32,280       771.7      50.7      00:15:37
 29478       8   4,035      32,280       781.2      51.3      00:15:24
 29805      10   4,035      40,350       789.9      51.8      00:15:12
 30059       6   4,035      24,210       796.8      52.3      00:15:05
 30347       9   4,035      36,315       804.7      52.8      00:14:55
 30690      10   4,035      40,350       814.2      53.4      00:14:42
 31164       9   4,035      36,315       827.1      54.3      00:14:21
 31588       6   4,035      24,210       839.0      55.1      00:14:02
 32004       7   4,035      28,245       850.8      55.8      00:13:44
 32422       7   4,035      28,245       862.8      56.6      00:13:26
 32731       7   4,035      28,245       871.3      57.2      00:13:15
 33027       8   4,035      32,280       879.6      57.7      00:13:05
 33360       7   4,035      28,245       888.9      58.3      00:12:52
 33739       7   4,035      28,245       899.6      59.0      00:12:38
 34097       9   4,035      36,315       909.7      59.7      00:12:24
 34503      10   4,035      40,350       921.2      60.5      00:12:07
 34975       8   4,035      32,280       934.5      61.3      00:11:47
 35442       6   4,035      24,210       947.6      62.2      00:11:28
 35898       9   4,035      36,315       960.2      63.0      00:11:10
 36357       7   4,035      28,245       973.0      63.9      00:10:52
 36706       9   4,035      36,315       982.6      64.5      00:10:40
 37003       9   4,035      36,315       990.5      65.0      00:10:31
 37316       7   4,035      28,245       998.5      65.5      00:10:22
 37596       6   4,035      24,210     1,005.8      66.0      00:10:14
 37860       7   4,035      28,245     1,012.7      66.5      00:10:07
 38119       6   4,035      24,210     1,019.7      66.9      00:09:59
 38402       8   4,035      32,280     1,027.6      67.4      00:09:50
 38759       6   4,035      24,210     1,037.5      68.1      00:09:37
 39154       7   4,035      28,245     1,048.2      68.8      00:09:23
 39560       9   4,035      36,315     1,058.9      69.5      00:09:10
 39955       6   4,035      24,210     1,069.4      70.2      00:08:56
 40385       7   4,035      28,245     1,080.8      70.9      00:08:41
 40778       7   4,035      28,245     1,091.7      71.7      00:08:27
 41096       9   4,035      36,315     1,100.5      72.2      00:08:17
 41403       8   4,035      32,280     1,108.8      72.8      00:08:07
 41737       9   4,035      36,315     1,117.9      73.4      00:07:56
 42021      10   4,035      40,350     1,125.8      73.9      00:07:47
 42399       9   4,035      36,315     1,135.4      74.5      00:07:35
 42750       5   4,035      20,175     1,144.8      75.1      00:07:24
 43042       6   4,035      24,210     1,152.8      75.7      00:07:15
 43348       9   4,035      36,315     1,161.5      76.2      00:07:05
 43680       9   4,035      36,315     1,170.3      76.8      00:06:54
 43977       7   4,035      28,245     1,178.3      77.3      00:06:45
 44313       7   4,035      28,245     1,187.3      77.9      00:06:34
 44714       8   4,035      32,280     1,197.9      78.6      00:06:21
 45132      10   4,035      40,350     1,209.1      79.4      00:06:07
 45533       8   4,035      32,280     1,219.3      80.0      00:05:55
 45895      10   4,035      40,350     1,228.5      80.6      00:05:44
 46231       4   4,035      16,140     1,237.7      81.2      00:05:33
 46556       7   4,035      28,245     1,246.6      81.8      00:05:23
 46939       7   4,035      28,245     1,257.1      82.5      00:05:10
 47219       9   4,035      36,315     1,263.8      82.9      00:05:03
 47565       8   4,035      32,280     1,272.7      83.5      00:04:52
 47857       6   4,035      24,210     1,280.5      84.0      00:04:43
 48171       4   4,035      16,140     1,288.9      84.6      00:04:34
 48523       7   4,035      28,245     1,298.5      85.2      00:04:22
 48964       7   4,035      28,245     1,310.3      86.0      00:04:08
 49383       6   4,035      24,210     1,321.5      86.7      00:03:54
 49915       5   4,035      20,175     1,334.8      87.6      00:03:38
 50421       9   4,035      36,315     1,347.9      88.5      00:03:22
 50858       7   4,035      28,245     1,359.8      89.3      00:03:08
 51275       9   4,035      36,315     1,371.2      90.0      00:02:55
 51714       8   4,035      32,280     1,383.4      90.8      00:02:40
 52142      10   4,035      40,350     1,395.5      91.6      00:02:26
 52536       7   4,035      28,245     1,407.0      92.3      00:02:13
 52892       6   4,035      24,210     1,417.5      93.0      00:02:01
 53253       7   4,035      28,245     1,427.6      93.7      00:01:49
 53753       4   4,035      16,140     1,441.5      94.6      00:01:33
 54157       8   4,035      32,280     1,452.4      95.3      00:01:21
 54463       9   4,035      36,315     1,460.4      95.9      00:01:11
 54908       5   4,035      20,175     1,472.0      96.6      00:00:58
 55352       7   4,035      28,245     1,483.5      97.4      00:00:45
 55755       8   4,035      32,280     1,494.1      98.1      00:00:33
 56163       9   4,035      36,315     1,505.2      98.8      00:00:21
 56564       6   4,035      24,210     1,516.5      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1713.444
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar//v
    > accinated/ca_blk_Dollar_dist_total_8000_5_4q_mnl.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K8000_4q/Dollar//va
> ccinated/ca_blk_Dollar_dist_total_8000_5_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
