
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A200.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   342       5   4,235      21,175         8.4       0.5      00:31:38
   734       8   4,235      33,880        18.4       1.1      00:28:43
  1120       5   4,235      21,175        28.6       1.8      00:27:30
  1506       7   4,235      29,645        39.4       2.5      00:26:23
  1907       6   4,235      25,410        50.1       3.1      00:25:46
  2281       9   4,235      38,115        60.4       3.8      00:25:28
  2684       5   4,235      21,175        71.2       4.5      00:25:03
  3077      10   4,235      42,350        81.9       5.1      00:24:43
  3445       5   4,235      21,175        92.7       5.8      00:24:23
  3847      10   4,235      42,350       103.8       6.5      00:24:01
  4160       7   4,235      29,645       111.9       7.0      00:24:22
  4485       5   4,235      21,175       120.5       7.5      00:24:33
  4771       3   4,235      12,705       128.6       8.0      00:24:47
  5077      10   4,235      42,350       136.9       8.6      00:24:56
  5357       9   4,235      38,115       144.8       9.1      00:25:08
  5615       6   4,235      25,410       151.2       9.5      00:25:33
  5896       8   4,235      33,880       158.7       9.9      00:25:44
  6220       7   4,235      29,645       167.7      10.5      00:25:37
  6535       3   4,235      12,705       176.0      11.0      00:25:38
  6855       7   4,235      29,645       184.6      11.6      00:25:34
  7207       8   4,235      33,880       193.8      12.1      00:25:24
  7555       6   4,235      25,410       203.6      12.7      00:25:09
  7900       8   4,235      33,880       213.4      13.4      00:24:55
  8255       7   4,235      29,645       223.7      14.0      00:24:37
  8597       4   4,235      16,940       233.7      14.6      00:24:22
  8939       9   4,235      38,115       243.6      15.2      00:24:08
  9249      10   4,235      42,350       252.5      15.8      00:24:01
  9413       9   4,235      38,115       257.3      16.1      00:24:22
  9546       6   4,235      25,410       261.2      16.3      00:24:46
  9655       9   4,235      38,115       264.5      16.6      00:25:15
  9778       6   4,235      25,410       268.1      16.8      00:25:41
  9921       8   4,235      33,880       272.0      17.0      00:26:03
 10038      10   4,235      42,350       275.1      17.2      00:26:30
 10192       9   4,235      38,115       279.0      17.5      00:26:51
 10323       6   4,235      25,410       282.4      17.7      00:27:14
 10474       8   4,235      33,880       286.7      17.9      00:27:30
 10660      10   4,235      42,350       291.6      18.2      00:27:41
 10902       5   4,235      21,175       298.2      18.7      00:27:40
 11104       8   4,235      33,880       303.8      19.0      00:27:45
 11274       6   4,235      25,410       308.4      19.3      00:27:56
 11406       8   4,235      33,880       312.1      19.5      00:28:13
 11537       8   4,235      33,880       315.7      19.8      00:28:29
 11688       2   4,235       8,470       319.9      20.0      00:28:42
 11816       9   4,235      38,115       323.5      20.2      00:28:57
 11969       7   4,235      29,645       327.6      20.5      00:29:09
 12111      10   4,235      42,350       331.8      20.8      00:29:20
 12229       6   4,235      25,410       335.0      21.0      00:29:36
 12435       9   4,235      38,115       340.5      21.3      00:29:37
 12652       4   4,235      16,940       346.6      21.7      00:29:33
 12888       4   4,235      16,940       352.8      22.1      00:29:29
 13140       8   4,235      33,880       359.8      22.5      00:29:19
 13357       4   4,235      16,940       365.9      22.9      00:29:15
 13530       1   4,235       4,235       371.1      23.2      00:29:16
 13663       6   4,235      25,410       375.0      23.5      00:29:26
 13829       7   4,235      29,645       379.5      23.7      00:29:30
 13991       2   4,235       8,470       383.9      24.0      00:29:35
 14131       8   4,235      33,880       387.8      24.3      00:29:43
 14273       5   4,235      21,175       391.9      24.5      00:29:49
 14435       5   4,235      21,175       396.6      24.8      00:29:52
 14593       6   4,235      25,410       401.1      25.1      00:29:55
 14745       8   4,235      33,880       405.3      25.4      00:29:60
 14896       4   4,235      16,940       409.5      25.6      00:30:04
 15084       6   4,235      25,410       415.0      26.0      00:30:00
 15282       9   4,235      38,115       420.7      26.3      00:29:56
 15505       7   4,235      29,645       427.0      26.7      00:29:47
 15715       6   4,235      25,410       432.8      27.1      00:29:42
 15928       7   4,235      29,645       439.1      27.5      00:29:33
 16121       8   4,235      33,880       444.9      27.8      00:29:27
 16330      10   4,235      42,350       450.9      28.2      00:29:20
 16504      10   4,235      42,350       456.0      28.5      00:29:17
 16669      10   4,235      42,350       460.6      28.8      00:29:18
 16816       8   4,235      33,880       464.7      29.1      00:29:20
 16916       9   4,235      38,115       467.5      29.3      00:29:30
 17015      10   4,235      42,350       470.4      29.4      00:29:39
 17143       7   4,235      29,645       473.8      29.7      00:29:44
 17240       4   4,235      16,940       476.6      29.8      00:29:53
 17350       6   4,235      25,410       480.0      30.0      00:29:59
 17475       7   4,235      29,645       483.7      30.3      00:30:02
 17588       3   4,235      12,705       487.0      30.5      00:30:07
 17760       8   4,235      33,880       491.7      30.8      00:30:05
 17933       7   4,235      29,645       496.6      31.1      00:30:02
 18138       9   4,235      38,115       502.5      31.4      00:29:53
 18378       6   4,235      25,410       509.3      31.9      00:29:39
 18550       8   4,235      33,880       513.9      32.2      00:29:37
 18676       7   4,235      29,645       517.7      32.4      00:29:39
 18819       8   4,235      33,880       521.7      32.6      00:29:39
 18969       6   4,235      25,410       526.3      32.9      00:29:37
 19158       8   4,235      33,880       531.8      33.3      00:29:29
 19305       9   4,235      38,115       536.1      33.5      00:29:28
 19452       6   4,235      25,410       540.3      33.8      00:29:27
 19685       9   4,235      38,115       547.3      34.2      00:29:12
 19921       5   4,235      21,175       554.3      34.7      00:28:57
 20131       8   4,235      33,880       560.5      35.1      00:28:46
 20300      10   4,235      42,350       565.3      35.4      00:28:42
 20497       9   4,235      38,115       571.0      35.7      00:28:34
 20625      10   4,235      42,350       574.7      36.0      00:28:34
 20771       5   4,235      21,175       578.9      36.2      00:28:33
 20911       6   4,235      25,410       583.0      36.5      00:28:31
 21056       8   4,235      33,880       587.0      36.7      00:28:30
 21231       8   4,235      33,880       591.5      37.0      00:28:27
 21364       8   4,235      33,880       594.9      37.2      00:28:28
 21521       7   4,235      29,645       599.4      37.5      00:28:24
 21631       9   4,235      38,115       602.1      37.7      00:28:29
 21787       6   4,235      25,410       606.1      37.9      00:28:27
 21943       8   4,235      33,880       610.5      38.2      00:28:24
 22115       8   4,235      33,880       614.8      38.5      00:28:20
 22312       7   4,235      29,645       620.1      38.8      00:28:13
 22474       7   4,235      29,645       624.4      39.1      00:28:09
 22622      10   4,235      42,350       628.5      39.3      00:28:07
 22807       8   4,235      33,880       633.0      39.6      00:28:02
 23020       7   4,235      29,645       639.0      40.0      00:27:51
 23236      10   4,235      42,350       645.2      40.4      00:27:39
 23449       5   4,235      21,175       650.8      40.7      00:27:30
 23689       8   4,235      33,880       657.2      41.1      00:27:17
 23902      10   4,235      42,350       663.3      41.5      00:27:05
 24140       7   4,235      29,645       669.6      41.9      00:26:53
 24377       2   4,235       8,470       675.8      42.3      00:26:42
 24560       9   4,235      38,115       681.1      42.6      00:26:33
 24732       5   4,235      21,175       686.0      42.9      00:26:27
 24964       9   4,235      38,115       692.2      43.3      00:26:15
 25181       8   4,235      33,880       698.6      43.7      00:26:03
 25414       9   4,235      38,115       705.1      44.1      00:25:50
 25588      10   4,235      42,350       709.8      44.4      00:25:44
 25724       4   4,235      16,940       713.7      44.7      00:25:41
 25850       9   4,235      38,115       717.4      44.9      00:25:39
 25989       6   4,235      25,410       721.2      45.1      00:25:37
 26116       7   4,235      29,645       724.8      45.4      00:25:35
 26288      10   4,235      42,350       729.8      45.7      00:25:28
 26482      10   4,235      42,350       734.8      46.0      00:25:20
 26661       8   4,235      33,880       739.7      46.3      00:25:13
 26827       9   4,235      38,115       744.3      46.6      00:25:07
 26999       7   4,235      29,645       749.3      46.9      00:24:60
 27150       9   4,235      38,115       753.5      47.2      00:24:55
 27317       6   4,235      25,410       758.0      47.4      00:24:50
 27458       7   4,235      29,645       762.0      47.7      00:24:46
 27601       9   4,235      38,115       766.1      47.9      00:24:42
 27767       9   4,235      38,115       770.8      48.2      00:24:35
 27956       8   4,235      33,880       776.3      48.6      00:24:25
 28171       5   4,235      21,175       782.4      49.0      00:24:14
 28373       7   4,235      29,645       788.2      49.3      00:24:03
 28557       8   4,235      33,880       793.8      49.7      00:23:53
 28707       9   4,235      38,115       798.1      49.9      00:23:48
 28832       8   4,235      33,880       801.8      50.2      00:23:45
 28962       8   4,235      33,880       805.5      50.4      00:23:41
 29086       8   4,235      33,880       809.1      50.6      00:23:39
 29257       7   4,235      29,645       813.7      50.9      00:23:32
 29406       9   4,235      38,115       818.2      51.2      00:23:26
 29575       6   4,235      25,410       822.8      51.5      00:23:19
 29712      10   4,235      42,350       826.7      51.7      00:23:15
 29835       6   4,235      25,410       830.3      52.0      00:23:12
 29979      10   4,235      42,350       834.3      52.2      00:23:07
 30106       7   4,235      29,645       837.9      52.4      00:23:03
 30252       7   4,235      29,645       842.2      52.7      00:22:58
 30399      10   4,235      42,350       846.4      53.0      00:22:52
 30529       6   4,235      25,410       850.3      53.2      00:22:48
 30737       9   4,235      38,115       856.2      53.6      00:22:36
 30945       4   4,235      16,940       862.3      54.0      00:22:24
 31173       6   4,235      25,410       868.7      54.4      00:22:11
 31403       5   4,235      21,175       875.5      54.8      00:21:57
 31632      10   4,235      42,350       882.2      55.2      00:21:43
 31858      10   4,235      42,350       889.0      55.6      00:21:28
 32093       9   4,235      38,115       896.0      56.1      00:21:14
 32338      10   4,235      42,350       903.4      56.5      00:20:57
 32522       9   4,235      38,115       908.8      56.9      00:20:48
 32639       6   4,235      25,410       912.2      57.1      00:20:45
 32767       6   4,235      25,410       916.0      57.3      00:20:40
 32901       9   4,235      38,115       919.9      57.6      00:20:35
 33036       9   4,235      38,115       923.9      57.8      00:20:30
 33201       5   4,235      21,175       928.7      58.1      00:20:22
 33413       5   4,235      21,175       934.9      58.5      00:20:10
 33626       9   4,235      38,115       941.3      58.9      00:19:57
 33821       7   4,235      29,645       947.0      59.3      00:19:46
 33977       7   4,235      29,645       951.6      59.5      00:19:39
 34136       7   4,235      29,645       956.4      59.9      00:19:31
 34373       6   4,235      25,410       963.4      60.3      00:19:16
 34592       8   4,235      33,880       969.8      60.7      00:19:04
 34817       5   4,235      21,175       976.6      61.1      00:18:50
 35050       8   4,235      33,880       983.3      61.5      00:18:36
 35259       5   4,235      21,175       989.6      61.9      00:18:24
 35454       9   4,235      38,115       995.3      62.3      00:18:14
 35670       8   4,235      33,880     1,001.5      62.7      00:18:02
 35894       5   4,235      21,175     1,008.0      63.1      00:17:49
 36134       9   4,235      38,115     1,015.2      63.5      00:17:34
 36373       8   4,235      33,880     1,022.1      64.0      00:17:20
 36582       8   4,235      33,880     1,028.1      64.3      00:17:09
 36762       7   4,235      29,645     1,033.0      64.6      00:17:01
 36919       4   4,235      16,940     1,037.7      64.9      00:16:53
 37090      10   4,235      42,350     1,042.4      65.2      00:16:46
 37257      10   4,235      42,350     1,046.7      65.5      00:16:39
 37419       7   4,235      29,645     1,051.0      65.8      00:16:32
 37583       5   4,235      21,175     1,055.6      66.1      00:16:25
 37729       6   4,235      25,410     1,059.5      66.3      00:16:19
 37891       8   4,235      33,880     1,064.1      66.6      00:16:11
 38061       6   4,235      25,410     1,069.0      66.9      00:16:03
 38214      10   4,235      42,350     1,073.4      67.2      00:15:56
 38364       3   4,235      12,705     1,077.8      67.4      00:15:49
 38544       6   4,235      25,410     1,083.1      67.8      00:15:40
 38797       9   4,235      38,115     1,090.3      68.2      00:15:25
 38981       7   4,235      29,645     1,095.6      68.6      00:15:15
 39172       6   4,235      25,410     1,100.9      68.9      00:15:06
 39323       8   4,235      33,880     1,105.1      69.2      00:14:59
 39482       8   4,235      33,880     1,109.4      69.4      00:14:52
 39680      10   4,235      42,350     1,115.0      69.8      00:14:42
 39926       2   4,235       8,470     1,121.9      70.2      00:14:28
 40172      10   4,235      42,350     1,128.8      70.6      00:14:15
 40410       9   4,235      38,115     1,135.6      71.1      00:14:02
 40637       7   4,235      29,645     1,142.1      71.5      00:13:49
 40871       8   4,235      33,880     1,148.9      71.9      00:13:36
 41012       7   4,235      29,645     1,153.1      72.2      00:13:29
 41148       6   4,235      25,410     1,156.9      72.4      00:13:23
 41310       4   4,235      16,940     1,161.6      72.7      00:13:15
 41484       7   4,235      29,645     1,166.5      73.0      00:13:07
 41684       7   4,235      29,645     1,172.2      73.4      00:12:56
 41858      10   4,235      42,350     1,177.3      73.7      00:12:47
 41997       6   4,235      25,410     1,181.2      73.9      00:12:41
 42150       8   4,235      33,880     1,185.2      74.2      00:12:35
 42298       7   4,235      29,645     1,189.1      74.4      00:12:29
 42439       4   4,235      16,940     1,193.4      74.7      00:12:22
 42573       4   4,235      16,940     1,197.0      74.9      00:12:16
 42712       4   4,235      16,940     1,200.8      75.1      00:12:10
 42845       7   4,235      29,645     1,204.7      75.4      00:12:04
 42994       3   4,235      12,705     1,208.9      75.7      00:11:57
 43126       8   4,235      33,880     1,213.0      75.9      00:11:50
 43267       8   4,235      33,880     1,217.1      76.2      00:11:43
 43396       7   4,235      29,645     1,220.9      76.4      00:11:37
 43550       6   4,235      25,410     1,225.1      76.7      00:11:30
 43821       7   4,235      29,645     1,232.6      77.1      00:11:15
 44109       5   4,235      21,175     1,240.7      77.6      00:10:59
 44253       9   4,235      38,115     1,244.8      77.9      00:10:52
 44364       5   4,235      21,175     1,247.6      78.1      00:10:48
 44563      10   4,235      42,350     1,253.3      78.4      00:10:37
 44733       4   4,235      16,940     1,258.0      78.7      00:10:29
 44962       4   4,235      16,940     1,264.6      79.1      00:10:16
 45169       2   4,235       8,470     1,270.3      79.5      00:10:06
 45368       9   4,235      38,115     1,275.4      79.8      00:09:56
 45522       8   4,235      33,880     1,279.6      80.1      00:09:49
 45633       6   4,235      25,410     1,282.5      80.3      00:09:45
 45752       9   4,235      38,115     1,285.7      80.5      00:09:40
 45880       5   4,235      21,175     1,289.1      80.7      00:09:34
 46012       9   4,235      38,115     1,293.1      80.9      00:09:28
 46161      10   4,235      42,350     1,297.3      81.2      00:09:20
 46289       9   4,235      38,115     1,301.2      81.4      00:09:14
 46425       7   4,235      29,645     1,304.8      81.7      00:09:08
 46552       9   4,235      38,115     1,308.6      81.9      00:09:01
 46738       7   4,235      29,645     1,313.9      82.2      00:08:52
 46902      10   4,235      42,350     1,318.6      82.5      00:08:43
 47033       6   4,235      25,410     1,321.8      82.7      00:08:38
 47172       5   4,235      21,175     1,325.4      82.9      00:08:32
 47378       5   4,235      21,175     1,331.1      83.3      00:08:21
 47523       6   4,235      25,410     1,334.9      83.5      00:08:14
 47671       6   4,235      25,410     1,339.1      83.8      00:08:07
 47823       8   4,235      33,880     1,343.3      84.1      00:07:59
 47958       7   4,235      29,645     1,347.2      84.3      00:07:53
 48096       9   4,235      38,115     1,351.0      84.5      00:07:46
 48211       6   4,235      25,410     1,354.2      84.7      00:07:41
 48331      10   4,235      42,350     1,357.8      85.0      00:07:34
 48583       6   4,235      25,410     1,364.9      85.4      00:07:20
 48854       8   4,235      33,880     1,372.4      85.9      00:07:05
 49039       6   4,235      25,410     1,377.6      86.2      00:06:56
 49202       7   4,235      29,645     1,382.5      86.5      00:06:47
 49468       8   4,235      33,880     1,389.4      87.0      00:06:33
 49778       6   4,235      25,410     1,397.6      87.5      00:06:17
 50109       5   4,235      21,175     1,406.8      88.0      00:05:59
 50470       4   4,235      16,940     1,416.4      88.6      00:05:40
 50777       9   4,235      38,115     1,425.3      89.2      00:05:22
 51062      10   4,235      42,350     1,433.8      89.7      00:05:06
 51384       8   4,235      33,880     1,442.8      90.3      00:04:48
 51705       6   4,235      25,410     1,452.2      90.9      00:04:30
 52024      10   4,235      42,350     1,461.5      91.5      00:04:12
 52347       6   4,235      25,410     1,471.4      92.1      00:03:53
 52713       7   4,235      29,645     1,482.8      92.8      00:03:31
 53106      10   4,235      42,350     1,494.5      93.5      00:03:09
 53499       8   4,235      33,880     1,506.0      94.2      00:02:47
 53850       7   4,235      29,645     1,516.1      94.9      00:02:28
 54135       2   4,235       8,470     1,524.2      95.4      00:02:14
 54453       8   4,235      33,880     1,532.7      95.9      00:01:58
 54708       9   4,235      38,115     1,539.8      96.4      00:01:45
 54951      10   4,235      42,350     1,546.6      96.8      00:01:33
 55252       7   4,235      29,645     1,554.8      97.3      00:01:18
 55518      10   4,235      42,350     1,561.8      97.7      00:01:05
 55808      10   4,235      42,350     1,570.0      98.2      00:00:50
 56138       9   4,235      38,115     1,579.5      98.8      00:00:33
 56449       8   4,235      33,880     1,588.8      99.4      00:00:16

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 2855.493
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A200.csv saved

. 
. cap log close

. 
end of do-file
