
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_1_4q_mnl_flexthresh2_3_15_logdistabove1.0.dta /export/sto
> rage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_b
> lk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_logdistabove1.0.csv 3000
>  50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  13 Jan 2024, 22:14:08

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_1_4q_mnl_flexthresh2_3_15_logd
> istabove1.0.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_logdis
> tabove1.0.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   520       9   4,035      36,315        12.1       0.8      00:20:52
  1057       4   4,035      16,140        25.5       1.7      00:19:39
  1579      10   4,035      40,350        39.3       2.6      00:18:54
  2115       8   4,035      32,280        53.1       3.5      00:18:29
  2637       6   4,035      24,210        66.4       4.4      00:18:18
  3150       6   4,035      24,210        80.0       5.2      00:18:05
  3650       8   4,035      32,280        93.4       6.1      00:17:53
  4104       5   4,035      20,175       105.1       6.9      00:18:01
  4507       8   4,035      32,280       115.2       7.6      00:18:21
  4896       5   4,035      20,175       125.6       8.2      00:18:34
  5275       6   4,035      24,210       135.4       8.9      00:18:49
  5648       4   4,035      16,140       144.7       9.5      00:19:05
  6066       3   4,035      12,105       155.6      10.2      00:19:04
  6476       9   4,035      36,315       166.0      10.9      00:19:06
  6816       8   4,035      32,280       174.7      11.5      00:19:20
  7182       8   4,035      32,280       183.9      12.1      00:19:27
  7596       6   4,035      24,210       195.0      12.8      00:19:20
  7983       6   4,035      24,210       205.5      13.5      00:19:16
  8358       9   4,035      36,315       215.9      14.2      00:19:12
  8759       5   4,035      20,175       226.8      14.9      00:19:05
  9136       6   4,035      24,210       237.3      15.6      00:18:60
  9411      10   4,035      40,350       244.8      16.1      00:19:10
  9719      10   4,035      40,350       253.6      16.6      00:19:13
 10034       9   4,035      36,315       261.9      17.2      00:19:18
 10341       9   4,035      36,315       269.3      17.7      00:19:26
 10733       9   4,035      36,315       279.6      18.4      00:19:18
 11155       6   4,035      24,210       290.6      19.1      00:19:07
 11515       7   4,035      28,245       300.2      19.7      00:19:03
 11890       6   4,035      24,210       310.0      20.3      00:18:57
 12241       6   4,035      24,210       319.4      21.0      00:18:53
 12706       9   4,035      36,315       331.5      21.8      00:18:36
 13180       6   4,035      24,210       343.7      22.6      00:18:20
 13634       4   4,035      16,140       356.3      23.4      00:18:02
 14140       7   4,035      28,245       369.5      24.3      00:17:43
 14635       6   4,035      24,210       383.1      25.1      00:17:24
 15191       9   4,035      36,315       398.2      26.1      00:16:59
 15763       7   4,035      28,245       413.5      27.1      00:16:35
 16285       6   4,035      24,210       428.2      28.1      00:16:14
 16686       5   4,035      20,175       439.1      28.8      00:16:05
 17006       6   4,035      24,210       447.7      29.4      00:16:03
 17305       4   4,035      16,140       455.7      29.9      00:16:02
 17587      10   4,035      40,350       463.8      30.4      00:16:01
 17940       8   4,035      32,280       473.1      31.1      00:15:56
 18313       6   4,035      24,210       483.3      31.7      00:15:48
 18797       9   4,035      36,315       496.4      32.6      00:15:33
 19305      10   4,035      40,350       510.5      33.5      00:15:14
 19807       7   4,035      28,245       524.6      34.4      00:14:56
 20300      10   4,035      40,350       538.4      35.3      00:14:40
 20674       9   4,035      36,315       548.7      36.0      00:14:32
 21005       8   4,035      32,280       557.7      36.6      00:14:27
 21411      10   4,035      40,350       567.8      37.3      00:14:20
 21807       2   4,035       8,070       577.7      37.9      00:14:12
 22193       5   4,035      20,175       587.5      38.6      00:14:06
 22584      10   4,035      40,350       597.5      39.2      00:13:58
 22977       4   4,035      16,140       607.4      39.9      00:13:51
 23318       6   4,035      24,210       616.7      40.5      00:13:45
 23695      10   4,035      40,350       626.2      41.1      00:13:38
 24059       5   4,035      20,175       635.9      41.7      00:13:31
 24513       8   4,035      32,280       647.4      42.5      00:13:20
 24977       9   4,035      36,315       659.7      43.3      00:13:07
 25410       6   4,035      24,210       671.4      44.1      00:12:55
 25789       7   4,035      28,245       681.6      44.7      00:12:47
 26132       5   4,035      20,175       690.8      45.3      00:12:41
 26536       5   4,035      20,175       701.2      46.0      00:12:32
 26935       6   4,035      24,210       711.7      46.7      00:12:22
 27270       6   4,035      24,210       720.7      47.3      00:12:16
 27584       5   4,035      20,175       729.1      47.9      00:12:11
 27961       8   4,035      32,280       739.4      48.5      00:12:02
 28392       4   4,035      16,140       751.2      49.3      00:11:50
 28747       9   4,035      36,315       761.1      50.0      00:11:42
 29023       6   4,035      24,210       768.8      50.5      00:11:38
 29367      10   4,035      40,350       778.1      51.1      00:11:31
 29754       8   4,035      32,280       788.5      51.8      00:11:21
 30053       5   4,035      20,175       796.7      52.3      00:11:16
 30360       9   4,035      36,315       805.1      52.8      00:11:10
 30714       9   4,035      36,315       814.8      53.5      00:11:02
 31171       5   4,035      20,175       827.3      54.3      00:10:49
 31638      10   4,035      40,350       840.4      55.2      00:10:35
 32097       8   4,035      32,280       853.5      56.0      00:10:21
 32541       7   4,035      28,245       866.1      56.8      00:10:08
 32808       6   4,035      24,210       873.5      57.3      00:10:04
 33091      10   4,035      40,350       881.4      57.9      00:09:58
 33431       7   4,035      28,245       890.9      58.5      00:09:50
 33780       9   4,035      36,315       900.7      59.1      00:09:42
 34118       8   4,035      32,280       910.3      59.7      00:09:34
 34557       7   4,035      28,245       922.7      60.6      00:09:21
 35026       9   4,035      36,315       935.9      61.4      00:09:07
 35514      10   4,035      40,350       949.6      62.3      00:08:53
 36006       8   4,035      32,280       963.2      63.2      00:08:39
 36478       5   4,035      20,175       976.4      64.1      00:08:25
 36817       9   4,035      36,315       985.5      64.7      00:08:18
 37141       9   4,035      36,315       994.2      65.3      00:08:11
 37460       5   4,035      20,175     1,002.2      65.8      00:08:05
 37766       7   4,035      28,245     1,010.1      66.3      00:07:58
 38062       8   4,035      32,280     1,018.2      66.8      00:07:52
 38351      10   4,035      40,350     1,026.1      67.4      00:07:46
 38714      10   4,035      40,350     1,036.2      68.0      00:07:37
 39115       9   4,035      36,315     1,047.2      68.7      00:07:26
 39464       6   4,035      24,210     1,056.2      69.3      00:07:19
 39846       6   4,035      24,210     1,066.5      70.0      00:07:09
 40356       6   4,035      24,210     1,080.0      70.9      00:06:55
 40833       7   4,035      28,245     1,093.3      71.8      00:06:42
 41155       4   4,035      16,140     1,102.1      72.3      00:06:34
 41494       6   4,035      24,210     1,111.4      72.9      00:06:26
 41873       8   4,035      32,280     1,121.7      73.6      00:06:17
 42210       9   4,035      36,315     1,130.5      74.2      00:06:09
 42541      10   4,035      40,350     1,139.4      74.8      00:06:01
 42883       4   4,035      16,140     1,148.5      75.4      00:05:53
 43198       7   4,035      28,245     1,157.3      76.0      00:05:45
 43509       8   4,035      32,280     1,165.9      76.5      00:05:38
 43834       8   4,035      32,280     1,174.4      77.1      00:05:31
 44151       7   4,035      28,245     1,182.8      77.6      00:05:23
 44442       9   4,035      36,315     1,190.4      78.1      00:05:17
 44827       5   4,035      20,175     1,200.9      78.8      00:05:07
 45234       9   4,035      36,315     1,211.6      79.5      00:04:57
 45537       4   4,035      16,140     1,219.4      80.0      00:04:50
 45856       7   4,035      28,245     1,227.5      80.6      00:04:43
 46168       8   4,035      32,280     1,236.0      81.1      00:04:35
 46487       6   4,035      24,210     1,244.6      81.7      00:04:27
 46892       7   4,035      28,245     1,255.8      82.4      00:04:16
 47196       7   4,035      28,245     1,263.3      82.9      00:04:10
 47509       6   4,035      24,210     1,271.3      83.4      00:04:02
 47805       7   4,035      28,245     1,279.2      84.0      00:03:55
 48099      10   4,035      40,350     1,287.1      84.5      00:03:48
 48401       7   4,035      28,245     1,295.2      85.0      00:03:41
 48731       4   4,035      16,140     1,304.1      85.6      00:03:32
 49057       4   4,035      16,140     1,312.7      86.2      00:03:24
 49385       4   4,035      16,140     1,321.5      86.7      00:03:16
 49756       5   4,035      20,175     1,330.8      87.3      00:03:07
 50060       6   4,035      24,210     1,338.8      87.9      00:02:60
 50386       7   4,035      28,245     1,347.0      88.4      00:02:52
 50709       9   4,035      36,315     1,355.7      89.0      00:02:44
 51025       7   4,035      28,245     1,364.6      89.6      00:02:35
 51364      10   4,035      40,350     1,373.6      90.2      00:02:27
 51694       8   4,035      32,280     1,382.9      90.8      00:02:18
 52010       8   4,035      32,280     1,391.7      91.3      00:02:09
 52326       5   4,035      20,175     1,400.8      91.9      00:02:00
 52805      10   4,035      40,350     1,415.0      92.9      00:01:46
 53289       4   4,035      16,140     1,428.7      93.8      00:01:32
 53746       7   4,035      28,245     1,441.3      94.6      00:01:20
 54041       8   4,035      32,280     1,449.3      95.1      00:01:12
 54351       6   4,035      24,210     1,457.7      95.7      00:01:04
 54685       4   4,035      16,140     1,466.1      96.2      00:00:56
 55023       7   4,035      28,245     1,475.1      96.8      00:00:47
 55353       6   4,035      24,210     1,483.5      97.4      00:00:39
 55668      10   4,035      40,350     1,491.6      97.9      00:00:31
 55968       6   4,035      24,210     1,499.9      98.4      00:00:23
 56303       6   4,035      24,210     1,509.1      99.0      00:00:14
 56661       9   4,035      36,315     1,519.2      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1502.926
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_log
    > distabove1.0.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_logdistabo
> ve1.0.csv saved

. 
. cap log close

. 
end of do-file
