
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A200_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Apr 2024, 11:57:29

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   364       4   4,235      16,940         8.8       0.5      00:30:17
   781       9   4,235      38,115        19.5       1.2      00:26:57
  1204       7   4,235      29,645        30.7       1.9      00:25:31
  1617       7   4,235      29,645        42.4       2.6      00:24:30
  2042       7   4,235      29,645        53.6       3.4      00:24:01
  2468       4   4,235      16,940        65.2       4.1      00:23:33
  2905       4   4,235      16,940        77.2       4.8      00:23:01
  3309       9   4,235      38,115        88.6       5.5      00:22:45
  3728       6   4,235      25,410       100.3       6.3      00:22:26
  4111       5   4,235      21,175       110.4       6.9      00:22:29
  4493       7   4,235      29,645       120.5       7.5      00:22:31
  4805       7   4,235      29,645       129.3       8.1      00:22:45
  5079       6   4,235      25,410       136.8       8.6      00:23:11
  5362       6   4,235      25,410       144.7       9.0      00:23:29
  5687       4   4,235      16,940       152.9       9.6      00:23:41
  6055      10   4,235      42,350       163.0      10.2      00:23:31
  6438       5   4,235      21,175       173.2      10.8      00:23:21
  6824       8   4,235      33,880       183.6      11.5      00:23:10
  7257       6   4,235      25,410       195.0      12.2      00:22:49
  7705      10   4,235      42,350       207.5      13.0      00:22:23
  8088       7   4,235      29,645       218.7      13.7      00:22:07
  8421       9   4,235      38,115       228.5      14.3      00:22:02
  8775       7   4,235      29,645       238.5      14.9      00:21:54
  9102      10   4,235      42,350       248.0      15.5      00:21:49
  9357       9   4,235      38,115       255.4      16.0      00:21:57
  9614      10   4,235      42,350       263.0      16.4      00:22:02
  9906       8   4,235      33,880       271.4      17.0      00:22:03
 10232       8   4,235      33,880       279.9      17.5      00:22:02
 10619       9   4,235      38,115       290.3      18.2      00:21:49
 11034       5   4,235      21,175       301.8      18.9      00:21:32
 11400       5   4,235      21,175       311.7      19.5      00:21:22
 11712       5   4,235      21,175       320.4      20.0      00:21:19
 12062       8   4,235      33,880       330.1      20.6      00:21:10
 12447       9   4,235      38,115       340.8      21.3      00:20:57
 12928       8   4,235      33,880       353.7      22.1      00:20:34
 13386       8   4,235      33,880       366.5      22.9      00:20:13
 13766       5   4,235      21,175       377.5      23.6      00:19:59
 14146       6   4,235      25,410       388.0      24.3      00:19:48
 14534       4   4,235      16,940       399.2      25.0      00:19:34
 14933       8   4,235      33,880       410.3      25.7      00:19:21
 15396       8   4,235      33,880       423.8      26.5      00:18:59
 15853       5   4,235      21,175       436.6      27.3      00:18:40
 16304       7   4,235      29,645       449.9      28.1      00:18:20
 16704       4   4,235      16,940       461.3      28.8      00:18:07
 17053       5   4,235      21,175       471.3      29.5      00:17:58
 17387       5   4,235      21,175       480.8      30.1      00:17:52
 17679       7   4,235      29,645       489.4      30.6      00:17:47
 18025       6   4,235      25,410       498.9      31.2      00:17:40
 18354       6   4,235      25,410       508.4      31.8      00:17:33
 18733       7   4,235      29,645       519.1      32.5      00:17:22
 19139       6   4,235      25,410       530.9      33.2      00:17:08
 19583       8   4,235      33,880       544.0      34.0      00:16:50
 20035      10   4,235      42,350       557.5      34.9      00:16:32
 20492      10   4,235      42,350       570.6      35.7      00:16:15
 20849      10   4,235      42,350       581.0      36.3      00:16:05
 21201       7   4,235      29,645       590.6      36.9      00:15:58
 21561       8   4,235      33,880       600.2      37.5      00:15:50
 21905      10   4,235      42,350       609.2      38.1      00:15:44
 22273       6   4,235      25,410       618.8      38.7      00:15:36
 22654       7   4,235      29,645       629.1      39.3      00:15:27
 23031       7   4,235      29,645       639.0      40.0      00:15:18
 23406       6   4,235      25,410       649.6      40.6      00:15:08
 23790       2   4,235       8,470       659.9      41.3      00:14:58
 24182       8   4,235      33,880       670.5      41.9      00:14:48
 24634      10   4,235      42,350       683.1      42.7      00:14:33
 25088      10   4,235      42,350       695.6      43.5      00:14:18
 25549       4   4,235      16,940       708.7      44.3      00:14:03
 25902       7   4,235      29,645       718.5      44.9      00:13:55
 26277       8   4,235      33,880       729.3      45.6      00:13:44
 26723       9   4,235      38,115       741.1      46.3      00:13:32
 27157      10   4,235      42,350       753.3      47.1      00:13:18
 27542       9   4,235      38,115       764.1      47.8      00:13:08
 27922       8   4,235      33,880       775.0      48.5      00:12:57
 28361       9   4,235      38,115       787.5      49.2      00:12:44
 28739      10   4,235      42,350       798.6      49.9      00:12:33
 29050       4   4,235      16,940       807.7      50.5      00:12:26
 29376       6   4,235      25,410       816.9      51.1      00:12:18
 29735       8   4,235      33,880       827.0      51.7      00:12:09
 30002      10   4,235      42,350       834.6      52.2      00:12:05
 30264       6   4,235      25,410       842.2      52.7      00:12:00
 30589       9   4,235      38,115       851.7      53.3      00:11:52
 30993      10   4,235      42,350       863.3      54.0      00:11:40
 31419       8   4,235      33,880       875.6      54.8      00:11:27
 31818       8   4,235      33,880       887.4      55.5      00:11:15
 32265       9   4,235      38,115       900.8      56.3      00:10:60
 32629       9   4,235      38,115       911.5      57.0      00:10:50
 32902       8   4,235      33,880       919.5      57.5      00:10:44
 33171       9   4,235      38,115       927.5      58.0      00:10:38
 33564       7   4,235      29,645       939.0      58.7      00:10:27
 33950       8   4,235      33,880       950.4      59.4      00:10:15
 34335       6   4,235      25,410       962.0      60.2      00:10:04
 34793       6   4,235      25,410       975.4      61.0      00:09:49
 35256       8   4,235      33,880       989.1      61.9      00:09:34
 35681       9   4,235      38,115     1,001.6      62.6      00:09:22
 36142       9   4,235      38,115     1,015.0      63.5      00:09:08
 36581       8   4,235      33,880     1,027.7      64.3      00:08:55
 36881       3   4,235      12,705     1,036.1      64.8      00:08:48
 37172       1   4,235       4,235     1,044.2      65.3      00:08:42
 37460       5   4,235      21,175     1,051.8      65.8      00:08:36
 37767       9   4,235      38,115     1,060.2      66.3      00:08:29
 38080       9   4,235      38,115     1,069.2      66.9      00:08:21
 38365       9   4,235      38,115     1,077.4      67.4      00:08:15
 38674       7   4,235      29,645     1,086.4      67.9      00:08:07
 39001       7   4,235      29,645     1,095.8      68.5      00:07:58
 39262       4   4,235      16,940     1,103.0      69.0      00:07:53
 39536       8   4,235      33,880     1,110.7      69.5      00:07:47
 39826       8   4,235      33,880     1,118.6      70.0      00:07:40
 40176      10   4,235      42,350     1,128.5      70.6      00:07:31
 40566       7   4,235      29,645     1,139.7      71.3      00:07:20
 40987       7   4,235      29,645     1,152.0      72.0      00:07:08
 41282       3   4,235      12,705     1,160.4      72.6      00:07:00
 41633       7   4,235      29,645     1,170.4      73.2      00:06:51
 41975       6   4,235      25,410     1,180.4      73.8      00:06:41
 42306       8   4,235      33,880     1,189.1      74.4      00:06:34
 42622       7   4,235      29,645     1,198.0      74.9      00:06:26
 42939       9   4,235      38,115     1,207.0      75.5      00:06:17
 43283       5   4,235      21,175     1,217.2      76.1      00:06:08
 43648       8   4,235      33,880     1,227.4      76.8      00:05:58
 43982      10   4,235      42,350     1,236.9      77.3      00:05:49
 44304       8   4,235      33,880     1,245.9      77.9      00:05:41
 44681       7   4,235      29,645     1,256.3      78.6      00:05:31
 45025       5   4,235      21,175     1,266.1      79.2      00:05:21
 45433       6   4,235      25,410     1,276.9      79.9      00:05:11
 45829       7   4,235      29,645     1,287.6      80.5      00:05:00
 46180       6   4,235      25,410     1,297.6      81.1      00:04:51
 46543       6   4,235      25,410     1,308.0      81.8      00:04:41
 46948       6   4,235      25,410     1,319.6      82.5      00:04:29
 47282      10   4,235      42,350     1,328.2      83.1      00:04:22
 47664      10   4,235      42,350     1,338.6      83.7      00:04:11
 48016       8   4,235      33,880     1,348.5      84.3      00:04:02
 48327       7   4,235      29,645     1,357.3      84.9      00:03:54
 48725       7   4,235      29,645     1,368.6      85.6      00:03:43
 49119       6   4,235      25,410     1,379.5      86.3      00:03:32
 49525       9   4,235      38,115     1,390.7      87.0      00:03:21
 50011       8   4,235      33,880     1,403.8      87.8      00:03:08
 50442       6   4,235      25,410     1,415.4      88.5      00:02:57
 50795       4   4,235      16,940     1,425.4      89.1      00:02:47
 51142       7   4,235      29,645     1,435.5      89.8      00:02:38
 51445       7   4,235      29,645     1,444.1      90.3      00:02:29
 51727      10   4,235      42,350     1,452.4      90.8      00:02:22
 52008       9   4,235      38,115     1,460.6      91.3      00:02:14
 52315       7   4,235      29,645     1,469.9      91.9      00:02:05
 52732       9   4,235      38,115     1,482.9      92.7      00:01:52
 53159      10   4,235      42,350     1,495.6      93.5      00:01:40
 53601       9   4,235      38,115     1,508.6      94.3      00:01:27
 53961       8   4,235      33,880     1,518.8      95.0      00:01:17
 54295       3   4,235      12,705     1,528.3      95.6      00:01:08
 54600       9   4,235      38,115     1,536.3      96.1      00:01:01
 54922       5   4,235      21,175     1,545.3      96.6      00:00:52
 55210       6   4,235      25,410     1,553.3      97.1      00:00:44
 55479       6   4,235      25,410     1,560.4      97.6      00:00:37
 55749       9   4,235      38,115     1,567.9      98.0      00:00:30
 56068       7   4,235      29,645     1,577.1      98.6      00:00:21
 56376       7   4,235      29,645     1,586.1      99.2      00:00:13
 56704       6   4,235      25,410     1,595.7      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1561.388
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
