
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A800_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   226       3   4,835      14,505         6.2       0.3      00:48:46
   473       9   4,835      43,515        13.2       0.7      00:45:50
   699       9   4,835      43,515        19.8       1.1      00:45:40
   927       9   4,835      43,515        26.6       1.5      00:45:18
  1143       9   4,835      43,515        33.4       1.8      00:44:51
  1348      10   4,835      48,350        39.9       2.2      00:44:51
  1553       8   4,835      38,680        46.4       2.5      00:44:51
  1767       6   4,835      29,010        53.2       2.9      00:44:34
  1990       4   4,835      19,340        59.9       3.3      00:44:20
  2221       7   4,835      33,845        67.2       3.7      00:43:42
  2450      10   4,835      48,350        74.1       4.1      00:43:25
  2686       7   4,835      33,845        81.4       4.5      00:42:58
  2915       7   4,835      33,845        88.7       4.9      00:42:31
  3158      10   4,835      48,350        96.4       5.3      00:41:57
  3395       6   4,835      29,010       104.1       5.7      00:41:26
  3597      10   4,835      48,350       110.5       6.1      00:41:29
  3797       5   4,835      24,175       116.9       6.4      00:41:30
  3996       6   4,835      29,010       122.7       6.7      00:41:43
  4160       7   4,835      33,845       127.8       7.0      00:42:10
  4356       8   4,835      38,680       133.5       7.3      00:42:22
  4545      10   4,835      48,350       139.5       7.6      00:42:24
  4713       9   4,835      43,515       145.0       7.9      00:42:35
  4902       5   4,835      24,175       150.9       8.3      00:42:39
  5095       8   4,835      38,680       156.8       8.6      00:42:40
  5275      10   4,835      48,350       162.4       8.9      00:42:46
  5455       7   4,835      33,845       168.2       9.2      00:42:49
  5627       7   4,835      33,845       173.0       9.5      00:43:06
  5821       8   4,835      38,680       178.9       9.8      00:43:03
  6049      10   4,835      48,350       186.2      10.2      00:42:39
  6287       4   4,835      19,340       193.4      10.6      00:42:17
  6523       2   4,835       9,670       200.5      11.0      00:41:58
  6768       8   4,835      38,680       208.0      11.4      00:41:34
  7021       6   4,835      29,010       215.7      11.8      00:41:08
  7252      10   4,835      48,350       222.7      12.2      00:40:52
  7441       5   4,835      24,175       228.9      12.5      00:40:47
  7642       8   4,835      38,680       235.2      12.9      00:40:39
  7824       7   4,835      33,845       241.0      13.2      00:40:37
  8018       8   4,835      38,680       247.6      13.6      00:40:27
  8215       9   4,835      43,515       254.2      13.9      00:40:16
  8412       8   4,835      38,680       260.7      14.3      00:40:06
  8601      10   4,835      48,350       267.0      14.6      00:39:58
  8795       6   4,835      29,010       273.2      15.0      00:39:51
  8965       7   4,835      33,845       278.9      15.3      00:39:49
  9164       9   4,835      43,515       285.5      15.7      00:39:38
  9328       7   4,835      33,845       290.9      15.9      00:39:39
  9498       9   4,835      43,515       296.6      16.3      00:39:36
  9657       8   4,835      38,680       302.1      16.6      00:39:35
  9829       9   4,835      43,515       307.7      16.9      00:39:32
 10017       4   4,835      19,340       313.4      17.2      00:39:28
 10217       8   4,835      38,680       319.2      17.5      00:39:24
 10390       6   4,835      29,010       324.6      17.8      00:39:23
 10568       6   4,835      29,010       330.1      18.1      00:39:20
 10813       7   4,835      33,845       337.6      18.5      00:39:00
 11052      10   4,835      48,350       345.2      18.9      00:38:40
 11241       2   4,835       9,670       351.1      19.2      00:38:34
 11410       8   4,835      38,680       356.5      19.5      00:38:31
 11597       7   4,835      33,845       362.2      19.9      00:38:27
 11761       8   4,835      38,680       367.5      20.1      00:38:25
 11930       5   4,835      24,175       372.8      20.4      00:38:23
 12098       8   4,835      38,680       378.3      20.7      00:38:19
 12309       4   4,835      19,340       384.8      21.1      00:38:08
 12546       2   4,835       9,670       392.4      21.5      00:37:48
 12782       6   4,835      29,010       399.6      21.9      00:37:32
 13026       8   4,835      38,680       407.2      22.3      00:37:13
 13277       7   4,835      33,845       415.1      22.8      00:36:52
 13502       7   4,835      33,845       422.8      23.2      00:36:33
 13664      10   4,835      48,350       428.1      23.5      00:36:31
 13842       9   4,835      43,515       433.7      23.8      00:36:26
 14021       6   4,835      29,010       439.1      24.1      00:36:22
 14210      10   4,835      48,350       445.4      24.4      00:36:13
 14419       4   4,835      19,340       452.2      24.8      00:36:00
 14607       8   4,835      38,680       458.3      25.1      00:35:52
 14802       7   4,835      33,845       464.6      25.5      00:35:42
 15011       8   4,835      38,680       471.4      25.8      00:35:30
 15187       8   4,835      38,680       477.3      26.2      00:35:22
 15410       5   4,835      24,175       484.4      26.6      00:35:08
 15632       4   4,835      19,340       491.5      26.9      00:34:54
 15834       9   4,835      43,515       498.1      27.3      00:34:42
 16027       7   4,835      33,845       504.7      27.7      00:34:31
 16232       5   4,835      24,175       511.5      28.0      00:34:19
 16421       9   4,835      43,515       517.9      28.4      00:34:08
 16626       7   4,835      33,845       524.3      28.7      00:33:59
 16845       8   4,835      38,680       531.4      29.1      00:33:45
 17009       9   4,835      43,515       536.9      29.4      00:33:40
 17160       9   4,835      43,515       541.5      29.7      00:33:39
 17323       6   4,835      29,010       547.0      30.0      00:33:33
 17479      10   4,835      48,350       552.4      30.3      00:33:29
 17627       7   4,835      33,845       557.3      30.5      00:33:26
 17851       8   4,835      38,680       564.3      30.9      00:33:13
 18062       7   4,835      33,845       571.2      31.3      00:32:60
 18268       8   4,835      38,680       577.9      31.7      00:32:48
 18469      10   4,835      48,350       584.0      32.0      00:32:39
 18616       6   4,835      29,010       589.0      32.3      00:32:36
 18795       8   4,835      38,680       594.9      32.6      00:32:28
 19010       7   4,835      33,845       602.2      33.0      00:32:13
 19222       8   4,835      38,680       609.3      33.4      00:31:60
 19429       5   4,835      24,175       616.1      33.8      00:31:47
 19658       7   4,835      33,845       623.9      34.2      00:31:31
 19858       5   4,835      24,175       630.6      34.6      00:31:19
 20079       9   4,835      43,515       638.4      35.0      00:31:03
 20291       9   4,835      43,515       645.1      35.4      00:30:51
 20494       6   4,835      29,010       651.8      35.7      00:30:40
 20653       7   4,835      33,845       657.1      36.0      00:30:35
 20814      10   4,835      48,350       662.3      36.3      00:30:30
 20981      10   4,835      48,350       667.8      36.6      00:30:23
 21197       3   4,835      14,505       674.3      37.0      00:30:13
 21426      10   4,835      48,350       681.1      37.3      00:30:01
 21648       8   4,835      38,680       688.0      37.7      00:29:49
 21851       8   4,835      38,680       694.1      38.0      00:29:40
 22077       7   4,835      33,845       700.8      38.4      00:29:28
 22310      10   4,835      48,350       707.9      38.8      00:29:15
 22496       8   4,835      38,680       713.6      39.1      00:29:08
 22700       2   4,835       9,670       719.9      39.5      00:28:58
 22917       8   4,835      38,680       726.1      39.8      00:28:49
 23094       6   4,835      29,010       731.9      40.1      00:28:41
 23258      10   4,835      48,350       737.2      40.4      00:28:35
 23403       8   4,835      38,680       741.8      40.7      00:28:32
 23617       9   4,835      43,515       748.0      41.0      00:28:22
 23785       8   4,835      38,680       753.5      41.3      00:28:16
 23960      10   4,835      48,350       759.0      41.6      00:28:09
 24147      10   4,835      48,350       764.6      41.9      00:28:01
 24336      10   4,835      48,350       770.3      42.2      00:27:54
 24534       5   4,835      24,175       776.7      42.6      00:27:44
 24727       7   4,835      33,845       783.1      42.9      00:27:33
 24934       8   4,835      38,680       789.4      43.3      00:27:23
 25122       9   4,835      43,515       795.6      43.6      00:27:14
 25321       3   4,835      14,505       802.0      44.0      00:27:03
 25504       8   4,835      38,680       807.9      44.3      00:26:55
 25663       5   4,835      24,175       812.7      44.5      00:26:50
 25847       6   4,835      29,010       818.9      44.9      00:26:40
 26014       6   4,835      29,010       824.2      45.2      00:26:34
 26216       7   4,835      33,845       830.8      45.5      00:26:23
 26478       5   4,835      24,175       838.8      46.0      00:26:07
 26686      10   4,835      48,350       845.3      46.3      00:25:56
 26906       8   4,835      38,680       852.4      46.7      00:25:44
 27109      10   4,835      48,350       858.9      47.1      00:25:33
 27313       9   4,835      43,515       865.3      47.4      00:25:23
 27501       8   4,835      38,680       871.4      47.8      00:25:13
 27687      10   4,835      48,350       877.4      48.1      00:25:04
 27862      10   4,835      48,350       883.2      48.4      00:24:56
 28140       9   4,835      43,515       892.3      48.9      00:24:37
 28415       7   4,835      33,845       901.3      49.4      00:24:18
 28660       2   4,835       9,670       909.5      49.9      00:24:02
 28830       5   4,835      24,175       915.3      50.2      00:23:54
 28999       4   4,835      19,340       920.8      50.5      00:23:47
 29221       7   4,835      33,845       927.8      50.9      00:23:35
 29484       8   4,835      38,680       936.5      51.3      00:23:17
 29730       6   4,835      29,010       944.5      51.8      00:23:02
 29924       7   4,835      33,845       950.7      52.1      00:22:53
 30116       8   4,835      38,680       957.0      52.5      00:22:43
 30314       7   4,835      33,845       963.6      52.8      00:22:33
 30505       6   4,835      29,010       970.0      53.2      00:22:22
 30726       8   4,835      38,680       977.2      53.6      00:22:10
 31016       8   4,835      38,680       986.6      54.1      00:21:51
 31302       4   4,835      19,340       996.1      54.6      00:21:32
 31575      10   4,835      48,350     1,005.3      55.1      00:21:14
 31847      10   4,835      48,350     1,014.6      55.6      00:20:56
 32136       6   4,835      29,010     1,024.4      56.2      00:20:37
 32436       5   4,835      24,175     1,034.8      56.7      00:20:16
 32651       6   4,835      29,010     1,041.8      57.1      00:20:05
 32791       5   4,835      24,175     1,046.6      57.4      00:19:60
 32960       7   4,835      33,845     1,052.2      57.7      00:19:52
 33106       9   4,835      43,515     1,057.2      57.9      00:19:46
 33353      10   4,835      48,350     1,065.3      58.4      00:19:32
 33623      10   4,835      48,350     1,074.5      58.9      00:19:14
 33900       8   4,835      38,680     1,083.8      59.4      00:18:57
 34157       6   4,835      29,010     1,092.7      59.9      00:18:41
 34424       7   4,835      33,845     1,101.6      60.4      00:18:25
 34661       9   4,835      43,515     1,109.5      60.8      00:18:12
 34874       7   4,835      33,845     1,116.9      61.2      00:17:60
 35097       8   4,835      38,680     1,124.2      61.6      00:17:48
 35323      10   4,835      48,350     1,131.9      62.0      00:17:35
 35561       8   4,835      38,680     1,139.8      62.5      00:17:22
 35808       5   4,835      24,175     1,147.9      62.9      00:17:08
 36028       6   4,835      29,010     1,155.2      63.3      00:16:56
 36258       7   4,835      33,845     1,163.0      63.8      00:16:43
 36497       7   4,835      33,845     1,170.9      64.2      00:16:30
 36657       7   4,835      33,845     1,176.2      64.5      00:16:23
 36815       9   4,835      43,515     1,181.2      64.7      00:16:17
 36998       7   4,835      33,845     1,187.0      65.1      00:16:09
 37215       4   4,835      19,340     1,193.6      65.4      00:15:59
 37441       1   4,835       4,835     1,200.6      65.8      00:15:48
 37641       7   4,835      33,845     1,207.0      66.2      00:15:39
 37839       8   4,835      38,680     1,213.2      66.5      00:15:29
 38029       8   4,835      38,680     1,219.4      66.8      00:15:20
 38174       8   4,835      38,680     1,224.2      67.1      00:15:14
 38357       9   4,835      43,515     1,230.3      67.4      00:15:05
 38559       8   4,835      38,680     1,237.1      67.8      00:14:55
 38845       6   4,835      29,010     1,246.4      68.3      00:14:39
 39055       5   4,835      24,175     1,253.2      68.7      00:14:28
 39226       6   4,835      29,010     1,258.5      69.0      00:14:21
 39397       9   4,835      43,515     1,263.9      69.3      00:14:14
 39585      10   4,835      48,350     1,270.0      69.6      00:14:05
 39777       6   4,835      29,010     1,276.0      69.9      00:13:56
 40047       5   4,835      24,175     1,284.7      70.4      00:13:41
 40340       7   4,835      33,845     1,294.0      70.9      00:13:25
 40595       5   4,835      24,175     1,302.5      71.4      00:13:11
 40849       8   4,835      38,680     1,310.9      71.9      00:12:57
 41026       4   4,835      19,340     1,316.9      72.2      00:12:49
 41200       7   4,835      33,845     1,322.6      72.5      00:12:41
 41423       9   4,835      43,515     1,329.8      72.9      00:12:29
 41646       6   4,835      29,010     1,337.0      73.3      00:12:18
 41853       9   4,835      43,515     1,343.9      73.7      00:12:08
 42027       5   4,835      24,175     1,349.4      74.0      00:11:60
 42199       6   4,835      29,010     1,354.6      74.3      00:11:53
 42383       5   4,835      24,175     1,360.6      74.6      00:11:44
 42538      10   4,835      48,350     1,365.5      74.8      00:11:37
 42737       8   4,835      38,680     1,371.8      75.2      00:11:28
 42935       7   4,835      33,845     1,378.2      75.5      00:11:18
 43080       9   4,835      43,515     1,383.2      75.8      00:11:11
 43183      10   4,835      48,350     1,386.8      76.0      00:11:07
 43285       8   4,835      38,680     1,390.1      76.2      00:11:04
 43374      10   4,835      48,350     1,393.1      76.4      00:11:01
 43500       8   4,835      38,680     1,397.1      76.6      00:10:56
 43702       8   4,835      38,680     1,403.3      76.9      00:10:47
 43894       6   4,835      29,010     1,409.7      77.3      00:10:37
 44088       8   4,835      38,680     1,415.8      77.6      00:10:28
 44233      10   4,835      48,350     1,420.5      77.9      00:10:21
 44396       8   4,835      38,680     1,425.4      78.1      00:10:15
 44551       6   4,835      29,010     1,430.5      78.4      00:10:07
 44703       8   4,835      38,680     1,435.3      78.7      00:10:01
 44852       9   4,835      43,515     1,440.3      78.9      00:09:54
 45025       3   4,835      14,505     1,445.8      79.2      00:09:45
 45233       6   4,835      29,010     1,452.2      79.6      00:09:36
 45439       8   4,835      38,680     1,458.4      79.9      00:09:26
 45595       7   4,835      33,845     1,463.0      80.2      00:09:20
 45718      10   4,835      48,350     1,466.8      80.4      00:09:15
 45881       9   4,835      43,515     1,471.8      80.7      00:09:08
 46039       7   4,835      33,845     1,477.1      81.0      00:08:60
 46206       6   4,835      29,010     1,482.7      81.3      00:08:51
 46381       6   4,835      29,010     1,488.3      81.6      00:08:43
 46533       9   4,835      43,515     1,493.3      81.9      00:08:36
 46702      10   4,835      48,350     1,498.8      82.2      00:08:27
 46876       7   4,835      33,845     1,504.6      82.5      00:08:19
 46979       5   4,835      24,175     1,507.5      82.6      00:08:15
 47115       9   4,835      43,515     1,511.5      82.8      00:08:10
 47249      10   4,835      48,350     1,515.6      83.1      00:08:04
 47376       5   4,835      24,175     1,519.6      83.3      00:07:59
 47508       8   4,835      38,680     1,523.5      83.5      00:07:53
 47649      10   4,835      48,350     1,528.2      83.8      00:07:46
 47813      10   4,835      48,350     1,533.2      84.0      00:07:39
 47979       7   4,835      33,845     1,538.7      84.3      00:07:30
 48154      10   4,835      48,350     1,544.2      84.6      00:07:22
 48292       5   4,835      24,175     1,548.8      84.9      00:07:15
 48427       5   4,835      24,175     1,553.1      85.1      00:07:09
 48615       6   4,835      29,010     1,559.2      85.5      00:06:59
 48824       3   4,835      14,505     1,565.8      85.8      00:06:49
 48939       9   4,835      43,515     1,569.6      86.0      00:06:44
 49063       7   4,835      33,845     1,573.5      86.3      00:06:38
 49168       7   4,835      33,845     1,577.2      86.5      00:06:33
 49319       6   4,835      29,010     1,581.9      86.7      00:06:26
 49489       7   4,835      33,845     1,587.0      87.0      00:06:18
 49682       6   4,835      29,010     1,592.6      87.3      00:06:09
 49860       8   4,835      38,680     1,598.0      87.6      00:06:01
 50028       9   4,835      43,515     1,603.6      87.9      00:05:52
 50168       7   4,835      33,845     1,607.9      88.1      00:05:46
 50308       9   4,835      43,515     1,612.1      88.4      00:05:39
 50485      10   4,835      48,350     1,617.6      88.7      00:05:31
 50679       8   4,835      38,680     1,623.9      89.0      00:05:21
 50860       7   4,835      33,845     1,629.9      89.3      00:05:11
 51009      10   4,835      48,350     1,635.1      89.6      00:05:03
 51159       5   4,835      24,175     1,639.8      89.9      00:04:56
 51331       6   4,835      29,010     1,645.4      90.2      00:04:47
 51533       9   4,835      43,515     1,652.1      90.6      00:04:36
 51733       8   4,835      38,680     1,658.9      90.9      00:04:25
 51934       8   4,835      38,680     1,665.5      91.3      00:04:14
 52131       8   4,835      38,680     1,672.5      91.7      00:04:03
 52332      10   4,835      48,350     1,679.3      92.1      00:03:52
 52506       9   4,835      43,515     1,685.5      92.4      00:03:42
 52698       7   4,835      33,845     1,692.3      92.8      00:03:31
 52905       7   4,835      33,845     1,699.4      93.2      00:03:20
 53130       6   4,835      29,010     1,707.0      93.6      00:03:08
 53345      10   4,835      48,350     1,714.2      94.0      00:02:56
 53569       6   4,835      29,010     1,721.8      94.4      00:02:44
 53740       8   4,835      38,680     1,727.4      94.7      00:02:35
 53889       8   4,835      38,680     1,732.1      94.9      00:02:27
 54028       7   4,835      33,845     1,736.7      95.2      00:02:20
 54177       8   4,835      38,680     1,741.4      95.5      00:02:13
 54310       7   4,835      33,845     1,745.8      95.7      00:02:06
 54440       4   4,835      19,340     1,749.5      95.9      00:02:00
 54631       7   4,835      33,845     1,755.4      96.2      00:01:51
 54815       7   4,835      33,845     1,761.2      96.5      00:01:41
 54970       7   4,835      33,845     1,766.3      96.8      00:01:33
 55070       9   4,835      43,515     1,769.4      97.0      00:01:29
 55161      10   4,835      48,350     1,772.2      97.1      00:01:24
 55292       3   4,835      14,505     1,776.1      97.4      00:01:18
 55485       4   4,835      19,340     1,782.1      97.7      00:01:08
 55674       8   4,835      38,680     1,788.1      98.0      00:00:59
 55849       6   4,835      29,010     1,793.8      98.3      00:00:49
 56046       5   4,835      24,175     1,800.2      98.7      00:00:39
 56221       9   4,835      43,515     1,806.1      99.0      00:00:29
 56375       6   4,835      29,010     1,811.3      99.3      00:00:21
 56536       5   4,835      24,175     1,816.7      99.6      00:00:12
 56727       9   4,835      43,515     1,823.1      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 2968.237
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
