
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K12000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_12000_5_4q_mnl.dta /export/storage_covidvaccine/Result/MNL_part
> ial_new/M5_K12000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_12000_5_4q_m
> nl.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_12000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_12000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   388       6   4,035      24,210         9.0       0.6      00:28:12
   753       4   4,035      16,140        17.8       1.2      00:28:10
  1203       6   4,035      24,210        29.3       1.9      00:25:33
  1585       8   4,035      32,280        39.5       2.6      00:25:04
  2013       5   4,035      20,175        50.4       3.3      00:24:23
  2383       5   4,035      20,175        59.9       3.9      00:24:27
  2777       5   4,035      20,175        70.2       4.6      00:24:10
  3236       5   4,035      20,175        82.3       5.4      00:23:22
  3609       8   4,035      32,280        92.3       6.1      00:23:16
  4003       8   4,035      32,280       102.5       6.7      00:23:08
  4241       3   4,035      12,105       108.5       7.1      00:23:56
  4561       7   4,035      28,245       116.7       7.7      00:24:08
  4784       7   4,035      28,245       122.7       8.1      00:24:45
  5092      10   4,035      40,350       130.7       8.6      00:24:54
  5370       9   4,035      36,315       138.1       9.1      00:25:07
  5565       6   4,035      24,210       142.7       9.4      00:25:50
  5809       7   4,035      28,245       148.8       9.8      00:26:12
  6048       6   4,035      24,210       155.1      10.2      00:26:30
  6302       5   4,035      20,175       161.6      10.6      00:26:43
  6545       9   4,035      36,315       167.7      11.0      00:26:59
  6757       2   4,035       8,070       173.1      11.4      00:27:21
  6965       7   4,035      28,245       178.5      11.7      00:27:40
  7336       9   4,035      36,315       188.0      12.3      00:27:16
  7709       6   4,035      24,210       197.8      13.0      00:26:51
  8010       2   4,035       8,070       206.2      13.5      00:26:39
  8361       2   4,035       8,070       216.0      14.2      00:26:16
  8649      10   4,035      40,350       223.9      14.7      00:26:10
  9023       5   4,035      20,175       234.1      15.4      00:25:44
  9287       4   4,035      16,140       241.5      15.8      00:25:42
  9563       9   4,035      36,315       249.2      16.4      00:25:37
  9787       9   4,035      36,315       255.5      16.8      00:25:41
 10027       8   4,035      32,280       261.7      17.2      00:25:45
 10234       9   4,035      36,315       266.7      17.5      00:25:58
 10479      10   4,035      40,350       273.1      17.9      00:25:59
 10768       9   4,035      36,315       280.5      18.4      00:25:54
 11075      10   4,035      40,350       288.5      18.9      00:25:44
 11303       6   4,035      24,210       294.4      19.3      00:25:48
 11497       4   4,035      16,140       299.6      19.7      00:25:55
 11747       6   4,035      24,210       306.1      20.1      00:25:54
 11962      10   4,035      40,350       311.8      20.5      00:25:57
 12218       8   4,035      32,280       318.8      20.9      00:25:53
 12515       6   4,035      24,210       326.5      21.4      00:25:43
 12880       1   4,035       4,035       335.8      22.0      00:25:24
 13210       9   4,035      36,315       344.5      22.6      00:25:09
 13570       6   4,035      24,210       354.4      23.3      00:24:47
 13761      10   4,035      40,350       359.6      23.6      00:24:52
 13945       8   4,035      32,280       364.4      23.9      00:24:58
 14205       9   4,035      36,315       371.3      24.4      00:24:52
 14477       9   4,035      36,315       378.8      24.9      00:24:43
 14800       8   4,035      32,280       387.5      25.4      00:24:29
 15133       8   4,035      32,280       396.6      26.0      00:24:12
 15497      10   4,035      40,350       406.4      26.7      00:23:52
 15869       5   4,035      20,175       416.4      27.3      00:23:32
 16233       7   4,035      28,245       426.7      28.0      00:23:11
 16546       4   4,035      16,140       435.4      28.6      00:22:57
 16852       5   4,035      20,175       443.5      29.1      00:22:46
 17072       9   4,035      36,315       449.5      29.5      00:22:44
 17322       9   4,035      36,315       456.2      29.9      00:22:40
 17519       6   4,035      24,210       461.9      30.3      00:22:38
 17818       6   4,035      24,210       469.8      30.8      00:22:28
 18121       7   4,035      28,245       478.1      31.4      00:22:16
 18461       4   4,035      16,140       487.1      32.0      00:22:02
 18637       9   4,035      36,315       491.8      32.3      00:22:04
 18925       7   4,035      28,245       499.9      32.8      00:21:53
 19130       5   4,035      20,175       505.6      33.2      00:21:51
 19416      10   4,035      40,350       513.6      33.7      00:21:40
 19804       5   4,035      20,175       524.6      34.4      00:21:18
 20131       5   4,035      20,175       533.9      35.0      00:21:03
 20516       8   4,035      32,280       544.3      35.7      00:20:44
 20745      10   4,035      40,350       550.6      36.1      00:20:39
 20999       5   4,035      20,175       557.6      36.6      00:20:32
 21262       9   4,035      36,315       564.1      37.0      00:20:27
 21556       9   4,035      36,315       571.7      37.5      00:20:17
 21806      10   4,035      40,350       577.7      37.9      00:20:14
 22129       7   4,035      28,245       585.9      38.5      00:20:02
 22376       7   4,035      28,245       592.1      38.9      00:19:58
 22675       7   4,035      28,245       600.0      39.4      00:19:48
 22940       8   4,035      32,280       606.3      39.8      00:19:42
 23193       6   4,035      24,210       613.2      40.2      00:19:35
 23478       4   4,035      16,140       620.7      40.7      00:19:26
 23730       6   4,035      24,210       627.1      41.2      00:19:20
 23950       7   4,035      28,245       633.0      41.5      00:19:16
 24302       9   4,035      36,315       641.9      42.1      00:19:02
 24761       7   4,035      28,245       654.2      42.9      00:18:38
 25241       5   4,035      20,175       667.0      43.8      00:18:14
 25640       5   4,035      20,175       677.3      44.5      00:17:56
 25869       7   4,035      28,245       683.8      44.9      00:17:50
 26114      10   4,035      40,350       690.3      45.3      00:17:44
 26461      10   4,035      40,350       699.3      45.9      00:17:31
 26866      10   4,035      40,350       709.9      46.6      00:17:13
 27202       9   4,035      36,315       718.9      47.2      00:17:00
 27536       7   4,035      28,245       727.8      47.8      00:16:48
 27864       8   4,035      32,280       736.8      48.4      00:16:35
 28239       8   4,035      32,280       746.9      49.0      00:16:19
 28618       5   4,035      20,175       757.7      49.7      00:16:02
 28887       6   4,035      24,210       765.0      50.2      00:15:54
 29196       6   4,035      24,210       773.5      50.8      00:15:42
 29594       8   4,035      32,280       784.1      51.5      00:15:26
 29917       7   4,035      28,245       792.9      52.0      00:15:14
 30258       7   4,035      28,245       802.3      52.7      00:15:01
 30594       8   4,035      32,280       811.6      53.3      00:14:48
 31019       8   4,035      32,280       823.2      54.0      00:14:29
 31487       7   4,035      28,245       836.2      54.9      00:14:08
 31954       8   4,035      32,280       849.4      55.7      00:13:47
 32405       6   4,035      24,210       862.3      56.6      00:13:27
 32733       7   4,035      28,245       871.3      57.2      00:13:15
 32978       5   4,035      20,175       878.2      57.6      00:13:08
 33239       8   4,035      32,280       885.5      58.1      00:12:60
 33570       5   4,035      20,175       894.8      58.7      00:12:47
 33915       6   4,035      24,210       904.5      59.4      00:12:34
 34255       9   4,035      36,315       914.3      60.0      00:12:21
 34725       5   4,035      20,175       927.4      60.9      00:12:01
 35178       9   4,035      36,315       940.2      61.7      00:11:42
 35644       8   4,035      32,280       953.2      62.6      00:11:23
 36038       2   4,035       8,070       964.1      63.3      00:11:09
 36463      10   4,035      40,350       976.0      64.1      00:10:52
 36870       9   4,035      36,315       986.9      64.8      00:10:37
 37258       8   4,035      32,280       996.9      65.4      00:10:24
 37633       8   4,035      32,280     1,006.8      66.1      00:10:12
 37971       6   4,035      24,210     1,015.6      66.7      00:10:01
 38320      10   4,035      40,350     1,025.3      67.3      00:09:49
 38613       7   4,035      28,245     1,033.5      67.8      00:09:39
 38939       9   4,035      36,315     1,042.3      68.4      00:09:29
 39258       6   4,035      24,210     1,050.8      69.0      00:09:19
 39623       4   4,035      16,140     1,060.6      69.6      00:09:07
 40047       8   4,035      32,280     1,071.9      70.4      00:08:52
 40539       6   4,035      24,210     1,085.2      71.2      00:08:34
 40995       4   4,035      16,140     1,097.8      72.1      00:08:17
 41257      10   4,035      40,350     1,105.0      72.5      00:08:10
 41574       7   4,035      28,245     1,113.5      73.1      00:07:60
 41972       8   4,035      32,280     1,124.6      73.8      00:07:46
 42323       6   4,035      24,210     1,133.3      74.4      00:07:35
 42662      10   4,035      40,350     1,142.5      75.0      00:07:24
 42986       8   4,035      32,280     1,151.2      75.6      00:07:14
 43340       8   4,035      32,280     1,161.3      76.2      00:07:02
 43721       7   4,035      28,245     1,171.3      76.9      00:06:50
 44055       5   4,035      20,175     1,180.4      77.5      00:06:39
 44393       4   4,035      16,140     1,189.2      78.1      00:06:29
 44719      10   4,035      40,350     1,198.0      78.6      00:06:18
 45064      10   4,035      40,350     1,207.3      79.2      00:06:07
 45449       9   4,035      36,315     1,217.0      79.9      00:05:56
 45743       6   4,035      24,210     1,224.5      80.4      00:05:47
 46055       9   4,035      36,315     1,232.9      80.9      00:05:38
 46389       2   4,035       8,070     1,242.1      81.5      00:05:27
 46785       4   4,035      16,140     1,252.8      82.2      00:05:14
 47124       8   4,035      32,280     1,261.6      82.8      00:05:04
 47490       6   4,035      24,210     1,270.8      83.4      00:04:53
 47866       8   4,035      32,280     1,280.7      84.1      00:04:41
 48261       5   4,035      20,175     1,291.3      84.8      00:04:28
 48656       7   4,035      28,245     1,302.1      85.5      00:04:16
 49051       5   4,035      20,175     1,312.5      86.1      00:04:03
 49445       6   4,035      24,210     1,323.0      86.8      00:03:51
 50012       8   4,035      32,280     1,337.5      87.8      00:03:33
 50478       6   4,035      24,210     1,349.5      88.6      00:03:19
 50884       9   4,035      36,315     1,360.5      89.3      00:03:06
 51252       6   4,035      24,210     1,370.6      90.0      00:02:54
 51660       6   4,035      24,210     1,381.9      90.7      00:02:41
 52081       8   4,035      32,280     1,393.7      91.5      00:02:28
 52495       7   4,035      28,245     1,405.7      92.3      00:02:14
 52911      10   4,035      40,350     1,418.0      93.1      00:01:59
 53336       8   4,035      32,280     1,429.9      93.9      00:01:46
 53823      10   4,035      40,350     1,443.5      94.7      00:01:30
 54223       6   4,035      24,210     1,454.2      95.4      00:01:18
 54635       9   4,035      36,315     1,464.7      96.1      00:01:06
 55074       3   4,035      12,105     1,476.4      96.9      00:00:53
 55497       5   4,035      20,175     1,487.3      97.6      00:00:41
 55901       8   4,035      32,280     1,498.1      98.3      00:00:28
 56329       5   4,035      20,175     1,509.8      99.1      00:00:15
 56748       5   4,035      20,175     1,521.6      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1699.283
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_12000_5_4q_mnl.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K12000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_12000_5_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
