
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_Do
> llar_locations_total_fixR200.dta /export/storage_covidvaccine/Result/MaxVaxDi
> stLogLin/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR2
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   3 Nov 2023, 20:39:43

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capc
> oef/Dollar/vaccinated/ca_Dollar_locations_total_fixR200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capco
> ef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   508       9   4,035      36,315        11.7       0.8      00:21:31
  1033       8   4,035      32,280        24.8       1.6      00:20:10
  1553      10   4,035      40,350        38.6       2.5      00:19:15
  2079       8   4,035      32,280        52.1       3.4      00:18:51
  2602       3   4,035      12,105        65.5       4.3      00:18:34
  3118       9   4,035      36,315        79.0       5.2      00:18:18
  3623       8   4,035      32,280        92.7       6.1      00:18:02
  4085       7   4,035      28,245       104.6       6.9      00:18:06
  4515       8   4,035      32,280       115.5       7.6      00:18:19
  4927       4   4,035      16,140       126.4       8.3      00:18:27
  5366       7   4,035      28,245       137.9       9.1      00:18:26
  5734       2   4,035       8,070       146.8       9.6      00:18:47
  6067       9   4,035      36,315       155.6      10.2      00:19:04
  6412      10   4,035      40,350       164.4      10.8      00:19:19
  6814      10   4,035      40,350       174.6      11.5      00:19:20
  7288       9   4,035      36,315       186.6      12.3      00:19:08
  7777      10   4,035      40,350       199.7      13.1      00:18:49
  8249       7   4,035      28,245       212.8      14.0      00:18:30
  8738       6   4,035      24,210       226.3      14.9      00:18:11
  9211       8   4,035      32,280       239.4      15.7      00:17:55
  9564       8   4,035      32,280       249.2      16.4      00:17:56
  9941       8   4,035      32,280       259.5      17.0      00:17:53
 10301       2   4,035       8,070       268.3      17.6      00:17:58
 10665      10   4,035      40,350       277.7      18.2      00:17:58
 11068       7   4,035      28,245       288.4      18.9      00:17:53
 11424       8   4,035      32,280       297.7      19.5      00:17:52
 11836       6   4,035      24,210       308.6      20.3      00:17:45
 12249       9   4,035      36,315       319.6      21.0      00:17:36
 12789       7   4,035      28,245       333.4      21.9      00:17:17
 13343       7   4,035      28,245       348.0      22.8      00:16:55
 13744       2   4,035       8,070       359.2      23.6      00:16:46
 14170       4   4,035      16,140       370.4      24.3      00:16:38
 14690      10   4,035      40,350       384.5      25.2      00:16:19
 15244       9   4,035      36,315       399.7      26.2      00:15:57
 15805       7   4,035      28,245       414.7      27.2      00:15:37
 16323       7   4,035      28,245       429.2      28.2      00:15:19
 16741       9   4,035      36,315       440.6      28.9      00:15:11
 17093       6   4,035      24,210       450.0      29.5      00:15:08
 17461       7   4,035      28,245       460.1      30.2      00:15:03
 17875       8   4,035      32,280       471.4      30.9      00:14:54
 18236       5   4,035      20,175       481.3      31.6      00:14:49
 18594       9   4,035      36,315       490.6      32.2      00:14:46
 18991       7   4,035      28,245       501.8      32.9      00:14:37
 19487       9   4,035      36,315       515.5      33.8      00:14:22
 20045       7   4,035      28,245       531.5      34.9      00:14:01
 20561       6   4,035      24,210       545.6      35.8      00:13:46
 20913      10   4,035      40,350       555.3      36.5      00:13:41
 21320       4   4,035      16,140       565.4      37.1      00:13:35
 21718       6   4,035      24,210       575.6      37.8      00:13:28
 22100       4   4,035      16,140       585.3      38.4      00:13:23
 22448       2   4,035       8,070       594.0      39.0      00:13:19
 22807       3   4,035      12,105       603.0      39.6      00:13:15
 23156      10   4,035      40,350       612.2      40.2      00:13:10
 23458       6   4,035      24,210       620.2      40.7      00:13:08
 23772       6   4,035      24,210       628.2      41.2      00:13:05
 24146       4   4,035      16,140       638.0      41.9      00:12:58
 24696       7   4,035      28,245       652.5      42.8      00:12:42
 25260      10   4,035      40,350       667.4      43.8      00:12:25
 25708       7   4,035      28,245       679.2      44.6      00:12:14
 26091       9   4,035      36,315       689.7      45.3      00:12:06
 26580       7   4,035      28,245       702.4      46.1      00:11:54
 27070       5   4,035      20,175       715.4      47.0      00:11:41
 27412       7   4,035      28,245       724.4      47.5      00:11:36
 27763       9   4,035      36,315       734.0      48.2      00:11:29
 28177       6   4,035      24,210       745.3      48.9      00:11:20
 28599       8   4,035      32,280       757.1      49.7      00:11:09
 28952       6   4,035      24,210       766.9      50.3      00:11:02
 29385       8   4,035      32,280       778.6      51.1      00:10:51
 29816       9   4,035      36,315       790.2      51.9      00:10:41
 30202       7   4,035      28,245       800.8      52.6      00:10:33
 30588       7   4,035      28,245       811.4      53.3      00:10:24
 31104       9   4,035      36,315       825.4      54.2      00:10:10
 31629       7   4,035      28,245       840.1      55.1      00:09:55
 32146       7   4,035      28,245       854.8      56.1      00:09:40
 32623       6   4,035      24,210       868.3      57.0      00:09:27
 32969       5   4,035      20,175       878.0      57.6      00:09:20
 33340       9   4,035      36,315       888.4      58.3      00:09:11
 33766       6   4,035      24,210       900.3      59.1      00:09:01
 34178       9   4,035      36,315       912.1      59.9      00:08:50
 34702       9   4,035      36,315       926.7      60.8      00:08:36
 35261       7   4,035      28,245       942.5      61.9      00:08:20
 35818       7   4,035      28,245       957.9      62.9      00:08:05
 36359       7   4,035      28,245       973.1      63.9      00:07:50
 36821      10   4,035      40,350       985.6      64.7      00:07:39
 37235       3   4,035      12,105       996.3      65.4      00:07:30
 37601       7   4,035      28,245     1,005.9      66.0      00:07:23
 37957      10   4,035      40,350     1,015.3      66.6      00:07:16
 38324       7   4,035      28,245     1,025.4      67.3      00:07:08
 38692       7   4,035      28,245     1,035.6      68.0      00:06:60
 39063       3   4,035      12,105     1,045.8      68.6      00:06:52
 39470       8   4,035      32,280     1,056.4      69.3      00:06:43
 39880       6   4,035      24,210     1,067.4      70.1      00:06:34
 40417       5   4,035      20,175     1,081.7      71.0      00:06:20
 40918       6   4,035      24,210     1,095.6      71.9      00:06:08
 41227       5   4,035      20,175     1,104.1      72.5      00:06:01
 41554       6   4,035      24,210     1,112.9      73.0      00:05:55
 41921       8   4,035      32,280     1,123.1      73.7      00:05:46
 42277       4   4,035      16,140     1,132.2      74.3      00:05:39
 42658      10   4,035      40,350     1,142.4      75.0      00:05:31
 42974       9   4,035      36,315     1,150.9      75.5      00:05:24
 43280       8   4,035      32,280     1,159.6      76.1      00:05:17
 43581       8   4,035      32,280     1,167.8      76.6      00:05:11
 43893       8   4,035      32,280     1,176.0      77.2      00:05:05
 44220       7   4,035      28,245     1,184.8      77.8      00:04:58
 44555       8   4,035      32,280     1,193.6      78.3      00:04:51
 44957       8   4,035      32,280     1,204.4      79.1      00:04:41
 45355      10   4,035      40,350     1,214.6      79.7      00:04:33
 45716       6   4,035      24,210     1,223.8      80.3      00:04:25
 46066       8   4,035      32,280     1,233.2      80.9      00:04:17
 46421       4   4,035      16,140     1,242.9      81.6      00:04:09
 46852       5   4,035      20,175     1,254.7      82.4      00:03:58
 47178       7   4,035      28,245     1,262.8      82.9      00:03:52
 47556       4   4,035      16,140     1,272.5      83.5      00:03:43
 47966       6   4,035      24,210     1,283.5      84.2      00:03:34
 48403       6   4,035      24,210     1,295.3      85.0      00:03:23
 48827       3   4,035      12,105     1,306.6      85.8      00:03:13
 49387      10   4,035      40,350     1,321.6      86.7      00:02:59
 49783       9   4,035      36,315     1,331.4      87.4      00:02:51
 50165       3   4,035      12,105     1,341.5      88.1      00:02:42
 50539       9   4,035      36,315     1,351.1      88.7      00:02:33
 50908       5   4,035      20,175     1,361.2      89.3      00:02:25
 51283       8   4,035      32,280     1,371.4      90.0      00:02:16
 51696       7   4,035      28,245     1,382.9      90.8      00:02:05
 52100       8   4,035      32,280     1,394.2      91.5      00:01:55
 52493      10   4,035      40,350     1,405.7      92.3      00:01:45
 52887       9   4,035      36,315     1,417.3      93.0      00:01:35
 53338       8   4,035      32,280     1,430.0      93.9      00:01:23
 53811       5   4,035      20,175     1,443.1      94.7      00:01:11
 54229       6   4,035      24,210     1,454.3      95.5      00:01:02
 54666       4   4,035      16,140     1,465.6      96.2      00:00:52
 55100       4   4,035      16,140     1,477.1      96.9      00:00:41
 55501       8   4,035      32,280     1,487.4      97.6      00:00:32
 55896       8   4,035      32,280     1,497.9      98.3      00:00:23
 56267       6   4,035      24,210     1,508.1      99.0      00:00:14
 56664       8   4,035      32,280     1,519.3      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1359.69
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR200.csv saved

. 
. cap log close

. 
end of do-file
