
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A600.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A600.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A600.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A600.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   495       5   4,635      23,175        13.2       0.8      00:22:01
  1026       6   4,635      27,810        28.3       1.6      00:20:20
  1530       6   4,635      27,810        43.7       2.5      00:19:32
  2066       7   4,635      32,445        59.5       3.4      00:18:59
  2599       6   4,635      27,810        75.2       4.3      00:18:35
  3112       7   4,635      32,445        90.6       5.2      00:18:21
  3617       7   4,635      32,445       106.3       6.1      00:18:04
  4079       2   4,635       9,270       120.0       6.9      00:18:08
  4508       7   4,635      32,445       132.4       7.6      00:18:21
  4894       8   4,635      37,080       144.2       8.2      00:18:35
  5289       1   4,635       4,635       155.9       8.9      00:18:46
  5666       9   4,635      41,715       166.8       9.5      00:19:01
  6062       8   4,635      37,080       178.6      10.2      00:19:05
  6428       8   4,635      37,080       189.2      10.8      00:19:16
  6799       7   4,635      32,445       200.1      11.4      00:19:24
  7227       4   4,635      18,540       212.6      12.1      00:19:19
  7678       3   4,635      13,905       226.4      12.9      00:19:05
  8106       8   4,635      37,080       240.0      13.7      00:18:54
  8528       5   4,635      23,175       253.4      14.5      00:18:43
  8949       3   4,635      13,905       266.6      15.2      00:18:34
  9348       6   4,635      27,810       279.3      16.0      00:18:27
  9706       7   4,635      32,445       290.9      16.6      00:18:25
 10070       8   4,635      37,080       301.9      17.2      00:18:25
 10432       4   4,635      18,540       312.2      17.8      00:18:27
 10842       9   4,635      41,715       324.4      18.5      00:18:20
 11205       9   4,635      41,715       335.4      19.2      00:18:18
 11526       3   4,635      13,905       345.1      19.7      00:18:21
 11883       7   4,635      32,445       355.8      20.3      00:18:19
 12214       6   4,635      27,810       366.0      20.9      00:18:18
 12644       3   4,635      13,905       378.9      21.7      00:18:07
 13110       7   4,635      32,445       392.6      22.4      00:17:53
 13542       9   4,635      41,715       406.3      23.2      00:17:40
 13860       4   4,635      18,540       416.1      23.8      00:17:40
 14209       9   4,635      41,715       426.7      24.4      00:17:36
 14588       9   4,635      41,715       438.5      25.1      00:17:28
 14981       7   4,635      32,445       450.7      25.8      00:17:19
 15407       7   4,635      32,445       464.1      26.5      00:17:07
 15897      10   4,635      46,350       479.3      27.4      00:16:49
 16378       6   4,635      27,810       494.8      28.3      00:16:31
 16693      10   4,635      46,350       504.6      28.8      00:16:29
 16985       7   4,635      32,445       513.7      29.3      00:16:28
 17261       4   4,635      18,540       522.1      29.8      00:16:29
 17576       4   4,635      18,540       532.4      30.4      00:16:25
 17978       5   4,635      23,175       544.6      31.1      00:16:15
 18382       4   4,635      18,540       557.3      31.8      00:16:04
 18832       5   4,635      23,175       571.1      32.6      00:15:51
 19286      10   4,635      46,350       585.8      33.5      00:15:36
 19759       7   4,635      32,445       601.2      34.3      00:15:19
 20245       9   4,635      41,715       616.8      35.2      00:15:02
 20649       4   4,635      18,540       629.5      36.0      00:14:51
 20958      10   4,635      46,350       639.3      36.5      00:14:47
 21301       6   4,635      27,810       649.0      37.1      00:14:43
 21672       7   4,635      32,445       659.9      37.7      00:14:37
 22018      10   4,635      46,350       670.0      38.3      00:14:32
 22338      10   4,635      46,350       679.1      38.8      00:14:29
 22645       8   4,635      37,080       688.2      39.3      00:14:25
 22965       6   4,635      27,810       697.3      39.8      00:14:22
 23294       7   4,635      32,445       707.6      40.4      00:14:16
 23695      10   4,635      46,350       719.3      41.1      00:14:07
 24028      10   4,635      46,350       729.4      41.7      00:14:01
 24474       9   4,635      41,715       742.5      42.4      00:13:49
 24913       7   4,635      32,445       756.0      43.2      00:13:36
 25366       2   4,635       9,270       769.9      44.0      00:13:23
 25756      10   4,635      46,350       781.8      44.7      00:13:14
 26103      10   4,635      46,350       792.6      45.3      00:13:06
 26506       8   4,635      37,080       804.7      46.0      00:12:57
 26893      10   4,635      46,350       816.3      46.6      00:12:47
 27268       9   4,635      41,715       827.8      47.3      00:12:39
 27597      10   4,635      46,350       837.9      47.9      00:12:32
 28013       6   4,635      27,810       851.0      48.6      00:12:21
 28492       9   4,635      41,715       866.2      49.5      00:12:06
 28845       8   4,635      37,080       877.5      50.1      00:11:57
 29154       9   4,635      41,715       887.2      50.7      00:11:51
 29528       8   4,635      37,080       898.8      51.4      00:11:42
 29837       9   4,635      41,715       908.4      51.9      00:11:36
 30101       7   4,635      32,445       916.6      52.4      00:11:32
 30409       7   4,635      32,445       926.2      52.9      00:11:26
 30806       7   4,635      32,445       939.0      53.7      00:11:15
 31269       9   4,635      41,715       953.5      54.5      00:11:01
 31728       8   4,635      37,080       968.2      55.3      00:10:47
 32185       5   4,635      23,175       983.2      56.2      00:10:33
 32598       6   4,635      27,810       996.6      56.9      00:10:21
 32918       8   4,635      37,080     1,006.8      57.5      00:10:14
 33249       4   4,635      18,540     1,017.5      58.1      00:10:06
 33636      10   4,635      46,350     1,030.1      58.9      00:09:55
 34002       8   4,635      37,080     1,041.9      59.5      00:09:46
 34415       5   4,635      23,175     1,055.4      60.3      00:09:34
 34894       6   4,635      27,810     1,070.9      61.2      00:09:19
 35366       9   4,635      41,715     1,086.0      62.1      00:09:05
 35824       5   4,635      23,175     1,100.5      62.9      00:08:52
 36287       5   4,635      23,175     1,115.4      63.7      00:08:39
 36709       8   4,635      37,080     1,128.8      64.5      00:08:27
 37056      10   4,635      46,350     1,139.4      65.1      00:08:19
 37407       8   4,635      37,080     1,149.6      65.7      00:08:12
 37730       7   4,635      32,445     1,159.3      66.2      00:08:05
 38055       8   4,635      37,080     1,169.3      66.8      00:07:58
 38379       9   4,635      41,715     1,179.6      67.4      00:07:50
 38700       8   4,635      37,080     1,189.9      68.0      00:07:42
 39023       7   4,635      32,445     1,200.0      68.6      00:07:35
 39377       7   4,635      32,445     1,210.8      69.2      00:07:26
 39783       4   4,635      18,540     1,223.0      69.9      00:07:16
 40239       9   4,635      41,715     1,237.1      70.7      00:07:04
 40710       6   4,635      27,810     1,251.9      71.5      00:06:51
 41111       9   4,635      41,715     1,264.6      72.3      00:06:40
 41496       3   4,635      13,905     1,276.7      72.9      00:06:30
 41889       8   4,635      37,080     1,289.0      73.7      00:06:20
 42257       9   4,635      41,715     1,300.0      74.3      00:06:11
 42602       9   4,635      41,715     1,310.6      74.9      00:06:03
 42956      10   4,635      46,350     1,321.5      75.5      00:05:54
 43285      10   4,635      46,350     1,332.2      76.1      00:05:46
 43643       7   4,635      32,445     1,343.2      76.7      00:05:37
 43996       6   4,635      27,810     1,354.1      77.4      00:05:28
 44305       4   4,635      18,540     1,363.6      77.9      00:05:21
 44652       4   4,635      18,540     1,374.1      78.5      00:05:12
 45037       8   4,635      37,080     1,386.0      79.2      00:05:03
 45433       6   4,635      27,810     1,397.5      79.9      00:04:53
 45753       7   4,635      32,445     1,406.8      80.4      00:04:46
 46133       6   4,635      27,810     1,418.6      81.1      00:04:36
 46502       9   4,635      41,715     1,430.2      81.7      00:04:27
 46922       7   4,635      32,445     1,443.5      82.5      00:04:15
 47257       6   4,635      27,810     1,452.9      83.0      00:04:08
 47609      10   4,635      46,350     1,463.4      83.6      00:03:59
 47924       5   4,635      23,175     1,472.9      84.2      00:03:52
 48245       7   4,635      32,445     1,482.8      84.7      00:03:44
 48583       7   4,635      32,445     1,493.4      85.3      00:03:35
 48943       8   4,635      37,080     1,504.5      86.0      00:03:26
 49304       6   4,635      27,810     1,515.7      86.6      00:03:17
 49661      10   4,635      46,350     1,525.9      87.2      00:03:08
 50004      10   4,635      46,350     1,536.2      87.8      00:02:60
 50368      10   4,635      46,350     1,546.9      88.4      00:02:51
 50723       9   4,635      41,715     1,557.7      89.0      00:02:42
 51049       6   4,635      27,810     1,568.2      89.6      00:02:33
 51386       7   4,635      32,445     1,578.6      90.2      00:02:25
 51718       7   4,635      32,445     1,589.3      90.8      00:02:16
 52095       6   4,635      27,810     1,601.4      91.5      00:02:06
 52442       9   4,635      41,715     1,613.0      92.2      00:01:56
 52773       9   4,635      41,715     1,624.3      92.8      00:01:46
 53117       5   4,635      23,175     1,635.5      93.5      00:01:37
 53556       4   4,635      18,540     1,649.6      94.3      00:01:25
 53940       7   4,635      32,445     1,661.6      94.9      00:01:15
 54245       9   4,635      41,715     1,671.1      95.5      00:01:07
 54595       5   4,635      23,175     1,681.2      96.1      00:00:58
 54967       4   4,635      18,540     1,692.7      96.7      00:00:49
 55321       3   4,635      13,905     1,703.3      97.3      00:00:40
 55658       8   4,635      37,080     1,713.1      97.9      00:00:31
 55964       4   4,635      18,540     1,722.8      98.4      00:00:23
 56320       8   4,635      37,080     1,734.0      99.1      00:00:14
 56675      10   4,635      46,350     1,745.6      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1491.129
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A600.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A600.csv saved

. 
. cap log close

. 
end of do-file
