
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed940.dta /export/storage_covidva
> ccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_d
> ist_total_10000_5_4q_mnl_A1000_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed940.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed940.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   195      10   5,035      50,350         5.5       0.3      00:57:29
   402       2   5,035      10,070        11.8       0.6      00:53:47
   630       4   5,035      20,140        18.5       1.0      00:50:53
   824       6   5,035      30,210        24.8       1.3      00:50:37
  1008       8   5,035      40,280        30.3       1.6      00:51:40
  1184       8   5,035      40,280        36.1       1.9      00:51:51
  1382       9   5,035      45,315        42.7       2.2      00:50:57
  1583       6   5,035      30,210        49.4       2.6      00:50:07
  1784      10   5,035      50,350        55.9       2.9      00:49:38
  1998       3   5,035      15,105        62.6       3.3      00:49:06
  2164       5   5,035      25,175        68.0       3.6      00:49:34
  2372       7   5,035      35,245        74.6       3.9      00:49:05
  2558       6   5,035      30,210        80.6       4.2      00:49:05
  2765       8   5,035      40,280        87.5       4.6      00:48:30
  2974       6   5,035      30,210        94.0       4.9      00:48:11
  3150       7   5,035      35,245       100.1       5.3      00:48:07
  3362       8   5,035      40,280       107.4       5.7      00:47:27
  3553       8   5,035      40,280       113.8       6.0      00:47:16
  3780       8   5,035      40,280       121.2       6.4      00:46:37
  3950       9   5,035      45,315       126.4       6.7      00:46:56
  4056      10   5,035      50,350       129.8       6.8      00:47:54
  4172       7   5,035      35,245       133.5       7.0      00:48:42
  4303       9   5,035      45,315       137.3       7.2      00:49:23
  4428       3   5,035      15,105       141.4       7.4      00:49:57
  4540       8   5,035      40,280       145.1       7.6      00:50:35
  4638      10   5,035      50,350       148.4       7.8      00:51:23
  4758      10   5,035      50,350       152.5       8.0      00:51:50
  4881       9   5,035      45,315       156.4       8.2      00:52:17
  4997       8   5,035      40,280       160.2       8.4      00:52:45
  5099       8   5,035      40,280       163.4       8.6      00:53:24
  5211       4   5,035      20,140       167.2       8.8      00:53:49
  5325      10   5,035      50,350       170.9       9.0      00:54:14
  5428       5   5,035      25,175       174.3       9.2      00:54:43
  5535       8   5,035      40,280       177.4       9.3      00:55:19
  5666       7   5,035      35,245       181.4       9.5      00:55:34
  5784       5   5,035      25,175       185.1       9.7      00:55:53
  5917      10   5,035      50,350       189.4      10.0      00:55:58
  6025       5   5,035      25,175       193.1      10.2      00:56:17
  6179       5   5,035      25,175       197.9      10.4      00:56:12
  6310      10   5,035      50,350       202.1      10.6      00:56:17
  6427       3   5,035      15,105       205.8      10.8      00:56:33
  6547       9   5,035      45,315       209.6      11.0      00:56:44
  6656       4   5,035      20,140       213.0      11.2      00:57:02
  6780       7   5,035      35,245       217.0      11.4      00:57:10
  6894       4   5,035      20,140       220.7      11.6      00:57:20
  7039       9   5,035      45,315       225.3      11.9      00:57:16
  7219      10   5,035      50,350       230.9      12.2      00:56:55
  7386       5   5,035      25,175       236.5      12.5      00:56:32
  7559       6   5,035      30,210       242.2      12.7      00:56:10
  7728      10   5,035      50,350       247.7      13.0      00:55:51
  7881       7   5,035      35,245       253.0      13.3      00:55:35
  8034       7   5,035      35,245       258.4      13.6      00:55:19
  8172       4   5,035      20,140       263.2      13.9      00:55:11
  8331       8   5,035      40,280       268.6      14.1      00:54:54
  8474       4   5,035      20,140       273.7      14.4      00:54:44
  8648      10   5,035      50,350       279.5      14.7      00:54:21
  8821      10   5,035      50,350       285.4      15.0      00:53:59
  9006       7   5,035      35,245       291.8      15.4      00:53:31
  9168       7   5,035      35,245       297.5      15.7      00:53:12
  9292       8   5,035      40,280       301.8      15.9      00:53:12
  9420       8   5,035      40,280       306.1      16.1      00:53:11
  9530      10   5,035      50,350       309.9      16.3      00:53:16
  9647       7   5,035      35,245       314.2      16.5      00:53:15
  9773       6   5,035      30,210       318.5      16.8      00:53:12
  9912       4   5,035      20,140       323.1      17.0      00:53:08
 10033      10   5,035      50,350       326.9      17.2      00:53:11
 10162       6   5,035      30,210       330.7      17.4      00:53:14
 10280      10   5,035      50,350       334.4      17.6      00:53:19
 10397       9   5,035      45,315       338.2      17.8      00:53:22
 10508       2   5,035      10,070       341.9      18.0      00:53:25
 10687       8   5,035      40,280       347.6      18.3      00:53:06
 10849      10   5,035      50,350       352.9      18.6      00:52:52
 11007       5   5,035      25,175       358.1      18.8      00:52:38
 11145       8   5,035      40,280       362.5      19.1      00:52:33
 11265       6   5,035      30,210       366.4      19.3      00:52:34
 11382       8   5,035      40,280       370.3      19.5      00:52:35
 11494       6   5,035      30,210       374.1      19.7      00:52:36
 11599       8   5,035      40,280       377.3      19.9      00:52:44
 11718       8   5,035      40,280       381.3      20.1      00:52:43
 11855       6   5,035      30,210       385.8      20.3      00:52:35
 11981       6   5,035      30,210       389.9      20.5      00:52:33
 12080       6   5,035      30,210       393.4      20.7      00:52:36
 12202       5   5,035      25,175       397.4      20.9      00:52:33
 12350      10   5,035      50,350       402.2      21.2      00:52:24
 12538       7   5,035      35,245       408.5      21.5      00:51:59
 12769       5   5,035      25,175       415.6      21.9      00:51:26
 12970       9   5,035      45,315       422.1      22.2      00:51:01
 13170       6   5,035      30,210       428.8      22.6      00:50:34
 13388       9   5,035      45,315       436.0      23.0      00:50:03
 13550      10   5,035      50,350       441.8      23.3      00:49:45
 13670       5   5,035      25,175       446.1      23.5      00:49:41
 13785       8   5,035      40,280       449.7      23.7      00:49:41
 13907       6   5,035      30,210       453.6      23.9      00:49:40
 14046       8   5,035      40,280       458.2      24.1      00:49:32
 14205       3   5,035      15,105       463.6      24.4      00:49:17
 14366       8   5,035      40,280       469.2      24.7      00:49:01
 14509       6   5,035      30,210       474.0      25.0      00:48:52
 14661       9   5,035      45,315       479.1      25.2      00:48:40
 14818       7   5,035      35,245       484.3      25.5      00:48:28
 15005       4   5,035      20,140       490.7      25.8      00:48:06
 15191       8   5,035      40,280       497.2      26.2      00:47:43
 15396       6   5,035      30,210       504.0      26.5      00:47:19
 15580      10   5,035      50,350       510.1      26.8      00:47:00
 15758       5   5,035      25,175       516.1      27.2      00:46:41
 15943       6   5,035      30,210       522.5      27.5      00:46:21
 16138       9   5,035      45,315       529.5      27.9      00:45:56
 16315      10   5,035      50,350       535.6      28.2      00:45:39
 16481       4   5,035      20,140       541.4      28.5      00:45:22
 16639       7   5,035      35,245       546.4      28.8      00:45:13
 16758      10   5,035      50,350       550.6      29.0      00:45:08
 16892       6   5,035      30,210       555.0      29.2      00:45:03
 16995       8   5,035      40,280       558.5      29.4      00:45:02
 17110       6   5,035      30,210       562.3      29.6      00:45:00
 17226       9   5,035      45,315       566.2      29.8      00:44:58
 17331      10   5,035      50,350       569.9      30.0      00:44:56
 17451      10   5,035      50,350       574.1      30.2      00:44:51
 17550       6   5,035      30,210       577.7      30.4      00:44:50
 17696      10   5,035      50,350       582.6      30.7      00:44:40
 17841       7   5,035      35,245       587.3      30.9      00:44:32
 17975       8   5,035      40,280       591.8      31.2      00:44:25
 18106      10   5,035      50,350       596.4      31.4      00:44:17
 18315       7   5,035      35,245       603.4      31.8      00:43:53
 18490      10   5,035      50,350       608.9      32.1      00:43:40
 18604      10   5,035      50,350       612.9      32.3      00:43:36
 18735       7   5,035      35,245       617.5      32.5      00:43:28
 18873       9   5,035      45,315       622.2      32.8      00:43:19
 19011       7   5,035      35,245       627.2      33.0      00:43:09
 19125      10   5,035      50,350       631.1      33.2      00:43:05
 19256       6   5,035      30,210       635.6      33.5      00:42:58
 19443      10   5,035      50,350       642.1      33.8      00:42:38
 19635       9   5,035      45,315       648.8      34.2      00:42:18
 19813       7   5,035      35,245       655.2      34.5      00:41:59
 20026       6   5,035      30,210       662.9      34.9      00:41:33
 20246       8   5,035      40,280       670.2      35.3      00:41:10
 20466      10   5,035      50,350       677.8      35.7      00:40:45
 20582       9   5,035      45,315       681.8      35.9      00:40:41
 20717       5   5,035      25,175       686.4      36.1      00:40:33
 20828       8   5,035      40,280       690.3      36.3      00:40:29
 20935       4   5,035      20,140       694.0      36.5      00:40:26
 21073       8   5,035      40,280       698.5      36.8      00:40:19
 21209       6   5,035      30,210       702.6      37.0      00:40:14
 21362       8   5,035      40,280       707.3      37.2      00:40:05
 21513       9   5,035      45,315       712.3      37.5      00:39:55
 21663       1   5,035       5,035       717.0      37.7      00:39:46
 21789       3   5,035      15,105       720.7      37.9      00:39:43
 21903       8   5,035      40,280       724.5      38.1      00:39:39
 22024      10   5,035      50,350       728.4      38.3      00:39:35
 22184       7   5,035      35,245       733.2      38.6      00:39:26
 22314       6   5,035      30,210       737.3      38.8      00:39:20
 22436       6   5,035      30,210       741.1      39.0      00:39:16
 22568      10   5,035      50,350       745.4      39.2      00:39:10
 22728       7   5,035      35,245       750.3      39.5      00:38:59
 22934       8   5,035      40,280       756.7      39.8      00:38:42
 23111       5   5,035      25,175       762.7      40.1      00:38:26
 23310       5   5,035      25,175       769.4      40.5      00:38:08
 23519       5   5,035      25,175       775.8      40.8      00:37:51
 23714       9   5,035      45,315       782.2      41.2      00:37:33
 23879       6   5,035      30,210       787.9      41.5      00:37:20
 24085       9   5,035      45,315       794.5      41.8      00:37:02
 24281       7   5,035      35,245       800.6      42.1      00:36:47
 24467       9   5,035      45,315       806.6      42.5      00:36:32
 24618       8   5,035      40,280       811.8      42.7      00:36:21
 24780       6   5,035      30,210       817.1      43.0      00:36:10
 24975       9   5,035      45,315       823.4      43.3      00:35:54
 25186       9   5,035      45,315       830.7      43.7      00:35:33
 25405      10   5,035      50,350       838.0      44.1      00:35:13
 25559       6   5,035      30,210       843.0      44.4      00:35:03
 25664       9   5,035      45,315       846.4      44.5      00:35:00
 25767       7   5,035      35,245       850.1      44.7      00:34:56
 25883       6   5,035      30,210       854.0      44.9      00:34:51
 26015       6   5,035      30,210       858.3      45.2      00:34:44
 26118       4   5,035      20,140       861.8      45.4      00:34:41
 26257       5   5,035      25,175       866.6      45.6      00:34:32
 26416      10   5,035      50,350       871.5      45.9      00:34:22
 26550       4   5,035      20,140       876.0      46.1      00:34:15
 26706       8   5,035      40,280       880.9      46.4      00:34:05
 26849       6   5,035      30,210       885.7      46.6      00:33:56
 26990       6   5,035      30,210       890.5      46.9      00:33:46
 27130       8   5,035      40,280       895.2      47.1      00:33:38
 27277       6   5,035      30,210       899.9      47.4      00:33:29
 27425      10   5,035      50,350       904.8      47.6      00:33:19
 27557      10   5,035      50,350       909.3      47.9      00:33:11
 27693       6   5,035      30,210       913.9      48.1      00:33:03
 27833       7   5,035      35,245       918.7      48.4      00:32:54
 28006       5   5,035      25,175       924.6      48.7      00:32:40
 28202       5   5,035      25,175       931.2      49.0      00:32:23
 28370       7   5,035      35,245       937.0      49.3      00:32:10
 28547       5   5,035      25,175       943.4      49.7      00:31:55
 28701       6   5,035      30,210       948.6      49.9      00:31:44
 28828      10   5,035      50,350       953.1      50.2      00:31:36
 28930       7   5,035      35,245       956.6      50.4      00:31:32
 29027      10   5,035      50,350       959.9      50.5      00:31:28
 29149       4   5,035      20,140       964.1      50.7      00:31:22
 29298       8   5,035      40,280       968.9      51.0      00:31:12
 29445       1   5,035       5,035       974.1      51.3      00:31:01
 29595       9   5,035      45,315       978.9      51.5      00:30:52
 29718      10   5,035      50,350       983.2      51.7      00:30:45
 29844       7   5,035      35,245       987.4      52.0      00:30:38
 29939      10   5,035      50,350       990.6      52.1      00:30:35
 30048       7   5,035      35,245       994.3      52.3      00:30:29
 30154       9   5,035      45,315       998.0      52.5      00:30:25
 30266       7   5,035      35,245     1,001.8      52.7      00:30:19
 30406       8   5,035      40,280     1,006.6      53.0      00:30:10
 30533       7   5,035      35,245     1,011.1      53.2      00:30:01
 30693       6   5,035      30,210     1,016.5      53.5      00:29:50
 30882       9   5,035      45,315     1,023.1      53.9      00:29:33
 31072       8   5,035      40,280     1,029.3      54.2      00:29:19
 31260       7   5,035      35,245     1,035.9      54.5      00:29:02
 31455       6   5,035      30,210     1,042.8      54.9      00:28:45
 31665       7   5,035      35,245     1,050.0      55.3      00:28:27
 31831       7   5,035      35,245     1,056.0      55.6      00:28:14
 32009      10   5,035      50,350     1,062.3      55.9      00:27:59
 32216       7   5,035      35,245     1,069.7      56.3      00:27:40
 32409       5   5,035      25,175     1,076.6      56.7      00:27:24
 32549       5   5,035      25,175     1,081.4      56.9      00:27:14
 32662       5   5,035      25,175     1,085.3      57.1      00:27:08
 32767       6   5,035      30,210     1,089.0      57.3      00:27:03
 32878      10   5,035      50,350     1,092.8      57.5      00:26:57
 32989       8   5,035      40,280     1,096.7      57.7      00:26:51
 33102      10   5,035      50,350     1,100.8      57.9      00:26:44
 33248       5   5,035      25,175     1,105.8      58.2      00:26:34
 33399      10   5,035      50,350     1,111.0      58.5      00:26:23
 33548       6   5,035      30,210     1,116.3      58.8      00:26:12
 33687       8   5,035      40,280     1,121.2      59.0      00:26:03
 33843       7   5,035      35,245     1,126.6      59.3      00:25:51
 33994       9   5,035      45,315     1,131.9      59.6      00:25:40
 34114      10   5,035      50,350     1,136.3      59.8      00:25:32
 34250       8   5,035      40,280     1,141.1      60.1      00:25:23
 34460      10   5,035      50,350     1,148.5      60.5      00:25:05
 34664       9   5,035      45,315     1,155.5      60.8      00:24:48
 34879       8   5,035      40,280     1,163.3      61.2      00:24:29
 35099       8   5,035      40,280     1,170.8      61.6      00:24:11
 35294      10   5,035      50,350     1,177.7      62.0      00:23:55
 35499       7   5,035      35,245     1,185.0      62.4      00:23:38
 35723       9   5,035      45,315     1,192.5      62.8      00:23:20
 35933       7   5,035      35,245     1,199.8      63.2      00:23:03
 36161       4   5,035      20,140     1,207.8      63.6      00:22:44
 36403       9   5,035      45,315     1,216.3      64.0      00:22:23
 36589      10   5,035      50,350     1,222.5      64.3      00:22:10
 36736       7   5,035      35,245     1,227.3      64.6      00:22:01
 36854       7   5,035      35,245     1,231.4      64.8      00:21:54
 36968       8   5,035      40,280     1,235.2      65.0      00:21:48
 37121       9   5,035      45,315     1,240.3      65.3      00:21:38
 37284       6   5,035      30,210     1,245.2      65.5      00:21:28
 37432      10   5,035      50,350     1,250.0      65.8      00:21:19
 37554       6   5,035      30,210     1,254.1      66.0      00:21:12
 37670       9   5,035      45,315     1,257.7      66.2      00:21:06
 37777       9   5,035      45,315     1,261.2      66.4      00:21:01
 37921       8   5,035      40,280     1,266.1      66.6      00:20:52
 38070       4   5,035      20,140     1,271.2      66.9      00:20:42
 38217       8   5,035      40,280     1,276.3      67.2      00:20:32
 38368       5   5,035      25,175     1,281.6      67.5      00:20:21
 38540       7   5,035      35,245     1,287.6      67.8      00:20:08
 38708       8   5,035      40,280     1,293.3      68.1      00:19:56
 38918       6   5,035      30,210     1,300.4      68.4      00:19:41
 39014      10   5,035      50,350     1,303.8      68.6      00:19:35
 39127       7   5,035      35,245     1,307.4      68.8      00:19:29
 39263       6   5,035      30,210     1,311.8      69.0      00:19:22
 39456       8   5,035      40,280     1,318.1      69.4      00:19:08
 39662       3   5,035      15,105     1,325.0      69.7      00:18:53
 39836       9   5,035      45,315     1,330.9      70.1      00:18:41
 40080       7   5,035      35,245     1,338.9      70.5      00:18:22
 40273       4   5,035      20,140     1,345.3      70.8      00:18:09
 40438       3   5,035      15,105     1,351.0      71.1      00:17:57
 40626       8   5,035      40,280     1,357.6      71.5      00:17:43
 40867       7   5,035      35,245     1,365.8      71.9      00:17:25
 40980       7   5,035      35,245     1,369.8      72.1      00:17:17
 41072       9   5,035      45,315     1,372.9      72.3      00:17:13
 41187       1   5,035       5,035     1,376.8      72.5      00:17:06
 41334       6   5,035      30,210     1,381.8      72.7      00:16:57
 41469      10   5,035      50,350     1,386.4      73.0      00:16:48
 41621       4   5,035      20,140     1,391.6      73.2      00:16:38
 41762       8   5,035      40,280     1,396.3      73.5      00:16:29
 41897      10   5,035      50,350     1,401.1      73.8      00:16:19
 42028      10   5,035      50,350     1,405.2      74.0      00:16:12
 42171       9   5,035      45,315     1,409.8      74.2      00:16:04
 42328       8   5,035      40,280     1,414.8      74.5      00:15:54
 42443       5   5,035      25,175     1,418.9      74.7      00:15:46
 42614       2   5,035      10,070     1,424.4      75.0      00:15:35
 42787       8   5,035      40,280     1,430.2      75.3      00:15:23
 42941       7   5,035      35,245     1,435.4      75.6      00:15:13
 43077       6   5,035      30,210     1,440.3      75.8      00:15:03
 43203       6   5,035      30,210     1,444.8      76.1      00:14:55
 43329       9   5,035      45,315     1,449.1      76.3      00:14:47
 43459       6   5,035      30,210     1,453.6      76.5      00:14:39
 43695       5   5,035      25,175     1,461.1      76.9      00:14:22
 43947      10   5,035      50,350     1,469.8      77.4      00:14:03
 44153       7   5,035      35,245     1,476.5      77.7      00:13:49
 44309       5   5,035      25,175     1,481.7      78.0      00:13:39
 44468       6   5,035      30,210     1,486.9      78.3      00:13:29
 44596       7   5,035      35,245     1,491.2      78.5      00:13:21
 44753       7   5,035      35,245     1,496.4      78.8      00:13:11
 44898       6   5,035      30,210     1,501.4      79.0      00:13:01
 45043       6   5,035      30,210     1,506.2      79.3      00:12:52
 45261       2   5,035      10,070     1,513.1      79.6      00:12:37
 45419       7   5,035      35,245     1,518.0      79.9      00:12:28
 45593       5   5,035      25,175     1,523.5      80.2      00:12:17
 45765      10   5,035      50,350     1,529.0      80.5      00:12:06
 45936      10   5,035      50,350     1,534.6      80.8      00:11:55
 46108       7   5,035      35,245     1,540.6      81.1      00:11:43
 46284       6   5,035      30,210     1,546.8      81.4      00:11:30
 46451       8   5,035      40,280     1,552.2      81.7      00:11:19
 46654       8   5,035      40,280     1,559.2      82.1      00:11:05
 46896       7   5,035      35,245     1,567.5      82.5      00:10:47
 47080       8   5,035      40,280     1,573.1      82.8      00:10:36
 47279       8   5,035      40,280     1,579.2      83.1      00:10:24
 47465       9   5,035      45,315     1,585.2      83.4      00:10:12
 47626       8   5,035      40,280     1,590.5      83.7      00:10:01
 47787       6   5,035      30,210     1,595.8      84.0      00:09:51
 47940       5   5,035      25,175     1,601.1      84.3      00:09:41
 48091       7   5,035      35,245     1,606.1      84.5      00:09:31
 48248       9   5,035      45,315     1,611.3      84.8      00:09:21
 48454       8   5,035      40,280     1,618.3      85.2      00:09:07
 48664       6   5,035      30,210     1,625.4      85.6      00:08:52
 48895       5   5,035      25,175     1,633.0      86.0      00:08:37
 49101       7   5,035      35,245     1,639.9      86.3      00:08:23
 49313       7   5,035      35,245     1,647.1      86.7      00:08:08
 49523       6   5,035      30,210     1,653.7      87.0      00:07:55
 49723       8   5,035      40,280     1,659.8      87.4      00:07:43
 49889       7   5,035      35,245     1,665.2      87.6      00:07:33
 50034       7   5,035      35,245     1,670.1      87.9      00:07:23
 50189       6   5,035      30,210     1,675.1      88.2      00:07:14
 50364       6   5,035      30,210     1,680.4      88.5      00:07:03
 50506       5   5,035      25,175     1,685.3      88.7      00:06:54
 50669       6   5,035      30,210     1,690.7      89.0      00:06:44
 50809       6   5,035      30,210     1,695.6      89.2      00:06:34
 50922      10   5,035      50,350     1,699.6      89.5      00:06:27
 51085       8   5,035      40,280     1,705.2      89.8      00:06:16
 51289       5   5,035      25,175     1,712.0      90.1      00:06:02
 51544       6   5,035      30,210     1,720.8      90.6      00:05:45
 51814       9   5,035      45,315     1,730.4      91.1      00:05:25
 52107       8   5,035      40,280     1,740.7      91.6      00:05:05
 52407       8   5,035      40,280     1,751.6      92.2      00:04:43
 52693       5   5,035      25,175     1,762.2      92.8      00:04:22
 52972      10   5,035      50,350     1,772.1      93.3      00:04:02
 53242       6   5,035      30,210     1,781.6      93.8      00:03:44
 53512      10   5,035      50,350     1,791.0      94.3      00:03:26
 53725       9   5,035      45,315     1,798.3      94.7      00:03:12
 53914       7   5,035      35,245     1,804.6      95.0      00:02:60
 54075      10   5,035      50,350     1,810.0      95.3      00:02:49
 54225       7   5,035      35,245     1,815.1      95.5      00:02:40
 54391       8   5,035      40,280     1,820.4      95.8      00:02:30
 54594       8   5,035      40,280     1,826.8      96.2      00:02:18
 54814       7   5,035      35,245     1,834.0      96.5      00:02:04
 55047       4   5,035      20,140     1,841.8      96.9      00:01:49
 55225       6   5,035      30,210     1,847.7      97.3      00:01:38
 55428       6   5,035      30,210     1,854.0      97.6      00:01:26
 55620       7   5,035      35,245     1,860.2      97.9      00:01:14
 55804       6   5,035      30,210     1,866.4      98.2      00:01:03
 55993       7   5,035      35,245     1,873.0      98.6      00:00:50
 56206       7   5,035      35,245     1,880.4      99.0      00:00:36
 56423       6   5,035      30,210     1,888.0      99.4      00:00:22
 56702       5   5,035      25,175     1,897.6      99.9      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 3553.819
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed940.csv sa
> ved

. 
. cap log close

. 
end of do-file
