
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locations_total
> _fixR100.dta /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vacc
> inated/ca_blk_Dollar_dist_total_fixR100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Nov 2023, 18:07:14

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinate
> d/ca_Dollar_locations_total_fixR100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated
> /ca_blk_Dollar_dist_total_fixR100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   529       9   4,035      36,315        12.3       0.8      00:20:29
  1094       9   4,035      36,315        26.4       1.7      00:18:54
  1666       2   4,035       8,070        41.6       2.7      00:17:49
  2269       3   4,035      12,105        57.1       3.7      00:17:09
  2865      10   4,035      40,350        72.6       4.8      00:16:40
  3425       9   4,035      36,315        87.5       5.7      00:16:25
  3959       3   4,035      12,105       101.4       6.7      00:16:23
  4487       6   4,035      24,210       114.7       7.5      00:16:24
  5003      10   4,035      40,350       128.4       8.4      00:16:19
  5514       4   4,035      16,140       141.4       9.3      00:16:18
  5940      10   4,035      40,350       152.2      10.0      00:16:32
  6379       7   4,035      28,245       163.5      10.7      00:16:39
  6828       5   4,035      20,175       175.0      11.5      00:16:43
  7375       5   4,035      20,175       189.1      12.4      00:16:29
  7913       9   4,035      36,315       203.5      13.4      00:16:14
  8428       5   4,035      20,175       217.9      14.3      00:15:60
  8894       8   4,035      32,280       230.6      15.1      00:15:54
  9357       9   4,035      36,315       243.4      16.0      00:15:48
  9770       7   4,035      28,245       255.0      16.7      00:15:46
 10229       9   4,035      36,315       266.6      17.5      00:15:44
 10678       6   4,035      24,210       278.1      18.3      00:15:41
 11124       6   4,035      24,210       289.8      19.0      00:15:38
 11559       9   4,035      36,315       301.2      19.8      00:15:34
 12038       7   4,035      28,245       313.9      20.6      00:15:26
 12563       9   4,035      36,315       327.9      21.5      00:15:13
 13177      10   4,035      40,350       343.7      22.6      00:14:54
 13688      10   4,035      40,350       357.7      23.5      00:14:41
 14152       3   4,035      12,105       369.9      24.3      00:14:34
 14665       4   4,035      16,140       383.8      25.2      00:14:22
 15130       7   4,035      28,245       396.5      26.0      00:14:14
 15572       6   4,035      24,210       408.4      26.8      00:14:07
 16013       7   4,035      28,245       420.5      27.6      00:14:00
 16438       6   4,035      24,210       432.5      28.4      00:13:53
 16824      10   4,035      40,350       442.8      29.1      00:13:51
 17212       8   4,035      32,280       453.1      29.7      00:13:48
 17555       6   4,035      24,210       462.9      30.4      00:13:46
 18013       6   4,035      24,210       475.1      31.2      00:13:37
 18346       6   4,035      24,210       484.2      31.8      00:13:36
 18711       9   4,035      36,315       494.0      32.4      00:13:34
 19150       9   4,035      36,315       506.2      33.2      00:13:25
 19647      10   4,035      40,350       520.0      34.1      00:13:12
 20175       5   4,035      20,175       535.0      35.1      00:12:57
 20640       9   4,035      36,315       547.8      36.0      00:12:47
 20988      10   4,035      40,350       557.3      36.6      00:12:44
 21361       8   4,035      32,280       566.4      37.2      00:12:41
 21651       7   4,035      28,245       574.0      37.7      00:12:42
 21965       7   4,035      28,245       581.9      38.2      00:12:41
 22206       9   4,035      36,315       587.9      38.6      00:12:45
 22459       8   4,035      32,280       594.3      39.0      00:12:47
 22763       5   4,035      20,175       602.0      39.5      00:12:46
 23057       6   4,035      24,210       609.5      40.0      00:12:46
 23435       3   4,035      12,105       619.7      40.7      00:12:39
 23835       9   4,035      36,315       630.0      41.4      00:12:33
 24251       7   4,035      28,245       640.7      42.1      00:12:25
 24738       8   4,035      32,280       653.6      42.9      00:12:13
 25248       3   4,035      12,105       667.1      43.8      00:11:60
 25661       9   4,035      36,315       677.9      44.5      00:11:52
 26000       7   4,035      28,245       687.2      45.1      00:11:47
 26449       8   4,035      32,280       699.0      45.9      00:11:37
 26936      10   4,035      40,350       711.8      46.7      00:11:25
 27371       5   4,035      20,175       723.4      47.5      00:11:16
 27783       5   4,035      20,175       734.5      48.2      00:11:07
 28254       3   4,035      12,105       747.3      49.0      00:10:55
 28715       5   4,035      20,175       760.2      49.9      00:10:43
 29145       5   4,035      20,175       772.1      50.7      00:10:33
 29602       8   4,035      32,280       784.3      51.5      00:10:23
 30067       7   4,035      28,245       797.1      52.3      00:10:11
 30493       8   4,035      32,280       808.8      53.1      00:10:02
 30982       6   4,035      24,210       822.2      54.0      00:09:49
 31519      10   4,035      40,350       837.1      54.9      00:09:35
 32066       9   4,035      36,315       852.6      56.0      00:09:19
 32594       4   4,035      16,140       867.5      56.9      00:09:05
 33025       7   4,035      28,245       879.5      57.7      00:08:55
 33400       6   4,035      24,210       890.0      58.4      00:08:47
 33816      10   4,035      40,350       901.7      59.2      00:08:38
 34269       7   4,035      28,245       914.7      60.0      00:08:27
 34812       8   4,035      32,280       929.9      61.0      00:08:12
 35265       9   4,035      36,315       942.6      61.9      00:08:01
 35805      10   4,035      40,350       957.6      62.9      00:07:47
 36233       4   4,035      16,140       969.5      63.6      00:07:38
 36658       5   4,035      20,175       981.4      64.4      00:07:28
 37047       9   4,035      36,315       991.6      65.1      00:07:20
 37482       9   4,035      36,315     1,002.8      65.8      00:07:12
 37847       9   4,035      36,315     1,012.3      66.4      00:07:05
 38138       8   4,035      32,280     1,020.2      67.0      00:06:60
 38434      10   4,035      40,350     1,028.6      67.5      00:06:54
 38792      10   4,035      40,350     1,038.4      68.2      00:06:47
 39132      10   4,035      40,350     1,047.6      68.8      00:06:40
 39463       6   4,035      24,210     1,056.2      69.3      00:06:34
 39832       9   4,035      36,315     1,066.0      70.0      00:06:27
 40326       8   4,035      32,280     1,079.2      70.8      00:06:15
 40737       5   4,035      20,175     1,090.6      71.6      00:06:06
 41105       9   4,035      36,315     1,100.8      72.2      00:05:58
 41478       7   4,035      28,245     1,110.9      72.9      00:05:50
 41797       9   4,035      36,315     1,119.6      73.5      00:05:43
 42137       9   4,035      36,315     1,128.7      74.1      00:05:36
 42554       9   4,035      36,315     1,139.7      74.8      00:05:27
 42906      10   4,035      40,350     1,149.1      75.4      00:05:20
 43266       6   4,035      24,210     1,159.2      76.1      00:05:12
 43616       8   4,035      32,280     1,168.6      76.7      00:05:04
 43991      10   4,035      40,350     1,178.7      77.4      00:04:56
 44413       7   4,035      28,245     1,189.7      78.1      00:04:47
 44866       2   4,035       8,070     1,201.9      78.9      00:04:36
 45323       3   4,035      12,105     1,213.8      79.7      00:04:26
 45763      10   4,035      40,350     1,225.0      80.4      00:04:16
 46170       6   4,035      24,210     1,236.0      81.1      00:04:07
 46554       9   4,035      36,315     1,246.5      81.8      00:03:58
 47002       9   4,035      36,315     1,258.5      82.6      00:03:48
 47418       8   4,035      32,280     1,269.1      83.3      00:03:39
 47867       4   4,035      16,140     1,280.7      84.1      00:03:29
 48333       8   4,035      32,280     1,293.4      84.9      00:03:18
 48812       8   4,035      32,280     1,306.2      85.7      00:03:07
 49367       7   4,035      28,245     1,321.1      86.7      00:02:53
 49786       6   4,035      24,210     1,331.5      87.4      00:02:45
 50178       5   4,035      20,175     1,341.9      88.1      00:02:36
 50605      10   4,035      40,350     1,353.0      88.8      00:02:26
 51016       6   4,035      24,210     1,364.3      89.5      00:02:17
 51419       7   4,035      28,245     1,375.1      90.3      00:02:08
 51826       5   4,035      20,175     1,386.6      91.0      00:01:58
 52242       9   4,035      36,315     1,398.5      91.8      00:01:47
 52659       9   4,035      36,315     1,410.6      92.6      00:01:37
 53060       5   4,035      20,175     1,422.2      93.3      00:01:27
 53508       5   4,035      20,175     1,434.7      94.2      00:01:16
 53956       2   4,035       8,070     1,446.9      95.0      00:01:06
 54384       9   4,035      36,315     1,458.5      95.7      00:00:56
 54831       6   4,035      24,210     1,469.9      96.5      00:00:46
 55279      10   4,035      40,350     1,481.8      97.3      00:00:36
 55727       5   4,035      20,175     1,493.3      98.0      00:00:26
 56143       6   4,035      24,210     1,504.7      98.8      00:00:16
 56506       8   4,035      32,280     1,514.9      99.4      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1312.717
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_
> blk_Dollar_dist_total_fixR100.csv saved

. 
. cap log close

. 
end of do-file
