
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A500.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   481       9   4,535      40,815        12.5       0.7      00:22:42
   977      10   4,535      45,350        26.2       1.5      00:21:28
  1469       7   4,535      31,745        40.9       2.4      00:20:26
  1955       5   4,535      22,675        55.0       3.2      00:20:07
  2454      10   4,535      45,350        69.4       4.1      00:19:45
  2949       9   4,535      40,815        83.9       4.9      00:19:25
  3412       8   4,535      36,280        97.9       5.7      00:19:15
  3876       8   4,535      36,280       111.7       6.5      00:19:08
  4212       9   4,535      40,815       121.3       7.1      00:19:42
  4549       6   4,535      27,210       130.7       7.6      00:20:11
  4872      10   4,535      45,350       140.4       8.2      00:20:33
  5198       9   4,535      40,815       150.0       8.8      00:20:52
  5504       8   4,535      36,280       158.7       9.3      00:21:15
  5820      10   4,535      45,350       167.6       9.8      00:21:33
  6219       7   4,535      31,745       179.2      10.5      00:21:25
  6571       8   4,535      36,280       189.3      11.1      00:21:30
  6965       7   4,535      31,745       200.6      11.7      00:21:23
  7397       9   4,535      40,815       213.2      12.5      00:21:08
  7840       3   4,535      13,605       226.4      13.2      00:20:49
  8262       4   4,535      18,140       239.6      14.0      00:20:32
  8686       7   4,535      31,745       252.7      14.8      00:20:15
  9106       7   4,535      31,745       265.7      15.5      00:19:60
  9443       7   4,535      31,745       276.2      16.1      00:19:58
  9755      10   4,535      45,350       286.1      16.7      00:19:59
 10092       3   4,535      13,605       296.0      17.3      00:19:58
 10438       9   4,535      40,815       305.7      17.9      00:19:59
 10817       9   4,535      40,815       316.6      18.5      00:19:52
 11195       7   4,535      31,745       327.8      19.1      00:19:45
 11527       8   4,535      36,280       337.7      19.7      00:19:43
 11883       7   4,535      31,745       348.2      20.3      00:19:38
 12215       6   4,535      27,210       358.2      20.9      00:19:34
 12664       3   4,535      13,605       371.4      21.7      00:19:18
 13131       9   4,535      40,815       384.9      22.5      00:19:00
 13564       2   4,535       9,070       398.2      23.3      00:18:44
 13876       9   4,535      40,815       407.6      23.8      00:18:42
 14199       2   4,535       9,070       417.2      24.4      00:18:40
 14543       7   4,535      31,745       427.8      25.0      00:18:33
 14930       6   4,535      27,210       439.3      25.7      00:18:23
 15351       5   4,535      22,675       452.4      26.4      00:18:08
 15844      10   4,535      45,350       467.3      27.3      00:17:48
 16334       6   4,535      27,210       482.7      28.2      00:17:26
 16705       8   4,535      36,280       494.1      28.9      00:17:17
 17032       7   4,535      31,745       504.0      29.4      00:17:13
 17376       8   4,535      36,280       514.5      30.0      00:17:06
 17691       3   4,535      13,605       524.5      30.6      00:17:01
 18055       6   4,535      27,210       535.2      31.3      00:16:53
 18445       6   4,535      27,210       547.0      31.9      00:16:43
 18902       9   4,535      40,815       561.1      32.8      00:16:27
 19379       4   4,535      18,140       576.0      33.6      00:16:08
 19845       6   4,535      27,210       590.8      34.5      00:15:51
 20337       6   4,535      27,210       606.2      35.4      00:15:32
 20718       8   4,535      36,280       618.0      36.1      00:15:22
 21071      10   4,535      45,350       628.8      36.7      00:15:15
 21406       7   4,535      31,745       638.0      37.3      00:15:11
 21719       3   4,535      13,605       646.9      37.8      00:15:07
 22041       6   4,535      27,210       656.3      38.3      00:15:03
 22388       9   4,535      40,815       665.9      38.9      00:14:57
 22710       4   4,535      18,140       675.3      39.4      00:14:52
 23030       7   4,535      31,745       684.2      40.0      00:14:48
 23373       2   4,535       9,070       694.7      40.6      00:14:40
 23743       5   4,535      22,675       705.2      41.2      00:14:33
 24044      10   4,535      45,350       714.2      41.7      00:14:28
 24470      10   4,535      45,350       726.3      42.4      00:14:17
 24901       6   4,535      27,210       739.3      43.2      00:14:04
 25346       7   4,535      31,745       752.7      44.0      00:13:50
 25718      10   4,535      45,350       763.7      44.6      00:13:41
 26027       9   4,535      40,815       773.2      45.2      00:13:35
 26403       8   4,535      36,280       784.4      45.8      00:13:26
 26798      10   4,535      45,350       795.9      46.5      00:13:16
 27155       6   4,535      27,210       806.6      47.1      00:13:07
 27487       6   4,535      27,210       816.5      47.7      00:13:00
 27839      10   4,535      45,350       827.3      48.3      00:12:52
 28295      10   4,535      45,350       841.2      49.1      00:12:37
 28715       5   4,535      22,675       854.4      49.9      00:12:24
 29022      10   4,535      45,350       864.0      50.5      00:12:18
 29387       9   4,535      40,815       875.1      51.1      00:12:08
 29748       8   4,535      36,280       886.0      51.7      00:11:59
 30032       7   4,535      31,745       894.7      52.3      00:11:54
 30343       7   4,535      31,745       904.3      52.8      00:11:47
 30722       8   4,535      36,280       916.1      53.5      00:11:37
 31173       6   4,535      27,210       929.9      54.3      00:11:23
 31628       8   4,535      36,280       944.2      55.1      00:11:08
 32062       6   4,535      27,210       958.1      56.0      00:10:54
 32500       6   4,535      27,210       972.2      56.8      00:10:41
 32783       8   4,535      36,280       981.0      57.3      00:10:35
 33096       4   4,535      18,140       990.8      57.9      00:10:27
 33433       8   4,535      36,280     1,001.3      58.5      00:10:19
 33808       6   4,535      27,210     1,013.2      59.2      00:10:08
 34171      10   4,535      45,350     1,024.8      59.8      00:09:58
 34658       9   4,535      40,815     1,040.2      60.7      00:09:43
 35181       8   4,535      36,280     1,056.8      61.7      00:09:25
 35659       4   4,535      18,140     1,071.8      62.6      00:09:11
 36150      10   4,535      45,350     1,087.1      63.5      00:08:56
 36616       9   4,535      40,815     1,101.6      64.3      00:08:42
 36992       9   4,535      40,815     1,112.9      65.0      00:08:33
 37348       9   4,535      40,815     1,123.1      65.6      00:08:25
 37682       3   4,535      13,605     1,132.9      66.2      00:08:17
 37999       7   4,535      31,745     1,142.3      66.7      00:08:10
 38320      10   4,535      45,350     1,152.3      67.3      00:08:02
 38646       9   4,535      40,815     1,162.5      67.9      00:07:54
 38978      10   4,535      45,350     1,172.7      68.5      00:07:46
 39329       4   4,535      18,140     1,183.2      69.1      00:07:37
 39754       8   4,535      36,280     1,195.7      69.8      00:07:26
 40233       6   4,535      27,210     1,210.2      70.7      00:07:12
 40707       5   4,535      22,675     1,224.8      71.5      00:06:59
 41106       5   4,535      22,675     1,237.2      72.2      00:06:48
 41466       7   4,535      31,745     1,248.2      72.9      00:06:39
 41869       8   4,535      36,280     1,260.6      73.6      00:06:28
 42240       5   4,535      22,675     1,271.4      74.3      00:06:19
 42630       8   4,535      36,280     1,283.1      74.9      00:06:09
 43015       7   4,535      31,745     1,294.8      75.6      00:05:58
 43402       7   4,535      31,745     1,307.1      76.3      00:05:48
 43787       8   4,535      36,280     1,318.4      77.0      00:05:38
 44154       4   4,535      18,140     1,329.5      77.6      00:05:29
 44553       3   4,535      13,605     1,341.4      78.3      00:05:19
 44946       5   4,535      22,675     1,353.4      79.0      00:05:08
 45374       6   4,535      27,210     1,365.6      79.7      00:04:58
 45661       6   4,535      27,210     1,373.9      80.2      00:04:51
 45966       5   4,535      22,675     1,382.8      80.8      00:04:44
 46266       9   4,535      40,815     1,392.3      81.3      00:04:36
 46623       6   4,535      27,210     1,403.1      81.9      00:04:27
 47075       7   4,535      31,745     1,416.4      82.7      00:04:15
 47431       7   4,535      31,745     1,426.7      83.3      00:04:07
 47792       7   4,535      31,745     1,437.3      83.9      00:03:58
 48114       8   4,535      36,280     1,447.0      84.5      00:03:50
 48469       6   4,535      27,210     1,457.7      85.1      00:03:40
 48847       9   4,535      40,815     1,469.1      85.8      00:03:31
 49226      10   4,535      45,350     1,480.9      86.5      00:03:20
 49724       9   4,535      40,815     1,494.8      87.3      00:03:08
 50217       7   4,535      31,745     1,509.3      88.1      00:02:55
 50540       6   4,535      27,210     1,518.6      88.7      00:02:47
 50841       9   4,535      40,815     1,527.8      89.2      00:02:40
 51137       3   4,535      13,605     1,537.0      89.8      00:02:32
 51471      10   4,535      45,350     1,547.2      90.4      00:02:23
 51807       9   4,535      40,815     1,557.9      91.0      00:02:14
 52161      10   4,535      45,350     1,569.1      91.6      00:02:04
 52580       7   4,535      31,745     1,582.8      92.4      00:01:52
 53076       9   4,535      40,815     1,599.0      93.4      00:01:38
 53574       5   4,535      22,675     1,614.6      94.3      00:01:24
 53987       6   4,535      27,210     1,627.2      95.0      00:01:13
 54347      10   4,535      45,350     1,638.2      95.7      00:01:04
 54762       8   4,535      36,280     1,650.1      96.4      00:00:54
 55187      10   4,535      45,350     1,662.7      97.1      00:00:43
 55517       6   4,535      27,210     1,672.1      97.6      00:00:35
 55791      10   4,535      45,350     1,680.3      98.1      00:00:28
 56089       5   4,535      22,675     1,689.4      98.7      00:00:20
 56420       9   4,535      40,815     1,699.9      99.3      00:00:11
 56800       8   4,535      36,280     1,711.8     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1487.963
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A500.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
