
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl.dta /export/storage_covidvaccine/Result/MNL_part
> ial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_m
> nl.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   537       7   4,035      28,245        12.5       0.8      00:20:11
  1127       9   4,035      36,315        27.2       1.8      00:18:19
  1712       5   4,035      20,175        42.9       2.8      00:17:16
  2320       9   4,035      36,315        58.4       3.8      00:16:44
  2948      10   4,035      40,350        74.6       4.9      00:16:11
  3557      10   4,035      40,350        91.0       6.0      00:15:45
  4096      10   4,035      40,350       104.9       6.9      00:15:48
  4538       6   4,035      24,210       116.0       7.6      00:16:12
  4958       6   4,035      24,210       127.2       8.4      00:16:29
  5375      10   4,035      40,350       138.2       9.1      00:16:43
  5718       8   4,035      32,280       146.5       9.6      00:17:15
  6094      10   4,035      40,350       156.3      10.3      00:17:31
  6486       9   4,035      36,315       166.3      10.9      00:17:42
  6859       3   4,035      12,105       175.8      11.5      00:17:55
  7332       4   4,035      16,140       187.9      12.3      00:17:48
  7819       8   4,035      32,280       200.9      13.2      00:17:35
  8296       6   4,035      24,210       214.1      14.1      00:17:21
  8780       7   4,035      28,245       227.4      14.9      00:17:07
  9235       8   4,035      32,280       240.1      15.8      00:16:57
  9607       9   4,035      36,315       250.4      16.4      00:16:59
 10023      10   4,035      40,350       261.6      17.2      00:16:55
 10448      10   4,035      40,350       272.3      17.9      00:16:53
 10949      10   4,035      40,350       285.3      18.7      00:16:40
 11361       8   4,035      32,280       296.0      19.4      00:16:37
 11740       6   4,035      24,210       305.9      20.1      00:16:36
 12100       9   4,035      36,315       315.6      20.7      00:16:37
 12561       7   4,035      28,245       327.8      21.5      00:16:26
 13111       9   4,035      36,315       341.9      22.4      00:16:09
 13628      10   4,035      40,350       356.2      23.4      00:15:52
 14233       6   4,035      24,210       372.1      24.4      00:15:30
 14828       3   4,035      12,105       388.2      25.5      00:15:08
 15339       9   4,035      36,315       402.2      26.4      00:14:53
 15922       8   4,035      32,280       417.9      27.4      00:14:34
 16480       8   4,035      32,280       433.7      28.5      00:14:16
 16895       5   4,035      20,175       444.6      29.2      00:14:11
 17240       5   4,035      20,175       453.9      29.8      00:14:10
 17621       7   4,035      28,245       464.7      30.5      00:14:04
 18059       9   4,035      36,315       476.3      31.3      00:13:57
 18529       7   4,035      28,245       488.8      32.1      00:13:47
 19112       5   4,035      20,175       505.1      33.2      00:13:28
 19677       6   4,035      24,210       520.9      34.2      00:13:10
 20292      10   4,035      40,350       538.2      35.3      00:12:50
 20734       7   4,035      28,245       550.3      36.1      00:12:42
 21034       3   4,035      12,105       558.5      36.7      00:12:41
 21424       8   4,035      32,280       568.1      37.3      00:12:38
 21793      10   4,035      40,350       577.4      37.9      00:12:35
 22187       9   4,035      36,315       587.3      38.6      00:12:30
 22557       9   4,035      36,315       596.9      39.2      00:12:26
 22947      10   4,035      40,350       606.5      39.8      00:12:22
 23295       7   4,035      28,245       616.0      40.4      00:12:18
 23691       6   4,035      24,210       626.0      41.1      00:12:12
 24071       7   4,035      28,245       636.2      41.8      00:12:06
 24613       5   4,035      20,175       650.2      42.7      00:11:53
 25206       9   4,035      36,315       666.0      43.7      00:11:36
 25718      10   4,035      40,350       679.5      44.6      00:11:24
 26114      10   4,035      40,350       690.3      45.3      00:11:17
 26617       9   4,035      36,315       703.4      46.2      00:11:06
 27079       7   4,035      28,245       715.7      47.0      00:10:56
 27465      10   4,035      40,350       725.9      47.6      00:10:49
 27916       5   4,035      20,175       738.2      48.5      00:10:39
 28446       9   4,035      36,315       752.7      49.4      00:10:26
 28865       6   4,035      24,210       764.5      50.2      00:10:17
 29308       8   4,035      32,280       776.4      51.0      00:10:07
 29800       4   4,035      16,140       789.8      51.8      00:09:55
 30169       7   4,035      28,245       799.8      52.5      00:09:49
 30602       8   4,035      32,280       811.8      53.3      00:09:39
 31180       4   4,035      16,140       827.5      54.3      00:09:24
 31788       5   4,035      20,175       844.6      55.4      00:09:07
 32397       6   4,035      24,210       862.1      56.6      00:08:50
 32810       6   4,035      24,210       873.5      57.3      00:08:42
 33261       6   4,035      24,210       886.1      58.2      00:08:31
 33803       6   4,035      24,210       901.4      59.2      00:08:18
 34347       8   4,035      32,280       916.9      60.2      00:08:04
 34964       7   4,035      28,245       934.2      61.3      00:07:47
 35600       7   4,035      28,245       951.9      62.5      00:07:31
 36221       5   4,035      20,175       969.2      63.6      00:07:15
 36771       5   4,035      20,175       984.2      64.6      00:07:03
 37246       4   4,035      16,140       996.6      65.4      00:06:53
 37690       6   4,035      24,210     1,008.2      66.2      00:06:44
 38086       8   4,035      32,280     1,018.9      66.9      00:06:37
 38474       9   4,035      36,315     1,029.6      67.6      00:06:29
 38865       8   4,035      32,280     1,040.3      68.3      00:06:21
 39408       6   4,035      24,210     1,054.8      69.2      00:06:09
 40019       8   4,035      32,280     1,071.1      70.3      00:05:55
 40610       8   4,035      32,280     1,087.1      71.4      00:05:42
 41110       6   4,035      24,210     1,100.9      72.3      00:05:31
 41570       7   4,035      28,245     1,113.4      73.1      00:05:21
 42039       6   4,035      24,210     1,126.2      73.9      00:05:11
 42505      10   4,035      40,350     1,138.4      74.7      00:05:02
 42868       6   4,035      24,210     1,148.1      75.4      00:04:55
 43232       4   4,035      16,140     1,158.3      76.0      00:04:47
 43589       6   4,035      24,210     1,167.9      76.7      00:04:41
 43936      10   4,035      40,350     1,177.2      77.3      00:04:34
 44309       7   4,035      28,245     1,187.2      77.9      00:04:27
 44735       8   4,035      32,280     1,198.4      78.7      00:04:18
 45137       8   4,035      32,280     1,209.2      79.4      00:04:10
 45527       4   4,035      16,140     1,219.1      80.0      00:04:03
 45885      10   4,035      40,350     1,228.2      80.6      00:03:56
 46241       6   4,035      24,210     1,238.0      81.3      00:03:49
 46598       7   4,035      28,245     1,247.8      81.9      00:03:41
 47029       7   4,035      28,245     1,259.1      82.6      00:03:32
 47360       7   4,035      28,245     1,267.5      83.2      00:03:26
 47713       5   4,035      20,175     1,276.7      83.8      00:03:19
 48030       9   4,035      36,315     1,285.3      84.4      00:03:13
 48361       7   4,035      28,245     1,294.1      84.9      00:03:06
 48737       8   4,035      32,280     1,304.3      85.6      00:02:58
 49127       7   4,035      28,245     1,314.6      86.3      00:02:50
 49603       6   4,035      24,210     1,327.0      87.1      00:02:40
 50147       8   4,035      32,280     1,341.1      88.0      00:02:29
 50535      10   4,035      40,350     1,351.0      88.7      00:02:21
 50883       9   4,035      36,315     1,360.5      89.3      00:02:13
 51234       7   4,035      28,245     1,370.1      89.9      00:02:06
 51588       8   4,035      32,280     1,379.8      90.6      00:01:58
 51992       9   4,035      36,315     1,391.2      91.3      00:01:49
 52428       6   4,035      24,210     1,403.8      92.1      00:01:38
 52792      10   4,035      40,350     1,414.6      92.8      00:01:30
 53182       6   4,035      24,210     1,425.6      93.6      00:01:21
 53667       5   4,035      20,175     1,439.2      94.5      00:01:09
 53969       8   4,035      32,280     1,447.3      95.0      00:01:03
 54281       7   4,035      28,245     1,455.8      95.5      00:00:56
 54623       9   4,035      36,315     1,464.4      96.1      00:00:49
 55007       6   4,035      24,210     1,474.7      96.8      00:00:41
 55339       3   4,035      12,105     1,483.2      97.3      00:00:34
 55653       8   4,035      32,280     1,491.1      97.9      00:00:27
 55950       6   4,035      24,210     1,499.4      98.4      00:00:20
 56281       7   4,035      28,245     1,508.5      99.0      00:00:13
 56626       6   4,035      24,210     1,518.2      99.6      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1283.14
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
