
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locatio
> ns_total_10000_1_4q_flexthresh2_3_15.dta /export/storage_covidvaccine/Result/
> MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4
> q_flexthresh2_3_15.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 13:32:29

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_1_4q_flexthresh2_3_15.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
  8125       8   4,035      32,280       209.4      13.7      00:19:53
  7966       8   4,035      32,280       205.0      13.5      00:20:24
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   466      10   4,035      40,350        10.7       0.7      00:23:32
  8490       8   4,035      32,280       219.6      14.4      00:19:49
  8368       7   4,035      28,245       216.2      14.2      00:20:11
   971       7   4,035      28,245        23.1       1.5      00:21:39
  8900       6   4,035      24,210       230.8      15.1      00:19:38
  8790       7   4,035      28,245       227.7      14.9      00:19:57
  1450       8   4,035      32,280        35.9       2.4      00:20:45
  9270      10   4,035      40,350       241.0      15.8      00:19:32
  9204      10   4,035      40,350       239.2      15.7      00:19:43
  1937       5   4,035      20,175        48.4       3.2      00:20:21
  9579       7   4,035      28,245       249.6      16.4      00:19:35
  9515       8   4,035      32,280       247.8      16.3      00:19:46
  2426       8   4,035      32,280        61.1       4.0      00:19:59
  9908       7   4,035      28,245       258.6      17.0      00:19:35
  9853       6   4,035      24,210       257.2      16.9      00:19:43
  2928       7   4,035      28,245        74.2       4.9      00:19:34
 10277       4   4,035      16,140       267.7      17.6      00:19:34
 10232       8   4,035      32,280       266.7      17.5      00:19:40
  3423       9   4,035      36,315        87.5       5.7      00:19:11
 10662       6   4,035      24,210       277.7      18.2      00:19:28
 10638       7   4,035      28,245       277.1      18.2      00:19:31
  3887       9   4,035      36,315        99.7       6.5      00:19:04
 11047       7   4,035      28,245       287.8      18.9      00:19:21
 11051       2   4,035       8,070       287.9      18.9      00:19:20
  4252       9   4,035      36,315       108.8       7.1      00:19:32
 11348       7   4,035      28,245       295.7      19.4      00:19:24
 11384       6   4,035      24,210       296.6      19.5      00:19:20
  4627       8   4,035      32,280       118.5       7.8      00:19:48
 11641       5   4,035      20,175       303.3      19.9      00:19:28
 11705       7   4,035      28,245       305.1      20.0      00:19:20
  4954       9   4,035      36,315       127.1       8.3      00:20:10
 11975       7   4,035      28,245       312.1      20.5      00:19:26
 12064       6   4,035      24,210       314.6      20.6      00:19:14
  5294       9   4,035      36,315       135.9       8.9      00:20:27
 12287       7   4,035      28,245       320.5      21.0      00:19:25
 12439       9   4,035      36,315       324.5      21.3      00:19:07
  5636       6   4,035      24,210       144.4       9.5      00:20:44
 12710       3   4,035      12,105       331.6      21.8      00:19:12
 12905      10   4,035      40,350       336.4      22.1      00:18:51
  5979       7   4,035      28,245       153.2      10.1      00:20:54
 13177      10   4,035      40,350       343.7      22.6      00:18:54
 13375      10   4,035      40,350       348.9      22.9      00:18:32
  6349       7   4,035      28,245       162.7      10.7      00:20:57
 13726       5   4,035      20,175       358.8      23.5      00:18:25
 13588      10   4,035      40,350       354.9      23.3      00:18:41
  6701       6   4,035      24,210       171.7      11.3      00:21:02
 14084       8   4,035      32,280       368.0      24.2      00:18:20
 13902       7   4,035      28,245       363.3      23.8      00:18:39
  7079       7   4,035      28,245       181.4      11.9      00:20:60
 14464       9   4,035      36,315       378.4      24.8      00:18:11
 14278       8   4,035      32,280       373.4      24.5      00:18:30
  7526       4   4,035      16,140       193.0      12.7      00:20:43
 14846       6   4,035      24,210       388.6      25.5      00:18:02
 14663       6   4,035      24,210       383.8      25.2      00:18:20
  7958       9   4,035      36,315       204.8      13.4      00:20:25
 15310       6   4,035      24,210       401.4      26.3      00:17:44
 15086       7   4,035      28,245       395.3      25.9      00:18:06
  8397       6   4,035      24,210       216.9      14.2      00:20:06
 15776       9   4,035      36,315       413.9      27.2      00:17:27
 15542       7   4,035      28,245       407.6      26.8      00:17:49
  8818       8   4,035      32,280       228.4      15.0      00:19:52
 16236       7   4,035      28,245       426.8      28.0      00:17:09
 16017       8   4,035      32,280       420.6      27.6      00:17:30
  9231       8   4,035      32,280       239.9      15.7      00:19:39
 16650       7   4,035      28,245       438.0      28.7      00:16:57
 16472       7   4,035      28,245       433.5      28.5      00:17:12
  9558       9   4,035      36,315       249.0      16.3      00:19:39
 16837       9   4,035      36,315       443.1      29.1      00:17:05
 16998       8   4,035      32,280       447.5      29.4      00:16:51
  9912       4   4,035      16,140       258.8      17.0      00:19:35
 17165       4   4,035      16,140       451.9      29.7      00:17:01
 17312       9   4,035      36,315       455.9      29.9      00:16:48
 10299      10   4,035      40,350       268.3      17.6      00:19:32
 17482      10   4,035      40,350       460.7      30.2      00:16:56
 17619       8   4,035      32,280       464.7      30.5      00:16:44
 10678       6   4,035      24,210       278.1      18.3      00:19:26
 17808       8   4,035      32,280       469.5      30.8      00:16:51
 17930       8   4,035      32,280       472.9      31.0      00:16:41
 11101       3   4,035      12,105       289.1      19.0      00:19:15
 18141       7   4,035      28,245       478.7      31.4      00:16:45
 18298       8   4,035      32,280       482.9      31.7      00:16:33
 11413      10   4,035      40,350       297.4      19.5      00:19:16
 18486       5   4,035      20,175       487.6      32.0      00:16:40
 18727       4   4,035      16,140       494.4      32.5      00:16:20
 11718       6   4,035      24,210       305.4      20.0      00:19:19
 19175       6   4,035      24,210       506.9      33.3      00:16:04
 18924       7   4,035      28,245       499.8      32.8      00:16:24
 12049      10   4,035      40,350       314.2      20.6      00:19:17
 19388       7   4,035      28,245       512.7      33.7      00:16:07
 19657       7   4,035      28,245       520.3      34.2      00:15:46
 12379       9   4,035      36,315       322.9      21.2      00:19:15
 19815       8   4,035      32,280       524.9      34.5      00:15:53
 20136       9   4,035      36,315       534.1      35.1      00:15:28
 12847       6   4,035      24,210       334.9      22.0      00:18:58
 20268       7   4,035      28,245       537.5      35.3      00:15:37
 20566      10   4,035      40,350       545.7      35.8      00:15:15
 13275       8   4,035      32,280       346.2      22.7      00:18:44
 20646       6   4,035      24,210       547.9      36.0      00:15:27
 20897       6   4,035      24,210       554.8      36.4      00:15:09
 13666       7   4,035      28,245       357.1      23.4      00:18:32
 20933       6   4,035      24,210       555.9      36.5      00:15:24
 21251       8   4,035      32,280       563.8      37.0      00:15:03
 14036      10   4,035      40,350       366.7      24.1      00:18:26
 21289       1   4,035       4,035       564.7      37.1      00:15:18
 21599       7   4,035      28,245       572.7      37.6      00:14:58
 14441       6   4,035      24,210       377.8      24.8      00:18:14
 21669       6   4,035      24,210       574.4      37.7      00:15:10
 21985       9   4,035      36,315       582.4      38.2      00:14:50
 14824       8   4,035      32,280       388.1      25.5      00:18:04
 22052       6   4,035      24,210       584.2      38.3      00:15:02
 22372       9   4,035      36,315       592.0      38.9      00:14:42
 15300       5   4,035      20,175       401.1      26.3      00:17:45
 22426       8   4,035      32,280       593.4      38.9      00:14:55
 22728       4   4,035      16,140       601.3      39.5      00:14:35
 15795       5   4,035      20,175       414.4      27.2      00:17:25
 22784       8   4,035      32,280       602.5      39.5      00:14:48
 23123       6   4,035      24,210       611.3      40.1      00:14:27
 16272       5   4,035      20,175       427.8      28.1      00:17:06
 23129       8   4,035      32,280       611.5      40.1      00:14:41
 23480       7   4,035      28,245       620.7      40.7      00:14:19
 16698       9   4,035      36,315       439.4      28.8      00:16:53
 23472       8   4,035      32,280       620.5      40.7      00:14:34
 23890       6   4,035      24,210       631.5      41.4      00:14:09
 17049       8   4,035      32,280       448.9      29.5      00:16:47
 23846       8   4,035      32,280       630.3      41.4      00:14:26
 24357       6   4,035      24,210       643.2      42.2      00:13:56
 17394       3   4,035      12,105       458.3      30.1      00:16:41
 24246      10   4,035      40,350       640.6      42.0      00:14:16
 24833       7   4,035      28,245       656.0      43.1      00:13:41
 17711       7   4,035      28,245       467.1      30.7      00:16:37
 24656       9   4,035      36,315       651.4      42.8      00:14:05
 25288       7   4,035      28,245       668.2      43.9      00:13:28
 18114       7   4,035      28,245       477.9      31.4      00:16:26
 25097       5   4,035      20,175       663.0      43.5      00:13:52
 25704       8   4,035      32,280       679.1      44.6      00:13:17
 18531       8   4,035      32,280       488.8      32.1      00:16:15
 25546       6   4,035      24,210       675.2      44.3      00:13:38
 26030       4   4,035      16,140       688.0      45.2      00:13:11
 18995       6   4,035      24,210       501.9      32.9      00:15:58
 25882       4   4,035      16,140       684.1      44.9      00:13:31
 26449       8   4,035      32,280       699.0      45.9      00:12:60
 19468       9   4,035      36,315       515.0      33.8      00:15:41
 26229       6   4,035      24,210       693.4      45.5      00:13:23
 26886       3   4,035      12,105       710.5      46.6      00:12:48
 19912       8   4,035      32,280       527.6      34.6      00:15:26
 26622       7   4,035      28,245       703.5      46.2      00:13:14
 27247       8   4,035      32,280       720.1      47.3      00:12:40
 20396       6   4,035      24,210       541.0      35.5      00:15:09
 27033       8   4,035      32,280       714.5      46.9      00:13:02
 27591       9   4,035      36,315       729.3      47.9      00:12:33
 20745      10   4,035      40,350       550.6      36.1      00:15:03
 27376       6   4,035      24,210       723.5      47.5      00:12:55
 28003       9   4,035      36,315       740.5      48.6      00:12:21
 21079       9   4,035      36,315       559.7      36.7      00:14:57
 27740       8   4,035      32,280       733.3      48.1      00:12:46
 28453      10   4,035      40,350       752.9      49.4      00:12:08
 21461       8   4,035      32,280       569.1      37.3      00:14:50
 28173       3   4,035      12,105       745.2      48.9      00:12:33
 28816       7   4,035      28,245       763.1      50.1      00:11:59
 21823       6   4,035      24,210       578.1      37.9      00:14:44
 28604       7   4,035      28,245       757.3      49.7      00:12:20
 29111       8   4,035      32,280       771.2      50.6      00:11:53
 22192       7   4,035      28,245       587.5      38.6      00:14:38
 28951      10   4,035      40,350       766.8      50.3      00:12:11
 29530       8   4,035      32,280       782.5      51.4      00:11:42
 22569       6   4,035      24,210       597.1      39.2      00:14:30
 29327       9   4,035      36,315       776.9      51.0      00:12:02
 29893       9   4,035      36,315       792.3      52.0      00:11:33
 22964       7   4,035      28,245       607.0      39.8      00:14:22
 29740       5   4,035      20,175       788.1      51.7      00:11:50
 30238       8   4,035      32,280       801.8      52.6      00:11:25
 23341       7   4,035      28,245       617.2      40.5      00:14:13
 30041       4   4,035      16,140       796.3      52.3      00:11:44
 30616       7   4,035      28,245       812.2      53.3      00:11:15
 23740       7   4,035      28,245       627.3      41.2      00:14:04
 30381       6   4,035      24,210       805.6      52.9      00:11:36
 31081       8   4,035      32,280       824.8      54.1      00:11:02
 24118       9   4,035      36,315       637.4      41.8      00:13:55
 30784       6   4,035      24,210       816.8      53.6      00:11:25
 31546       9   4,035      36,315       837.9      55.0      00:10:47
 24559       8   4,035      32,280       648.6      42.6      00:13:44
 31259       9   4,035      36,315       829.8      54.5      00:11:10
 32004       7   4,035      28,245       850.8      55.8      00:10:34
 24995       4   4,035      16,140       660.1      43.3      00:13:32
 31713       4   4,035      16,140       842.4      55.3      00:10:56
 32446       6   4,035      24,210       863.5      56.7      00:10:20
 25449       8   4,035      32,280       672.5      44.1      00:13:18
 32107      10   4,035      40,350       853.7      56.0      00:10:44
 32733       7   4,035      28,245       871.3      57.2      00:10:15
 25811       7   4,035      28,245       682.2      44.8      00:13:10
 32509      10   4,035      40,350       865.3      56.8      00:10:32
 33039       3   4,035      12,105       879.9      57.8      00:10:08
 26129       6   4,035      24,210       690.8      45.3      00:13:05
 32773       8   4,035      32,280       872.6      57.3      00:10:28
 33382       9   4,035      36,315       889.5      58.4      00:09:60
 26547       6   4,035      24,210       701.5      46.0      00:12:54
 33066       9   4,035      36,315       880.7      57.8      00:10:21
 33746       9   4,035      36,315       899.8      59.1      00:09:50
 26958      10   4,035      40,350       712.4      46.8      00:12:44
 33440      10   4,035      40,350       891.1      58.5      00:10:11
 34111       9   4,035      36,315       910.1      59.7      00:09:41
 27317       6   4,035      24,210       721.9      47.4      00:12:36
 33837       6   4,035      24,210       902.3      59.2      00:09:60
 34527       7   4,035      28,245       921.9      60.5      00:09:29
 27640      10   4,035      40,350       730.6      48.0      00:12:30
 34217      10   4,035      40,350       913.2      59.9      00:09:49
 35003       5   4,035      20,175       935.3      61.4      00:09:14
 28052       9   4,035      36,315       741.8      48.7      00:12:19
 34679       7   4,035      28,245       926.0      60.8      00:09:35
 35450      10   4,035      40,350       947.8      62.2      00:09:01
 28473       6   4,035      24,210       753.4      49.5      00:12:07
 35152      10   4,035      40,350       939.4      61.7      00:09:21
 35926       9   4,035      36,315       960.9      63.1      00:08:48
 28818       5   4,035      20,175       763.1      50.1      00:11:59
 35632       9   4,035      36,315       952.8      62.5      00:09:06
 36403       6   4,035      24,210       974.3      64.0      00:08:34
 29164       9   4,035      36,315       772.7      50.7      00:11:51
 36115      10   4,035      40,350       966.2      63.4      00:08:51
 36805       9   4,035      36,315       985.1      64.7      00:08:24
 29575       8   4,035      32,280       783.6      51.4      00:11:40
 37182       9   4,035      36,315       995.1      65.3      00:08:15
 36578       5   4,035      20,175       979.0      64.3      00:08:38
 29900       5   4,035      20,175       792.5      52.0      00:11:33
 37518       6   4,035      24,210     1,003.7      65.9      00:08:08
 36953       7   4,035      28,245       989.3      64.9      00:08:29
 30180       9   4,035      36,315       800.1      52.5      00:11:28
 37849       9   4,035      36,315     1,012.4      66.4      00:08:00
 37321       4   4,035      16,140       998.6      65.5      00:08:20
 30539       8   4,035      32,280       810.1      53.2      00:11:19
 38175       3   4,035      12,105     1,021.3      67.0      00:07:53
 37659       9   4,035      36,315     1,007.5      66.1      00:08:13
 30984       2   4,035       8,070       822.3      54.0      00:11:06
 38499       6   4,035      24,210     1,030.4      67.6      00:07:45
 37995       6   4,035      24,210     1,016.3      66.7      00:08:05
 31436       7   4,035      28,245       834.7      54.8      00:10:53
 38835       8   4,035      32,280     1,039.5      68.2      00:07:37
 38330       9   4,035      36,315     1,025.6      67.3      00:07:57
 31896       7   4,035      28,245       847.7      55.6      00:10:39
 39151       7   4,035      28,245     1,048.1      68.8      00:07:30
 38649       8   4,035      32,280     1,034.4      67.9      00:07:49
 32354       9   4,035      36,315       860.8      56.5      00:10:25
 39486       3   4,035      12,105     1,056.8      69.4      00:07:22
 38971       5   4,035      20,175     1,043.2      68.5      00:07:41
 32723       6   4,035      24,210       871.1      57.2      00:10:15
 39855       8   4,035      32,280     1,066.7      70.0      00:07:13
 39274       5   4,035      20,175     1,051.2      69.0      00:07:35
 33056       8   4,035      32,280       880.5      57.8      00:10:07
 40354       8   4,035      32,280     1,080.0      70.9      00:06:60
 39674       8   4,035      32,280     1,061.9      69.7      00:07:24
 33457       5   4,035      20,175       891.6      58.5      00:09:56
 40799       8   4,035      32,280     1,092.3      71.7      00:06:47
 40111       6   4,035      24,210     1,073.5      70.5      00:07:13
 33861       8   4,035      32,280       903.0      59.3      00:09:45
 41160       4   4,035      16,140     1,102.3      72.3      00:06:38
 40613       4   4,035      16,140     1,087.2      71.4      00:06:58
 34264       5   4,035      20,175       914.5      60.0      00:09:34
 41541       5   4,035      20,175     1,112.6      73.0      00:06:28
 41042       8   4,035      32,280     1,099.1      72.1      00:06:46
 34745       8   4,035      32,280       927.9      60.9      00:09:19
 41914       6   4,035      24,210     1,122.9      73.7      00:06:19
 41373       7   4,035      28,245     1,108.0      72.7      00:06:38
 35240       6   4,035      24,210       941.9      61.8      00:09:04
 42219       9   4,035      36,315     1,130.7      74.2      00:06:12
 41733       9   4,035      36,315     1,117.8      73.4      00:06:29
 35745       5   4,035      20,175       955.9      62.7      00:08:49
 42541      10   4,035      40,350     1,139.4      74.8      00:06:05
 42070      10   4,035      40,350     1,127.0      74.0      00:06:21
 36245       8   4,035      32,280       969.9      63.7      00:08:35
 42888       7   4,035      28,245     1,148.6      75.4      00:05:56
 42430       8   4,035      32,280     1,136.4      74.6      00:06:12
 36682       8   4,035      32,280       982.0      64.5      00:08:23
 43196      10   4,035      40,350     1,157.3      76.0      00:05:49
 42775       8   4,035      32,280     1,145.5      75.2      00:06:04
 37061       9   4,035      36,315       992.0      65.1      00:08:14
 43520      10   4,035      40,350     1,166.2      76.5      00:05:41
 43088       6   4,035      24,210     1,154.2      75.8      00:05:56
 37433       4   4,035      16,140     1,001.5      65.7      00:08:05
 43857       5   4,035      20,175     1,175.0      77.1      00:05:33
 43413       5   4,035      20,175     1,163.3      76.4      00:05:47
 37786       9   4,035      36,315     1,010.7      66.3      00:07:58
 44203       5   4,035      20,175     1,184.3      77.7      00:05:24
 43759       8   4,035      32,280     1,172.3      76.9      00:05:39
 38115       8   4,035      32,280     1,019.6      66.9      00:07:50
 44534       7   4,035      28,245     1,193.0      78.3      00:05:16
 44100      10   4,035      40,350     1,181.6      77.6      00:05:31
 38456       7   4,035      28,245     1,029.2      67.5      00:07:42
 44897       6   4,035      24,210     1,202.9      78.9      00:05:07
 44419       5   4,035      20,175     1,189.8      78.1      00:05:23
 38789       9   4,035      36,315     1,038.3      68.1      00:07:34
 45314       5   4,035      20,175     1,213.6      79.7      00:04:57
 44783       8   4,035      32,280     1,199.7      78.7      00:05:14
 39136       7   4,035      28,245     1,047.7      68.8      00:07:26
 45626       9   4,035      36,315     1,221.5      80.2      00:04:50
 45154       6   4,035      24,210     1,209.7      79.4      00:05:04
 39508       3   4,035      12,105     1,057.4      69.4      00:07:17
 45982      10   4,035      40,350     1,230.8      80.8      00:04:41
 45514       6   4,035      24,210     1,218.8      80.0      00:04:56
 39922       9   4,035      36,315     1,068.5      70.1      00:07:07
 46325       7   4,035      28,245     1,240.4      81.4      00:04:32
 45896       7   4,035      28,245     1,228.5      80.6      00:04:46
 40433       3   4,035      12,105     1,082.2      71.0      00:06:53
 46722       6   4,035      24,210     1,251.1      82.1      00:04:22
 46245       8   4,035      32,280     1,238.1      81.3      00:04:37
 40936       7   4,035      28,245     1,096.0      71.9      00:06:38
 47081       6   4,035      24,210     1,260.4      82.7      00:04:13
 46584       8   4,035      32,280     1,247.4      81.9      00:04:28
 41248       7   4,035      28,245     1,104.7      72.5      00:06:31
 47439       7   4,035      28,245     1,269.6      83.3      00:04:04
 46989       7   4,035      28,245     1,258.1      82.6      00:04:18
 41662       9   4,035      36,315     1,116.0      73.2      00:06:20
 47791       8   4,035      32,280     1,278.8      83.9      00:03:56
 47316      10   4,035      40,350     1,266.3      83.1      00:04:10
 42027       4   4,035      16,140     1,125.9      73.9      00:06:11
 48112       3   4,035      12,105     1,287.4      84.5      00:03:48
 47648       7   4,035      28,245     1,274.9      83.7      00:04:02
 42413       6   4,035      24,210     1,135.9      74.6      00:06:02
 48473       5   4,035      20,175     1,297.1      85.1      00:03:39
 47974       9   4,035      36,315     1,283.7      84.3      00:03:54
 42777       7   4,035      28,245     1,145.5      75.2      00:05:54
 48843      10   4,035      40,350     1,307.0      85.8      00:03:29
 48302      10   4,035      40,350     1,292.5      84.8      00:03:46
 43125       8   4,035      32,280     1,155.2      75.8      00:05:45
 49184      10   4,035      40,350     1,316.3      86.4      00:03:20
 48659      10   4,035      40,350     1,302.2      85.5      00:03:36
 43502       6   4,035      24,210     1,165.7      76.5      00:05:35
 49551       8   4,035      32,280     1,325.7      87.0      00:03:11
 49029       9   4,035      36,315     1,311.9      86.1      00:03:27
 43878       8   4,035      32,280     1,175.6      77.2      00:05:26
 49880       5   4,035      20,175     1,333.9      87.6      00:03:04
 49366       6   4,035      24,210     1,321.1      86.7      00:03:18
 44275       8   4,035      32,280     1,186.2      77.9      00:05:16
 50173       7   4,035      28,245     1,341.7      88.1      00:02:56
 49704       8   4,035      32,280     1,329.4      87.3      00:03:10
 44705       9   4,035      36,315     1,197.6      78.6      00:05:05
 50497       5   4,035      20,175     1,349.9      88.6      00:02:49
 50011       8   4,035      32,280     1,337.5      87.8      00:03:03
 45142       4   4,035      16,140     1,209.3      79.4      00:04:54
 50848       7   4,035      28,245     1,359.6      89.2      00:02:39
 50314       4   4,035      16,140     1,345.3      88.3      00:02:55
 45556       4   4,035      16,140     1,219.8      80.1      00:04:44
 51185       5   4,035      20,175     1,368.8      89.8      00:02:31
 50632      10   4,035      40,350     1,353.7      88.8      00:02:47
 45915       8   4,035      32,280     1,229.0      80.7      00:04:36
 51564       6   4,035      24,210     1,379.2      90.5      00:02:21
 50927       6   4,035      24,210     1,361.8      89.4      00:02:40
 46292       6   4,035      24,210     1,239.5      81.4      00:04:26
 51959       7   4,035      28,245     1,390.2      91.2      00:02:10
 51239       4   4,035      16,140     1,370.3      89.9      00:02:31
 46711       7   4,035      28,245     1,250.8      82.1      00:04:16
 52330       8   4,035      32,280     1,400.9      91.9      00:01:59
 51543       7   4,035      28,245     1,378.6      90.5      00:02:23
 47111       6   4,035      24,210     1,261.2      82.8      00:04:06
 52695       6   4,035      24,210     1,411.7      92.7      00:01:49
 51845       8   4,035      32,280     1,387.1      91.0      00:02:15
 47497       7   4,035      28,245     1,271.0      83.4      00:03:57
 53074       7   4,035      28,245     1,422.6      93.4      00:01:38
 52148       9   4,035      36,315     1,395.7      91.6      00:02:07
 47866       8   4,035      32,280     1,280.7      84.1      00:03:48
 53518       9   4,035      36,315     1,435.0      94.2      00:01:26
 52497       9   4,035      36,315     1,405.8      92.3      00:01:57
 48227       6   4,035      24,210     1,290.4      84.7      00:03:39
 53911      10   4,035      40,350     1,445.8      94.9      00:01:15
 52940       9   4,035      36,315     1,418.8      93.1      00:01:44
 48602       9   4,035      36,315     1,300.7      85.4      00:03:29
 54266       5   4,035      20,175     1,455.4      95.5      00:01:06
 53399       6   4,035      24,210     1,431.6      94.0      00:01:31
 48994       7   4,035      28,245     1,311.1      86.1      00:03:20
 54644       4   4,035      16,140     1,465.0      96.2      00:00:57
 53821       8   4,035      32,280     1,443.4      94.7      00:01:19
 49383       6   4,035      24,210     1,321.5      86.7      00:03:10
 55061       6   4,035      24,210     1,476.0      96.9      00:00:46
 54123       3   4,035      12,105     1,451.4      95.3      00:01:11
 49935       8   4,035      32,280     1,335.4      87.6      00:02:56
 55471       5   4,035      20,175     1,486.5      97.6      00:00:36
 54428       5   4,035      20,175     1,459.6      95.8      00:01:03
 50421       9   4,035      36,315     1,347.9      88.5      00:02:44
 55827       8   4,035      32,280     1,495.9      98.2      00:00:27
 54795       5   4,035      20,175     1,469.1      96.4      00:00:54
 50808       8   4,035      32,280     1,358.5      89.2      00:02:35
 56210      10   4,035      40,350     1,506.5      98.9      00:00:17
 55207       6   4,035      24,210     1,479.9      97.1      00:00:43
 51187       8   4,035      32,280     1,368.9      89.8      00:02:25
 56604       8   4,035      32,280     1,517.6      99.6      00:00:06
 55585       4   4,035      16,140     1,489.4      97.8      00:00:34
 51579       5   4,035      20,175     1,379.6      90.6      00:02:15
 55896       8   4,035      32,280     1,497.9      98.3      00:00:25

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1482.71
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 51978       8   4,035      32,280     1,390.7      91.3      00:02:04
 56269      10   4,035      40,350     1,508.2      99.0      00:00:15
 52342       6   4,035      24,210     1,401.2      92.0      00:01:55
 56622       4   4,035      16,140     1,518.1      99.6      00:00:05
 52708       8   4,035      32,280     1,412.1      92.7      00:01:44

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1512.988
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 53062       7   4,035      28,245     1,422.3      93.4      00:01:35
 53492       8   4,035      32,280     1,434.3      94.1      00:01:24
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv not
    found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv saved

. 
. cap log close

. 
end of do-file
 53913       8   4,035      32,280     1,445.9      94.9      00:01:13
 54273      10   4,035      40,350     1,455.6      95.5      00:01:04
 54656       5   4,035      20,175     1,465.3      96.2      00:00:55
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv not
    found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv saved

. 
. cap log close

. 
end of do-file
 55049       4   4,035      16,140     1,475.7      96.9      00:00:45
 55410       8   4,035      32,280     1,485.0      97.5      00:00:36
 55741       5   4,035      20,175     1,493.6      98.0      00:00:28
 56060       2   4,035       8,070     1,502.4      98.6      00:00:20
 56439       8   4,035      32,280     1,513.0      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1437.043
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv not
    found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv saved

. 
. cap log close

. 
end of do-file
