
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial/M10_K10000_4q/Dollar//vaccinated/ca_Dollar_locat
> ions_total_10000_10_4q_mnl.dta /export/storage_covidvaccine/Result/MNL_partia
> l/M10_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_10_4q_mnl.c
> sv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M10_K10000_4q/Dollar/
> /vaccinated/ca_Dollar_locations_total_10000_10_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M10_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_10_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   521       9   4,035      36,315        12.1       0.8      00:20:48
  1109       7   4,035      28,245        26.8       1.8      00:18:40
  1690       6   4,035      24,210        42.3       2.8      00:17:31
  2276       7   4,035      28,245        57.3       3.8      00:17:05
  2858       5   4,035      20,175        72.4       4.8      00:16:43
  3410       6   4,035      24,210        87.1       5.7      00:16:31
  3968      10   4,035      40,350       101.6       6.7      00:16:21
  4456       5   4,035      20,175       113.8       7.5      00:16:32
  4918       2   4,035       8,070       126.2       8.3      00:16:38
  5371      10   4,035      40,350       138.1       9.1      00:16:44
  5771       2   4,035       8,070       147.8       9.7      00:17:05
  6239       7   4,035      28,245       160.1      10.5      00:17:03
  6697       4   4,035      16,140       171.6      11.3      00:17:05
  7167      10   4,035      40,350       183.5      12.0      00:17:03
  7713       9   4,035      36,315       197.9      13.0      00:16:46
  8238       7   4,035      28,245       212.6      14.0      00:16:28
  8744       9   4,035      36,315       226.5      14.9      00:16:15
  9250      10   4,035      40,350       240.5      15.8      00:16:01
  9644       6   4,035      24,210       251.4      16.5      00:16:02
 10063       4   4,035      16,140       262.6      17.2      00:16:01
 10475       9   4,035      36,315       273.0      17.9      00:16:03
 10962       9   4,035      36,315       285.6      18.7      00:15:55
 11405       8   4,035      32,280       297.2      19.5      00:15:50
 11815       7   4,035      28,245       308.0      20.2      00:15:48
 12198       7   4,035      28,245       318.3      20.9      00:15:48
 12687      10   4,035      40,350       331.1      21.7      00:15:38
 13238       7   4,035      28,245       345.3      22.7      00:15:22
 13754       5   4,035      20,175       359.4      23.6      00:15:08
 14315       8   4,035      32,280       374.4      24.6      00:14:51
 14884      10   4,035      40,350       389.7      25.6      00:14:34
 15445       2   4,035       8,070       405.0      26.6      00:14:17
 16013       7   4,035      28,245       420.5      27.6      00:14:00
 16552       8   4,035      32,280       435.6      28.6      00:13:45
 16975       9   4,035      36,315       446.9      29.3      00:13:40
 17347       6   4,035      24,210       457.0      30.0      00:13:38
 17726       5   4,035      20,175       467.5      30.7      00:13:34
 18195       8   4,035      32,280       480.2      31.5      00:13:25
 18715       7   4,035      28,245       494.1      32.4      00:13:13
 19272       6   4,035      24,210       509.6      33.4      00:12:57
 19817       5   4,035      20,175       524.9      34.5      00:12:42
 20382       4   4,035      16,140       540.5      35.5      00:12:27
 20781       6   4,035      24,210       551.6      36.2      00:12:21
 21195      10   4,035      40,350       562.6      36.9      00:12:15
 21646       6   4,035      24,210       573.8      37.7      00:12:09
 22085       7   4,035      28,245       585.0      38.4      00:12:03
 22542       7   4,035      28,245       596.4      39.1      00:11:56
 22976       8   4,035      32,280       607.3      39.9      00:11:50
 23404       9   4,035      36,315       618.9      40.6      00:11:43
 23818       8   4,035      32,280       629.5      41.3      00:11:37
 24278       8   4,035      32,280       641.4      42.1      00:11:28
 24818       7   4,035      28,245       655.6      43.0      00:11:16
 25324       9   4,035      36,315       669.1      43.9      00:11:05
 25760       4   4,035      16,140       680.7      44.7      00:10:57
 26143       8   4,035      32,280       691.1      45.4      00:10:51
 26628       7   4,035      28,245       703.6      46.2      00:10:42
 27087       9   4,035      36,315       715.9      47.0      00:10:33
 27470       6   4,035      24,210       726.0      47.7      00:10:27
 27920       7   4,035      28,245       738.3      48.5      00:10:18
 28441       9   4,035      36,315       752.5      49.4      00:10:05
 28862       5   4,035      20,175       764.4      50.2      00:09:57
 29259       7   4,035      28,245       775.0      50.9      00:09:50
 29740       5   4,035      20,175       788.1      51.7      00:09:39
 30098       6   4,035      24,210       797.9      52.4      00:09:34
 30503       7   4,035      28,245       809.1      53.1      00:09:26
 31037       7   4,035      28,245       823.6      54.1      00:09:13
 31571      10   4,035      40,350       838.5      55.0      00:08:60
 32115       8   4,035      32,280       854.0      56.0      00:08:46
 32609       8   4,035      32,280       867.9      57.0      00:08:34
 32959       8   4,035      32,280       877.7      57.6      00:08:28
 33352       9   4,035      36,315       888.7      58.3      00:08:21
 33793      10   4,035      40,350       901.1      59.1      00:08:11
 34251       7   4,035      28,245       914.1      60.0      00:08:01
 34781       3   4,035      12,105       929.0      61.0      00:07:48
 35330       4   4,035      16,140       944.4      62.0      00:07:34
 35880       9   4,035      36,315       959.7      63.0      00:07:21
 36443       9   4,035      36,315       975.4      64.0      00:07:08
 36910      10   4,035      40,350       988.0      64.9      00:06:58
 37314       7   4,035      28,245       998.4      65.5      00:06:51
 37688       7   4,035      28,245     1,008.2      66.2      00:06:44
 38041       2   4,035       8,070     1,017.5      66.8      00:06:38
 38391      10   4,035      40,350     1,027.3      67.4      00:06:32
 38746       9   4,035      36,315     1,037.1      68.1      00:06:25
 39137       6   4,035      24,210     1,047.7      68.8      00:06:17
 39589       9   4,035      36,315     1,059.6      69.5      00:06:08
 40121       4   4,035      16,140     1,073.8      70.5      00:05:57
 40693      10   4,035      40,350     1,089.4      71.5      00:05:43
 41151       7   4,035      28,245     1,102.0      72.3      00:05:33
 41589       4   4,035      16,140     1,113.9      73.1      00:05:24
 42014       9   4,035      36,315     1,125.6      73.9      00:05:15
 42468       7   4,035      28,245     1,137.4      74.7      00:05:06
 42920       6   4,035      24,210     1,149.4      75.4      00:04:57
 43354       9   4,035      36,315     1,161.6      76.2      00:04:47
 43759       8   4,035      32,280     1,172.3      76.9      00:04:39
 44169       8   4,035      32,280     1,183.3      77.7      00:04:31
 44616       7   4,035      28,245     1,195.2      78.4      00:04:21
 45070       9   4,035      36,315     1,207.5      79.3      00:04:12
 45520       6   4,035      24,210     1,218.9      80.0      00:04:03
 45956       8   4,035      32,280     1,230.1      80.7      00:03:54
 46362       2   4,035       8,070     1,241.3      81.5      00:03:45
 46844       9   4,035      36,315     1,254.5      82.3      00:03:35
 47250       9   4,035      36,315     1,264.6      83.0      00:03:27
 47668      10   4,035      40,350     1,275.5      83.7      00:03:19
 48063       2   4,035       8,070     1,286.1      84.4      00:03:10
 48494      10   4,035      40,350     1,297.7      85.2      00:03:01
 48946       5   4,035      20,175     1,309.8      86.0      00:02:52
 49418       5   4,035      20,175     1,322.3      86.8      00:02:42
 50025       9   4,035      36,315     1,337.9      87.8      00:02:29
 50511       8   4,035      32,280     1,350.3      88.6      00:02:19
 50918       4   4,035      16,140     1,361.5      89.4      00:02:10
 51341      10   4,035      40,350     1,373.0      90.1      00:02:01
 51783       9   4,035      36,315     1,385.4      90.9      00:01:51
 52224       4   4,035      16,140     1,398.0      91.8      00:01:41
 52643       9   4,035      36,315     1,410.1      92.6      00:01:31
 53056       8   4,035      32,280     1,422.1      93.3      00:01:21
 53544       9   4,035      36,315     1,435.7      94.2      00:01:10
 54006       7   4,035      28,245     1,448.3      95.1      00:01:00
 54423       5   4,035      20,175     1,459.4      95.8      00:00:51
 54905       6   4,035      24,210     1,471.9      96.6      00:00:41
 55364       4   4,035      16,140     1,483.8      97.4      00:00:32
 55743       7   4,035      28,245     1,493.7      98.0      00:00:24
 56176       9   4,035      36,315     1,505.6      98.8      00:00:15
 56552       4   4,035      16,140     1,516.2      99.5      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1233.543
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial/M10_K10000_4q/Dollar//vac
    > cinated/ca_blk_Dollar_dist_total_10000_10_4q_mnl.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial/M10_K10000_4q/Dollar//vacc
> inated/ca_blk_Dollar_dist_total_10000_10_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
