
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A900.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A900.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   310       8   4,935      39,480         8.9       0.5      00:34:54
   660      10   4,935      49,350        19.0       1.0      00:32:19
  1016       6   4,935      29,610        30.0       1.6      00:30:36
  1308       8   4,935      39,480        39.4       2.1      00:30:54
  1609      10   4,935      49,350        49.3       2.6      00:30:43
  1912       9   4,935      44,415        58.6       3.1      00:30:51
  2244       5   4,935      24,675        69.3       3.7      00:30:16
  2491      10   4,935      49,350        76.8       4.1      00:31:03
  2799       8   4,935      39,480        86.9       4.7      00:30:43
  3117       5   4,935      24,675        96.9       5.2      00:30:25
  3419       6   4,935      29,610       107.2       5.8      00:30:05
  3676      10   4,935      49,350       115.5       6.2      00:30:19
  3970       7   4,935      34,545       124.5       6.7      00:30:18
  4205       6   4,935      29,610       131.9       7.1      00:30:41
  4450      10   4,935      49,350       139.2       7.5      00:31:01
  4659      10   4,935      49,350       146.2       7.9      00:31:22
  4852       4   4,935      19,740       152.4       8.2      00:31:52
  5140       8   4,935      39,480       161.5       8.7      00:31:39
  5390       8   4,935      39,480       169.8       9.1      00:31:38
  5614       7   4,935      34,545       176.2       9.5      00:31:58
  5812       6   4,935      29,610       182.3       9.8      00:32:20
  6043       8   4,935      39,480       189.8      10.2      00:32:23
  6317       6   4,935      29,610       198.3      10.7      00:32:14
  6549       6   4,935      29,610       205.5      11.0      00:32:19
  6809       5   4,935      24,675       213.7      11.5      00:32:13
  7047      10   4,935      49,350       221.0      11.9      00:32:15
  7312       9   4,935      44,415       229.4      12.3      00:32:07
  7585       5   4,935      24,675       238.3      12.8      00:31:52
  7861      10   4,935      49,350       247.3      13.3      00:31:38
  8179       7   4,935      34,545       258.2      13.9      00:31:08
  8423       6   4,935      29,610       266.5      14.3      00:31:01
  8697      10   4,935      49,350       275.6      14.8      00:30:46
  9025       9   4,935      44,415       286.6      15.4      00:30:18
  9281       7   4,935      34,545       295.4      15.9      00:30:07
  9496       8   4,935      39,480       302.6      16.3      00:30:08
  9705       3   4,935      14,805       309.9      16.6      00:30:07
  9895       8   4,935      39,480       316.1      17.0      00:30:13
 10102       3   4,935      14,805       322.4      17.3      00:30:19
 10339      10   4,935      49,350       329.7      17.7      00:30:17
 10609      10   4,935      49,350       338.2      18.2      00:30:06
 10878       6   4,935      29,610       346.8      18.6      00:29:55
 11130       9   4,935      44,415       354.8      19.1      00:29:48
 11298       7   4,935      34,545       360.1      19.3      00:29:57
 11454       8   4,935      39,480       365.3      19.6      00:30:07
 11651       9   4,935      44,415       371.6      20.0      00:30:09
 11850       4   4,935      19,740       378.0      20.3      00:30:10
 12052       6   4,935      29,610       384.6      20.7      00:30:09
 12241       8   4,935      39,480       390.8      21.0      00:30:11
 12500       9   4,935      44,415       399.1      21.4      00:30:00
 12764       8   4,935      39,480       407.2      21.9      00:29:50
 13031       7   4,935      34,545       415.8      22.3      00:29:38
 13265       9   4,935      44,415       423.3      22.7      00:29:31
 13474       7   4,935      34,545       430.5      23.1      00:29:26
 13664      10   4,935      49,350       437.0      23.5      00:29:25
 13825       4   4,935      19,740       442.1      23.7      00:29:31
 13974       3   4,935      14,805       446.8      24.0      00:29:38
 14123       9   4,935      44,415       451.6      24.3      00:29:44
 14302       5   4,935      24,675       457.7      24.6      00:29:44
 14520       9   4,935      44,415       465.0      25.0      00:29:37
 14750       9   4,935      44,415       472.4      25.4      00:29:29
 14983       6   4,935      29,610       480.2      25.8      00:29:20
 15242       6   4,935      29,610       488.9      26.3      00:29:05
 15528      10   4,935      49,350       498.3      26.8      00:28:49
 15830       8   4,935      39,480       508.3      27.3      00:28:29
 16136       8   4,935      39,480       518.9      27.9      00:28:07
 16474       9   4,935      44,415       530.5      28.5      00:27:41
 16663       8   4,935      39,480       536.5      28.8      00:27:40
 16893       6   4,935      29,610       544.0      29.2      00:27:32
 17116      10   4,935      49,350       551.4      29.6      00:27:24
 17309       7   4,935      34,545       557.8      30.0      00:27:21
 17522       6   4,935      29,610       565.3      30.4      00:27:12
 17736       8   4,935      39,480       572.3      30.7      00:27:07
 18012       9   4,935      44,415       581.3      31.2      00:26:52
 18406       4   4,935      19,740       594.2      31.9      00:26:23
 18662       7   4,935      34,545       602.7      32.4      00:26:11
 18889      10   4,935      49,350       610.4      32.8      00:26:02
 19167       6   4,935      29,610       620.0      33.3      00:25:46
 19472       4   4,935      19,740       630.4      33.9      00:25:28
 19786       9   4,935      44,415       641.3      34.4      00:25:07
 20077       7   4,935      34,545       651.5      35.0      00:24:50
 20387       8   4,935      39,480       661.6      35.5      00:24:33
 20561       8   4,935      39,480       667.6      35.9      00:24:31
 20730       9   4,935      44,415       673.2      36.2      00:24:29
 20920       9   4,935      44,415       679.7      36.5      00:24:25
 21159       6   4,935      29,610       687.2      36.9      00:24:17
 21360       8   4,935      39,480       693.2      37.2      00:24:14
 21572       8   4,935      39,480       699.9      37.6      00:24:08
 21756       5   4,935      24,675       705.3      37.9      00:24:07
 21936       6   4,935      29,610       711.1      38.2      00:24:04
 22112      10   4,935      49,350       716.4      38.5      00:24:03
 22278       6   4,935      29,610       721.5      38.7      00:24:02
 22507       1   4,935       4,935       728.6      39.1      00:23:54
 22742       7   4,935      34,545       735.8      39.5      00:23:47
 23055      10   4,935      49,350       745.8      40.1      00:23:30
 23382       8   4,935      39,480       756.4      40.6      00:23:12
 23741      10   4,935      49,350       767.6      41.2      00:22:52
 24044       7   4,935      34,545       777.5      41.8      00:22:36
 24351      10   4,935      49,350       786.6      42.2      00:22:23
 24654       8   4,935      39,480       796.9      42.8      00:22:06
 24966       7   4,935      34,545       806.7      43.3      00:21:51
 25248       9   4,935      44,415       816.2      43.8      00:21:37
 25535      10   4,935      49,350       825.6      44.3      00:21:23
 25728      10   4,935      49,350       831.8      44.7      00:21:19
 25905       8   4,935      39,480       837.7      45.0      00:21:14
 26112       8   4,935      39,480       844.5      45.4      00:21:08
 26439       4   4,935      19,740       855.1      45.9      00:20:51
 26749      10   4,935      49,350       864.9      46.4      00:20:36
 27024       8   4,935      39,480       873.9      46.9      00:20:24
 27246       4   4,935      19,740       881.0      47.3      00:20:16
 27443       6   4,935      29,610       887.5      47.7      00:20:11
 27714       7   4,935      34,545       896.5      48.1      00:19:58
 28034       6   4,935      29,610       907.1      48.7      00:19:42
 28324       6   4,935      29,610       916.9      49.2      00:19:27
 28651       7   4,935      34,545       928.1      49.8      00:19:10
 28896       8   4,935      39,480       936.4      50.3      00:18:59
 29159       4   4,935      19,740       945.1      50.8      00:18:48
 29474       6   4,935      29,610       955.6      51.3      00:18:32
 29764       9   4,935      44,415       965.1      51.8      00:18:19
 29996       9   4,935      44,415       972.8      52.2      00:18:10
 30229       6   4,935      29,610       980.7      52.7      00:18:01
 30431       9   4,935      44,415       987.6      53.0      00:17:54
 30703       7   4,935      34,545       996.6      53.5      00:17:42
 31022       7   4,935      34,545     1,007.2      54.1      00:17:26
 31357       8   4,935      39,480     1,018.6      54.7      00:17:09
 31649       7   4,935      34,545     1,028.6      55.2      00:16:55
 31915       9   4,935      44,415     1,037.9      55.7      00:16:43
 32147       9   4,935      44,415     1,046.0      56.2      00:16:33
 32399       7   4,935      34,545     1,054.9      56.7      00:16:22
 32560       9   4,935      44,415     1,060.3      56.9      00:16:18
 32697       8   4,935      39,480     1,064.9      57.2      00:16:15
 32911       6   4,935      29,610     1,072.3      57.6      00:16:07
 33126       9   4,935      44,415     1,079.7      58.0      00:15:59
 33398       8   4,935      39,480     1,088.9      58.5      00:15:46
 33658       8   4,935      39,480     1,097.9      59.0      00:15:35
 33917       6   4,935      29,610     1,106.8      59.4      00:15:23
 34185       9   4,935      44,415     1,116.3      59.9      00:15:11
 34529       5   4,935      24,675     1,127.9      60.6      00:14:54
 34805       9   4,935      44,415     1,137.6      61.1      00:14:41
 35051       9   4,935      44,415     1,145.9      61.5      00:14:31
 35318       6   4,935      29,610     1,155.1      62.0      00:14:19
 35602       5   4,935      24,675     1,164.8      62.6      00:14:06
 35875       7   4,935      34,545     1,174.0      63.0      00:13:54
 36152       7   4,935      34,545     1,183.5      63.6      00:13:42
 36413       8   4,935      39,480     1,192.4      64.0      00:13:30
 36655       6   4,935      29,610     1,200.5      64.5      00:13:21
 36876       6   4,935      29,610     1,207.7      64.9      00:13:13
 37104       8   4,935      39,480     1,215.1      65.3      00:13:04
 37361       6   4,935      29,610     1,222.9      65.7      00:12:55
 37569       7   4,935      34,545     1,229.6      66.0      00:12:48
 37754      10   4,935      49,350     1,235.5      66.3      00:12:42
 37911       7   4,935      34,545     1,240.7      66.6      00:12:38
 38116      10   4,935      49,350     1,247.5      67.0      00:12:30
 38352       6   4,935      29,610     1,255.5      67.4      00:12:21
 38654       9   4,935      44,415     1,265.8      68.0      00:12:07
 38965       9   4,935      44,415     1,276.2      68.5      00:11:53
 39204      10   4,935      49,350     1,283.8      68.9      00:11:44
 39455      10   4,935      49,350     1,291.9      69.4      00:11:34
 39667      10   4,935      49,350     1,298.8      69.8      00:11:27
 39925       9   4,935      44,415     1,307.4      70.2      00:11:16
 40224       5   4,935      24,675     1,317.0      70.7      00:11:04
 40513       7   4,935      34,545     1,326.8      71.3      00:10:51
 40799       7   4,935      34,545     1,336.4      71.8      00:10:39
 41035       4   4,935      19,740     1,344.4      72.2      00:10:29
 41241      10   4,935      49,350     1,351.2      72.6      00:10:21
 41457       5   4,935      24,675     1,358.4      73.0      00:10:13
 41658       8   4,935      39,480     1,365.1      73.3      00:10:06
 41843      10   4,935      49,350     1,371.3      73.6      00:09:59
 42027       5   4,935      24,675     1,377.3      74.0      00:09:53
 42232      10   4,935      49,350     1,383.7      74.3      00:09:46
 42417      10   4,935      49,350     1,389.9      74.6      00:09:39
 42602       8   4,935      39,480     1,395.7      75.0      00:09:33
 42776       7   4,935      34,545     1,401.4      75.3      00:09:27
 42964       6   4,935      29,610     1,407.8      75.6      00:09:20
 43157       7   4,935      34,545     1,414.5      76.0      00:09:12
 43331       6   4,935      29,610     1,420.4      76.3      00:09:05
 43537      10   4,935      49,350     1,427.2      76.6      00:08:58
 43835       7   4,935      34,545     1,436.8      77.2      00:08:45
 44096       4   4,935      19,740     1,445.2      77.6      00:08:35
 44272       7   4,935      34,545     1,451.2      77.9      00:08:28
 44465       6   4,935      29,610     1,457.3      78.3      00:08:21
 44710       9   4,935      44,415     1,465.2      78.7      00:08:11
 44915       9   4,935      44,415     1,472.1      79.1      00:08:03
 45155       5   4,935      24,675     1,479.8      79.5      00:07:54
 45387       6   4,935      29,610     1,486.8      79.8      00:07:46
 45599       5   4,935      24,675     1,493.4      80.2      00:07:38
 45831      10   4,935      49,350     1,500.7      80.6      00:07:29
 46034      10   4,935      49,350     1,507.5      81.0      00:07:21
 46233       7   4,935      34,545     1,514.3      81.3      00:07:13
 46438       9   4,935      44,415     1,520.9      81.7      00:07:05
 46626      10   4,935      49,350     1,527.2      82.0      00:06:58
 46862       5   4,935      24,675     1,535.2      82.4      00:06:48
 47035      10   4,935      49,350     1,540.3      82.7      00:06:42
 47217       7   4,935      34,545     1,545.9      83.0      00:06:36
 47375       7   4,935      34,545     1,551.0      83.3      00:06:30
 47552       5   4,935      24,675     1,556.4      83.6      00:06:24
 47744       2   4,935       9,870     1,562.8      83.9      00:06:16
 47924      10   4,935      49,350     1,568.7      84.2      00:06:09
 48110      10   4,935      49,350     1,574.7      84.6      00:06:02
 48324       9   4,935      44,415     1,581.9      85.0      00:05:53
 48550       7   4,935      34,545     1,589.3      85.4      00:05:44
 48784       9   4,935      44,415     1,596.9      85.8      00:05:35
 48998      10   4,935      49,350     1,603.9      86.1      00:05:26
 49176      10   4,935      49,350     1,610.1      86.5      00:05:18
 49366       3   4,935      14,805     1,615.9      86.8      00:05:12
 49548       6   4,935      29,610     1,621.6      87.1      00:05:05
 49762       5   4,935      24,675     1,628.0      87.4      00:04:57
 49951      10   4,935      49,350     1,634.2      87.8      00:04:49
 50158       8   4,935      39,480     1,640.9      88.1      00:04:41
 50361       6   4,935      29,610     1,647.0      88.4      00:04:34
 50566       4   4,935      19,740     1,653.8      88.8      00:04:25
 50766       6   4,935      29,610     1,660.5      89.2      00:04:17
 50940       7   4,935      34,545     1,666.5      89.5      00:04:09
 51139       9   4,935      44,415     1,673.1      89.8      00:04:01
 51345       9   4,935      44,415     1,679.9      90.2      00:03:53
 51554       7   4,935      34,545     1,686.9      90.6      00:03:44
 51749       9   4,935      44,415     1,693.8      91.0      00:03:35
 51935       6   4,935      29,610     1,700.0      91.3      00:03:27
 52205       8   4,935      39,480     1,709.6      91.8      00:03:15
 52448       8   4,935      39,480     1,718.2      92.3      00:03:04
 52694       6   4,935      29,610     1,727.2      92.8      00:02:52
 52934       7   4,935      34,545     1,735.5      93.2      00:02:42
 53172       5   4,935      24,675     1,743.8      93.6      00:02:31
 53452      10   4,935      49,350     1,753.3      94.2      00:02:19
 53703       7   4,935      34,545     1,761.8      94.6      00:02:08
 53895       5   4,935      24,675     1,768.2      95.0      00:01:60
 54091       8   4,935      39,480     1,774.6      95.3      00:01:52
 54280      10   4,935      49,350     1,780.9      95.6      00:01:44
 54555       8   4,935      39,480     1,789.2      96.1      00:01:33
 54806       4   4,935      19,740     1,797.4      96.5      00:01:23
 55055       7   4,935      34,545     1,805.5      97.0      00:01:12
 55289       4   4,935      19,740     1,812.8      97.4      00:01:03
 55483       1   4,935       4,935     1,818.9      97.7      00:00:55
 55698       9   4,935      44,415     1,825.9      98.1      00:00:46
 55904       7   4,935      34,545     1,832.8      98.4      00:00:37
 56122       9   4,935      44,415     1,840.0      98.8      00:00:28
 56334       9   4,935      44,415     1,847.4      99.2      00:00:19
 56574       4   4,935      19,740     1,855.5      99.6      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 2390.487
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900.csv saved

. 
. cap log close

. 
end of do-file
