
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A800_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   245       1   4,835       4,835         6.8       0.4      00:44:47
   517       8   4,835      38,680        14.6       0.8      00:41:30
   784       6   4,835      29,010        22.6       1.2      00:39:54
  1041       7   4,835      33,845        30.2       1.7      00:39:43
  1245      10   4,835      48,350        36.6       2.0      00:40:49
  1439       6   4,835      29,010        42.9       2.3      00:41:44
  1644       6   4,835      29,010        49.3       2.7      00:42:08
  1856      10   4,835      48,350        55.9       3.1      00:42:21
  2052       7   4,835      33,845        61.7       3.4      00:42:59
  2273       7   4,835      33,845        68.7       3.8      00:42:45
  2508       7   4,835      33,845        75.8       4.2      00:42:26
  2712       9   4,835      43,515        82.2       4.5      00:42:31
  2896       7   4,835      33,845        88.1       4.8      00:42:51
  3112       9   4,835      43,515        94.8       5.2      00:42:43
  3317       6   4,835      29,010       101.6       5.6      00:42:32
  3520       6   4,835      29,010       108.1       5.9      00:42:27
  3729      10   4,835      48,350       114.8       6.3      00:42:20
  3923       9   4,835      43,515       120.7       6.6      00:42:30
  4081       9   4,835      43,515       125.4       6.9      00:43:02
  4256      10   4,835      48,350       130.6       7.2      00:43:21
  4415       9   4,835      43,515       135.3       7.4      00:43:49
  4542       6   4,835      29,010       139.4       7.6      00:44:28
  4649       3   4,835      14,505       142.9       7.8      00:45:14
  4753       8   4,835      38,680       146.2       8.0      00:46:02
  4880       8   4,835      38,680       150.2       8.2      00:46:37
  5005       9   4,835      43,515       154.1       8.4      00:47:09
  5136       7   4,835      33,845       158.1       8.7      00:47:37
  5275      10   4,835      48,350       162.4       8.9      00:47:57
  5396       7   4,835      33,845       166.5       9.1      00:48:19
  5533       6   4,835      29,010       170.2       9.3      00:48:47
  5639       6   4,835      29,010       173.4       9.5      00:49:24
  5761       9   4,835      43,515       177.1       9.7      00:49:48
  5890       6   4,835      29,010       181.0       9.9      00:50:09
  6010       7   4,835      33,845       184.9      10.1      00:50:27
  6141       6   4,835      29,010       189.0      10.4      00:50:41
  6264       7   4,835      33,845       192.8      10.6      00:50:59
  6405       7   4,835      33,845       196.9      10.8      00:51:10
  6529      10   4,835      48,350       200.7      11.0      00:51:26
  6646       7   4,835      33,845       204.3      11.2      00:51:46
  6759       5   4,835      24,175       207.7      11.4      00:52:06
  6905       5   4,835      24,175       212.3      11.6      00:52:05
  7048      10   4,835      48,350       216.6      11.9      00:52:10
  7220       4   4,835      19,340       221.7      12.2      00:52:01
  7343       8   4,835      38,680       225.7      12.4      00:52:09
  7515       9   4,835      43,515       231.2      12.7      00:51:54
  7668       4   4,835      19,340       236.0      12.9      00:51:48
  7842       7   4,835      33,845       241.6      13.2      00:51:31
  8024      10   4,835      48,350       247.8      13.6      00:51:06
  8200       8   4,835      38,680       253.7      13.9      00:50:46
  8370       5   4,835      24,175       259.3      14.2      00:50:31
  8526       9   4,835      43,515       264.5      14.5      00:50:20
  8697      10   4,835      48,350       270.0      14.8      00:50:06
  8851       6   4,835      29,010       275.1      15.1      00:49:57
  9015       9   4,835      43,515       280.5      15.4      00:49:44
  9161       9   4,835      43,515       285.4      15.6      00:49:37
  9271      10   4,835      48,350       289.1      15.8      00:49:47
  9388       8   4,835      38,680       292.8      16.1      00:49:54
  9509       7   4,835      33,845       296.9      16.3      00:49:56
  9632       7   4,835      33,845       301.2      16.5      00:49:56
  9749       7   4,835      33,845       305.1      16.7      00:50:00
  9870      10   4,835      48,350       308.9      16.9      00:50:05
  9980       6   4,835      29,010       312.3      17.1      00:50:14
 10105       6   4,835      29,010       315.9      17.3      00:50:20
 10240       2   4,835       9,670       319.9      17.5      00:50:23
 10363       7   4,835      33,845       323.7      17.7      00:50:26
 10481       9   4,835      43,515       327.5      18.0      00:50:28
 10658       6   4,835      29,010       332.9      18.2      00:50:14
 10827      10   4,835      48,350       338.1      18.5      00:50:01
 10956      10   4,835      48,350       342.3      18.8      00:49:60
 11128       3   4,835      14,505       347.5      19.0      00:49:46
 11231       8   4,835      38,680       350.8      19.2      00:49:55
 11335       4   4,835      19,340       354.1      19.4      00:50:02
 11467       6   4,835      29,010       358.3      19.6      00:49:59
 11602       9   4,835      43,515       362.4      19.9      00:49:57
 11747      10   4,835      48,350       367.0      20.1      00:49:51
 11878       9   4,835      43,515       371.2      20.3      00:49:47
 12005      10   4,835      48,350       375.3      20.6      00:49:46
 12140       9   4,835      43,515       379.7      20.8      00:49:40
 12296       5   4,835      24,175       384.5      21.1      00:49:31
 12514       9   4,835      43,515       391.5      21.5      00:49:00
 12727       5   4,835      24,175       398.0      21.8      00:48:34
 12955       6   4,835      29,010       404.8      22.2      00:48:07
 13155       5   4,835      24,175       411.3      22.5      00:47:43
 13380       7   4,835      33,845       418.4      22.9      00:47:14
 13555      10   4,835      48,350       424.5      23.3      00:46:55
 13664      10   4,835      48,350       428.1      23.5      00:46:56
 13786       8   4,835      38,680       431.9      23.7      00:46:56
 13920       7   4,835      33,845       436.1      23.9      00:46:53
 14085       6   4,835      29,010       441.2      24.2      00:46:41
 14206       7   4,835      33,845       445.3      24.4      00:46:39
 14348      10   4,835      48,350       450.0      24.7      00:46:31
 14486       9   4,835      43,515       454.5      24.9      00:46:24
 14636      10   4,835      48,350       459.3      25.2      00:46:15
 14782       9   4,835      43,515       464.0      25.4      00:46:07
 14949      10   4,835      48,350       469.3      25.7      00:45:54
 15149       6   4,835      29,010       476.0      26.1      00:45:30
 15332       9   4,835      43,515       481.9      26.4      00:45:13
 15538       6   4,835      29,010       488.5      26.8      00:44:51
 15751       8   4,835      38,680       495.4      27.2      00:44:26
 15969       5   4,835      24,175       502.7      27.6      00:43:59
 16151       7   4,835      33,845       508.9      27.9      00:43:41
 16353       7   4,835      33,845       515.6      28.3      00:43:19
 16551       5   4,835      24,175       522.0      28.6      00:42:59
 16709       3   4,835      14,505       527.1      28.9      00:42:50
 16846       9   4,835      43,515       531.5      29.1      00:42:44
 16960       7   4,835      33,845       535.3      29.3      00:42:43
 17065       6   4,835      29,010       538.6      29.5      00:42:44
 17184       9   4,835      43,515       542.3      29.7      00:42:43
 17300       7   4,835      33,845       546.2      29.9      00:42:41
 17382       6   4,835      29,010       549.0      30.1      00:42:46
 17470       7   4,835      33,845       552.0      30.3      00:42:48
 17574       7   4,835      33,845       555.6      30.5      00:42:48
 17713       8   4,835      38,680       560.0      30.7      00:42:41
 17851       8   4,835      38,680       564.3      30.9      00:42:36
 18000       6   4,835      29,010       569.1      31.2      00:42:27
 18205       6   4,835      29,010       576.0      31.6      00:42:04
 18447       2   4,835       9,670       583.4      32.0      00:41:39
 18585       4   4,835      19,340       587.9      32.2      00:41:32
 18711       5   4,835      24,175       592.2      32.5      00:41:26
 18840       7   4,835      33,845       596.4      32.7      00:41:21
 18994       7   4,835      33,845       601.7      33.0      00:41:09
 19100       5   4,835      24,175       605.2      33.2      00:41:08
 19227       7   4,835      33,845       609.5      33.4      00:41:02
 19411       8   4,835      38,680       615.5      33.7      00:40:45
 19612       7   4,835      33,845       622.2      34.1      00:40:25
 19842       6   4,835      29,010       630.2      34.5      00:39:57
 20050       4   4,835      19,340       637.3      34.9      00:39:35
 20252       8   4,835      38,680       643.8      35.3      00:39:17
 20457      10   4,835      48,350       650.5      35.7      00:38:57
 20583       8   4,835      38,680       654.8      35.9      00:38:51
 20690       8   4,835      38,680       658.3      36.1      00:38:50
 20801      10   4,835      48,350       661.9      36.3      00:38:47
 20934      10   4,835      48,350       666.4      36.5      00:38:40
 21119       9   4,835      43,515       672.1      36.8      00:38:26
 21257       7   4,835      33,845       676.0      37.1      00:38:22
 21407       6   4,835      29,010       680.5      37.3      00:38:15
 21569       7   4,835      33,845       685.6      37.6      00:38:04
 21753       9   4,835      43,515       690.9      37.9      00:37:53
 21893       9   4,835      43,515       695.4      38.1      00:37:46
 22013       5   4,835      24,175       699.1      38.3      00:37:42
 22152       3   4,835      14,505       703.0      38.5      00:37:38
 22296       7   4,835      33,845       707.4      38.8      00:37:31
 22412       4   4,835      19,340       710.9      39.0      00:37:28
 22559       7   4,835      33,845       715.5      39.2      00:37:20
 22700       2   4,835       9,670       719.9      39.5      00:37:13
 22886       8   4,835      38,680       725.1      39.7      00:37:02
 23102       6   4,835      29,010       732.1      40.1      00:36:41
 23285       6   4,835      29,010       738.2      40.5      00:36:26
 23485       9   4,835      43,515       744.0      40.8      00:36:12
 23670      10   4,835      48,350       749.7      41.1      00:35:58
 23868       9   4,835      43,515       756.2      41.5      00:35:41
 24070       7   4,835      33,845       762.6      41.8      00:35:24
 24253       6   4,835      29,010       768.0      42.1      00:35:12
 24483       9   4,835      43,515       775.1      42.5      00:34:53
 24671       5   4,835      24,175       781.3      42.8      00:34:37
 24866       2   4,835       9,670       787.4      43.2      00:34:22
 25031       7   4,835      33,845       792.6      43.4      00:34:11
 25231       7   4,835      33,845       799.1      43.8      00:33:55
 25391       7   4,835      33,845       804.2      44.1      00:33:45
 25557       3   4,835      14,505       809.4      44.4      00:33:34
 25653       6   4,835      29,010       812.4      44.5      00:33:33
 25767       7   4,835      33,845       816.3      44.7      00:33:28
 25899       4   4,835      19,340       820.6      45.0      00:33:21
 26011       5   4,835      24,175       824.1      45.2      00:33:18
 26137      10   4,835      48,350       828.1      45.4      00:33:12
 26301       6   4,835      29,010       833.5      45.7      00:33:01
 26467       5   4,835      24,175       838.5      46.0      00:32:51
 26624       8   4,835      38,680       843.4      46.2      00:32:41
 26793       4   4,835      19,340       848.8      46.5      00:32:30
 26949       5   4,835      24,175       853.8      46.8      00:32:20
 27086       5   4,835      24,175       858.1      47.0      00:32:13
 27215       6   4,835      29,010       862.2      47.3      00:32:07
 27357       9   4,835      43,515       866.7      47.5      00:31:59
 27493       4   4,835      19,340       871.1      47.7      00:31:51
 27614       8   4,835      38,680       875.0      48.0      00:31:46
 27739       6   4,835      29,010       879.1      48.2      00:31:40
 27869       6   4,835      29,010       883.4      48.4      00:31:32
 28073      10   4,835      48,350       890.1      48.8      00:31:15
 28276       8   4,835      38,680       896.7      49.2      00:30:59
 28476       4   4,835      19,340       903.5      49.5      00:30:42
 28653       7   4,835      33,845       909.3      49.8      00:30:28
 28772       8   4,835      38,680       913.3      50.1      00:30:22
 28887       7   4,835      33,845       917.1      50.3      00:30:17
 29001       8   4,835      38,680       920.9      50.5      00:30:12
 29117      10   4,835      48,350       924.7      50.7      00:30:06
 29267       7   4,835      33,845       929.3      50.9      00:29:58
 29430       9   4,835      43,515       934.9      51.2      00:29:46
 29619       5   4,835      24,175       940.7      51.6      00:29:33
 29766       5   4,835      24,175       945.6      51.8      00:29:23
 29897       8   4,835      38,680       949.9      52.1      00:29:16
 30014       9   4,835      43,515       953.7      52.3      00:29:10
 30121       8   4,835      38,680       957.2      52.5      00:29:06
 30249       7   4,835      33,845       961.4      52.7      00:28:59
 30366       7   4,835      33,845       965.2      52.9      00:28:53
 30463       7   4,835      33,845       968.6      53.1      00:28:49
 30581      10   4,835      48,350       972.5      53.3      00:28:43
 30782       6   4,835      29,010       979.1      53.7      00:28:27
 30992       7   4,835      33,845       985.9      54.0      00:28:10
 31199       6   4,835      29,010       992.7      54.4      00:27:53
 31397       8   4,835      38,680       999.3      54.8      00:27:37
 31606       9   4,835      43,515     1,006.3      55.2      00:27:20
 31817       6   4,835      29,010     1,013.5      55.6      00:27:02
 32022       6   4,835      29,010     1,020.6      55.9      00:26:45
 32243       5   4,835      24,175     1,028.1      56.4      00:26:26
 32442       9   4,835      43,515     1,035.0      56.7      00:26:09
 32574      10   4,835      48,350     1,039.3      57.0      00:26:02
 32669       7   4,835      33,845     1,042.4      57.1      00:25:59
 32780       8   4,835      38,680     1,046.2      57.3      00:25:53
 32903       8   4,835      38,680     1,050.3      57.6      00:25:46
 33006       5   4,835      24,175     1,053.8      57.8      00:25:41
 33121       5   4,835      24,175     1,057.7      58.0      00:25:35
 33262       7   4,835      33,845     1,062.3      58.2      00:25:26
 33421       5   4,835      24,175     1,067.6      58.5      00:25:15
 33587      10   4,835      48,350     1,073.3      58.8      00:25:03
 33727       9   4,835      43,515     1,077.9      59.1      00:24:54
 33868       6   4,835      29,010     1,082.7      59.3      00:24:45
 34021       6   4,835      29,010     1,087.8      59.6      00:24:35
 34146       5   4,835      24,175     1,092.3      59.9      00:24:26
 34327       9   4,835      43,515     1,098.5      60.2      00:24:12
 34539      10   4,835      48,350     1,105.4      60.6      00:23:56
 34742      10   4,835      48,350     1,112.4      61.0      00:23:40
 34956       8   4,835      38,680     1,119.6      61.4      00:23:23
 35156       6   4,835      29,010     1,126.3      61.7      00:23:07
 35357       7   4,835      33,845     1,133.0      62.1      00:22:52
 35562       7   4,835      33,845     1,139.9      62.5      00:22:36
 35748       8   4,835      38,680     1,146.0      62.8      00:22:23
 35946       8   4,835      38,680     1,152.6      63.2      00:22:08
 36147       7   4,835      33,845     1,159.4      63.5      00:21:53
 36363       8   4,835      38,680     1,166.6      63.9      00:21:36
 36557       2   4,835       9,670     1,172.9      64.3      00:21:22
 36687       7   4,835      33,845     1,177.1      64.5      00:21:15
 36820       7   4,835      33,845     1,181.3      64.8      00:21:08
 36964       9   4,835      43,515     1,186.0      65.0      00:20:59
 37064       4   4,835      19,340     1,189.2      65.2      00:20:54
 37180       8   4,835      38,680     1,192.6      65.4      00:20:49
 37295       5   4,835      24,175     1,196.0      65.6      00:20:44
 37422       6   4,835      29,010     1,200.0      65.8      00:20:38
 37561       8   4,835      38,680     1,204.5      66.0      00:20:29
 37700      10   4,835      48,350     1,208.7      66.3      00:20:22
 37886       5   4,835      24,175     1,214.8      66.6      00:20:09
 38049       7   4,835      33,845     1,220.1      66.9      00:19:58
 38157       3   4,835      14,505     1,223.7      67.1      00:19:52
 38273       5   4,835      24,175     1,227.4      67.3      00:19:46
 38380       8   4,835      38,680     1,231.1      67.5      00:19:40
 38510       8   4,835      38,680     1,235.4      67.7      00:19:32
 38727       9   4,835      43,515     1,242.6      68.1      00:19:16
 38939       7   4,835      33,845     1,249.4      68.5      00:19:01
 39054       8   4,835      38,680     1,253.2      68.7      00:18:54
 39195       5   4,835      24,175     1,257.5      68.9      00:18:46
 39315       9   4,835      43,515     1,261.4      69.1      00:18:40
 39464       6   4,835      29,010     1,266.0      69.4      00:18:31
 39612       7   4,835      33,845     1,270.9      69.7      00:18:21
 39765       6   4,835      29,010     1,275.6      69.9      00:18:12
 39961       6   4,835      29,010     1,282.0      70.3      00:17:58
 40158       7   4,835      33,845     1,288.2      70.6      00:17:45
 40353       9   4,835      43,515     1,294.5      71.0      00:17:32
 40553       7   4,835      33,845     1,301.1      71.3      00:17:17
 40744       6   4,835      29,010     1,307.4      71.7      00:17:04
 40955       9   4,835      43,515     1,314.6      72.1      00:16:48
 41101       6   4,835      29,010     1,319.3      72.3      00:16:39
 41192      10   4,835      48,350     1,322.3      72.5      00:16:35
 41344       9   4,835      43,515     1,327.1      72.7      00:16:25
 41470       9   4,835      43,515     1,331.3      73.0      00:16:18
 41567       8   4,835      38,680     1,334.5      73.1      00:16:13
 41671       9   4,835      43,515     1,337.9      73.3      00:16:07
 41808       8   4,835      38,680     1,342.4      73.6      00:15:59
 41930       8   4,835      38,680     1,346.6      73.8      00:15:51
 42072      10   4,835      48,350     1,350.8      74.0      00:15:43
 42226      10   4,835      48,350     1,355.5      74.3      00:15:34
 42365      10   4,835      48,350     1,359.9      74.5      00:15:26
 42543      10   4,835      48,350     1,365.7      74.9      00:15:14
 42721       2   4,835       9,670     1,371.3      75.2      00:15:02
 42893       8   4,835      38,680     1,376.9      75.5      00:14:50
 43057       8   4,835      38,680     1,382.4      75.8      00:14:39
 43225       5   4,835      24,175     1,388.1      76.1      00:14:27
 43406       6   4,835      29,010     1,394.2      76.4      00:14:15
 43619       5   4,835      24,175     1,400.8      76.8      00:14:01
 43843       9   4,835      43,515     1,408.0      77.2      00:13:45
 44009       9   4,835      43,515     1,413.3      77.5      00:13:34
 44124       9   4,835      43,515     1,416.9      77.7      00:13:28
 44218      10   4,835      48,350     1,420.1      77.8      00:13:23
 44327       7   4,835      33,845     1,423.4      78.0      00:13:17
 44425      10   4,835      48,350     1,426.4      78.2      00:13:13
 44592      10   4,835      48,350     1,431.8      78.5      00:13:01
 44785       9   4,835      43,515     1,438.0      78.8      00:12:49
 44963       9   4,835      43,515     1,443.9      79.1      00:12:36
 45188       6   4,835      29,010     1,450.7      79.5      00:12:22
 45401       9   4,835      43,515     1,457.1      79.9      00:12:09
 45603       8   4,835      38,680     1,463.3      80.2      00:11:56
 45815       8   4,835      38,680     1,469.8      80.6      00:11:42
 46021       8   4,835      38,680     1,476.6      80.9      00:11:28
 46200       5   4,835      24,175     1,482.5      81.3      00:11:16
 46412       4   4,835      19,340     1,489.2      81.6      00:11:02
 46648       9   4,835      43,515     1,497.0      82.1      00:10:45
 46898       8   4,835      38,680     1,505.3      82.5      00:10:28
 47076       7   4,835      33,845     1,510.4      82.8      00:10:17
 47249      10   4,835      48,350     1,515.6      83.1      00:10:07
 47399       7   4,835      33,845     1,520.3      83.3      00:09:58
 47583       4   4,835      19,340     1,525.9      83.6      00:09:47
 47765       4   4,835      19,340     1,531.7      84.0      00:09:35
 47929       6   4,835      29,010     1,537.1      84.3      00:09:25
 48092       8   4,835      38,680     1,542.3      84.5      00:09:14
 48233       8   4,835      38,680     1,546.7      84.8      00:09:06
 48516       6   4,835      29,010     1,556.1      85.3      00:08:46
 48869       3   4,835      14,505     1,567.3      85.9      00:08:22
 49147      10   4,835      48,350     1,576.5      86.4      00:08:03
 49403       7   4,835      33,845     1,584.3      86.8      00:07:47
 49614       8   4,835      38,680     1,590.6      87.2      00:07:34
 49820       6   4,835      29,010     1,596.9      87.5      00:07:22
 50005       9   4,835      43,515     1,602.8      87.9      00:07:10
 50236       7   4,835      33,845     1,610.0      88.3      00:06:56
 50479       7   4,835      33,845     1,617.4      88.7      00:06:41
 50714      10   4,835      48,350     1,625.2      89.1      00:06:25
 50959      10   4,835      48,350     1,633.4      89.5      00:06:08
 51186       4   4,835      19,340     1,640.7      89.9      00:05:54
 51412       8   4,835      38,680     1,648.1      90.3      00:05:39
 51643       7   4,835      33,845     1,655.9      90.8      00:05:24
 51886      10   4,835      48,350     1,664.0      91.2      00:05:08
 52217       9   4,835      43,515     1,675.4      91.8      00:04:45
 52495       8   4,835      38,680     1,685.1      92.4      00:04:25
 52764       9   4,835      43,515     1,694.7      92.9      00:04:07
 53021       7   4,835      33,845     1,703.4      93.4      00:03:49
 53249      10   4,835      48,350     1,711.1      93.8      00:03:35
 53565       7   4,835      33,845     1,721.7      94.4      00:03:14
 53816       6   4,835      29,010     1,729.8      94.8      00:02:58
 54043       7   4,835      33,845     1,737.1      95.2      00:02:44
 54249       7   4,835      33,845     1,743.8      95.6      00:02:32
 54502       7   4,835      33,845     1,751.2      96.0      00:02:17
 54830      10   4,835      48,350     1,761.7      96.6      00:01:57
 55137       7   4,835      33,845     1,771.5      97.1      00:01:39
 55396       8   4,835      38,680     1,779.3      97.5      00:01:24
 55612       7   4,835      33,845     1,786.0      97.9      00:01:12
 55822       7   4,835      33,845     1,792.9      98.3      00:00:59
 56070      10   4,835      48,350     1,801.0      98.7      00:00:43
 56336       8   4,835      38,680     1,810.0      99.2      00:00:27
 56670      10   4,835      48,350     1,821.2      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 3381.225
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
