
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total.dta /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10
> 000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  13 Dec 2023, 21:37:56

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
  3444       2   4,035       8,070        88.1       5.8      00:16:19
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   562       9   4,035      36,315        13.1       0.9      00:19:16
  4009       7   4,035      28,245       102.6       6.7      00:16:10
  1145       6   4,035      24,210        27.8       1.8      00:17:59
  4530       9   4,035      36,315       115.8       7.6      00:16:13
  1715       9   4,035      36,315        43.0       2.8      00:17:15
  5031      10   4,035      40,350       129.1       8.5      00:16:13
  2297       5   4,035      20,175        57.8       3.8      00:16:55
  5529       5   4,035      20,175       141.8       9.3      00:16:15
  2876       7   4,035      28,245        72.9       4.8      00:16:37
  5949       8   4,035      32,280       152.5      10.0      00:16:30
  3448      10   4,035      40,350        88.2       5.8      00:16:18
  6371       7   4,035      28,245       163.3      10.7      00:16:41
  4011       9   4,035      36,315       102.7       6.7      00:16:10
  6812       3   4,035      12,105       174.5      11.5      00:16:46
  4535      10   4,035      40,350       115.9       7.6      00:16:12
  7336       9   4,035      36,315       188.0      12.3      00:16:35
  5045       6   4,035      24,210       129.5       8.5      00:16:10
  7870       7   4,035      28,245       202.3      13.3      00:16:21
  5536       9   4,035      36,315       142.0       9.3      00:16:14
  8390       6   4,035      24,210       216.7      14.2      00:16:06
  5953      10   4,035      40,350       152.6      10.0      00:16:30
  8910       7   4,035      28,245       231.1      15.2      00:15:52
  6383       4   4,035      16,140       163.6      10.7      00:16:39
  9363      10   4,035      40,350       243.5      16.0      00:15:47
  6830       7   4,035      28,245       175.1      11.5      00:16:42
  9782       6   4,035      24,210       255.3      16.8      00:15:45
  7359       9   4,035      36,315       188.6      12.4      00:16:32
 10213       9   4,035      36,315       266.2      17.5      00:15:46
  7898       7   4,035      28,245       203.1      13.3      00:16:17
 10689       8   4,035      32,280       278.5      18.3      00:15:40
  8416      10   4,035      40,350       217.5      14.3      00:16:02
 11157       4   4,035      16,140       290.6      19.1      00:15:34
  8936      10   4,035      40,350       231.8      15.2      00:15:48
 11582       7   4,035      28,245       301.8      19.8      00:15:32
  9385       8   4,035      32,280       244.2      16.0      00:15:44
 12068       9   4,035      36,315       314.7      20.7      00:15:23
  9811       3   4,035      12,105       256.1      16.8      00:15:41
 12598       7   4,035      28,245       328.6      21.6      00:15:10
 10251       6   4,035      24,210       267.1      17.5      00:15:42
 13181       7   4,035      28,245       343.8      22.6      00:14:53
 10714       9   4,035      36,315       279.1      18.3      00:15:37
 13683       8   4,035      32,280       357.6      23.5      00:14:41
 11167       5   4,035      20,175       290.9      19.1      00:15:33
 14146       6   4,035      24,210       369.7      24.3      00:14:35
 11588       3   4,035      12,105       301.9      19.8      00:15:32
 14675       3   4,035      12,105       384.1      25.2      00:14:21
 12055      10   4,035      40,350       314.4      20.6      00:15:24
 15222       4   4,035      16,140       399.1      26.2      00:14:06
 12582       7   4,035      28,245       328.3      21.5      00:15:11
 15784       8   4,035      32,280       414.2      27.2      00:13:51
 13165       9   4,035      36,315       343.3      22.5      00:14:55
 16329       9   4,035      36,315       429.4      28.2      00:13:36
 13667       8   4,035      32,280       357.2      23.4      00:14:43
 16797       7   4,035      28,245       442.1      29.0      00:13:28
 14117       7   4,035      28,245       368.8      24.2      00:14:38
 17253       5   4,035      20,175       454.3      29.8      00:13:21
 14644       6   4,035      24,210       383.3      25.2      00:14:24
 17698       5   4,035      20,175       466.8      30.6      00:13:13
 15192       7   4,035      28,245       398.3      26.1      00:14:09
 18179       7   4,035      28,245       479.7      31.5      00:13:04
 15757       5   4,035      20,175       413.3      27.1      00:13:54
 18610       7   4,035      28,245       491.1      32.2      00:12:59
 16303       5   4,035      20,175       428.7      28.1      00:13:38
 19052       6   4,035      24,210       503.5      33.0      00:12:51
 16779       4   4,035      16,140       441.6      29.0      00:13:30
 19552       6   4,035      24,210       517.4      34.0      00:12:39
 17226       6   4,035      24,210       453.6      29.8      00:13:23
 20096      10   4,035      40,350       533.0      35.0      00:12:24
 17668       9   4,035      36,315       466.0      30.6      00:13:15
 20599       1   4,035       4,035       546.6      35.9      00:12:14
 18157       7   4,035      28,245       479.1      31.4      00:13:06
 21000       4   4,035      16,140       557.6      36.6      00:12:08
 18591       6   4,035      24,210       490.5      32.2      00:13:00
 21451       7   4,035      28,245       568.8      37.3      00:12:03
 19026       7   4,035      28,245       502.8      33.0      00:12:52
 21883       8   4,035      32,280       579.8      38.1      00:11:57
 19519      10   4,035      40,350       516.5      33.9      00:12:41
 22324       7   4,035      28,245       590.8      38.8      00:11:51
 20057       8   4,035      32,280       531.8      34.9      00:12:27
 22749      10   4,035      40,350       601.7      39.5      00:11:46
 20574       9   4,035      36,315       546.0      35.8      00:12:15
 23171      10   4,035      40,350       612.6      40.2      00:11:40
 20982       9   4,035      36,315       557.2      36.6      00:12:09
 23605       6   4,035      24,210       623.7      40.9      00:11:33
 21436       6   4,035      24,210       568.4      37.3      00:12:04
 24051       9   4,035      36,315       635.7      41.7      00:11:25
 21864       7   4,035      28,245       579.3      38.0      00:11:58
 24626       3   4,035      12,105       650.5      42.7      00:11:12
 22306       9   4,035      36,315       590.4      38.7      00:11:52
 25192       5   4,035      20,175       665.6      43.7      00:10:58
 22723       9   4,035      36,315       601.2      39.5      00:11:47
 25702       7   4,035      28,245       679.0      44.6      00:10:47
 23155       9   4,035      36,315       612.1      40.2      00:11:41
 26124       7   4,035      28,245       690.6      45.3      00:10:40
 23578       7   4,035      28,245       623.1      40.9      00:11:35
 26641       7   4,035      28,245       704.0      46.2      00:10:29
 24018       5   4,035      20,175       634.8      41.7      00:11:27
 27140       8   4,035      32,280       717.2      47.1      00:10:19
 24591       8   4,035      32,280       649.6      42.6      00:11:14
 27552       4   4,035      16,140       728.3      47.8      00:10:12
 25159       8   4,035      32,280       664.8      43.6      00:10:60
 27997       5   4,035      20,175       740.4      48.6      00:10:04
 25678       9   4,035      36,315       678.4      44.5      00:10:49
 28504      10   4,035      40,350       754.4      49.5      00:09:52
 26086      10   4,035      40,350       689.5      45.3      00:10:42
 28918       6   4,035      24,210       765.9      50.3      00:09:44
 26603       8   4,035      32,280       703.1      46.1      00:10:31
 29399       6   4,035      24,210       779.0      51.1      00:09:34
 27106      10   4,035      40,350       716.3      47.0      00:10:21
 29888      10   4,035      40,350       792.2      52.0      00:09:24
 27509       8   4,035      32,280       727.0      47.7      00:10:14
 30353       8   4,035      32,280       804.9      52.8      00:09:14
 27941      10   4,035      40,350       738.9      48.5      00:10:06
 30837       9   4,035      36,315       818.3      53.7      00:09:03
 28444       7   4,035      28,245       752.6      49.4      00:09:55
 31372       5   4,035      20,175       832.9      54.7      00:08:51
 28852       6   4,035      24,210       764.1      50.1      00:09:47
 31900       7   4,035      28,245       847.9      55.6      00:08:39
 29317       6   4,035      24,210       776.6      51.0      00:09:38
 32420       9   4,035      36,315       862.7      56.6      00:08:26
 29781      10   4,035      40,350       789.3      51.8      00:09:28
 32837       4   4,035      16,140       874.3      57.4      00:08:18
 30231       4   4,035      16,140       801.6      52.6      00:09:19
 33218       6   4,035      24,210       884.9      58.1      00:08:11
 30679       8   4,035      32,280       813.9      53.4      00:09:10
 33681       5   4,035      20,175       898.0      58.9      00:08:01
 31214       9   4,035      36,315       828.5      54.4      00:08:58
 34147       8   4,035      32,280       911.1      59.8      00:07:51
 31744       4   4,035      16,140       843.4      55.4      00:08:45
 34674       7   4,035      28,245       925.9      60.8      00:07:39
 32260       8   4,035      32,280       858.1      56.3      00:08:33
 35200      10   4,035      40,350       940.8      61.8      00:07:26
 32732       9   4,035      36,315       871.3      57.2      00:08:22
 35729       7   4,035      28,245       955.5      62.7      00:07:14
 33108       6   4,035      24,210       881.9      57.9      00:08:15
 36267      10   4,035      40,350       970.5      63.7      00:07:02
 33558       7   4,035      28,245       894.5      58.7      00:08:06
 36751       4   4,035      16,140       983.7      64.6      00:06:52
 34020       3   4,035      12,105       907.4      59.6      00:07:56
 37178       8   4,035      32,280       995.0      65.3      00:06:44
 34502       9   4,035      36,315       921.2      60.5      00:07:45
 37581       7   4,035      28,245     1,005.4      66.0      00:06:37
 35033      10   4,035      40,350       936.1      61.4      00:07:32
 37983       9   4,035      36,315     1,016.0      66.7      00:06:30
 35581       7   4,035      28,245       951.4      62.4      00:07:20
 38362       7   4,035      28,245     1,026.4      67.4      00:06:23
 36146      10   4,035      40,350       967.1      63.5      00:07:06
 38747       7   4,035      28,245     1,037.2      68.1      00:06:16
 36662      10   4,035      40,350       981.5      64.4      00:06:55
 39229       9   4,035      36,315     1,050.1      68.9      00:06:06
 37106       9   4,035      36,315       993.2      65.2      00:06:46
 39798       5   4,035      20,175     1,065.1      69.9      00:05:53
 37548       5   4,035      20,175     1,004.4      65.9      00:06:38
 40366       6   4,035      24,210     1,080.3      70.9      00:05:41
 37949       7   4,035      28,245     1,015.1      66.6      00:06:31
 40923       6   4,035      24,210     1,095.7      71.9      00:05:28
 38352      10   4,035      40,350     1,026.2      67.4      00:06:23
 41339       6   4,035      24,210     1,107.1      72.7      00:05:20
 38753       9   4,035      36,315     1,037.3      68.1      00:06:15
 41768      10   4,035      40,350     1,118.8      73.4      00:05:11
 39242       7   4,035      28,245     1,050.4      68.9      00:06:05
 42210       9   4,035      36,315     1,130.5      74.2      00:05:03
 39819       6   4,035      24,210     1,065.6      69.9      00:05:53
 42662      10   4,035      40,350     1,142.5      75.0      00:04:54
 40389       4   4,035      16,140     1,080.9      70.9      00:05:40
 43074       6   4,035      24,210     1,153.7      75.7      00:04:46
 40942       9   4,035      36,315     1,096.2      72.0      00:05:28
 43476       7   4,035      28,245     1,165.1      76.5      00:04:37
 41349       7   4,035      28,245     1,107.4      72.7      00:05:20
 43911       6   4,035      24,210     1,176.5      77.2      00:04:29
 41779      10   4,035      40,350     1,119.2      73.5      00:05:11
 44354       6   4,035      24,210     1,188.3      78.0      00:04:20
 42203       9   4,035      36,315     1,130.3      74.2      00:05:03
 44817       6   4,035      24,210     1,200.6      78.8      00:04:10
 42658      10   4,035      40,350     1,142.4      75.0      00:04:54
 45307       8   4,035      32,280     1,213.5      79.6      00:04:00
 43070       8   4,035      32,280     1,153.6      75.7      00:04:46
 45773       8   4,035      32,280     1,225.3      80.4      00:03:52
 43470      10   4,035      40,350     1,164.9      76.5      00:04:37
 46217       8   4,035      32,280     1,237.3      81.2      00:03:42
 43906      10   4,035      40,350     1,176.4      77.2      00:04:29
 46672       8   4,035      32,280     1,249.7      82.0      00:03:33
 44354       6   4,035      24,210     1,188.3      78.0      00:04:20
 47112       7   4,035      28,245     1,261.2      82.8      00:03:24
 44813      10   4,035      40,350     1,200.5      78.8      00:04:11
 47546      10   4,035      40,350     1,272.2      83.5      00:03:16
 45312       1   4,035       4,035     1,213.6      79.7      00:04:00
 48040       8   4,035      32,280     1,285.5      84.4      00:03:05
 45775       6   4,035      24,210     1,225.3      80.4      00:03:52
 48557       7   4,035      28,245     1,299.4      85.3      00:02:54
 46226      10   4,035      40,350     1,237.6      81.2      00:03:42
 49101       8   4,035      32,280     1,313.9      86.2      00:02:43
 46682       6   4,035      24,210     1,250.0      82.0      00:03:33
 49602       8   4,035      32,280     1,327.0      87.1      00:02:33
 47136       2   4,035       8,070     1,261.8      82.8      00:03:24
 50035       6   4,035      24,210     1,338.1      87.8      00:02:24
 47572      10   4,035      40,350     1,272.9      83.5      00:03:15
 50501      10   4,035      40,350     1,350.1      88.6      00:02:15
 48067      10   4,035      40,350     1,286.2      84.4      00:03:05
 50961       9   4,035      36,315     1,362.7      89.4      00:02:05
 48578       8   4,035      32,280     1,300.0      85.3      00:02:54
 51423       9   4,035      36,315     1,375.2      90.3      00:01:56
 49129       5   4,035      20,175     1,314.7      86.3      00:02:42
 51878       9   4,035      36,315     1,388.0      91.1      00:01:46
 49629       7   4,035      28,245     1,327.6      87.1      00:02:32
 52325       9   4,035      36,315     1,400.8      91.9      00:01:36
 50059      10   4,035      40,350     1,338.7      87.9      00:02:24
 52764      10   4,035      40,350     1,413.8      92.8      00:01:26
 50530       8   4,035      32,280     1,350.9      88.7      00:02:14
 53214       7   4,035      28,245     1,426.5      93.6      00:01:16
 50987      10   4,035      40,350     1,363.5      89.5      00:02:05
 53744       6   4,035      24,210     1,441.3      94.6      00:01:04
 51453       5   4,035      20,175     1,376.1      90.3      00:01:55
 54191      10   4,035      40,350     1,453.3      95.4      00:00:55
 51903       9   4,035      36,315     1,388.7      91.1      00:01:45
 54683       6   4,035      24,210     1,466.0      96.2      00:00:45
 52345       6   4,035      24,210     1,401.3      92.0      00:01:35
 55162      10   4,035      40,350     1,478.8      97.1      00:00:35
 52781       7   4,035      28,245     1,414.2      92.8      00:01:25
 55612       5   4,035      20,175     1,490.1      97.8      00:00:26
 53231       6   4,035      24,210     1,427.0      93.7      00:01:15
 56053       7   4,035      28,245     1,502.3      98.6      00:00:17
 53752       6   4,035      24,210     1,441.5      94.6      00:01:04
 56466       7   4,035      28,245     1,513.8      99.4      00:00:08
 54197       6   4,035      24,210     1,453.5      95.4      00:00:55

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1192.952
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 54688       8   4,035      32,280     1,466.2      96.2      00:00:45
 55157       8   4,035      32,280     1,478.6      97.1      00:00:35
 55611      10   4,035      40,350     1,490.1      97.8      00:00:26
 56043      10   4,035      40,350     1,502.0      98.6      00:00:17
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
 56457       9   4,035      36,315     1,513.5      99.3      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1193.326
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
