
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locations_total
> _fixR200.dta /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vacc
> inated/ca_blk_Dollar_dist_total_fixR200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Nov 2023, 18:43:47

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinate
> d/ca_Dollar_locations_total_fixR200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated
> /ca_blk_Dollar_dist_total_fixR200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   538       1   4,035       4,035        12.5       0.8      00:20:09
  1106       3   4,035      12,105        26.7       1.8      00:18:42
  1634       7   4,035      28,245        40.8       2.7      00:18:11
  2174       6   4,035      24,210        54.6       3.6      00:17:57
  2732       8   4,035      32,280        68.9       4.5      00:17:36
  3268       5   4,035      20,175        83.3       5.5      00:17:18
  3834       6   4,035      24,210        98.4       6.5      00:16:55
  4370       8   4,035      32,280       111.6       7.3      00:16:53
  4892       6   4,035      24,210       125.5       8.2      00:16:44
  5394       9   4,035      36,315       138.7       9.1      00:16:39
  5809       7   4,035      28,245       148.8       9.8      00:16:57
  6207       9   4,035      36,315       159.2      10.4      00:17:10
  6595       8   4,035      32,280       169.1      11.1      00:17:22
  7116       7   4,035      28,245       182.4      12.0      00:17:10
  7627       6   4,035      24,210       195.8      12.8      00:16:58
  8113       6   4,035      24,210       209.1      13.7      00:16:47
  8616       4   4,035      16,140       223.0      14.6      00:16:32
  9105       6   4,035      24,210       236.4      15.5      00:16:21
  9503       4   4,035      16,140       247.4      16.2      00:16:21
  9937       6   4,035      24,210       259.4      17.0      00:16:16
 10402       7   4,035      28,245       271.0      17.8      00:16:12
 10850      10   4,035      40,350       282.6      18.5      00:16:07
 11276      10   4,035      40,350       293.7      19.3      00:16:04
 11702       5   4,035      20,175       305.0      20.0      00:15:60
 12153       7   4,035      28,245       317.0      20.8      00:15:52
 12705       8   4,035      32,280       331.5      21.8      00:15:36
 13286       8   4,035      32,280       346.5      22.7      00:15:18
 13731       3   4,035      12,105       358.9      23.6      00:15:10
 14212       7   4,035      28,245       371.5      24.4      00:15:00
 14738       9   4,035      36,315       385.7      25.3      00:14:46
 15289      10   4,035      40,350       400.8      26.3      00:14:29
 15872       5   4,035      20,175       416.5      27.3      00:14:11
 16436       9   4,035      36,315       432.4      28.4      00:13:54
 16894       7   4,035      28,245       444.6      29.2      00:13:46
 17312       9   4,035      36,315       455.9      29.9      00:13:41
 17729      10   4,035      40,350       467.6      30.7      00:13:34
 18188       8   4,035      32,280       480.0      31.5      00:13:25
 18613       6   4,035      24,210       491.1      32.2      00:13:20
 19030       6   4,035      24,210       502.9      33.0      00:13:12
 19505       7   4,035      28,245       516.1      33.9      00:13:02
 20055       6   4,035      24,210       531.8      34.9      00:12:46
 20577       6   4,035      24,210       546.0      35.8      00:12:33
 20958      10   4,035      40,350       556.6      36.5      00:12:28
 21399      10   4,035      40,350       567.5      37.2      00:12:22
 21803       5   4,035      20,175       577.7      37.9      00:12:18
 22221       8   4,035      32,280       588.3      38.6      00:12:12
 22649       5   4,035      20,175       599.2      39.3      00:12:06
 23065      10   4,035      40,350       609.8      40.0      00:12:00
 23461      10   4,035      40,350       620.3      40.7      00:11:54
 23859       4   4,035      16,140       630.7      41.4      00:11:49
 24407       5   4,035      20,175       644.5      42.3      00:11:37
 24963       8   4,035      32,280       659.3      43.3      00:11:22
 25508       9   4,035      36,315       674.1      44.2      00:11:09
 25884       7   4,035      28,245       684.2      44.9      00:11:03
 26368       9   4,035      36,315       697.1      45.8      00:10:53
 26868       7   4,035      28,245       710.0      46.6      00:10:43
 27319       8   4,035      32,280       722.0      47.4      00:10:34
 27690       5   4,035      20,175       732.0      48.0      00:10:28
 28111       6   4,035      24,210       743.5      48.8      00:10:20
 28574       8   4,035      32,280       756.4      49.6      00:10:09
 28973       8   4,035      32,280       767.4      50.4      00:10:02
 29414       7   4,035      28,245       779.4      51.2      00:09:53
 29846       8   4,035      32,280       791.1      51.9      00:09:44
 30283      10   4,035      40,350       802.9      52.7      00:09:35
 30698       5   4,035      20,175       814.4      53.5      00:09:27
 31226       9   4,035      36,315       828.9      54.4      00:09:14
 31752       9   4,035      36,315       843.6      55.4      00:09:01
 32253       6   4,035      24,210       857.9      56.3      00:08:48
 32716       8   4,035      32,280       870.9      57.2      00:08:38
 33078      10   4,035      40,350       881.1      57.8      00:08:31
 33495       9   4,035      36,315       892.6      58.6      00:08:22
 33917       6   4,035      24,210       904.6      59.4      00:08:13
 34365       6   4,035      24,210       917.4      60.2      00:08:03
 34898       9   4,035      36,315       932.4      61.2      00:07:50
 35439      10   4,035      40,350       947.5      62.2      00:07:37
 35972       5   4,035      20,175       962.2      63.2      00:07:24
 36478       5   4,035      20,175       976.4      64.1      00:07:12
 36912       9   4,035      36,315       988.1      64.9      00:07:03
 37351       2   4,035       8,070       999.3      65.6      00:06:55
 37733       9   4,035      36,315     1,009.3      66.2      00:06:48
 38108       7   4,035      28,245     1,019.5      66.9      00:06:41
 38478       4   4,035      16,140     1,029.7      67.6      00:06:34
 38855       8   4,035      32,280     1,040.1      68.3      00:06:26
 39231       5   4,035      20,175     1,050.1      68.9      00:06:19
 39617       8   4,035      32,280     1,060.4      69.6      00:06:12
 40082      10   4,035      40,350     1,072.8      70.4      00:06:02
 40619       7   4,035      28,245     1,087.3      71.4      00:05:49
 41084       9   4,035      36,315     1,100.2      72.2      00:05:39
 41471      10   4,035      40,350     1,110.7      72.9      00:05:31
 41879       8   4,035      32,280     1,121.9      73.6      00:05:23
 42305       4   4,035      16,140     1,132.9      74.4      00:05:14
 42727       6   4,035      24,210     1,144.3      75.1      00:05:05
 43120       6   4,035      24,210     1,155.1      75.8      00:04:57
 43516       5   4,035      20,175     1,166.1      76.5      00:04:49
 43936      10   4,035      40,350     1,177.2      77.3      00:04:40
 44375      10   4,035      40,350     1,188.8      78.0      00:04:31
 44823       6   4,035      24,210     1,200.7      78.8      00:04:21
 45277       6   4,035      24,210     1,212.8      79.6      00:04:11
 45717       9   4,035      36,315     1,223.8      80.3      00:04:03
 46144      10   4,035      40,350     1,235.3      81.1      00:03:54
 46577       9   4,035      36,315     1,247.2      81.9      00:03:44
 47031       8   4,035      32,280     1,259.2      82.6      00:03:34
 47421       5   4,035      20,175     1,269.1      83.3      00:03:27
 47867       4   4,035      16,140     1,280.7      84.1      00:03:17
 48360       7   4,035      28,245     1,294.1      84.9      00:03:06
 48862       7   4,035      28,245     1,307.5      85.8      00:02:55
 49406       5   4,035      20,175     1,322.0      86.8      00:02:43
 49810       6   4,035      24,210     1,332.1      87.4      00:02:35
 50218       4   4,035      16,140     1,342.9      88.1      00:02:27
 50639       8   4,035      32,280     1,353.8      88.9      00:02:18
 51027       6   4,035      24,210     1,364.6      89.6      00:02:09
 51415       5   4,035      20,175     1,375.0      90.3      00:02:01
 51792       9   4,035      36,315     1,385.7      90.9      00:01:53
 52165       9   4,035      36,315     1,396.2      91.6      00:01:44
 52559       9   4,035      36,315     1,407.7      92.4      00:01:35
 52948       9   4,035      36,315     1,419.0      93.1      00:01:26
 53393       7   4,035      28,245     1,431.5      94.0      00:01:15
 53852       9   4,035      36,315     1,444.2      94.8      00:01:05
 54287       6   4,035      24,210     1,455.9      95.6      00:00:55
 54753       5   4,035      20,175     1,467.9      96.3      00:00:46
 55179       8   4,035      32,280     1,479.2      97.1      00:00:36
 55588       9   4,035      36,315     1,489.4      97.8      00:00:28
 55970       9   4,035      36,315     1,500.0      98.5      00:00:19
 56367       4   4,035      16,140     1,510.9      99.2      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1257.223
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_
> blk_Dollar_dist_total_fixR200.csv saved

. 
. cap log close

. 
end of do-file
