
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A1000.dta /export/storage_covidvaccine
> /Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchoo
> ls_dist_total_10000_5_4q_mnl_A1000.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A1000.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A1000.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   279       7   5,035      35,245         8.1       0.4      00:39:58
   358       7   5,035      35,245        10.4       0.5      01:01:14
   570       3   5,035      15,105        16.7       0.9      00:56:44
   939       9   5,035      45,315        28.0       1.5      00:44:52
  1294       5   5,035      25,175        39.7       2.1      00:39:14
  1647       4   5,035      20,140        51.5       2.7      00:36:06
  1994       9   5,035      45,315        62.5       3.3      00:34:28
  2351       7   5,035      35,245        74.0       3.9      00:33:03
  2701       7   5,035      35,245        85.2       4.5      00:32:04
  3040       9   5,035      45,315        96.2       5.1      00:31:22
  3369       8   5,035      40,280       107.6       5.7      00:30:39
  3713       8   5,035      40,280       119.0       6.3      00:30:02
  4010       7   5,035      35,245       128.3       6.8      00:30:01
  4280       9   5,035      45,315       136.7       7.2      00:30:12
  4534      10   5,035      50,350       144.9       7.6      00:30:23
  4776       6   5,035      30,210       153.1       8.1      00:30:32
  5040      10   5,035      50,350       161.7       8.5      00:30:33
  5312       5   5,035      25,175       170.4       9.0      00:30:32
  5593       8   5,035      40,280       179.1       9.4      00:30:31
  5870       7   5,035      35,245       187.8       9.9      00:30:29
  6133       6   5,035      30,210       196.6      10.3      00:30:25
  6400       7   5,035      35,245       204.9      10.8      00:30:25
  6668       8   5,035      40,280       213.4      11.2      00:30:23
  6931       8   5,035      40,280       222.0      11.7      00:30:19
  7239       7   5,035      35,245       231.5      12.2      00:30:07
  7529       6   5,035      30,210       241.2      12.7      00:29:53
  7827       8   5,035      40,280       251.1      13.2      00:29:37
  8122       8   5,035      40,280       261.4      13.8      00:29:19
  8426       8   5,035      40,280       272.0      14.3      00:29:00
  8718       9   5,035      45,315       281.9      14.8      00:28:46
  8911       8   5,035      40,280       288.6      15.2      00:28:55
  9098       8   5,035      40,280       295.0      15.5      00:29:05
  9231      10   5,035      50,350       299.7      15.8      00:29:27
  9341       8   5,035      40,280       303.3      16.0      00:29:55
  9466       8   5,035      40,280       307.6      16.2      00:30:17
  9566       5   5,035      25,175       311.2      16.4      00:30:43
  9710       6   5,035      30,210       316.4      16.7      00:30:57
  9860       9   5,035      45,315       321.3      16.9      00:31:13
  9999       7   5,035      35,245       325.9      17.2      00:31:30
 10158       5   5,035      25,175       330.6      17.4      00:31:45
 10329       6   5,035      30,210       336.0      17.7      00:31:55
 10497       3   5,035      15,105       341.6      18.0      00:32:02
 10711       9   5,035      45,315       348.4      18.3      00:32:01
 10927      10   5,035      50,350       355.5      18.7      00:31:58
 11117       6   5,035      30,210       361.6      19.0      00:32:01
 11254       9   5,035      45,315       366.0      19.3      00:32:14
 11381      10   5,035      50,350       370.2      19.5      00:32:28
 11511       9   5,035      45,315       374.6      19.7      00:32:41
 11656       6   5,035      30,210       379.3      20.0      00:32:51
 11822       8   5,035      40,280       384.8      20.3      00:32:55
 11952       7   5,035      35,245       388.9      20.5      00:33:08
 12063       5   5,035      25,175       392.8      20.7      00:33:22
 12193       6   5,035      30,210       397.2      20.9      00:33:32
 12358       5   5,035      25,175       402.4      21.2      00:33:36
 12606       9   5,035      45,315       410.6      21.6      00:33:21
 12859       3   5,035      15,105       418.6      22.0      00:33:08
 13095       7   5,035      35,245       426.3      22.4      00:32:56
 13328      10   5,035      50,350       434.0      22.8      00:32:45
 13547       6   5,035      30,210       441.7      23.3      00:32:34
 13686       7   5,035      35,245       446.6      23.5      00:32:39
 13864       6   5,035      30,210       452.3      23.8      00:32:38
 14041       9   5,035      45,315       458.0      24.1      00:32:38
 14221       6   5,035      30,210       464.2      24.4      00:32:35
 14401       9   5,035      45,315       470.3      24.8      00:32:32
 14586      10   5,035      50,350       476.6      25.1      00:32:27
 14756       7   5,035      35,245       482.2      25.4      00:32:27
 14944       8   5,035      40,280       488.5      25.7      00:32:22
 15153       7   5,035      35,245       495.8      26.1      00:32:12
 15416       5   5,035      25,175       504.7      26.6      00:31:53
 15721      10   5,035      50,350       514.8      27.1      00:31:30
 16020       7   5,035      35,245       525.3      27.6      00:31:04
 16321       9   5,035      45,315       535.8      28.2      00:30:39
 16569       8   5,035      40,280       544.2      28.6      00:30:24
 16782       7   5,035      35,245       551.4      29.0      00:30:15
 16998       8   5,035      40,280       558.7      29.4      00:30:06
 17189       5   5,035      25,175       564.9      29.7      00:30:02
 17376       6   5,035      30,210       571.5      30.1      00:29:56
 17568       6   5,035      30,210       578.4      30.4      00:29:48
 17807       8   5,035      40,280       586.1      30.9      00:29:36
 18047       8   5,035      40,280       594.3      31.3      00:29:23
 18347       5   5,035      25,175       604.5      31.8      00:29:01
 18596       7   5,035      35,245       612.6      32.2      00:28:49
 18807       8   5,035      40,280       619.9      32.6      00:28:39
 19012       5   5,035      25,175       627.2      33.0      00:28:30
 19235       6   5,035      30,210       634.9      33.4      00:28:19
 19521       6   5,035      30,210       644.9      33.9      00:27:59
 19803       6   5,035      30,210       654.8      34.5      00:27:39
 20065      10   5,035      50,350       664.3      35.0      00:27:22
 20364       8   5,035      40,280       674.2      35.5      00:27:03
 20577       8   5,035      40,280       681.6      35.9      00:26:53
 20760       8   5,035      40,280       687.9      36.2      00:26:48
 20952       6   5,035      30,210       694.5      36.6      00:26:41
 21174       8   5,035      40,280       701.6      36.9      00:26:33
 21385       4   5,035      20,140       708.0      37.3      00:26:27
 21602      10   5,035      50,350       714.9      37.6      00:26:19
 21812       9   5,035      45,315       721.5      38.0      00:26:12
 21975       3   5,035      15,105       726.8      38.3      00:26:10
 22186       5   5,035      25,175       733.3      38.6      00:26:04
 22407       7   5,035      35,245       740.2      39.0      00:25:56
 22619      10   5,035      50,350       747.1      39.3      00:25:47
 22888       5   5,035      25,175       755.2      39.8      00:25:35
 23172       8   5,035      40,280       764.8      40.3      00:25:18
 23449       5   5,035      25,175       773.7      40.7      00:25:03
 23743       5   5,035      25,175       783.2      41.2      00:24:47
 24012       8   5,035      40,280       792.1      41.7      00:24:32
 24311       4   5,035      20,140       801.4      42.2      00:24:17
 24596       6   5,035      30,210       811.0      42.7      00:24:00
 24889       6   5,035      30,210       820.7      43.2      00:23:44
 25168       9   5,035      45,315       830.0      43.7      00:23:29
 25459       5   5,035      25,175       839.8      44.2      00:23:12
 25676       6   5,035      30,210       846.8      44.6      00:23:04
 25854       6   5,035      30,210       853.0      44.9      00:22:58
 26034       9   5,035      45,315       859.0      45.2      00:22:53
 26266       9   5,035      45,315       866.9      45.6      00:22:42
 26526       8   5,035      40,280       875.1      46.1      00:22:30
 26781       5   5,035      25,175       883.5      46.5      00:22:18
 27035       8   5,035      40,280       891.9      46.9      00:22:06
 27259       8   5,035      40,280       899.3      47.3      00:21:56
 27479       6   5,035      30,210       906.6      47.7      00:21:47
 27697       6   5,035      30,210       914.0      48.1      00:21:38
 27939       9   5,035      45,315       922.3      48.5      00:21:26
 28203       7   5,035      35,245       931.2      49.0      00:21:12
 28448       8   5,035      40,280       939.8      49.5      00:20:60
 28673       5   5,035      25,175       947.6      49.9      00:20:49
 28859       7   5,035      35,245       954.1      50.2      00:20:42
 29053       9   5,035      45,315       960.8      50.6      00:20:35
 29292       8   5,035      40,280       968.7      51.0      00:20:24
 29536       5   5,035      25,175       976.9      51.4      00:20:12
 29751       8   5,035      40,280       984.2      51.8      00:20:03
 29921       4   5,035      20,140       990.0      52.1      00:19:58
 30103       8   5,035      40,280       996.1      52.4      00:19:52
 30309       6   5,035      30,210     1,003.2      52.8      00:19:43
 30519       5   5,035      25,175     1,010.6      53.2      00:19:33
 30784       6   5,035      30,210     1,019.7      53.7      00:19:20
 31078      10   5,035      50,350     1,029.5      54.2      00:19:04
 31349       7   5,035      35,245     1,038.9      54.7      00:18:50
 31633       9   5,035      45,315     1,048.9      55.2      00:18:35
 31910       8   5,035      40,280     1,058.8      55.7      00:18:19
 32199      10   5,035      50,350     1,069.1      56.3      00:18:03
 32472       9   5,035      45,315     1,078.9      56.8      00:17:48
 32655      10   5,035      50,350     1,085.0      57.1      00:17:42
 32844       5   5,035      25,175     1,091.6      57.5      00:17:34
 33023       8   5,035      40,280     1,098.0      57.8      00:17:27
 33224      10   5,035      50,350     1,104.9      58.2      00:17:19
 33467       8   5,035      40,280     1,113.3      58.6      00:17:07
 33694       9   5,035      45,315     1,121.4      59.0      00:16:56
 33936       9   5,035      45,315     1,129.9      59.5      00:16:44
 34152       7   5,035      35,245     1,137.7      59.9      00:16:34
 34419       4   5,035      20,140     1,147.0      60.4      00:16:21
 34705      10   5,035      50,350     1,157.0      60.9      00:16:06
 34999       5   5,035      25,175     1,167.4      61.4      00:15:50
 35296       7   5,035      35,245     1,177.8      62.0      00:15:34
 35593       7   5,035      35,245     1,188.1      62.5      00:15:19
 35902       7   5,035      35,245     1,198.7      63.1      00:15:03
 36199       6   5,035      30,210     1,209.1      63.6      00:14:48
 36491       9   5,035      45,315     1,219.1      64.2      00:14:33
 36663       9   5,035      45,315     1,225.0      64.5      00:14:27
 36850       7   5,035      35,245     1,231.3      64.8      00:14:20
 37034       8   5,035      40,280     1,237.4      65.1      00:14:14
 37246       8   5,035      40,280     1,244.1      65.5      00:14:06
 37462       9   5,035      45,315     1,251.0      65.8      00:13:57
 37658       6   5,035      30,210     1,257.4      66.2      00:13:50
 37852       6   5,035      30,210     1,263.8      66.5      00:13:43
 38057       5   5,035      25,175     1,270.8      66.9      00:13:34
 38274       6   5,035      30,210     1,278.2      67.3      00:13:25
 38478       9   5,035      45,315     1,285.5      67.7      00:13:15
 38777       3   5,035      15,105     1,295.6      68.2      00:13:01
 39017      10   5,035      50,350     1,303.9      68.6      00:12:50
 39231       7   5,035      35,245     1,310.7      69.0      00:12:42
 39445       8   5,035      40,280     1,317.8      69.4      00:12:33
 39668       9   5,035      45,315     1,325.2      69.8      00:12:24
 39914       7   5,035      35,245     1,333.4      70.2      00:12:13
 40202       3   5,035      15,105     1,343.0      70.7      00:11:59
 40500       9   5,035      45,315     1,353.2      71.2      00:11:45
 40792       4   5,035      20,140     1,363.2      71.8      00:11:31
 41020       9   5,035      45,315     1,371.2      72.2      00:11:20
 41233       6   5,035      30,210     1,378.3      72.6      00:11:11
 41461       7   5,035      35,245     1,386.1      73.0      00:11:01
 41689       7   5,035      35,245     1,393.8      73.4      00:10:52
 41909       9   5,035      45,315     1,401.6      73.8      00:10:42
 42110       8   5,035      40,280     1,407.9      74.1      00:10:34
 42307       8   5,035      40,280     1,414.0      74.4      00:10:27
 42497       3   5,035      15,105     1,420.7      74.8      00:10:19
 42679       9   5,035      45,315     1,426.7      75.1      00:10:12
 42874       4   5,035      20,140     1,433.2      75.4      00:10:04
 43062      10   5,035      50,350     1,439.8      75.8      00:09:56
 43243       4   5,035      20,140     1,446.2      76.1      00:09:48
 43422      10   5,035      50,350     1,452.4      76.5      00:09:41
 43675       5   5,035      25,175     1,460.4      76.9      00:09:30
 43964       5   5,035      25,175     1,470.3      77.4      00:09:17
 44205      10   5,035      50,350     1,478.4      77.8      00:09:06
 44401       9   5,035      45,315     1,484.5      78.1      00:08:59
 44620       8   5,035      40,280     1,492.0      78.5      00:08:49
 44852       9   5,035      45,315     1,499.9      78.9      00:08:39
 45070       4   5,035      20,140     1,507.0      79.3      00:08:30
 45317       2   5,035      10,070     1,514.7      79.7      00:08:20
 45514       7   5,035      35,245     1,521.1      80.1      00:08:12
 45741       8   5,035      40,280     1,528.2      80.4      00:08:03
 45962       7   5,035      35,245     1,535.6      80.8      00:07:53
 46170      10   5,035      50,350     1,542.7      81.2      00:07:44
 46384       9   5,035      45,315     1,550.0      81.6      00:07:35
 46620       9   5,035      45,315     1,558.0      82.0      00:07:24
 46885       5   5,035      25,175     1,567.1      82.5      00:07:12
 47121      10   5,035      50,350     1,574.2      82.9      00:07:03
 47349       8   5,035      40,280     1,581.6      83.2      00:06:54
 47557       8   5,035      40,280     1,588.2      83.6      00:06:45
 47771       7   5,035      35,245     1,595.3      84.0      00:06:36
 47978      10   5,035      50,350     1,602.4      84.3      00:06:27
 48198       8   5,035      40,280     1,609.5      84.7      00:06:18
 48411       9   5,035      45,315     1,616.8      85.1      00:06:09
 48639       7   5,035      35,245     1,624.5      85.5      00:05:59
 48862       9   5,035      45,315     1,631.9      85.9      00:05:49
 49075       8   5,035      40,280     1,639.0      86.3      00:05:40
 49275       7   5,035      35,245     1,645.8      86.6      00:05:31
 49488       8   5,035      40,280     1,652.6      87.0      00:05:22
 49721      10   5,035      50,350     1,659.7      87.4      00:05:13
 49950       9   5,035      45,315     1,667.2      87.8      00:05:04
 50194       4   5,035      20,140     1,675.2      88.2      00:04:53
 50424       7   5,035      35,245     1,682.5      88.6      00:04:44
 50638       6   5,035      30,210     1,689.6      88.9      00:04:34
 50865       3   5,035      15,105     1,697.5      89.4      00:04:24
 51104       6   5,035      30,210     1,705.8      89.8      00:04:13
 51322       9   5,035      45,315     1,713.1      90.2      00:04:04
 51568       7   5,035      35,245     1,721.6      90.6      00:03:52
 51805       6   5,035      30,210     1,730.0      91.1      00:03:41
 52077       7   5,035      35,245     1,739.6      91.6      00:03:29
 52386       9   5,035      45,315     1,750.8      92.2      00:03:14
 52696       6   5,035      30,210     1,762.3      92.8      00:02:58
 53026       6   5,035      30,210     1,774.0      93.4      00:02:43
 53356       7   5,035      35,245     1,785.4      94.0      00:02:28
 53681       9   5,035      45,315     1,796.8      94.6      00:02:13
 53916       8   5,035      40,280     1,804.7      95.0      00:02:03
 54153       8   5,035      40,280     1,812.6      95.4      00:01:52
 54399       3   5,035      15,105     1,820.7      95.8      00:01:42
 54710       9   5,035      45,315     1,830.7      96.4      00:01:29
 55015       5   5,035      25,175     1,840.7      96.9      00:01:16
 55271       7   5,035      35,245     1,849.1      97.3      00:01:05
 55529       4   5,035      20,140     1,857.1      97.8      00:00:55
 55766       8   5,035      40,280     1,865.1      98.2      00:00:45
 56003       7   5,035      35,245     1,873.4      98.6      00:00:34
 56267       4   5,035      20,140     1,882.3      99.1      00:00:22
 56551       6   5,035      30,210     1,892.4      99.6      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 2439.882
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A1000.csv saved

. 
. cap log close

. 
end of do-file
