
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A600_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   254       3   4,635      13,905         6.7       0.4      00:43:27
   539       5   4,635      23,175        14.5       0.8      00:39:55
   847       9   4,635      41,715        23.3       1.3      00:37:02
  1136       7   4,635      32,445        31.8       1.8      00:36:02
  1418       8   4,635      37,080        40.4       2.3      00:35:17
  1713      10   4,635      46,350        49.5       2.8      00:34:24
  2026       9   4,635      41,715        58.4       3.3      00:33:49
  2321      10   4,635      46,350        67.3       3.8      00:33:24
  2605       8   4,635      37,080        75.6       4.3      00:33:17
  2883       9   4,635      41,715        84.1       4.8      00:33:05
  3169       6   4,635      27,810        92.7       5.3      00:32:49
  3409       9   4,635      41,715       100.3       5.7      00:32:57
  3691       7   4,635      32,445       108.8       6.2      00:32:43
  3932       5   4,635      23,175       115.9       6.6      00:32:57
  4080       5   4,635      23,175       120.2       6.9      00:33:58
  4275      10   4,635      46,350       125.7       7.2      00:34:31
  4423      10   4,635      46,350       130.0       7.4      00:35:23
  4568      10   4,635      46,350       134.4       7.7      00:36:07
  4675       6   4,635      27,810       137.8       7.9      00:37:07
  4819       5   4,635      23,175       142.1       8.1      00:37:48
  4945      10   4,635      46,350       146.0       8.3      00:38:33
  5104      10   4,635      46,350       150.6       8.6      00:39:02
  5292       9   4,635      41,715       156.3       8.9      00:39:11
  5475       3   4,635      13,905       161.6       9.2      00:39:24
  5611      10   4,635      46,350       165.4       9.5      00:40:02
  5727       8   4,635      37,080       168.7       9.6      00:40:44
  5872       9   4,635      41,715       172.9       9.9      00:41:09
  6031       7   4,635      32,445       177.9      10.2      00:41:21
  6179       5   4,635      23,175       182.2      10.4      00:41:43
  6358      10   4,635      46,350       187.4      10.7      00:41:49
  6524       9   4,635      41,715       192.3      11.0      00:41:59
  6638      10   4,635      46,350       195.6      11.2      00:42:30
  6772       7   4,635      32,445       199.5      11.4      00:42:52
  6921       6   4,635      27,810       204.1      11.7      00:43:03
  7105      10   4,635      46,350       209.4      12.0      00:43:01
  7285       9   4,635      41,715       214.5      12.3      00:43:04
  7468       6   4,635      27,810       220.2      12.6      00:42:57
  7635       7   4,635      32,445       225.3      12.9      00:42:59
  7766       6   4,635      27,810       229.2      13.1      00:43:15
  7931       9   4,635      41,715       234.6      13.4      00:43:11
  8113      10   4,635      46,350       240.4      13.7      00:43:01
  8305       8   4,635      37,080       246.5      14.1      00:42:48
  8488       7   4,635      32,445       252.4      14.4      00:42:39
  8690       8   4,635      37,080       258.6      14.8      00:42:24
  8894      10   4,635      46,350       265.1      15.2      00:42:07
  9105      10   4,635      46,350       271.8      15.5      00:41:49
  9260      10   4,635      46,350       276.7      15.8      00:41:49
  9403       8   4,635      37,080       281.2      16.1      00:41:54
  9538       9   4,635      41,715       285.6      16.3      00:41:59
  9669      10   4,635      46,350       290.0      16.6      00:42:04
  9816       9   4,635      41,715       294.6      16.8      00:42:07
  9966       4   4,635      18,540       299.0      17.1      00:42:10
 10112       7   4,635      32,445       303.1      17.3      00:42:17
 10275       6   4,635      27,810       307.7      17.6      00:42:18
 10406       9   4,635      41,715       311.6      17.8      00:42:25
 10563       7   4,635      32,445       316.3      18.1      00:42:25
 10689      10   4,635      46,350       320.1      18.3      00:42:34
 10877      10   4,635      46,350       325.7      18.6      00:42:24
 11037       9   4,635      41,715       330.5      18.9      00:42:21
 11191       4   4,635      18,540       335.1      19.2      00:42:20
 11313       7   4,635      32,445       338.8      19.4      00:42:28
 11454       8   4,635      37,080       343.1      19.6      00:42:29
 11603       6   4,635      27,810       347.5      19.9      00:42:30
 11765       4   4,635      18,540       352.4      20.1      00:42:25
 11887       7   4,635      32,445       356.2      20.4      00:42:31
 12028       5   4,635      23,175       360.5      20.6      00:42:31
 12162       9   4,635      41,715       364.7      20.9      00:42:32
 12280       8   4,635      37,080       368.1      21.0      00:42:40
 12488      10   4,635      46,350       374.4      21.4      00:42:22
 12667       4   4,635      18,540       379.9      21.7      00:42:12
 12869       3   4,635      13,905       385.6      22.0      00:41:59
 13098       9   4,635      41,715       392.6      22.4      00:41:36
 13327       4   4,635      18,540       399.5      22.8      00:41:15
 13515       9   4,635      41,715       405.7      23.2      00:40:58
 13630       7   4,635      32,445       409.4      23.4      00:41:03
 13764       8   4,635      37,080       413.3      23.6      00:41:04
 13874       8   4,635      37,080       416.7      23.8      00:41:10
 14031       7   4,635      32,445       421.3      24.1      00:41:07
 14199      10   4,635      46,350       426.6      24.4      00:40:57
 14373       6   4,635      27,810       432.2      24.7      00:40:46
 14577       6   4,635      27,810       438.4      25.1      00:40:30
 14786       7   4,635      32,445       444.9      25.4      00:40:12
 15048       3   4,635      13,905       453.1      25.9      00:39:42
 15313       7   4,635      32,445       461.4      26.4      00:39:12
 15567      10   4,635      46,350       469.1      26.8      00:38:47
 15805       7   4,635      32,445       476.6      27.3      00:38:24
 16022      10   4,635      46,350       483.6      27.7      00:38:04
 16182      10   4,635      46,350       488.8      27.9      00:37:56
 16370       4   4,635      18,540       494.8      28.3      00:37:44
 16533       8   4,635      37,080       499.9      28.6      00:37:36
 16681       8   4,635      37,080       504.4      28.8      00:37:33
 16833       6   4,635      27,810       509.1      29.1      00:37:28
 16961       8   4,635      37,080       513.2      29.3      00:37:27
 17102       7   4,635      32,445       517.4      29.6      00:37:25
 17250       7   4,635      32,445       522.0      29.8      00:37:20
 17405       9   4,635      41,715       527.0      30.1      00:37:13
 17556       9   4,635      41,715       532.0      30.4      00:37:06
 17677       5   4,635      23,175       535.8      30.6      00:37:06
 17848      10   4,635      46,350       540.9      30.9      00:36:59
 18013       7   4,635      32,445       546.0      31.2      00:36:51
 18258       4   4,635      18,540       553.7      31.7      00:36:27
 18492       4   4,635      18,540       560.6      32.1      00:36:09
 18634       8   4,635      37,080       565.2      32.3      00:36:04
 18746       3   4,635      13,905       568.8      32.5      00:36:05
 18863       5   4,635      23,175       572.4      32.7      00:36:05
 18973       8   4,635      37,080       576.1      32.9      00:36:05
 19115       7   4,635      32,445       580.6      33.2      00:36:00
 19257       6   4,635      27,810       585.1      33.5      00:35:55
 19467       7   4,635      32,445       591.8      33.8      00:35:38
 19699       8   4,635      37,080       599.5      34.3      00:35:16
 19939      10   4,635      46,350       607.3      34.7      00:34:53
 20157       3   4,635      13,905       614.3      35.1      00:34:35
 20378       5   4,635      23,175       621.1      35.5      00:34:18
 20519       8   4,635      37,080       625.6      35.8      00:34:14
 20627       7   4,635      32,445       629.1      36.0      00:34:14
 20762       4   4,635      18,540       633.3      36.2      00:34:10
 20899       5   4,635      23,175       637.8      36.5      00:34:05
 21053       7   4,635      32,445       642.4      36.7      00:33:59
 21233       8   4,635      37,080       647.4      37.0      00:33:51
 21439      10   4,635      46,350       653.3      37.4      00:33:39
 21618       6   4,635      27,810       658.6      37.7      00:33:30
 21806       6   4,635      27,810       664.0      38.0      00:33:20
 21970       1   4,635       4,635       668.9      38.2      00:33:12
 22147       4   4,635      18,540       673.9      38.5      00:33:05
 22298       3   4,635      13,905       678.2      38.8      00:32:60
 22382       7   4,635      32,445       680.6      38.9      00:33:04
 22524       8   4,635      37,080       684.9      39.2      00:32:59
 22693       6   4,635      27,810       689.9      39.5      00:32:51
 22933       8   4,635      37,080       696.6      39.8      00:32:35
 23171      10   4,635      46,350       704.0      40.3      00:32:16
 23421       8   4,635      37,080       711.6      40.7      00:31:56
 23620       7   4,635      32,445       717.2      41.0      00:31:45
 23883       8   4,635      37,080       725.4      41.5      00:31:23
 24169       7   4,635      32,445       733.7      42.0      00:31:00
 24416       7   4,635      32,445       740.9      42.4      00:30:43
 24656       5   4,635      23,175       748.5      42.8      00:30:24
 24882       9   4,635      41,715       755.3      43.2      00:30:08
 25147       5   4,635      23,175       763.5      43.7      00:29:47
 25404       4   4,635      18,540       771.3      44.1      00:29:27
 25589       1   4,635       4,635       776.9      44.4      00:29:17
 25771       6   4,635      27,810       782.6      44.8      00:29:06
 25951      10   4,635      46,350       788.1      45.1      00:28:57
 26077       7   4,635      32,445       792.1      45.3      00:28:53
 26246       8   4,635      37,080       797.4      45.6      00:28:44
 26480       8   4,635      37,080       804.2      46.0      00:28:29
 26685       9   4,635      41,715       810.3      46.3      00:28:17
 26846       3   4,635      13,905       815.3      46.6      00:28:09
 27022       1   4,635       4,635       820.7      46.9      00:27:59
 27141       5   4,635      23,175       824.4      47.1      00:27:57
 27277       6   4,635      27,810       828.4      47.4      00:27:52
 27437       5   4,635      23,175       833.3      47.6      00:27:45
 27587       2   4,635       9,270       838.0      47.9      00:27:38
 27776       9   4,635      41,715       843.9      48.3      00:27:26
 28007       4   4,635      18,540       851.1      48.7      00:27:10
 28228      10   4,635      46,350       858.0      49.1      00:26:55
 28481       8   4,635      37,080       866.3      49.5      00:26:35
 28667       5   4,635      23,175       872.1      49.9      00:26:23
 28776       7   4,635      32,445       875.7      50.1      00:26:21
 28896       8   4,635      37,080       879.5      50.3      00:26:17
 29048       8   4,635      37,080       884.3      50.6      00:26:09
 29278       5   4,635      23,175       891.3      51.0      00:25:54
 29489       6   4,635      27,810       898.0      51.3      00:25:40
 29671       8   4,635      37,080       903.4      51.7      00:25:30
 29826       3   4,635      13,905       908.4      51.9      00:25:22
 29984      10   4,635      46,350       913.3      52.2      00:25:14
 30134       9   4,635      41,715       918.0      52.5      00:25:07
 30318       8   4,635      37,080       923.8      52.8      00:24:56
 30463       7   4,635      32,445       928.6      53.1      00:24:49
 30636       8   4,635      37,080       934.0      53.4      00:24:39
 30884       7   4,635      32,445       941.8      53.9      00:24:21
 31128       7   4,635      32,445       949.3      54.3      00:24:05
 31335       7   4,635      32,445       956.0      54.7      00:23:51
 31551       5   4,635      23,175       962.9      55.1      00:23:37
 31776       8   4,635      37,080       970.2      55.5      00:23:21
 32011      10   4,635      46,350       978.0      55.9      00:23:04
 32235       7   4,635      32,445       985.3      56.3      00:22:48
 32464       6   4,635      27,810       992.9      56.8      00:22:32
 32600       7   4,635      32,445       997.1      57.0      00:22:26
 32729      10   4,635      46,350     1,001.3      57.3      00:22:21
 32893       7   4,635      32,445     1,006.5      57.5      00:22:12
 33029       7   4,635      32,445     1,011.0      57.8      00:22:05
 33181       8   4,635      37,080     1,015.8      58.1      00:21:58
 33355       4   4,635      18,540     1,021.3      58.4      00:21:48
 33566       8   4,635      37,080     1,028.2      58.8      00:21:34
 33731      10   4,635      46,350     1,033.5      59.1      00:21:25
 33920       7   4,635      32,445     1,039.6      59.4      00:21:13
 34075       9   4,635      41,715     1,044.7      59.7      00:21:05
 34239       8   4,635      37,080     1,050.1      60.0      00:20:55
 34492       7   4,635      32,445     1,058.3      60.5      00:20:37
 34741       9   4,635      41,715     1,066.3      61.0      00:20:20
 34996       5   4,635      23,175     1,074.6      61.4      00:20:02
 35241      10   4,635      46,350     1,082.5      61.9      00:19:46
 35493       7   4,635      32,445     1,090.6      62.4      00:19:28
 35732       9   4,635      41,715     1,098.0      62.8      00:19:14
 35981       8   4,635      37,080     1,106.1      63.2      00:18:57
 36226      10   4,635      46,350     1,113.9      63.7      00:18:41
 36476       5   4,635      23,175     1,121.9      64.2      00:18:24
 36636      10   4,635      46,350     1,127.0      64.4      00:18:16
 36838       9   4,635      41,715     1,133.0      64.8      00:18:05
 36985       8   4,635      37,080     1,137.5      65.0      00:17:58
 37160       4   4,635      18,540     1,142.7      65.3      00:17:50
 37314       9   4,635      41,715     1,147.1      65.6      00:17:43
 37461       7   4,635      32,445     1,151.6      65.8      00:17:36
 37579       9   4,635      41,715     1,155.2      66.1      00:17:32
 37738       8   4,635      37,080     1,159.9      66.3      00:17:24
 37906      10   4,635      46,350     1,165.1      66.6      00:17:15
 38073       8   4,635      37,080     1,170.4      66.9      00:17:06
 38256       7   4,635      32,445     1,176.1      67.2      00:16:56
 38432       9   4,635      41,715     1,181.8      67.6      00:16:46
 38663       5   4,635      23,175     1,189.1      68.0      00:16:32
 38906       7   4,635      32,445     1,196.7      68.4      00:16:17
 39073       9   4,635      41,715     1,202.0      68.7      00:16:08
 39214      10   4,635      46,350     1,206.1      69.0      00:16:02
 39414       1   4,635       4,635     1,212.1      69.3      00:15:51
 39573      10   4,635      46,350     1,217.1      69.6      00:15:42
 39765       6   4,635      27,810     1,222.8      69.9      00:15:32
 39923       6   4,635      27,810     1,227.8      70.2      00:15:24
 40134      10   4,635      46,350     1,234.2      70.6      00:15:12
 40360       9   4,635      41,715     1,241.2      71.0      00:14:59
 40544       5   4,635      23,175     1,247.0      71.3      00:14:48
 40784       7   4,635      32,445     1,254.7      71.7      00:14:33
 40991       9   4,635      41,715     1,261.3      72.1      00:14:21
 41110       7   4,635      32,445     1,265.0      72.3      00:14:16
 41271       5   4,635      23,175     1,270.0      72.6      00:14:07
 41411       8   4,635      37,080     1,274.4      72.9      00:14:00
 41553       9   4,635      41,715     1,278.9      73.1      00:13:53
 41724       6   4,635      27,810     1,284.2      73.4      00:13:44
 41899       7   4,635      32,445     1,289.9      73.8      00:13:34
 42060       7   4,635      32,445     1,294.6      74.0      00:13:26
 42214       9   4,635      41,715     1,299.1      74.3      00:13:19
 42361       5   4,635      23,175     1,303.5      74.5      00:13:12
 42530       9   4,635      41,715     1,308.8      74.8      00:13:03
 42734       7   4,635      32,445     1,314.9      75.2      00:12:51
 42912      10   4,635      46,350     1,320.5      75.5      00:12:42
 43019       9   4,635      41,715     1,324.0      75.7      00:12:37
 43123      10   4,635      46,350     1,327.5      75.9      00:12:32
 43267       8   4,635      37,080     1,332.1      76.2      00:12:24
 43386       8   4,635      37,080     1,335.9      76.4      00:12:18
 43541      10   4,635      46,350     1,340.5      76.7      00:12:10
 43751       7   4,635      32,445     1,346.8      77.0      00:11:59
 43954       8   4,635      37,080     1,353.2      77.4      00:11:47
 44106       6   4,635      27,810     1,357.7      77.6      00:11:39
 44209       9   4,635      41,715     1,361.0      77.8      00:11:35
 44325       6   4,635      27,810     1,364.4      78.0      00:11:30
 44517       5   4,635      23,175     1,370.2      78.3      00:11:19
 44744       8   4,635      37,080     1,377.2      78.7      00:11:06
 44958       9   4,635      41,715     1,384.0      79.1      00:10:53
 45117       5   4,635      23,175     1,388.8      79.4      00:10:45
 45380       4   4,635      18,540     1,396.2      79.8      00:10:31
 45565       9   4,635      41,715     1,401.7      80.1      00:10:21
 45781       4   4,635      18,540     1,408.0      80.5      00:10:10
 45937       7   4,635      32,445     1,412.7      80.8      00:10:02
 46119       4   4,635      18,540     1,418.5      81.1      00:09:51
 46239       6   4,635      27,810     1,422.5      81.3      00:09:45
 46379       5   4,635      23,175     1,426.7      81.6      00:09:38
 46513       7   4,635      32,445     1,430.9      81.8      00:09:31
 46739       6   4,635      27,810     1,438.0      82.2      00:09:17
 46915      10   4,635      46,350     1,443.5      82.5      00:09:08
 47059      10   4,635      46,350     1,447.4      82.8      00:09:01
 47206       7   4,635      32,445     1,451.6      83.0      00:08:54
 47408       8   4,635      37,080     1,457.7      83.3      00:08:43
 47596       8   4,635      37,080     1,463.2      83.7      00:08:33
 47778       9   4,635      41,715     1,468.8      84.0      00:08:23
 47948       8   4,635      37,080     1,474.1      84.3      00:08:14
 48119       5   4,635      23,175     1,479.3      84.6      00:08:05
 48279      10   4,635      46,350     1,484.3      84.9      00:07:56
 48493       4   4,635      18,540     1,490.9      85.2      00:07:44
 48733       4   4,635      18,540     1,498.3      85.7      00:07:30
 48923       7   4,635      32,445     1,504.2      86.0      00:07:19
 49042       5   4,635      23,175     1,507.8      86.2      00:07:13
 49192       7   4,635      32,445     1,512.7      86.5      00:07:04
 49385       3   4,635      13,905     1,518.2      86.8      00:06:55
 49544       5   4,635      23,175     1,522.9      87.1      00:06:47
 49726       6   4,635      27,810     1,528.0      87.4      00:06:37
 49903       7   4,635      32,445     1,533.3      87.7      00:06:28
 50119       9   4,635      41,715     1,539.9      88.1      00:06:16
 50350       5   4,635      23,175     1,546.5      88.4      00:06:04
 50542       9   4,635      41,715     1,552.5      88.8      00:05:53
 50731       7   4,635      32,445     1,558.4      89.1      00:05:42
 50898      10   4,635      46,350     1,563.8      89.4      00:05:32
 51118      10   4,635      46,350     1,570.7      89.8      00:05:20
 51369       9   4,635      41,715     1,578.5      90.3      00:05:05
 51592       9   4,635      41,715     1,585.7      90.7      00:04:52
 51823      10   4,635      46,350     1,593.2      91.1      00:04:39
 52099       9   4,635      41,715     1,602.2      91.6      00:04:22
 52403      10   4,635      46,350     1,612.3      92.2      00:04:03
 52667       9   4,635      41,715     1,621.3      92.7      00:03:47
 52926       6   4,635      27,810     1,629.7      93.2      00:03:31
 53215       9   4,635      41,715     1,639.2      93.7      00:03:14
 53502       4   4,635      18,540     1,648.4      94.3      00:02:57
 53743       6   4,635      27,810     1,656.0      94.7      00:02:44
 53932       8   4,635      37,080     1,661.8      95.0      00:02:34
 54113       8   4,635      37,080     1,667.5      95.3      00:02:24
 54342       7   4,635      32,445     1,674.5      95.7      00:02:11
 54604       7   4,635      32,445     1,682.0      96.2      00:01:58
 54771       4   4,635      18,540     1,687.1      96.5      00:01:49
 55000       2   4,635       9,270     1,694.0      96.9      00:01:37
 55183       9   4,635      41,715     1,699.6      97.2      00:01:27
 55413       6   4,635      27,810     1,706.2      97.6      00:01:15
 55632       8   4,635      37,080     1,712.8      97.9      00:01:03
 55758       7   4,635      32,445     1,716.7      98.2      00:00:57
 55958       7   4,635      32,445     1,723.0      98.5      00:00:46
 56190       7   4,635      32,445     1,730.4      98.9      00:00:32
 56402       8   4,635      37,080     1,737.3      99.3      00:00:20
 56664       7   4,635      32,445     1,745.7      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 3071.241
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
