
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locations_total
> .dta /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/c
> a_blk_Dollar_dist_total.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total.dta /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10
> 000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
(file /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log not found)
. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  21 Nov 2023, 14:15:53

. 
. *Pass in parameters.
. local baselocs "`1'"

-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  21 Nov 2023, 14:15:53

. local nborlocs "`2'"

. *Pass in parameters.
. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. local baselocs "`1'"

. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta
. local outpath "`3'"


. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinate
> d/ca_Dollar_locations_total.dta

. local within "`4'"

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated
> /ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 3000
. local limit "`5'"

. 
i "limit: `limit'"
limit: 50

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid


. 
. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   427       3   4,035      12,105         9.8       0.6      00:25:39
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   435       8   4,035      32,280        10.0       0.7      00:25:13
   902       5   4,035      20,175        21.3       1.4      00:23:29
   918       7   4,035      28,245        21.8       1.4      00:23:01
  1348       6   4,035      24,210        33.2       2.2      00:22:30
  1396       8   4,035      32,280        34.4       2.3      00:21:39
  1819       9   4,035      36,315        45.5       3.0      00:21:41
  1849       7   4,035      28,245        46.3       3.0      00:21:19
  2279       9   4,035      36,315        57.3       3.8      00:21:20
  2309       6   4,035      24,210        58.2       3.8      00:21:01
  2741       9   4,035      36,315        69.2       4.5      00:21:02
  2776       9   4,035      36,315        70.2       4.6      00:20:44
  3200       7   4,035      28,245        81.3       5.3      00:20:43
  3234       6   4,035      24,210        82.3       5.4      00:20:28
  3650       8   4,035      32,280        93.4       6.1      00:20:26
  3673       7   4,035      28,245        94.1       6.2      00:20:17
  4083       8   4,035      32,280       104.6       6.9      00:20:23
  4070      10   4,035      40,350       104.2       6.8      00:20:27
  4464      10   4,035      40,350       114.0       7.5      00:20:38
  4449      10   4,035      40,350       113.7       7.5      00:20:42
  4841       7   4,035      28,245       124.1       8.1      00:20:42
  4816       8   4,035      32,280       123.5       8.1      00:20:49
  5231       7   4,035      28,245       134.4       8.8      00:20:42
  5197       7   4,035      28,245       133.5       8.8      00:20:52
  5554       5   4,035      20,175       142.4       9.3      00:21:02
  5538       8   4,035      32,280       142.0       9.3      00:21:06
  5853       8   4,035      32,280       149.9       9.8      00:21:25
  5807       9   4,035      36,315       148.7       9.8      00:21:36
  6172      10   4,035      40,350       158.3      10.4      00:21:36
  6075       5   4,035      20,175       155.8      10.2      00:21:59
  6512       8   4,035      32,280       166.9      11.0      00:21:43
  6361       5   4,035      20,175       163.0      10.7      00:22:18
  6921       8   4,035      32,280       177.4      11.6      00:21:32
  6634       7   4,035      28,245       170.0      11.2      00:22:36
  7430       7   4,035      28,245       190.6      12.5      00:21:01
  6983       7   4,035      28,245       179.0      11.7      00:22:35
  7941       7   4,035      28,245       204.3      13.4      00:20:29
  7395       9   4,035      36,315       189.7      12.4      00:22:19
  8443      10   4,035      40,350       218.2      14.3      00:19:58
  7820       6   4,035      24,210       200.9      13.2      00:21:59
  8930       8   4,035      32,280       231.6      15.2      00:19:33
  8200       9   4,035      36,315       211.6      13.9      00:21:45
  9307       5   4,035      20,175       242.0      15.9      00:19:26
  8588       7   4,035      28,245       222.2      14.6      00:21:30
  9602       7   4,035      28,245       250.2      16.4      00:19:32
  8992       8   4,035      32,280       233.3      15.3      00:21:14
  9967       9   4,035      36,315       260.2      17.1      00:19:27
  9317       9   4,035      36,315       242.3      15.9      00:21:11
 10373       6   4,035      24,210       270.2      17.7      00:19:21
  9611       5   4,035      20,175       250.5      16.4      00:21:13
 10740      10   4,035      40,350       279.8      18.4      00:19:17
  9945       7   4,035      28,245       259.6      17.0      00:21:08
 11115       7   4,035      28,245       289.5      19.0      00:19:12
 10300       3   4,035      12,105       268.3      17.6      00:21:05
 11437       6   4,035      24,210       298.1      19.6      00:19:13
 10672       9   4,035      36,315       278.0      18.2      00:20:57
 11820       8   4,035      32,280       308.1      20.2      00:19:06
 11068       7   4,035      28,245       288.4      18.9      00:20:44
 12260       7   4,035      28,245       319.9      21.0      00:18:51
 11428      10   4,035      40,350       297.8      19.5      00:20:37
 12785       2   4,035       8,070       333.3      21.9      00:18:29
 11852       8   4,035      32,280       309.0      20.3      00:20:21
 13316       8   4,035      32,280       347.3      22.8      00:18:05
 12254       6   4,035      24,210       319.7      21.0      00:20:07
 13690       9   4,035      36,315       357.8      23.5      00:17:57
 12784       3   4,035      12,105       333.3      21.9      00:19:40
 14043      10   4,035      40,350       366.9      24.1      00:17:54
 13287       7   4,035      28,245       346.5      22.7      00:19:17
 14465       8   4,035      32,280       378.5      24.8      00:17:41
 13686       5   4,035      20,175       357.7      23.5      00:19:03
 14936       8   4,035      32,280       391.0      25.7      00:17:24
 14043      10   4,035      40,350       366.9      24.1      00:18:57
 15413       5   4,035      20,175       404.2      26.5      00:17:06
 14452       6   4,035      24,210       378.1      24.8      00:18:43
 15855      10   4,035      40,350       416.1      27.3      00:16:53
 14890      10   4,035      40,350       389.9      25.6      00:18:27
 16309      10   4,035      40,350       428.8      28.1      00:16:37
 15361       9   4,035      36,315       402.8      26.4      00:18:07
 16736       8   4,035      32,280       440.4      28.9      00:16:25
 15879       6   4,035      24,210       416.7      27.4      00:17:44
 17123       8   4,035      32,280       450.8      29.6      00:16:17
 16365       9   4,035      36,315       430.4      28.3      00:17:23
 17525       5   4,035      20,175       462.1      30.3      00:16:06
 16797       7   4,035      28,245       442.1      29.0      00:17:09
 17998       8   4,035      32,280       474.7      31.2      00:15:52
 17180       4   4,035      16,140       452.2      29.7      00:17:00
 18316       9   4,035      36,315       483.4      31.7      00:15:48
 17548       7   4,035      28,245       462.7      30.4      00:16:50
 18615       8   4,035      32,280       491.2      32.2      00:15:47
 18010      10   4,035      40,350       475.0      31.2      00:16:35
 18999       8   4,035      32,280       502.0      32.9      00:15:38
 18336       5   4,035      20,175       484.0      31.8      00:16:30
 19370       7   4,035      28,245       512.2      33.6      00:15:29
 18639      10   4,035      40,350       491.9      32.3      00:16:27
 19793       6   4,035      24,210       524.3      34.4      00:15:16
 18920       7   4,035      28,245       499.7      32.8      00:16:25
 20245       9   4,035      36,315       536.9      35.2      00:15:02
 19266       6   4,035      24,210       509.4      33.4      00:16:17
 20673       4   4,035      16,140       548.7      36.0      00:14:50
 19723       6   4,035      24,210       522.3      34.3      00:16:00
 20971       7   4,035      28,245       556.9      36.6      00:14:47
 20229       4   4,035      16,140       536.5      35.2      00:15:40
 21374      10   4,035      40,350       566.8      37.2      00:14:39
 20674       9   4,035      36,315       548.7      36.0      00:15:25
 21781       4   4,035      16,140       577.1      37.9      00:14:31
 21058       5   4,035      20,175       559.1      36.7      00:15:16
 21456      10   4,035      40,350       568.9      37.3      00:15:07
 22170       7   4,035      28,245       586.9      38.5      00:14:23
 21779       5   4,035      20,175       577.0      37.9      00:15:04
 22516       6   4,035      24,210       595.8      39.1      00:14:18
 22074       7   4,035      28,245       584.7      38.4      00:15:01
 22820       5   4,035      20,175       603.3      39.6      00:14:16
 22385       6   4,035      24,210       592.4      38.9      00:14:57
 23173       5   4,035      20,175       612.7      40.2      00:14:09
 22688       5   4,035      20,175       600.3      39.4      00:14:54
 23487       9   4,035      36,315       620.9      40.8      00:14:05
 22995       7   4,035      28,245       607.8      39.9      00:14:50
 23832      10   4,035      40,350       629.9      41.3      00:13:58
 23276      10   4,035      40,350       615.5      40.4      00:14:47
 24254       4   4,035      16,140       640.8      42.1      00:13:48
 24710       5   4,035      20,175       652.9      42.9      00:13:35
 23632       6   4,035      24,210       624.5      41.0      00:14:40
 25202       9   4,035      36,315       665.9      43.7      00:13:20
 23990       4   4,035      16,140       634.0      41.6      00:14:31
 25676       7   4,035      28,245       678.3      44.5      00:13:06
 24463       8   4,035      32,280       646.0      42.4      00:14:17
 26038       8   4,035      32,280       688.2      45.2      00:12:58
 24990       9   4,035      36,315       660.0      43.3      00:13:59
 26504       6   4,035      24,210       700.5      46.0      00:12:45
 25522       9   4,035      36,315       674.5      44.3      00:13:39
 26996       9   4,035      36,315       713.5      46.8      00:12:30
 25886       9   4,035      36,315       684.2      44.9      00:13:31
 27396      10   4,035      40,350       724.0      47.5      00:12:21
 26358       6   4,035      24,210       696.8      45.7      00:13:16
 27776       7   4,035      28,245       734.3      48.2      00:12:12
 26795      10   4,035      40,350       708.1      46.5      00:13:04
 28177       6   4,035      24,210       745.3      48.9      00:12:02
 27195       8   4,035      32,280       718.8      47.2      00:12:54
 28570       4   4,035      16,140       756.3      49.6      00:11:51
 27511       6   4,035      24,210       727.1      47.7      00:12:48
 28889       6   4,035      24,210       765.1      50.2      00:11:45
 27837      10   4,035      40,350       736.0      48.3      00:12:41
 29348      10   4,035      40,350       777.5      51.0      00:11:32
 28242       5   4,035      20,175       747.0      49.0      00:12:30
 29756       9   4,035      36,315       788.6      51.8      00:11:21
 28668       6   4,035      24,210       759.0      49.8      00:12:17
 30148       6   4,035      24,210       799.2      52.5      00:11:12
 29001       8   4,035      32,280       768.2      50.4      00:12:09
 30506       9   4,035      36,315       809.2      53.1      00:11:03
 29385       8   4,035      32,280       778.6      51.1      00:11:59
 30963       8   4,035      32,280       821.7      53.9      00:10:50
 29825       6   4,035      24,210       790.4      51.9      00:11:46
 31473      10   4,035      40,350       835.8      54.9      00:10:34
 30252       8   4,035      32,280       802.1      52.6      00:11:34
 31922       5   4,035      20,175       848.4      55.7      00:10:22
 30584       6   4,035      24,210       811.3      53.3      00:11:26
 32368       8   4,035      32,280       861.2      56.5      00:10:08
 30974       8   4,035      32,280       822.0      54.0      00:11:15
 32763       6   4,035      24,210       872.2      57.2      00:09:58
 31362       8   4,035      32,280       832.7      54.7      00:11:05
 33065       7   4,035      28,245       880.7      57.8      00:09:52
 31790       8   4,035      32,280       844.7      55.4      00:10:52
 33411       8   4,035      32,280       890.3      58.4      00:09:44
 32247      10   4,035      40,350       857.8      56.3      00:10:37
 33738       9   4,035      36,315       899.6      59.0      00:09:37
 32710       7   4,035      28,245       870.7      57.1      00:10:23
 34089      10   4,035      40,350       909.4      59.7      00:09:28
 33057       8   4,035      32,280       880.5      57.8      00:10:14
 34536       5   4,035      20,175       922.1      60.5      00:09:15
 33413       8   4,035      32,280       890.4      58.4      00:10:05
 35041       8   4,035      32,280       936.3      61.5      00:09:00
 33792       6   4,035      24,210       901.0      59.1      00:09:55
 35529      10   4,035      40,350       950.1      62.4      00:08:46
 34183       7   4,035      28,245       912.2      59.9      00:09:44
 36050       9   4,035      36,315       964.4      63.3      00:08:31
 34685       7   4,035      28,245       926.2      60.8      00:09:28
 36568       7   4,035      28,245       978.8      64.2      00:08:16
 35198       6   4,035      24,210       940.8      61.7      00:09:12
 36942      10   4,035      40,350       989.0      64.9      00:08:07
 35716       9   4,035      36,315       955.1      62.7      00:08:56
 37331       9   4,035      36,315       998.8      65.6      00:07:59
 36198       9   4,035      36,315       968.6      63.6      00:08:42
 37700       6   4,035      24,210     1,008.4      66.2      00:07:51
 36661       8   4,035      32,280       981.5      64.4      00:08:29
 38064       9   4,035      36,315     1,018.2      66.8      00:07:42
 37025       7   4,035      28,245       991.0      65.0      00:08:21
 38413       8   4,035      32,280     1,027.9      67.5      00:07:34
 37348       9   4,035      36,315       999.2      65.6      00:08:14
 38736       8   4,035      32,280     1,036.9      68.1      00:07:27
 37673       6   4,035      24,210     1,007.8      66.1      00:08:07
 39067       7   4,035      28,245     1,045.9      68.6      00:07:19
 37986       7   4,035      28,245     1,016.0      66.7      00:08:00
 39477      10   4,035      40,350     1,056.6      69.3      00:07:09
 38311       9   4,035      36,315     1,025.0      67.3      00:07:53
 39869       7   4,035      28,245     1,067.1      70.0      00:06:60
 38639      10   4,035      40,350     1,034.1      67.9      00:07:45
 40378       5   4,035      20,175     1,080.6      70.9      00:06:46
 39101       8   4,035      32,280     1,046.8      68.7      00:07:32
 40880       6   4,035      24,210     1,094.5      71.8      00:06:33
 39467       7   4,035      28,245     1,056.3      69.3      00:07:23
 41181       6   4,035      24,210     1,102.8      72.4      00:06:26
 39785      10   4,035      40,350     1,064.8      69.9      00:07:16
 41531       6   4,035      24,210     1,112.3      73.0      00:06:18
 40209       8   4,035      32,280     1,076.1      70.6      00:07:05
 41840       9   4,035      36,315     1,120.8      73.6      00:06:11
 40668       8   4,035      32,280     1,088.7      71.5      00:06:52
 42171       8   4,035      32,280     1,129.5      74.1      00:06:03
 41079       7   4,035      28,245     1,100.1      72.2      00:06:41
 42514      10   4,035      40,350     1,138.7      74.7      00:05:55
 41386       9   4,035      36,315     1,108.4      72.7      00:06:34
 42794       9   4,035      36,315     1,146.0      75.2      00:05:50
 41668       9   4,035      36,315     1,116.1      73.3      00:06:28
 43086       9   4,035      36,315     1,154.1      75.7      00:05:43
 41965       6   4,035      24,210     1,124.4      73.8      00:06:21
 43376      10   4,035      40,350     1,162.3      76.3      00:05:36
 42341       7   4,035      28,245     1,133.8      74.4      00:06:12
 43726       9   4,035      36,315     1,171.4      76.9      00:05:28
 42738       5   4,035      20,175     1,144.5      75.1      00:06:02
 44093      10   4,035      40,350     1,181.4      77.5      00:05:19
 43099       6   4,035      24,210     1,154.5      75.8      00:05:52
 44414       8   4,035      32,280     1,189.7      78.1      00:05:12
 43470      10   4,035      40,350     1,164.9      76.5      00:05:42
 44793       9   4,035      36,315     1,200.0      78.8      00:05:02
 43840       6   4,035      24,210     1,174.6      77.1      00:05:33
 45173      10   4,035      40,350     1,210.1      79.4      00:04:53
 44238       5   4,035      20,175     1,185.3      77.8      00:05:23
 45596       8   4,035      32,280     1,220.8      80.1      00:04:43
 44672       4   4,035      16,140     1,196.7      78.5      00:05:12
 45982      10   4,035      40,350     1,230.8      80.8      00:04:34
 45076       9   4,035      36,315     1,207.6      79.3      00:05:01
 46370       7   4,035      28,245     1,241.6      81.5      00:04:24
 45530       7   4,035      28,245     1,219.2      80.0      00:04:50
 46781       7   4,035      28,245     1,252.7      82.2      00:04:13
 45929       5   4,035      20,175     1,229.3      80.7      00:04:40
 47142       8   4,035      32,280     1,261.9      82.8      00:04:05
 46281       8   4,035      32,280     1,239.2      81.3      00:04:31
 47564      10   4,035      40,350     1,272.7      83.5      00:03:55
 46722       6   4,035      24,210     1,251.1      82.1      00:04:20
 48023       9   4,035      36,315     1,285.1      84.3      00:03:43
 47130       9   4,035      36,315     1,261.7      82.8      00:04:09
 48468       9   4,035      36,315     1,297.0      85.1      00:03:32
 47517       9   4,035      36,315     1,271.5      83.5      00:04:00
 48857       6   4,035      24,210     1,307.3      85.8      00:03:22
 47922       8   4,035      32,280     1,282.2      84.2      00:03:50
 49353       6   4,035      24,210     1,320.8      86.7      00:03:09
 48377      10   4,035      40,350     1,294.6      85.0      00:03:38
 49696       9   4,035      36,315     1,329.2      87.2      00:03:02
 48846       8   4,035      32,280     1,307.1      85.8      00:03:26
 50029       4   4,035      16,140     1,338.0      87.8      00:02:54
 49370       9   4,035      36,315     1,321.2      86.7      00:03:12
 50406       9   4,035      36,315     1,347.5      88.4      00:02:45
 49776       7   4,035      28,245     1,331.3      87.4      00:03:02
 50788      10   4,035      40,350     1,357.9      89.1      00:02:35
 50178       5   4,035      20,175     1,341.9      88.1      00:02:52
 51168       5   4,035      20,175     1,368.4      89.8      00:02:25
 50582       9   4,035      36,315     1,352.3      88.8      00:02:42
 51516       5   4,035      20,175     1,377.8      90.4      00:02:17
 50998       7   4,035      28,245     1,363.8      89.5      00:02:31
 51847       9   4,035      36,315     1,387.2      91.0      00:02:08
 51380      10   4,035      40,350     1,374.1      90.2      00:02:22
 52169       9   4,035      36,315     1,396.3      91.6      00:01:60
 51732       6   4,035      24,210     1,384.0      90.8      00:02:12
 52488       4   4,035      16,140     1,405.5      92.3      00:01:51
 52087      10   4,035      40,350     1,393.9      91.5      00:02:03
 52806       7   4,035      28,245     1,415.0      92.9      00:01:42
 52461       8   4,035      32,280     1,404.8      92.2      00:01:53
 53128       8   4,035      32,280     1,424.1      93.5      00:01:34
 52850       9   4,035      36,315     1,416.2      93.0      00:01:42
 53550       8   4,035      32,280     1,435.9      94.2      00:01:23
 53245       6   4,035      24,210     1,427.4      93.7      00:01:31
 53921       6   4,035      24,210     1,446.0      94.9      00:01:13
 53738       9   4,035      36,315     1,441.1      94.6      00:01:18
 54347      10   4,035      40,350     1,457.6      95.7      00:01:02
 54142       9   4,035      36,315     1,452.0      95.3      00:01:08
 54799       9   4,035      36,315     1,469.1      96.4      00:00:51
 54586       5   4,035      20,175     1,463.4      96.0      00:00:57
 55215       3   4,035      12,105     1,480.0      97.1      00:00:41
 55022       9   4,035      36,315     1,475.1      96.8      00:00:46
 55598       7   4,035      28,245     1,489.7      97.8      00:00:32
 55425       8   4,035      32,280     1,485.3      97.5      00:00:36
 55954       9   4,035      36,315     1,499.5      98.4      00:00:23
 55813       8   4,035      32,280     1,495.6      98.2      00:00:26
 56250       8   4,035      32,280     1,507.7      99.0      00:00:15
 56166       6   4,035      24,210     1,505.3      98.8      00:00:17
 56538      10   4,035      40,350     1,515.8      99.5      00:00:07
 56497       4   4,035      16,140     1,514.7      99.4      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1443.272
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1444.002
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
file /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_
> blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
