
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A100_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   362       5   4,135      20,675         8.6       0.6      00:29:55
   712       8   4,135      33,080        17.3       1.1      00:29:48
  1068       4   4,135      16,540        26.6       1.7      00:28:55
  1425       9   4,135      37,215        36.3       2.3      00:28:04
  1767       6   4,135      24,810        45.5       2.9      00:27:49
  2112       7   4,135      28,945        54.5       3.5      00:27:41
  2450      10   4,135      41,350        63.4       4.1      00:27:36
  2787      10   4,135      41,350        72.5       4.6      00:27:26
  3120      10   4,135      41,350        81.3       5.2      00:27:21
  3439      10   4,135      41,350        90.3       5.8      00:27:11
  3769       6   4,135      24,810        99.3       6.4      00:27:01
  4054       3   4,135      12,405       106.6       6.8      00:27:20
  4313       4   4,135      16,540       113.1       7.2      00:27:47
  4559       8   4,135      33,080       119.7       7.7      00:28:09
  4791       7   4,135      28,945       126.1       8.1      00:28:30
  5033       5   4,135      20,675       132.6       8.5      00:28:46
  5267       9   4,135      37,215       138.7       8.9      00:29:06
  5514       9   4,135      37,215       145.1       9.3      00:29:19
  5734       8   4,135      33,080       150.7       9.7      00:29:41
  5957       8   4,135      33,080       156.6      10.0      00:29:56
  6222       2   4,135       8,270       163.8      10.5      00:29:54
  6456       7   4,135      28,945       169.8      10.9      00:30:05
  6701       7   4,135      28,945       176.1      11.3      00:30:11
  6920       6   4,135      24,810       182.0      11.7      00:30:21
  7229       7   4,135      28,945       189.9      12.2      00:30:08
  7534       4   4,135      16,540       198.2      12.7      00:29:50
  7783       7   4,135      28,945       205.0      13.1      00:29:48
  8078       8   4,135      33,080       213.4      13.7      00:29:31
  8374       6   4,135      24,810       221.9      14.2      00:29:13
  8674       6   4,135      24,810       230.2      14.8      00:28:56
  8965       7   4,135      28,945       238.5      15.3      00:28:41
  9223       8   4,135      33,080       245.8      15.8      00:28:34
  9411       7   4,135      28,945       251.1      16.1      00:28:44
  9637       7   4,135      28,945       257.7      16.5      00:28:42
  9842       7   4,135      28,945       263.5      16.9      00:28:46
 10063       9   4,135      37,215       269.3      17.3      00:28:49
 10263       8   4,135      33,080       274.2      17.6      00:28:60
 10467       9   4,135      37,215       279.7      17.9      00:29:04
 10746       9   4,135      37,215       287.0      18.4      00:28:54
 11019       8   4,135      33,080       294.4      18.9      00:28:44
 11269       6   4,135      24,810       301.0      19.3      00:28:40
 11500       5   4,135      20,675       307.4      19.7      00:28:36
 11742       5   4,135      20,675       313.7      20.1      00:28:33
 11983       7   4,135      28,945       320.3      20.5      00:28:28
 12198       8   4,135      33,080       326.3      20.9      00:28:26
 12473       7   4,135      28,945       333.6      21.4      00:28:16
 12780       6   4,135      24,810       341.7      21.9      00:28:00
 13099       8   4,135      33,080       350.2      22.4      00:27:42
 13415       8   4,135      33,080       358.9      23.0      00:27:24
 13669       8   4,135      33,080       366.3      23.5      00:27:14
 13894       6   4,135      24,810       372.3      23.9      00:27:11
 14166       7   4,135      28,945       379.7      24.3      00:27:01
 14434       5   4,135      20,675       387.2      24.8      00:26:50
 14710       7   4,135      28,945       394.7      25.3      00:26:38
 15020       5   4,135      20,675       403.4      25.9      00:26:21
 15359       5   4,135      20,675       412.9      26.5      00:25:60
 15691       8   4,135      33,080       421.9      27.0      00:25:42
 15986       8   4,135      33,080       430.4      27.6      00:25:26
 16315      10   4,135      41,350       439.8      28.2      00:25:06
 16608       5   4,135      20,675       447.9      28.7      00:24:53
 16830       6   4,135      24,810       454.1      29.1      00:24:49
 17043       3   4,135      12,405       460.1      29.5      00:24:46
 17277       5   4,135      20,675       466.5      29.9      00:24:41
 17479      10   4,135      41,350       472.4      30.3      00:24:37
 17705      10   4,135      41,350       478.7      30.7      00:24:32
 17981       9   4,135      37,215       486.2      31.2      00:24:21
 18314       5   4,135      20,675       495.6      31.8      00:24:03
 18589       8   4,135      33,080       502.9      32.2      00:23:53
 18797       7   4,135      28,945       508.8      32.6      00:23:49
 19025       6   4,135      24,810       515.5      33.0      00:23:42
 19264      10   4,135      41,350       522.2      33.5      00:23:35
 19563       5   4,135      20,675       530.8      34.0      00:23:20
 19896       6   4,135      24,810       540.5      34.6      00:23:01
 20219       9   4,135      37,215       549.8      35.2      00:22:43
 20511       5   4,135      20,675       557.9      35.8      00:22:31
 20710       8   4,135      33,080       563.5      36.1      00:22:27
 20917       6   4,135      24,810       569.5      36.5      00:22:23
 21160       1   4,135       4,135       575.8      36.9      00:22:18
 21426      10   4,135      41,350       582.5      37.3      00:22:10
 21670       8   4,135      33,080       589.0      37.8      00:22:04
 21935       8   4,135      33,080       595.8      38.2      00:21:55
 22197       7   4,135      28,945       602.5      38.6      00:21:48
 22484       7   4,135      28,945       610.0      39.1      00:21:37
 22760       6   4,135      24,810       617.0      39.5      00:21:28
 23004       5   4,135      20,675       623.4      40.0      00:21:21
 23214       6   4,135      24,810       629.3      40.3      00:21:16
 23455       4   4,135      16,540       635.6      40.7      00:21:10
 23684       6   4,135      24,810       641.5      41.1      00:21:04
 23921       6   4,135      24,810       648.1      41.5      00:20:57
 24192       8   4,135      33,080       655.2      42.0      00:20:47
 24486       6   4,135      24,810       662.9      42.5      00:20:36
 24761       6   4,135      24,810       670.5      43.0      00:20:25
 25050      10   4,135      41,350       678.4      43.5      00:20:13
 25347      10   4,135      41,350       686.6      44.0      00:19:60
 25633      10   4,135      41,350       694.2      44.5      00:19:49
 25836       9   4,135      37,215       700.1      44.9      00:19:43
 26049       7   4,135      28,945       705.9      45.2      00:19:38
 26284       8   4,135      33,080       712.4      45.7      00:19:30
 26579       6   4,135      24,810       720.1      46.2      00:19:19
 26857      10   4,135      41,350       727.6      46.6      00:19:08
 27112       5   4,135      20,675       734.6      47.1      00:18:59
 27310       6   4,135      24,810       739.9      47.4      00:18:54
 27491      10   4,135      41,350       745.0      47.7      00:18:51
 27742       7   4,135      28,945       751.9      48.2      00:18:42
 27991       6   4,135      24,810       758.9      48.6      00:18:32
 28248       8   4,135      33,080       766.0      49.1      00:18:22
 28497       9   4,135      37,215       773.3      49.6      00:18:12
 28666       4   4,135      16,540       778.0      49.9      00:18:09
 28782       8   4,135      33,080       781.4      50.1      00:18:10
 28899       7   4,135      28,945       784.7      50.3      00:18:10
 29046       8   4,135      33,080       788.8      50.6      00:18:09
 29213       8   4,135      33,080       793.3      50.8      00:18:06
 29376       9   4,135      37,215       798.0      51.1      00:18:03
 29547       9   4,135      37,215       802.6      51.4      00:17:59
 29717       9   4,135      37,215       807.4      51.7      00:17:56
 29854       9   4,135      37,215       811.2      52.0      00:17:54
 30005       9   4,135      37,215       815.4      52.3      00:17:52
 30159       8   4,135      33,080       819.8      52.5      00:17:49
 30337       9   4,135      37,215       824.7      52.9      00:17:45
 30483       7   4,135      28,945       829.0      53.1      00:17:42
 30649       9   4,135      37,215       833.6      53.4      00:17:38
 30856      10   4,135      41,350       839.5      53.8      00:17:31
 31103       7   4,135      28,945       846.2      54.2      00:17:21
 31292       6   4,135      24,810       851.6      54.6      00:17:15
 31531      10   4,135      41,350       858.6      55.0      00:17:05
 31795      10   4,135      41,350       866.1      55.5      00:16:53
 32022       6   4,135      24,810       872.8      55.9      00:16:43
 32274       9   4,135      37,215       880.1      56.4      00:16:32
 32497       8   4,135      33,080       886.7      56.8      00:16:23
 32620       5   4,135      20,675       890.1      57.0      00:16:22
 32747       8   4,135      33,080       893.8      57.3      00:16:20
 32878      10   4,135      41,350       897.4      57.5      00:16:18
 33027      10   4,135      41,350       901.8      57.8      00:16:14
 33177       6   4,135      24,810       906.1      58.1      00:16:10
 33360       8   4,135      33,080       911.3      58.4      00:16:04
 33553       8   4,135      33,080       916.9      58.8      00:15:57
 33748       7   4,135      28,945       922.5      59.1      00:15:50
 33899       7   4,135      28,945       926.8      59.4      00:15:46
 34043      10   4,135      41,350       931.0      59.7      00:15:42
 34194       8   4,135      33,080       935.6      60.0      00:15:38
 34441       9   4,135      37,215       942.6      60.4      00:15:27
 34703       9   4,135      37,215       950.1      60.9      00:15:15
 34935       5   4,135      20,675       956.9      61.3      00:15:04
 35168       7   4,135      28,945       963.6      61.8      00:14:54
 35423       7   4,135      28,945       970.9      62.2      00:14:43
 35688       7   4,135      28,945       978.4      62.7      00:14:31
 35915       5   4,135      20,675       984.8      63.1      00:14:22
 36145       6   4,135      24,810       991.5      63.5      00:14:12
 36362       6   4,135      24,810       997.7      63.9      00:14:03
 36563       5   4,135      20,675     1,003.3      64.3      00:13:55
 36713       9   4,135      37,215     1,007.4      64.6      00:13:51
 36873       6   4,135      24,810     1,011.9      64.9      00:13:46
 37022       5   4,135      20,675     1,015.8      65.1      00:13:42
 37184       9   4,135      37,215     1,020.0      65.4      00:13:38
 37355       8   4,135      33,080     1,024.5      65.7      00:13:33
 37518       8   4,135      33,080     1,028.8      65.9      00:13:28
 37686       6   4,135      24,810     1,033.3      66.2      00:13:23
 37887       5   4,135      20,675     1,038.9      66.6      00:13:15
 38076       8   4,135      33,080     1,044.2      66.9      00:13:08
 38256       7   4,135      28,945     1,049.2      67.2      00:13:02
 38427       7   4,135      28,945     1,054.2      67.6      00:12:55
 38613       6   4,135      24,810     1,059.4      67.9      00:12:48
 38817      10   4,135      41,350     1,065.1      68.3      00:12:40
 38999       8   4,135      33,080     1,070.3      68.6      00:12:33
 39128       4   4,135      16,540     1,073.8      68.8      00:12:30
 39273       8   4,135      33,080     1,077.6      69.1      00:12:26
 39461       7   4,135      28,945     1,082.6      69.4      00:12:19
 39644       6   4,135      24,810     1,087.7      69.7      00:12:12
 39818      10   4,135      41,350     1,092.4      70.0      00:12:06
 40053       4   4,135      16,540     1,098.9      70.4      00:11:56
 40294       8   4,135      33,080     1,105.4      70.8      00:11:46
 40533       7   4,135      28,945     1,112.3      71.3      00:11:35
 40769       5   4,135      20,675     1,118.9      71.7      00:11:24
 40975       9   4,135      37,215     1,124.8      72.1      00:11:16
 41108       6   4,135      24,810     1,128.5      72.3      00:11:12
 41255       8   4,135      33,080     1,132.6      72.6      00:11:06
 41428       7   4,135      28,945     1,137.4      72.9      00:10:60
 41579       7   4,135      28,945     1,141.6      73.2      00:10:55
 41746       8   4,135      33,080     1,146.3      73.5      00:10:48
 41924       7   4,135      28,945     1,151.4      73.8      00:10:41
 42057       5   4,135      20,675     1,154.8      74.0      00:10:37
 42213      10   4,135      41,350     1,158.9      74.3      00:10:32
 42376       9   4,135      37,215     1,163.4      74.6      00:10:26
 42529       5   4,135      20,675     1,167.6      74.8      00:10:21
 42706       8   4,135      33,080     1,172.3      75.1      00:10:14
 42867       4   4,135      16,540     1,176.8      75.4      00:10:08
 43003       9   4,135      37,215     1,180.7      75.7      00:10:03
 43124       5   4,135      20,675     1,184.3      75.9      00:09:59
 43286       6   4,135      24,810     1,188.9      76.2      00:09:52
 43435       8   4,135      33,080     1,193.2      76.5      00:09:46
 43637       9   4,135      37,215     1,198.4      76.8      00:09:38
 43833       9   4,135      37,215     1,203.8      77.2      00:09:30
 44026      10   4,135      41,350     1,209.1      77.5      00:09:22
 44174      10   4,135      41,350     1,213.3      77.8      00:09:16
 44290       9   4,135      37,215     1,216.4      78.0      00:09:13
 44400       6   4,135      24,810     1,219.1      78.1      00:09:10
 44565       9   4,135      37,215     1,223.8      78.4      00:09:03
 44755       6   4,135      24,810     1,229.0      78.8      00:08:55
 44925       4   4,135      16,540     1,233.7      79.1      00:08:48
 45143       6   4,135      24,810     1,239.6      79.5      00:08:39
 45333       4   4,135      16,540     1,244.3      79.8      00:08:32
 45486       7   4,135      28,945     1,248.5      80.0      00:08:26
 45613       3   4,135      12,405     1,251.7      80.2      00:08:22
 45789       7   4,135      28,945     1,256.3      80.5      00:08:15
 45944       6   4,135      24,810     1,260.5      80.8      00:08:09
 46100      10   4,135      41,350     1,264.9      81.1      00:08:02
 46271      10   4,135      41,350     1,269.9      81.4      00:07:55
 46413       7   4,135      28,945     1,273.7      81.6      00:07:49
 46576       9   4,135      37,215     1,278.3      81.9      00:07:42
 46814       4   4,135      16,540     1,285.0      82.4      00:07:31
 46969       8   4,135      33,080     1,289.0      82.6      00:07:25
 47146       6   4,135      24,810     1,293.4      82.9      00:07:19
 47292       4   4,135      16,540     1,297.3      83.1      00:07:13
 47452       7   4,135      28,945     1,301.5      83.4      00:07:07
 47585       8   4,135      33,080     1,305.1      83.6      00:07:02
 47750      10   4,135      41,350     1,309.6      83.9      00:06:55
 47889       5   4,135      20,675     1,313.4      84.2      00:06:49
 48042       6   4,135      24,810     1,317.7      84.5      00:06:43
 48180       7   4,135      28,945     1,321.4      84.7      00:06:37
 48360       6   4,135      24,810     1,326.4      85.0      00:06:29
 48568       9   4,135      37,215     1,332.2      85.4      00:06:19
 48803       4   4,135      16,540     1,338.6      85.8      00:06:09
 48951       6   4,135      24,810     1,342.7      86.1      00:06:02
 49108       9   4,135      37,215     1,347.0      86.3      00:05:56
 49251       7   4,135      28,945     1,351.0      86.6      00:05:49
 49392       5   4,135      20,675     1,354.6      86.8      00:05:44
 49529       9   4,135      37,215     1,358.3      87.1      00:05:39
 49684       7   4,135      28,945     1,362.1      87.3      00:05:33
 49829       8   4,135      33,080     1,365.9      87.5      00:05:27
 49968       8   4,135      33,080     1,369.8      87.8      00:05:21
 50130       9   4,135      37,215     1,374.1      88.1      00:05:14
 50275       7   4,135      28,945     1,377.8      88.3      00:05:08
 50423       7   4,135      28,945     1,381.7      88.6      00:05:02
 50592       5   4,135      20,675     1,386.4      88.9      00:04:54
 50721       6   4,135      24,810     1,390.0      89.1      00:04:49
 50859       4   4,135      16,540     1,393.9      89.3      00:04:42
 50983       6   4,135      24,810     1,397.6      89.6      00:04:37
 51196       6   4,135      24,810     1,403.4      89.9      00:04:27
 51421       5   4,135      20,675     1,409.7      90.4      00:04:16
 51678       9   4,135      37,215     1,417.2      90.8      00:04:03
 51979       9   4,135      37,215     1,425.7      91.4      00:03:48
 52260       8   4,135      33,080     1,434.1      91.9      00:03:34
 52527       7   4,135      28,945     1,442.1      92.4      00:03:20
 52751       9   4,135      37,215     1,448.9      92.9      00:03:08
 52961      10   4,135      41,350     1,455.0      93.3      00:02:58
 53205       7   4,135      28,945     1,462.0      93.7      00:02:46
 53451       9   4,135      37,215     1,469.1      94.2      00:02:34
 53639       6   4,135      24,810     1,474.4      94.5      00:02:25
 53761       7   4,135      28,945     1,477.9      94.7      00:02:19
 53921       9   4,135      37,215     1,482.2      95.0      00:02:12
 54093       3   4,135      12,405     1,487.0      95.3      00:02:04
 54229       5   4,135      20,675     1,490.8      95.5      00:01:58
 54370       5   4,135      20,675     1,494.5      95.8      00:01:52
 54517       7   4,135      28,945     1,498.1      96.0      00:01:46
 54705       7   4,135      28,945     1,503.3      96.4      00:01:37
 54848       8   4,135      33,080     1,507.2      96.6      00:01:30
 54986       5   4,135      20,675     1,510.9      96.8      00:01:24
 55110       5   4,135      20,675     1,514.3      97.1      00:01:18
 55265      10   4,135      41,350     1,518.4      97.3      00:01:12
 55419       6   4,135      24,810     1,522.3      97.6      00:01:05
 55606      10   4,135      41,350     1,527.2      97.9      00:00:57
 55762       2   4,135       8,270     1,531.6      98.2      00:00:49
 55917      10   4,135      41,350     1,536.1      98.5      00:00:41
 56035       5   4,135      20,675     1,539.3      98.7      00:00:36
 56159      10   4,135      41,350     1,542.8      98.9      00:00:30
 56299       6   4,135      24,810     1,546.8      99.1      00:00:23
 56424       8   4,135      33,080     1,550.5      99.4      00:00:17
 56645       6   4,135      24,810     1,556.8      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 2703.739
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
