
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A600.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A600.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A600.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A600.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   367       7   4,635      32,445         9.7       0.6      00:30:01
   740       7   4,635      32,445        20.1       1.1      00:28:44
  1072       6   4,635      27,810        29.7       1.7      00:29:00
  1466       9   4,635      41,715        41.7       2.4      00:27:21
  1843       1   4,635       4,635        53.0       3.0      00:26:46
  2226       9   4,635      41,715        64.3       3.7      00:26:15
  2646       7   4,635      32,445        76.6       4.4      00:25:31
  3022       6   4,635      27,810        87.8       5.0      00:25:18
  3361       6   4,635      27,810        98.5       5.6      00:25:11
  3670       3   4,635      13,905       108.0       6.2      00:25:24
  3978       6   4,635      27,810       116.9       6.7      00:25:39
  4193       7   4,635      32,445       123.4       7.0      00:26:25
  4440       5   4,635      23,175       130.3       7.4      00:26:58
  4701       9   4,635      41,715       138.5       7.9      00:27:12
  4951       9   4,635      41,715       146.0       8.3      00:27:31
  5176       5   4,635      23,175       152.6       8.7      00:27:58
  5432       1   4,635       4,635       160.4       9.2      00:28:07
  5666       9   4,635      41,715       166.8       9.5      00:28:32
  5899       6   4,635      27,810       173.5       9.9      00:28:50
  6104       4   4,635      18,540       179.9      10.3      00:29:09
  6366       7   4,635      32,445       187.4      10.7      00:29:15
  6637       5   4,635      23,175       195.3      11.2      00:29:15
  6883       9   4,635      41,715       202.6      11.6      00:29:21
  7175       6   4,635      27,810       211.1      12.1      00:29:14
  7534       9   4,635      41,715       222.0      12.7      00:28:45
  7840       3   4,635      13,905       231.3      13.2      00:28:31
  8091       6   4,635      27,810       239.4      13.7      00:28:28
  8397       6   4,635      27,810       249.2      14.2      00:28:10
  8707       5   4,635      23,175       258.9      14.8      00:27:54
  9007       5   4,635      23,175       268.4      15.3      00:27:40
  9320       9   4,635      41,715       278.4      15.9      00:27:22
  9583       5   4,635      23,175       286.9      16.4      00:27:16
  9769       7   4,635      32,445       292.9      16.7      00:27:26
 10050       9   4,635      41,715       301.2      17.2      00:27:19
 10288       8   4,635      37,080       307.9      17.6      00:27:23
 10526      10   4,635      46,350       315.1      18.0      00:27:23
 10852       4   4,635      18,540       324.7      18.6      00:27:08
 11139       3   4,635      13,905       333.3      19.0      00:26:59
 11332      10   4,635      46,350       339.1      19.4      00:27:06
 11511       8   4,635      37,080       344.7      19.7      00:27:15
 11750       7   4,635      32,445       351.7      20.1      00:27:14
 11945      10   4,635      46,350       357.7      20.4      00:27:19
 12213       8   4,635      37,080       366.0      20.9      00:27:10
 12519       7   4,635      32,445       375.2      21.4      00:26:56
 12884      10   4,635      46,350       385.9      22.0      00:26:35
 13250       9   4,635      41,715       397.0      22.7      00:26:12
 13579      10   4,635      46,350       407.4      23.3      00:25:52
 13794      10   4,635      46,350       414.1      23.7      00:25:52
 14003       3   4,635      13,905       420.3      24.0      00:25:54
 14271       7   4,635      32,445       428.7      24.5      00:25:45
 14489       8   4,635      37,080       435.6      24.9      00:25:43
 14777       6   4,635      27,810       444.3      25.4      00:25:32
 15066       4   4,635      18,540       453.4      25.9      00:25:19
 15364      10   4,635      46,350       462.8      26.4      00:25:05
 15733       9   4,635      41,715       474.0      27.1      00:24:44
 16065       8   4,635      37,080       484.8      27.7      00:24:25
 16394       4   4,635      18,540       495.3      28.3      00:24:07
 16669      10   4,635      46,350       503.8      28.8      00:23:58
 16904       7   4,635      32,445       511.0      29.2      00:23:54
 17138       9   4,635      41,715       518.3      29.6      00:23:49
 17311       5   4,635      23,175       523.6      29.9      00:23:52
 17527       8   4,635      37,080       530.9      30.3      00:23:47
 17707       8   4,635      37,080       536.4      30.7      00:23:48
 18005       6   4,635      27,810       545.5      31.2      00:23:36
 18343       6   4,635      27,810       556.1      31.8      00:23:18
 18629       7   4,635      32,445       564.7      32.3      00:23:09
 18855      10   4,635      46,350       571.9      32.7      00:23:03
 19049       5   4,635      23,175       578.3      33.0      00:23:01
 19300       4   4,635      18,540       586.2      33.5      00:22:53
 19602       8   4,635      37,080       595.9      34.1      00:22:39
 19939      10   4,635      46,350       606.9      34.7      00:22:20
 20279      10   4,635      46,350       617.7      35.3      00:22:03
 20558       6   4,635      27,810       626.6      35.8      00:21:52
 20743       5   4,635      23,175       632.4      36.1      00:21:51
 20906       5   4,635      23,175       637.6      36.4      00:21:51
 21092       9   4,635      41,715       643.3      36.8      00:21:50
 21329       5   4,635      23,175       649.7      37.1      00:21:47
 21611       3   4,635      13,905       658.2      37.6      00:21:37
 21831       5   4,635      23,175       664.3      38.0      00:21:34
 22116       4   4,635      18,540       672.6      38.4      00:21:24
 22355       9   4,635      41,715       679.6      38.8      00:21:19
 22575      10   4,635      46,350       686.1      39.2      00:21:14
 22879       8   4,635      37,080       694.7      39.7      00:21:04
 23172       9   4,635      41,715       703.7      40.2      00:20:52
 23508       7   4,635      32,445       713.8      40.8      00:20:37
 23780       6   4,635      27,810       721.9      41.2      00:20:28
 24135       6   4,635      27,810       732.6      41.9      00:20:11
 24433       8   4,635      37,080       741.1      42.3      00:20:01
 24759       7   4,635      32,445       751.4      42.9      00:19:46
 25040       8   4,635      37,080       759.8      43.4      00:19:36
 25386       7   4,635      32,445       770.5      44.0      00:19:19
 25643       7   4,635      32,445       778.1      44.5      00:19:12
 25859       6   4,635      27,810       785.1      44.9      00:19:06
 26060       9   4,635      41,715       791.3      45.2      00:19:02
 26293       9   4,635      41,715       798.6      45.6      00:18:55
 26558       8   4,635      37,080       806.2      46.1      00:18:47
 26839       7   4,635      32,445       814.6      46.5      00:18:36
 27085       9   4,635      41,715       822.3      47.0      00:18:28
 27275       6   4,635      27,810       828.0      47.3      00:18:25
 27487       6   4,635      27,810       834.5      47.7      00:18:20
 27691       6   4,635      27,810       840.8      48.0      00:18:15
 27984       8   4,635      37,080       850.1      48.6      00:18:02
 28292       8   4,635      37,080       859.7      49.1      00:17:49
 28651       6   4,635      27,810       871.3      49.8      00:17:31
 28808       4   4,635      18,540       876.3      50.1      00:17:30
 29020       3   4,635      13,905       883.0      50.5      00:17:23
 29217       4   4,635      18,540       889.1      50.8      00:17:19
 29470       9   4,635      41,715       897.1      51.3      00:17:09
 29711       8   4,635      37,080       904.3      51.7      00:17:02
 29898       6   4,635      27,810       910.3      52.0      00:16:57
 30082       6   4,635      27,810       916.0      52.3      00:16:53
 30287       7   4,635      32,445       922.4      52.7      00:16:47
 30490       7   4,635      32,445       929.0      53.1      00:16:41
 30748       9   4,635      41,715       937.1      53.5      00:16:32
 31056       8   4,635      37,080       946.7      54.1      00:16:18
 31389       7   4,635      32,445       957.3      54.7      00:16:03
 31716       7   4,635      32,445       967.8      55.3      00:15:48
 32053       8   4,635      37,080       978.9      55.9      00:15:32
 32394       5   4,635      23,175       990.2      56.6      00:15:15
 32604       7   4,635      32,445       996.8      57.0      00:15:09
 32841      10   4,635      46,350     1,004.5      57.4      00:15:00
 32981       7   4,635      32,445     1,008.9      57.6      00:14:58
 33176       8   4,635      37,080     1,015.3      58.0      00:14:52
 33387       6   4,635      27,810     1,021.9      58.4      00:14:46
 33646       7   4,635      32,445     1,030.4      58.9      00:14:35
 33877       3   4,635      13,905     1,037.8      59.3      00:14:27
 34158       6   4,635      27,810     1,047.0      59.8      00:14:15
 34467       8   4,635      37,080     1,057.0      60.4      00:14:01
 34824       5   4,635      23,175     1,068.6      61.1      00:13:45
 35154       7   4,635      32,445     1,079.1      61.7      00:13:30
 35468       8   4,635      37,080     1,089.4      62.2      00:13:16
 35793       8   4,635      37,080     1,099.6      62.8      00:13:03
 36178       7   4,635      32,445     1,112.0      63.5      00:12:45
 36494      10   4,635      46,350     1,122.1      64.1      00:12:32
 36746      10   4,635      46,350     1,129.9      64.6      00:12:23
 36938       7   4,635      32,445     1,135.9      64.9      00:12:17
 37171       8   4,635      37,080     1,142.8      65.3      00:12:10
 37409       8   4,635      37,080     1,149.7      65.7      00:12:02
 37697       4   4,635      18,540     1,158.3      66.2      00:11:52
 37987       7   4,635      32,445     1,167.1      66.7      00:11:41
 38239       8   4,635      37,080     1,175.2      67.1      00:11:31
 38424       7   4,635      32,445     1,181.2      67.5      00:11:26
 38758       9   4,635      41,715     1,191.8      68.1      00:11:12
 39093      10   4,635      46,350     1,202.2      68.7      00:10:58
 39410       8   4,635      37,080     1,211.7      69.2      00:10:46
 39732       5   4,635      23,175     1,221.5      69.8      00:10:33
 40060       5   4,635      23,175     1,231.6      70.4      00:10:20
 40476       9   4,635      41,715     1,244.5      71.1      00:10:03
 40895       5   4,635      23,175     1,257.7      71.9      00:09:45
 41200       9   4,635      41,715     1,267.4      72.4      00:09:33
 41532       7   4,635      32,445     1,277.8      73.0      00:09:19
 41833       9   4,635      41,715     1,287.3      73.6      00:09:08
 42097       7   4,635      32,445     1,295.3      74.0      00:08:58
 42406       8   4,635      37,080     1,304.5      74.5      00:08:47
 42696      10   4,635      46,350     1,313.4      75.0      00:08:37
 43000       8   4,635      37,080     1,322.9      75.6      00:08:25
 43294       8   4,635      37,080     1,332.5      76.1      00:08:13
 43565       9   4,635      41,715     1,340.9      76.6      00:08:03
 43858       6   4,635      27,810     1,349.8      77.1      00:07:53
 44105      10   4,635      46,350     1,357.5      77.6      00:07:44
 44352       7   4,635      32,445     1,364.9      78.0      00:07:35
 44655       6   4,635      27,810     1,374.1      78.5      00:07:24
 44974      10   4,635      46,350     1,384.1      79.1      00:07:12
 45324       8   4,635      37,080     1,394.4      79.7      00:06:59
 45583      10   4,635      46,350     1,402.0      80.1      00:06:51
 45897       7   4,635      32,445     1,411.2      80.6      00:06:40
 46182       7   4,635      32,445     1,420.2      81.1      00:06:29
 46484       9   4,635      41,715     1,429.6      81.7      00:06:18
 46807       9   4,635      41,715     1,439.8      82.3      00:06:05
 47095       4   4,635      18,540     1,448.2      82.8      00:05:55
 47368       8   4,635      37,080     1,456.2      83.2      00:05:46
 47657       9   4,635      41,715     1,464.8      83.7      00:05:36
 47896       8   4,635      37,080     1,472.1      84.1      00:05:28
 48157       7   4,635      32,445     1,480.2      84.6      00:05:18
 48427       6   4,635      27,810     1,488.6      85.1      00:05:08
 48732       9   4,635      41,715     1,498.0      85.6      00:04:57
 49038       3   4,635      13,905     1,507.2      86.1      00:04:46
 49323       6   4,635      27,810     1,516.2      86.6      00:04:35
 49576      10   4,635      46,350     1,523.6      87.1      00:04:27
 49873       8   4,635      37,080     1,532.1      87.5      00:04:17
 50132       7   4,635      32,445     1,540.0      88.0      00:04:07
 50418       7   4,635      32,445     1,548.2      88.5      00:03:58
 50703       5   4,635      23,175     1,557.1      89.0      00:03:47
 50976       8   4,635      37,080     1,565.8      89.5      00:03:37
 51266       9   4,635      41,715     1,574.8      90.0      00:03:26
 51613       5   4,635      23,175     1,585.8      90.6      00:03:13
 51897       8   4,635      37,080     1,595.1      91.1      00:03:02
 52174       6   4,635      27,810     1,604.2      91.7      00:02:51
 52532       8   4,635      37,080     1,616.1      92.3      00:02:37
 52908       9   4,635      41,715     1,628.8      93.1      00:02:22
 53323       6   4,635      27,810     1,642.1      93.8      00:02:06
 53734       9   4,635      41,715     1,655.3      94.6      00:01:50
 53979       5   4,635      23,175     1,662.8      95.0      00:01:42
 54252       6   4,635      27,810     1,671.4      95.5      00:01:32
 54541       4   4,635      18,540     1,679.7      96.0      00:01:22
 54852       6   4,635      27,810     1,689.1      96.5      00:01:11
 55208       6   4,635      27,810     1,700.0      97.1      00:00:58
 55552       7   4,635      32,445     1,709.9      97.7      00:00:47
 55847      10   4,635      46,350     1,719.0      98.2      00:00:36
 56197       6   4,635      27,810     1,730.1      98.9      00:00:23
 56504       6   4,635      27,810     1,740.2      99.4      00:00:12

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 2029.629
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A600.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A600.csv saved

. 
. cap log close

. 
end of do-file
