
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A700.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A700.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   264       8   4,735      37,880         7.2       0.4      00:41:34
   573       8   4,735      37,880        15.9       0.9      00:37:19
   911       8   4,735      37,880        25.6       1.4      00:34:33
  1255      10   4,735      47,350        36.2       2.0      00:32:21
  1568       2   4,735       9,470        46.0       2.6      00:31:38
  1878       6   4,735      28,410        55.3       3.1      00:31:23
  2220       5   4,735      23,675        65.8       3.7      00:30:35
  2570       6   4,735      28,410        76.1       4.3      00:30:02
  2939       8   4,735      37,880        87.5       4.9      00:29:11
  3264       9   4,735      42,615        97.9       5.5      00:28:49
  3634       9   4,735      42,615       109.4       6.1      00:28:10
  3947       9   4,735      42,615       118.8       6.6      00:28:08
  4151       9   4,735      42,615       124.9       7.0      00:28:54
  4435      10   4,735      47,350       133.1       7.5      00:29:02
  4704       5   4,735      23,675       141.7       7.9      00:29:05
  4972       7   4,735      33,145       149.9       8.4      00:29:11
  5223       8   4,735      37,880       157.6       8.8      00:29:22
  5456       4   4,735      18,940       164.7       9.2      00:29:37
  5675       7   4,735      33,145       170.8       9.6      00:30:01
  5927      10   4,735      47,350       178.5      10.0      00:30:06
  6181       8   4,735      37,880       186.2      10.4      00:30:09
  6435       7   4,735      33,145       193.8      10.8      00:30:12
  6692       7   4,735      33,145       201.4      11.3      00:30:15
  6913       6   4,735      28,410       208.2      11.7      00:30:24
  7180       8   4,735      37,880       215.9      12.1      00:30:23
  7475       5   4,735      23,675       225.2      12.6      00:30:07
  7819       5   4,735      23,675       235.9      13.2      00:29:39
  8116       4   4,735      18,940       245.7      13.7      00:29:20
  8377       4   4,735      18,940       254.1      14.2      00:29:12
  8636       7   4,735      33,145       262.5      14.7      00:29:05
  8866       9   4,735      42,615       269.9      15.1      00:29:06
  9115       7   4,735      33,145       278.0      15.6      00:29:00
  9307       7   4,735      33,145       284.2      15.9      00:29:08
  9510       7   4,735      33,145       290.8      16.3      00:29:13
  9708       7   4,735      33,145       297.5      16.6      00:29:16
  9922       9   4,735      42,615       304.2      17.0      00:29:18
 10141      10   4,735      47,350       310.4      17.4      00:29:23
 10382       6   4,735      28,410       317.6      17.8      00:29:22
 10589      10   4,735      47,350       323.9      18.1      00:29:25
 10848       5   4,735      23,675       331.8      18.6      00:29:18
 11110      10   4,735      47,350       339.8      19.0      00:29:09
 11291       6   4,735      28,410       345.3      19.3      00:29:17
 11465       6   4,735      28,410       350.9      19.6      00:29:24
 11706       7   4,735      33,145       358.2      20.0      00:29:19
 11945       5   4,735      23,675       365.6      20.5      00:29:13
 12168       9   4,735      42,615       372.8      20.9      00:29:09
 12415       5   4,735      23,675       380.2      21.3      00:29:02
 12724       5   4,735      23,675       389.7      21.8      00:28:44
 13053      10   4,735      47,350       399.7      22.4      00:28:24
 13338       7   4,735      33,145       408.5      22.9      00:28:11
 13583      10   4,735      47,350       416.7      23.3      00:28:01
 13762      10   4,735      47,350       422.2      23.6      00:28:05
 13927       8   4,735      37,880       427.3      23.9      00:28:10
 14149       5   4,735      23,675       434.2      24.3      00:28:06
 14373       6   4,735      28,410       441.5      24.7      00:27:60
 14590       7   4,735      33,145       448.3      25.1      00:27:56
 14862      10   4,735      47,350       456.8      25.6      00:27:44
 15190      10   4,735      47,350       467.6      26.2      00:27:20
 15516       3   4,735      14,205       477.7      26.7      00:27:01
 15834       9   4,735      42,615       487.8      27.3      00:26:41
 16182      10   4,735      47,350       499.4      27.9      00:26:16
 16522       4   4,735      18,940       510.4      28.6      00:25:54
 16802      10   4,735      47,350       519.1      29.1      00:25:42
 17056       3   4,735      14,205       527.2      29.5      00:25:33
 17284       6   4,735      28,410       534.3      29.9      00:25:27
 17500       5   4,735      23,675       541.7      30.3      00:25:20
 17724       2   4,735       9,470       548.8      30.7      00:25:15
 17985      10   4,735      47,350       556.9      31.2      00:25:05
 18313       7   4,735      33,145       567.4      31.8      00:24:46
 18566       8   4,735      37,880       575.1      32.2      00:24:38
 18720      10   4,735      47,350       580.2      32.5      00:24:40
 18922       5   4,735      23,675       586.8      32.8      00:24:36
 19171       7   4,735      33,145       595.0      33.3      00:24:25
 19482       9   4,735      42,615       605.2      33.9      00:24:08
 19837       9   4,735      42,615       616.9      34.5      00:23:45
 20135      10   4,735      47,350       626.9      35.1      00:23:29
 20480       7   4,735      33,145       637.8      35.7      00:23:10
 20720       5   4,735      23,675       645.6      36.1      00:23:02
 20899       5   4,735      23,675       651.5      36.5      00:22:60
 21086      10   4,735      47,350       657.3      36.8      00:22:58
 21290       4   4,735      18,940       662.8      37.1      00:22:57
 21483       6   4,735      28,410       668.9      37.4      00:22:54
 21709       8   4,735      37,880       675.4      37.8      00:22:49
 21934       8   4,735      37,880       682.2      38.2      00:22:43
 22160       5   4,735      23,675       688.7      38.6      00:22:38
 22411       8   4,735      37,880       696.2      39.0      00:22:30
 22669       9   4,735      42,615       704.1      39.4      00:22:21
 23010       8   4,735      37,880       714.0      40.0      00:22:05
 23374       7   4,735      33,145       725.5      40.6      00:21:45
 23723      10   4,735      47,350       735.9      41.2      00:21:28
 24084       4   4,735      18,940       747.1      41.8      00:21:09
 24452      10   4,735      47,350       758.1      42.4      00:20:51
 24787       5   4,735      23,675       768.6      43.0      00:20:35
 25143       7   4,735      33,145       779.9      43.7      00:20:16
 25520       6   4,735      28,410       791.7      44.3      00:19:57
 25776       7   4,735      33,145       799.7      44.8      00:19:48
 26039       4   4,735      18,940       808.0      45.2      00:19:38
 26339       5   4,735      23,675       817.4      45.8      00:19:25
 26671       6   4,735      28,410       827.3      46.3      00:19:11
 26988       8   4,735      37,880       837.4      46.9      00:18:56
 27194       7   4,735      33,145       843.7      47.2      00:18:51
 27405       7   4,735      33,145       850.3      47.6      00:18:46
 27590       6   4,735      28,410       856.1      47.9      00:18:42
 27819       5   4,735      23,675       863.5      48.3      00:18:34
 28086       7   4,735      33,145       872.1      48.8      00:18:24
 28359       6   4,735      28,410       880.8      49.3      00:18:13
 28604       8   4,735      37,880       889.0      49.8      00:18:03
 28803       8   4,735      37,880       895.4      50.1      00:17:57
 28987       7   4,735      33,145       901.4      50.5      00:17:53
 29190      10   4,735      47,350       907.7      50.8      00:17:48
 29388       8   4,735      37,880       914.2      51.2      00:17:42
 29610       7   4,735      33,145       921.0      51.6      00:17:35
 29835       6   4,735      28,410       928.3      52.0      00:17:27
 30043       6   4,735      28,410       934.9      52.3      00:17:21
 30330       6   4,735      28,410       944.1      52.8      00:17:09
 30557       9   4,735      42,615       951.6      53.3      00:17:00
 30886       5   4,735      23,675       962.2      53.9      00:16:45
 31175       5   4,735      23,675       971.4      54.4      00:16:33
 31517      10   4,735      47,350       982.7      55.0      00:16:16
 31854       6   4,735      28,410       993.8      55.6      00:15:60
 32190       9   4,735      42,615     1,005.1      56.3      00:15:43
 32488       9   4,735      42,615     1,015.1      56.8      00:15:30
 32689       9   4,735      42,615     1,021.5      57.2      00:15:24
 32926       6   4,735      28,410     1,029.3      57.6      00:15:14
 33189       7   4,735      33,145     1,037.9      58.1      00:15:04
 33491       9   4,735      42,615     1,047.8      58.6      00:14:51
 33794       9   4,735      42,615     1,057.9      59.2      00:14:37
 34097       4   4,735      18,940     1,068.0      59.8      00:14:23
 34439       7   4,735      33,145     1,079.3      60.4      00:14:07
 34775       7   4,735      33,145     1,090.4      61.0      00:13:52
 35098       9   4,735      42,615     1,101.0      61.6      00:13:38
 35418       5   4,735      23,675     1,111.7      62.2      00:13:23
 35744       9   4,735      42,615     1,122.1      62.8      00:13:09
 36089       7   4,735      33,145     1,133.4      63.4      00:12:54
 36426       5   4,735      23,675     1,144.5      64.1      00:12:39
 36708       3   4,735      14,205     1,153.4      64.6      00:12:28
 36987       6   4,735      28,410     1,162.1      65.0      00:12:18
 37234       7   4,735      33,145     1,169.5      65.5      00:12:10
 37439       4   4,735      18,940     1,175.8      65.8      00:12:04
 37642       9   4,735      42,615     1,182.0      66.2      00:11:58
 37844       4   4,735      18,940     1,188.2      66.5      00:11:52
 38034       8   4,735      37,880     1,194.3      66.8      00:11:46
 38262      10   4,735      47,350     1,201.7      67.3      00:11:38
 38475       6   4,735      28,410     1,208.8      67.7      00:11:30
 38834       9   4,735      42,615     1,220.2      68.3      00:11:15
 39047       8   4,735      37,880     1,227.0      68.7      00:11:07
 39229      10   4,735      47,350     1,232.6      69.0      00:11:02
 39360       6   4,735      28,410     1,236.7      69.2      00:10:60
 39609       7   4,735      33,145     1,244.5      69.7      00:10:51
 39871      10   4,735      47,350     1,252.6      70.1      00:10:41
 40207       8   4,735      37,880     1,263.2      70.7      00:10:27
 40575       4   4,735      18,940     1,275.0      71.4      00:10:11
 40896       8   4,735      37,880     1,285.3      71.9      00:09:58
 41075       6   4,735      28,410     1,291.1      72.3      00:09:52
 41237       9   4,735      42,615     1,296.3      72.6      00:09:48
 41513       9   4,735      42,615     1,305.1      73.1      00:09:37
 41756      10   4,735      47,350     1,313.0      73.5      00:09:28
 41977       5   4,735      23,675     1,320.1      73.9      00:09:20
 42171       9   4,735      42,615     1,325.8      74.2      00:09:14
 42397       6   4,735      28,410     1,332.9      74.6      00:09:06
 42608       8   4,735      37,880     1,339.4      75.0      00:08:59
 42818       8   4,735      37,880     1,346.1      75.3      00:08:51
 43021       6   4,735      28,410     1,352.6      75.7      00:08:44
 43189       4   4,735      18,940     1,358.3      76.0      00:08:38
 43370       5   4,735      23,675     1,364.2      76.4      00:08:32
 43613       5   4,735      23,675     1,371.6      76.8      00:08:23
 43899       5   4,735      23,675     1,380.6      77.3      00:08:12
 44144       8   4,735      37,880     1,388.2      77.7      00:08:03
 44310       6   4,735      28,410     1,393.4      78.0      00:07:58
 44511       8   4,735      37,880     1,399.6      78.3      00:07:51
 44745       9   4,735      42,615     1,407.0      78.8      00:07:42
 44972      10   4,735      47,350     1,414.3      79.2      00:07:34
 45240       5   4,735      23,675     1,422.3      79.6      00:07:24
 45416       8   4,735      37,880     1,427.5      79.9      00:07:19
 45626       9   4,735      42,615     1,433.7      80.2      00:07:12
 45869       6   4,735      28,410     1,441.0      80.7      00:07:03
 46085       8   4,735      37,880     1,448.0      81.0      00:06:55
 46313       7   4,735      33,145     1,455.5      81.5      00:06:46
 46552       9   4,735      42,615     1,463.1      81.9      00:06:37
 46848       6   4,735      28,410     1,472.5      82.4      00:06:25
 47031       7   4,735      33,145     1,477.8      82.7      00:06:19
 47223       9   4,735      42,615     1,483.5      83.0      00:06:13
 47424       2   4,735       9,470     1,489.5      83.4      00:06:06
 47608       7   4,735      33,145     1,495.1      83.7      00:05:60
 47815       8   4,735      37,880     1,501.6      84.0      00:05:52
 48003       3   4,735      14,205     1,507.6      84.4      00:05:45
 48215       5   4,735      23,675     1,514.2      84.8      00:05:37
 48413       4   4,735      18,940     1,520.6      85.1      00:05:30
 48627       5   4,735      23,675     1,527.3      85.5      00:05:22
 48829       5   4,735      23,675     1,533.6      85.8      00:05:14
 48981      10   4,735      47,350     1,538.3      86.1      00:05:09
 49156       9   4,735      42,615     1,544.2      86.4      00:05:02
 49363       9   4,735      42,615     1,550.4      86.8      00:04:55
 49554       6   4,735      28,410     1,556.0      87.1      00:04:48
 49752       8   4,735      37,880     1,561.8      87.4      00:04:41
 49955      10   4,735      47,350     1,568.1      87.8      00:04:34
 50183       3   4,735      14,205     1,575.1      88.2      00:04:25
 50387       7   4,735      33,145     1,581.1      88.5      00:04:18
 50608       8   4,735      37,880     1,588.1      88.9      00:04:09
 50802       5   4,735      23,675     1,594.3      89.2      00:04:02
 50985       7   4,735      33,145     1,600.5      89.6      00:03:54
 51191       8   4,735      37,880     1,606.9      89.9      00:03:46
 51415       4   4,735      18,940     1,614.1      90.3      00:03:38
 51635       9   4,735      42,615     1,621.4      90.8      00:03:28
 51861       7   4,735      33,145     1,628.8      91.2      00:03:19
 52110       5   4,735      23,675     1,637.1      91.6      00:03:09
 52365       9   4,735      42,615     1,645.7      92.1      00:02:58
 52644       9   4,735      42,615     1,655.5      92.7      00:02:45
 52916       5   4,735      23,675     1,664.6      93.2      00:02:34
 53203       6   4,735      28,410     1,674.1      93.7      00:02:21
 53478       8   4,735      37,880     1,683.1      94.2      00:02:10
 53716       4   4,735      18,940     1,690.9      94.6      00:02:00
 53928       9   4,735      42,615     1,697.5      95.0      00:01:52
 54121       8   4,735      37,880     1,703.7      95.4      00:01:44
 54297       5   4,735      23,675     1,709.3      95.7      00:01:38
 54552       6   4,735      28,410     1,716.6      96.1      00:01:28
 54803       8   4,735      37,880     1,724.4      96.5      00:01:18
 55043       9   4,735      42,615     1,731.9      96.9      00:01:09
 55273       3   4,735      14,205     1,738.9      97.3      00:01:00
 55479       5   4,735      23,675     1,745.1      97.7      00:00:52
 55674       8   4,735      37,880     1,751.1      98.0      00:00:45
 55863       6   4,735      28,410     1,757.2      98.4      00:00:37
 56083       9   4,735      42,615     1,764.2      98.7      00:00:28
 56323       8   4,735      37,880     1,772.1      99.2      00:00:18
 56594       8   4,735      37,880     1,781.0      99.7      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 2268.303
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700.csv saved

. 
. cap log close

. 
end of do-file
