
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A400.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   332       8   4,435      35,480         8.6       0.5      00:32:24
   709       3   4,435      13,305        18.4       1.1      00:29:57
  1080       9   4,435      39,915        28.9       1.7      00:28:32
  1456       9   4,435      39,915        39.8       2.4      00:27:25
  1836       9   4,435      39,915        50.6       3.0      00:26:45
  2217       9   4,435      39,915        61.5       3.7      00:26:16
  2610       6   4,435      26,610        72.5       4.3      00:25:50
  3007      10   4,435      44,350        83.8       5.0      00:25:21
  3366       4   4,435      17,740        94.7       5.7      00:25:03
  3756      10   4,435      44,350       106.1       6.3      00:24:39
  4096       6   4,435      26,610       115.4       6.9      00:24:47
  4401       8   4,435      35,480       123.7       7.4      00:25:06
  4669       8   4,435      35,480       131.7       7.9      00:25:25
  4950       6   4,435      26,610       139.8       8.4      00:25:39
  5211       4   4,435      17,740       147.3       8.8      00:25:57
  5520       8   4,435      35,480       155.8       9.3      00:26:01
  5809       5   4,435      22,175       163.7       9.8      00:26:10
  6115       9   4,435      39,915       172.6      10.3      00:26:08
  6414       5   4,435      22,175       180.9      10.8      00:26:10
  6714       5   4,435      22,175       189.2      11.3      00:26:11
  7017       7   4,435      31,045       197.8      11.8      00:26:09
  7375      10   4,435      44,350       208.1      12.4      00:25:52
  7711       5   4,435      22,175       217.7      13.0      00:25:41
  8046      10   4,435      44,350       228.0      13.6      00:25:24
  8374       6   4,435      26,610       238.0      14.2      00:25:10
  8705       2   4,435       8,870       247.9      14.8      00:24:58
  9023       5   4,435      22,175       257.5      15.4      00:24:47
  9228      10   4,435      44,350       263.8      15.8      00:24:59
  9357       9   4,435      39,915       267.7      16.0      00:25:26
  9460      10   4,435      44,350       270.8      16.2      00:25:58
  9575       9   4,435      39,915       274.4      16.4      00:26:25
  9706       8   4,435      35,480       278.5      16.6      00:26:47
  9844       8   4,435      35,480       282.7      16.9      00:27:08
  9963       2   4,435       8,870       286.0      17.1      00:27:34
 10101       8   4,435      35,480       289.7      17.3      00:27:56
 10201      10   4,435      44,350       292.4      17.5      00:28:25
 10356       8   4,435      35,480       296.7      17.7      00:28:41
 10562       9   4,435      39,915       302.6      18.1      00:28:46
 10720       9   4,435      39,915       307.2      18.4      00:28:60
 10925       7   4,435      31,045       313.0      18.7      00:29:03
 11083       7   4,435      31,045       317.5      19.0      00:29:16
 11215      10   4,435      44,350       321.4      19.2      00:29:32
 11338       8   4,435      35,480       324.9      19.4      00:29:50
 11467       6   4,435      26,610       328.7      19.6      00:30:06
 11591       6   4,435      26,610       332.1      19.8      00:30:23
 11745       7   4,435      31,045       336.5      20.1      00:30:33
 11873      10   4,435      44,350       340.4      20.3      00:30:47
 12004      10   4,435      44,350       344.2      20.6      00:30:60
 12115       5   4,435      22,175       347.5      20.8      00:31:15
 12249       4   4,435      17,740       351.4      21.0      00:31:27
 12455       6   4,435      26,610       357.2      21.3      00:31:25
 12693       6   4,435      26,610       364.1      21.8      00:31:16
 12919       9   4,435      39,915       370.3      22.1      00:31:11
 13125       7   4,435      31,045       376.4      22.5      00:31:06
 13342       6   4,435      26,610       382.7      22.9      00:31:01
 13535       7   4,435      31,045       388.8      23.2      00:30:56
 13650       8   4,435      35,480       392.3      23.4      00:31:07
 13769       8   4,435      35,480       395.6      23.6      00:31:19
 13854       9   4,435      39,915       398.2      23.8      00:31:35
 14015       9   4,435      39,915       402.6      24.1      00:31:39
 14187       9   4,435      39,915       407.8      24.4      00:31:39
 14369       9   4,435      39,915       413.4      24.7      00:31:36
 14517      10   4,435      44,350       417.8      25.0      00:31:39
 14680       5   4,435      22,175       422.5      25.2      00:31:41
 14827       8   4,435      35,480       426.8      25.5      00:31:44
 15033       6   4,435      26,610       433.0      25.9      00:31:36
 15227       7   4,435      31,045       439.0      26.2      00:31:30
 15447       5   4,435      22,175       445.4      26.6      00:31:21
 15641       5   4,435      22,175       451.1      27.0      00:31:16
 15872       7   4,435      31,045       458.0      27.4      00:31:03
 16087       7   4,435      31,045       464.8      27.8      00:30:52
 16298       9   4,435      39,915       471.2      28.2      00:30:42
 16505       9   4,435      39,915       477.6      28.5      00:30:33
 16630       5   4,435      22,175       481.0      28.7      00:30:40
 16736       7   4,435      31,045       484.3      28.9      00:30:47
 16869       7   4,435      31,045       488.1      29.2      00:30:51
 16978       5   4,435      22,175       491.5      29.4      00:30:58
 17080       6   4,435      26,610       494.5      29.5      00:31:06
 17191       5   4,435      22,175       497.7      29.7      00:31:13
 17327       6   4,435      26,610       501.9      30.0      00:31:13
 17456       9   4,435      39,915       505.9      30.2      00:31:16
 17582       8   4,435      35,480       509.9      30.5      00:31:17
 17731       4   4,435      17,740       514.1      30.7      00:31:18
 17885       9   4,435      39,915       518.6      31.0      00:31:16
 18032       9   4,435      39,915       523.0      31.3      00:31:16
 18241       5   4,435      22,175       529.3      31.6      00:31:05
 18472      10   4,435      44,350       535.8      32.0      00:30:53
 18584       7   4,435      31,045       539.2      32.2      00:30:57
 18710       7   4,435      31,045       543.2      32.5      00:30:58
 18823      10   4,435      44,350       546.5      32.7      00:31:02
 18960       8   4,435      35,480       550.8      32.9      00:31:01
 19085      10   4,435      44,350       554.6      33.1      00:31:02
 19216      10   4,435      44,350       558.7      33.4      00:31:02
 19331       6   4,435      26,610       562.1      33.6      00:31:05
 19546       4   4,435      17,740       568.8      34.0      00:30:51
 19752       6   4,435      26,610       575.3      34.4      00:30:39
 19966       3   4,435      13,305       581.9      34.8      00:30:26
 20181       6   4,435      26,610       588.6      35.2      00:30:12
 20402       5   4,435      22,175       595.1      35.6      00:30:00
 20537       8   4,435      35,480       599.2      35.8      00:29:59
 20649       6   4,435      26,610       602.6      36.0      00:30:01
 20742      10   4,435      44,350       605.4      36.2      00:30:06
 20860       8   4,435      35,480       609.0      36.4      00:30:07
 20982       9   4,435      39,915       612.6      36.6      00:30:07
 21138       8   4,435      35,480       617.0      36.9      00:30:04
 21282       1   4,435       4,435       620.7      37.1      00:30:04
 21419       5   4,435      22,175       624.5      37.3      00:30:03
 21576      10   4,435      44,350       629.1      37.6      00:29:59
 21739       8   4,435      35,480       633.4      37.9      00:29:56
 21858       9   4,435      39,915       636.9      38.1      00:29:56
 21993       6   4,435      26,610       640.7      38.3      00:29:55
 22137       7   4,435      31,045       644.5      38.5      00:29:54
 22305      10   4,435      44,350       649.2      38.8      00:29:49
 22450       9   4,435      39,915       653.2      39.0      00:29:47
 22621       7   4,435      31,045       658.1      39.3      00:29:40
 22809       5   4,435      22,175       663.0      39.6      00:29:34
 22957       4   4,435      17,740       667.2      39.9      00:29:30
 23121      10   4,435      44,350       672.1      40.2      00:29:24
 23317       6   4,435      26,610       677.9      40.5      00:29:13
 23531       9   4,435      39,915       683.7      40.9      00:29:03
 23721       4   4,435      17,740       689.2      41.2      00:28:54
 23944       8   4,435      35,480       695.7      41.6      00:28:40
 24159       4   4,435      17,740       701.7      41.9      00:28:29
 24324       3   4,435      13,305       706.2      42.2      00:28:24
 24523       7   4,435      31,045       712.1      42.6      00:28:13
 24718       2   4,435       8,870       718.0      42.9      00:28:02
 24924      10   4,435      44,350       723.7      43.2      00:27:52
 25115       7   4,435      31,045       729.6      43.6      00:27:42
 25305       7   4,435      31,045       735.1      43.9      00:27:32
 25496       9   4,435      39,915       740.9      44.3      00:27:22
 25642       9   4,435      39,915       744.8      44.5      00:27:19
 25776       7   4,435      31,045       749.0      44.8      00:27:14
 25907       4   4,435      17,740       752.9      45.0      00:27:12
 26024       9   4,435      39,915       756.3      45.2      00:27:10
 26168       6   4,435      26,610       760.6      45.4      00:27:06
 26321       9   4,435      39,915       765.1      45.7      00:26:60
 26498       9   4,435      39,915       770.0      46.0      00:26:53
 26673       5   4,435      22,175       775.0      46.3      00:26:45
 26863       7   4,435      31,045       780.6      46.6      00:26:35
 27014       8   4,435      35,480       785.1      46.9      00:26:29
 27117      10   4,435      44,350       788.1      47.1      00:26:29
 27242       9   4,435      39,915       791.6      47.3      00:26:27
 27361       6   4,435      26,610       795.1      47.5      00:26:25
 27493       4   4,435      17,740       799.1      47.7      00:26:21
 27651       6   4,435      26,610       803.7      48.0      00:26:14
 27784      10   4,435      44,350       807.7      48.3      00:26:10
 27936       5   4,435      22,175       812.3      48.5      00:26:04
 28138       7   4,435      31,045       818.4      48.9      00:25:52
 28337       8   4,435      35,480       824.4      49.3      00:25:40
 28524      10   4,435      44,350       830.3      49.6      00:25:28
 28684      10   4,435      44,350       835.1      49.9      00:25:21
 28825       6   4,435      26,610       839.4      50.2      00:25:15
 28956       8   4,435      35,480       843.4      50.4      00:25:11
 29083       5   4,435      22,175       847.2      50.6      00:25:07
 29229      10   4,435      44,350       851.3      50.9      00:25:02
 29395       7   4,435      31,045       856.5      51.2      00:24:53
 29525       7   4,435      31,045       860.2      51.4      00:24:49
 29680       5   4,435      22,175       864.7      51.7      00:24:43
 29791       9   4,435      39,915       868.1      51.9      00:24:40
 29909       7   4,435      31,045       871.6      52.1      00:24:37
 30022       7   4,435      31,045       875.1      52.3      00:24:34
 30155      10   4,435      44,350       879.1      52.5      00:24:29
 30300       5   4,435      22,175       883.4      52.8      00:24:23
 30431       9   4,435      39,915       887.5      53.0      00:24:17
 30575       9   4,435      39,915       891.9      53.3      00:24:11
 30792       8   4,435      35,480       898.4      53.7      00:23:57
 31003       9   4,435      39,915       904.7      54.1      00:23:44
 31208       9   4,435      39,915       910.9      54.4      00:23:31
 31419       6   4,435      26,610       917.4      54.8      00:23:18
 31598      10   4,435      44,350       922.8      55.1      00:23:08
 31803       6   4,435      26,610       929.2      55.5      00:22:54
 31991       5   4,435      22,175       935.2      55.9      00:22:43
 32226      10   4,435      44,350       942.5      56.3      00:22:26
 32423       9   4,435      39,915       948.8      56.7      00:22:14
 32557       6   4,435      26,610       952.8      56.9      00:22:08
 32678       6   4,435      26,610       956.4      57.2      00:22:04
 32808       6   4,435      26,610       960.4      57.4      00:21:59
 32913      10   4,435      44,350       963.7      57.6      00:21:56
 33027      10   4,435      44,350       967.3      57.8      00:21:51
 33133      10   4,435      44,350       970.6      58.0      00:21:48
 33260       6   4,435      26,610       974.4      58.2      00:21:43
 33402       4   4,435      17,740       978.7      58.5      00:21:36
 33551       6   4,435      26,610       983.3      58.8      00:21:29
 33698       7   4,435      31,045       987.9      59.0      00:21:21
 33846      10   4,435      44,350       992.5      59.3      00:21:14
 33985       8   4,435      35,480       996.7      59.6      00:21:07
 34153       9   4,435      39,915     1,002.2      59.9      00:20:57
 34330       9   4,435      39,915     1,007.7      60.2      00:20:46
 34566       5   4,435      22,175     1,014.8      60.6      00:20:31
 34810      10   4,435      44,350     1,022.5      61.1      00:20:14
 35037       6   4,435      26,610     1,029.4      61.5      00:19:59
 35240      10   4,435      44,350     1,035.7      61.9      00:19:46
 35470       7   4,435      31,045     1,042.8      62.3      00:19:31
 35684       6   4,435      26,610     1,049.3      62.7      00:19:18
 35884       6   4,435      26,610     1,055.3      63.1      00:19:06
 36082       8   4,435      35,480     1,061.4      63.4      00:18:54
 36310       9   4,435      39,915     1,068.5      63.9      00:18:39
 36545      10   4,435      44,350     1,075.5      64.3      00:18:25
 36688       4   4,435      17,740     1,079.7      64.5      00:18:18
 36812       6   4,435      26,610     1,083.3      64.7      00:18:13
 36967      10   4,435      44,350     1,088.0      65.0      00:18:05
 37056       3   4,435      13,305     1,090.6      65.2      00:18:03
 37214       3   4,435      13,305     1,094.9      65.4      00:17:56
 37357       6   4,435      26,610     1,098.9      65.7      00:17:50
 37484       6   4,435      26,610     1,102.5      65.9      00:17:45
 37607       5   4,435      22,175     1,106.2      66.1      00:17:40
 37761       9   4,435      39,915     1,110.5      66.4      00:17:33
 37909       7   4,435      31,045     1,114.9      66.6      00:17:26
 38061       6   4,435      26,610     1,119.5      66.9      00:17:18
 38218       7   4,435      31,045     1,124.2      67.2      00:17:09
 38374       9   4,435      39,915     1,129.0      67.5      00:17:01
 38532      10   4,435      44,350     1,133.9      67.8      00:16:52
 38717       6   4,435      26,610     1,139.5      68.1      00:16:42
 38947       8   4,435      35,480     1,146.3      68.5      00:16:27
 39109       7   4,435      31,045     1,151.1      68.8      00:16:19
 39249       9   4,435      39,915     1,155.0      69.0      00:16:13
 39428       8   4,435      35,480     1,160.2      69.3      00:16:03
 39628       4   4,435      17,740     1,166.2      69.7      00:15:52
 39789       9   4,435      39,915     1,170.8      70.0      00:15:43
 39995       4   4,435      17,740     1,176.9      70.3      00:15:31
 40182       8   4,435      35,480     1,182.4      70.7      00:15:21
 40416       5   4,435      22,175     1,189.4      71.1      00:15:07
 40651      10   4,435      44,350     1,196.5      71.5      00:14:52
 40901       9   4,435      39,915     1,204.0      72.0      00:14:36
 41047       4   4,435      17,740     1,208.5      72.2      00:14:28
 41196       7   4,435      31,045     1,213.0      72.5      00:14:21
 41368       5   4,435      22,175     1,218.0      72.8      00:14:12
 41531       7   4,435      31,045     1,223.0      73.1      00:14:03
 41661       5   4,435      22,175     1,226.9      73.3      00:13:56
 41798       9   4,435      39,915     1,231.0      73.6      00:13:49
 41919       6   4,435      26,610     1,234.8      73.8      00:13:43
 42068       6   4,435      26,610     1,238.9      74.0      00:13:36
 42266       6   4,435      26,610     1,244.4      74.4      00:13:26
 42433       7   4,435      31,045     1,249.5      74.7      00:13:17
 42594       1   4,435       4,435     1,254.1      74.9      00:13:09
 42748       8   4,435      35,480     1,258.6      75.2      00:13:00
 42946       6   4,435      26,610     1,264.5      75.6      00:12:49
 43091       5   4,435      22,175     1,269.1      75.8      00:12:41
 43284       4   4,435      17,740     1,275.1      76.2      00:12:29
 43418       6   4,435      26,610     1,279.2      76.4      00:12:22
 43628       6   4,435      26,610     1,285.2      76.8      00:12:11
 43929       6   4,435      26,610     1,294.1      77.3      00:11:52
 44141      10   4,435      44,350     1,300.2      77.7      00:11:40
 44304       3   4,435      13,305     1,305.0      78.0      00:11:31
 44498      10   4,435      44,350     1,310.6      78.3      00:11:21
 44677       7   4,435      31,045     1,315.9      78.6      00:11:10
 44891       8   4,435      35,480     1,322.3      79.0      00:10:58
 45061       4   4,435      17,740     1,327.2      79.3      00:10:49
 45256       4   4,435      17,740     1,332.6      79.6      00:10:39
 45419       7   4,435      31,045     1,337.1      79.9      00:10:31
 45555       5   4,435      22,175     1,340.9      80.1      00:10:24
 45719      10   4,435      44,350     1,345.5      80.4      00:10:16
 45856       6   4,435      26,610     1,349.4      80.6      00:10:10
 45976       7   4,435      31,045     1,353.0      80.9      00:10:03
 46084       9   4,435      39,915     1,356.2      81.0      00:09:58
 46177       6   4,435      26,610     1,359.1      81.2      00:09:54
 46294       9   4,435      39,915     1,362.8      81.4      00:09:48
 46456       6   4,435      26,610     1,367.4      81.7      00:09:39
 46629       8   4,435      35,480     1,372.6      82.0      00:09:29
 46816       7   4,435      31,045     1,378.3      82.4      00:09:19
 46969       8   4,435      35,480     1,382.5      82.6      00:09:11
 47082       7   4,435      31,045     1,385.7      82.8      00:09:06
 47199       9   4,435      39,915     1,388.8      83.0      00:09:01
 47343       7   4,435      31,045     1,392.9      83.2      00:08:53
 47481       8   4,435      35,480     1,396.7      83.5      00:08:47
 47638       8   4,435      35,480     1,401.4      83.7      00:08:38
 47813      10   4,435      44,350     1,406.4      84.0      00:08:29
 47947      10   4,435      44,350     1,410.5      84.3      00:08:21
 48068       8   4,435      35,480     1,414.0      84.5      00:08:15
 48191       8   4,435      35,480     1,417.5      84.7      00:08:09
 48332       6   4,435      26,610     1,421.9      85.0      00:08:01
 48531       8   4,435      35,480     1,427.8      85.3      00:07:50
 48731       4   4,435      17,740     1,433.6      85.7      00:07:38
 48898       7   4,435      31,045     1,438.5      86.0      00:07:29
 49066       5   4,435      22,175     1,443.4      86.3      00:07:20
 49239      10   4,435      44,350     1,448.7      86.6      00:07:10
 49417      10   4,435      44,350     1,453.7      86.9      00:07:00
 49557       7   4,435      31,045     1,457.5      87.1      00:06:53
 49701       6   4,435      26,610     1,461.4      87.3      00:06:46
 49845       3   4,435      13,305     1,465.4      87.6      00:06:39
 50016       7   4,435      31,045     1,470.5      87.9      00:06:29
 50192       6   4,435      26,610     1,475.6      88.2      00:06:19
 50356       9   4,435      39,915     1,479.9      88.4      00:06:11
 50517       9   4,435      39,915     1,484.8      88.7      00:06:02
 50661       6   4,435      26,610     1,489.0      89.0      00:05:54
 50809       6   4,435      26,610     1,493.5      89.2      00:05:46
 50946       7   4,435      31,045     1,497.9      89.5      00:05:38
 51080       4   4,435      17,740     1,501.9      89.8      00:05:30
 51214       3   4,435      13,305     1,505.7      90.0      00:05:23
 51361       8   4,435      35,480     1,510.2      90.2      00:05:15
 51627       9   4,435      39,915     1,518.4      90.7      00:04:58
 51855       7   4,435      31,045     1,525.4      91.2      00:04:44
 52080       8   4,435      35,480     1,532.4      91.6      00:04:31
 52353       8   4,435      35,480     1,541.1      92.1      00:04:13
 52700       5   4,435      22,175     1,552.4      92.8      00:03:51
 53084      10   4,435      44,350     1,564.4      93.5      00:03:27
 53470       4   4,435      17,740     1,576.2      94.2      00:03:04
 53780       6   4,435      26,610     1,585.7      94.8      00:02:45
 53999       2   4,435       8,870     1,592.1      95.1      00:02:33
 54253       7   4,435      31,045     1,599.6      95.6      00:02:19
 54490       8   4,435      35,480     1,606.1      96.0      00:02:07
 54700       5   4,435      22,175     1,612.2      96.3      00:01:55
 54983       8   4,435      35,480     1,620.4      96.8      00:01:39
 55207       3   4,435      13,305     1,627.0      97.2      00:01:27
 55464       7   4,435      31,045     1,634.1      97.7      00:01:14
 55696       8   4,435      35,480     1,640.8      98.1      00:01:01
 55902       4   4,435      17,740     1,647.1      98.4      00:00:49
 56217       6   4,435      26,610     1,656.6      99.0      00:00:31
 56563       8   4,435      35,480     1,667.3      99.6      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 3112.138
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A400.csv saved

. 
. cap log close

. 
end of do-file
