
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed457.dta /export/storage_covidva
> ccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_d
> ist_total_10000_5_4q_mnl_A1000_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed457.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed457.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   205       9   5,035      45,315         5.9       0.3      00:54:02
   411       2   5,035      10,070        12.0       0.6      00:52:48
   614       9   5,035      45,315        18.0       0.9      00:52:17
   809       8   5,035      40,280        24.3       1.3      00:51:30
  1011       9   5,035      45,315        30.4       1.6      00:51:23
  1198       7   5,035      35,245        36.5       1.9      00:51:09
  1366       6   5,035      30,210        42.1       2.2      00:51:35
  1559       4   5,035      20,140        48.5       2.6      00:50:59
  1741      10   5,035      50,350        54.5       2.9      00:50:54
  1941       4   5,035      20,140        60.7       3.2      00:50:38
  2121       4   5,035      20,140        66.6       3.5      00:50:38
  2317      10   5,035      50,350        72.9       3.8      00:50:15
  2512       7   5,035      35,245        79.0       4.2      00:50:05
  2728       9   5,035      45,315        86.2       4.5      00:49:15
  2910       6   5,035      30,210        92.2       4.9      00:49:11
  3082       6   5,035      30,210        97.5       5.1      00:49:26
  3260       8   5,035      40,280       103.9       5.5      00:49:08
  3446       8   5,035      40,280       110.2       5.8      00:48:52
  3640       8   5,035      40,280       116.5       6.1      00:48:38
  3818       5   5,035      25,175       122.5       6.4      00:48:32
  3953       5   5,035      25,175       126.5       6.7      00:49:13
  4050       8   5,035      40,280       129.6       6.8      00:50:15
  4168       4   5,035      20,140       133.4       7.0      00:50:57
  4307       9   5,035      45,315       137.5       7.2      00:51:26
  4421       7   5,035      35,245       141.1       7.4      00:52:06
  4541       6   5,035      30,210       145.1       7.6      00:52:35
  4648       4   5,035      20,140       148.8       7.8      00:53:08
  4753       8   5,035      40,280       152.3       8.0      00:53:44
  4872       4   5,035      20,140       156.1       8.2      00:54:10
  5017      10   5,035      50,350       160.9       8.5      00:54:15
  5095       8   5,035      40,280       163.3       8.6      00:55:09
  5209       7   5,035      35,245       167.1       8.8      00:55:29
  5343       9   5,035      45,315       171.5       9.0      00:55:38
  5439       5   5,035      25,175       174.7       9.2      00:56:10
  5549       6   5,035      30,210       177.8       9.4      00:56:43
  5674       8   5,035      40,280       181.6       9.6      00:56:58
  5783       5   5,035      25,175       185.1       9.7      00:57:21
  5898      10   5,035      50,350       188.8       9.9      00:57:38
  6015       8   5,035      40,280       192.8      10.1      00:57:47
  6135       7   5,035      35,245       196.6      10.3      00:57:58
  6225       3   5,035      15,105       199.5      10.5      00:58:28
  6347       7   5,035      35,245       203.2      10.7      00:58:41
  6452       4   5,035      20,140       206.6      10.9      00:58:58
  6580       6   5,035      30,210       210.7      11.1      00:59:01
  6692       7   5,035      35,245       214.1      11.3      00:59:16
  6792       9   5,035      45,315       217.4      11.4      00:59:34
  6894       4   5,035      20,140       220.7      11.6      00:59:49
  6978       8   5,035      40,280       223.3      11.8      01:00:18
  7120       5   5,035      25,175       227.9      12.0      01:00:09
  7276       7   5,035      35,245       232.7      12.3      00:59:55
  7426       9   5,035      45,315       237.8      12.5      00:59:38
  7599       4   5,035      20,140       243.6      12.8      00:59:10
  7776       5   5,035      25,175       249.4      13.1      00:58:42
  7945       8   5,035      40,280       255.3      13.4      00:58:12
  8095       6   5,035      30,210       260.5      13.7      00:57:55
  8240      10   5,035      50,350       265.5      14.0      00:57:42
  8383      10   5,035      50,350       270.5      14.2      00:57:28
  8508       5   5,035      25,175       274.8      14.5      00:57:23
  8673       6   5,035      30,210       280.3      14.8      00:57:02
  8838      10   5,035      50,350       286.0      15.1      00:56:39
  8982       5   5,035      25,175       291.0      15.3      00:56:26
  9140       7   5,035      35,245       296.5      15.6      00:56:06
  9260      10   5,035      50,350       300.6      15.8      00:56:05
  9381       5   5,035      25,175       304.7      16.0      00:56:04
  9502       5   5,035      25,175       309.0      16.3      00:55:60
  9619      10   5,035      50,350       313.2      16.5      00:55:57
  9741       8   5,035      40,280       317.4      16.7      00:55:54
  9856       8   5,035      40,280       321.2      16.9      00:55:56
  9962       7   5,035      35,245       324.7      17.1      00:56:01
 10063       9   5,035      45,315       328.0      17.3      00:56:09
 10159       7   5,035      35,245       330.6      17.4      00:56:24
 10267       5   5,035      25,175       334.0      17.6      00:56:30
 10371       4   5,035      20,140       337.4      17.8      00:56:35
 10475      10   5,035      50,350       340.9      17.9      00:56:39
 10606      10   5,035      50,350       344.9      18.2      00:56:37
 10742       8   5,035      40,280       349.3      18.4      00:56:28
 10875       9   5,035      45,315       353.7      18.6      00:56:21
 10988      10   5,035      50,350       357.5      18.8      00:56:20
 11122       7   5,035      35,245       361.7      19.0      00:56:14
 11213       6   5,035      30,210       364.8      19.2      00:56:22
 11328       5   5,035      25,175       368.5      19.4      00:56:21
 11429       6   5,035      30,210       371.9      19.6      00:56:23
 11556       9   5,035      45,315       375.9      19.8      00:56:20
 11683       2   5,035      10,070       380.2      20.0      00:56:13
 11813       6   5,035      30,210       384.5      20.2      00:56:05
 11939      10   5,035      50,350       388.5      20.5      00:55:60
 12054       9   5,035      45,315       392.5      20.7      00:55:56
 12177       6   5,035      30,210       396.6      20.9      00:55:50
 12276       5   5,035      25,175       399.8      21.0      00:55:54
 12468       9   5,035      45,315       406.0      21.4      00:55:26
 12647       7   5,035      35,245       412.0      21.7      00:55:00
 12820       6   5,035      30,210       417.3      22.0      00:54:43
 12990       4   5,035      20,140       422.8      22.3      00:54:23
 13177       9   5,035      45,315       429.0      22.6      00:53:57
 13343       8   5,035      40,280       434.5      22.9      00:53:38
 13512       7   5,035      35,245       440.6      23.2      00:53:13
 13605       3   5,035      15,105       443.9      23.4      00:53:15
 13706       7   5,035      35,245       447.3      23.5      00:53:16
 13820      10   5,035      50,350       450.9      23.7      00:53:15
 13930       8   5,035      40,280       454.4      23.9      00:53:15
 14065       9   5,035      45,315       458.9      24.2      00:53:05
 14219       6   5,035      30,210       464.1      24.4      00:52:49
 14363       8   5,035      40,280       469.1      24.7      00:52:35
 14492       9   5,035      45,315       473.5      24.9      00:52:26
 14634       7   5,035      35,245       478.2      25.2      00:52:15
 14777       8   5,035      40,280       483.0      25.4      00:52:03
 14947       8   5,035      40,280       488.7      25.7      00:51:43
 15139       8   5,035      40,280       495.3      26.1      00:51:15
 15344       7   5,035      35,245       502.3      26.4      00:50:45
 15565       9   5,035      45,315       509.5      26.8      00:50:14
 15752       9   5,035      45,315       515.9      27.2      00:49:50
 15927       6   5,035      30,210       522.0      27.5      00:49:29
 16075       6   5,035      30,210       527.3      27.8      00:49:14
 16233       9   5,035      45,315       532.7      28.0      00:48:58
 16382       7   5,035      35,245       537.9      28.3      00:48:44
 16501       8   5,035      40,280       542.0      28.5      00:48:38
 16603       8   5,035      40,280       545.2      28.7      00:48:39
 16729      10   5,035      50,350       549.6      28.9      00:48:31
 16853       2   5,035      10,070       553.6      29.1      00:48:25
 16956       7   5,035      35,245       557.3      29.3      00:48:23
 17051       5   5,035      25,175       560.4      29.5      00:48:24
 17149       7   5,035      35,245       563.6      29.7      00:48:25
 17241       9   5,035      45,315       566.7      29.8      00:48:26
 17338       6   5,035      30,210       570.2      30.0      00:48:24
 17423       8   5,035      40,280       573.1      30.2      00:48:26
 17485       5   5,035      25,175       575.5      30.3      00:48:32
 17571      10   5,035      50,350       578.5      30.4      00:48:33
 17657       9   5,035      45,315       581.4      30.6      00:48:35
 17773       9   5,035      45,315       584.9      30.8      00:48:32
 17873       6   5,035      30,210       588.4      31.0      00:48:30
 18011       7   5,035      35,245       593.0      31.2      00:48:19
 18150       6   5,035      30,210       597.9      31.5      00:48:06
 18332       5   5,035      25,175       604.0      31.8      00:47:45
 18489       6   5,035      30,210       608.9      32.0      00:47:33
 18564       5   5,035      25,175       611.4      32.2      00:47:37
 18657       8   5,035      40,280       614.8      32.4      00:47:35
 18758       9   5,035      45,315       618.3      32.5      00:47:31
 18869       8   5,035      40,280       622.1      32.7      00:47:27
 18967       7   5,035      35,245       625.6      32.9      00:47:23
 19066       6   5,035      30,210       629.1      33.1      00:47:20
 19203       8   5,035      40,280       633.8      33.4      00:47:08
 19345       9   5,035      45,315       638.6      33.6      00:46:56
 19520       6   5,035      30,210       644.9      33.9      00:46:35
 19689      10   5,035      50,350       650.9      34.3      00:46:15
 19856       9   5,035      45,315       656.7      34.6      00:45:57
 20016       5   5,035      25,175       662.5      34.9      00:45:38
 20197       5   5,035      25,175       668.7      35.2      00:45:18
 20408       8   5,035      40,280       675.8      35.6      00:44:52
 20537       8   5,035      40,280       680.3      35.8      00:44:43
 20630       7   5,035      35,245       683.5      36.0      00:44:41
 20746       6   5,035      30,210       687.4      36.2      00:44:35
 20847       9   5,035      45,315       690.9      36.4      00:44:31
 20921       6   5,035      30,210       693.5      36.5      00:44:33
 21044      10   5,035      50,350       697.5      36.7      00:44:26
 21172       9   5,035      45,315       701.5      36.9      00:44:19
 21302       6   5,035      30,210       705.2      37.1      00:44:14
 21421       7   5,035      35,245       709.1      37.3      00:44:08
 21527       7   5,035      35,245       712.8      37.5      00:44:02
 21661       8   5,035      40,280       717.0      37.7      00:43:54
 21781       5   5,035      25,175       720.4      37.9      00:43:51
 21889       4   5,035      20,140       724.0      38.1      00:43:46
 21979       8   5,035      40,280       726.9      38.3      00:43:45
 22107       2   5,035      10,070       730.7      38.5      00:43:39
 22245       8   5,035      40,280       735.1      38.7      00:43:29
 22378       7   5,035      35,245       739.2      38.9      00:43:22
 22517       8   5,035      40,280       743.8      39.2      00:43:11
 22635       6   5,035      30,210       747.7      39.4      00:43:04
 22808       9   5,035      45,315       752.6      39.6      00:42:52
 23006       9   5,035      45,315       759.2      40.0      00:42:30
 23198      10   5,035      50,350       765.7      40.3      00:42:09
 23391       7   5,035      35,245       772.1      40.6      00:41:48
 23592       4   5,035      20,140       778.1      41.0      00:41:30
 23790       3   5,035      15,105       784.9      41.3      00:41:08
 23997       8   5,035      40,280       791.6      41.7      00:40:46
 24194       6   5,035      30,210       797.8      42.0      00:40:27
 24386      10   5,035      50,350       803.7      42.3      00:40:10
 24530       8   5,035      40,280       808.7      42.6      00:39:58
 24698       6   5,035      30,210       814.5      42.9      00:39:42
 24871       8   5,035      40,280       820.1      43.2      00:39:26
 25044      10   5,035      50,350       825.8      43.5      00:39:11
 25234       5   5,035      25,175       832.2      43.8      00:38:51
 25428       4   5,035      20,140       838.8      44.1      00:38:32
 25538      10   5,035      50,350       842.4      44.3      00:38:26
 25642       9   5,035      45,315       845.6      44.5      00:38:23
 25731      10   5,035      50,350       848.8      44.7      00:38:20
 25836       9   5,035      45,315       852.4      44.9      00:38:15
 25953      10   5,035      50,350       856.2      45.1      00:38:09
 26075       8   5,035      40,280       860.4      45.3      00:38:01
 26201       4   5,035      20,140       864.6      45.5      00:37:52
 26313       7   5,035      35,245       868.4      45.7      00:37:46
 26426       9   5,035      45,315       871.9      45.9      00:37:41
 26545       8   5,035      40,280       875.8      46.1      00:37:35
 26688       7   5,035      35,245       880.4      46.3      00:37:25
 26847       6   5,035      30,210       885.6      46.6      00:37:11
 26975       8   5,035      40,280       890.1      46.9      00:37:02
 27079       4   5,035      20,140       893.3      47.0      00:36:58
 27195       8   5,035      40,280       897.2      47.2      00:36:51
 27317       6   5,035      30,210       901.2      47.4      00:36:43
 27421       9   5,035      45,315       904.7      47.6      00:36:38
 27544       5   5,035      25,175       908.8      47.8      00:36:30
 27673       6   5,035      30,210       913.2      48.1      00:36:21
 27790      10   5,035      50,350       917.2      48.3      00:36:13
 27923       7   5,035      35,245       921.8      48.5      00:36:03
 28067       7   5,035      35,245       926.7      48.8      00:35:52
 28217       6   5,035      30,210       931.6      49.0      00:35:40
 28386       6   5,035      30,210       937.6      49.4      00:35:23
 28537       4   5,035      20,140       943.0      49.6      00:35:09
 28663       8   5,035      40,280       947.3      49.9      00:35:01
 28748      10   5,035      50,350       950.3      50.0      00:34:57
 28851      10   5,035      50,350       953.8      50.2      00:34:52
 28925       8   5,035      40,280       956.5      50.3      00:34:50
 29008       8   5,035      40,280       959.3      50.5      00:34:48
 29114       9   5,035      45,315       962.9      50.7      00:34:42
 29259       6   5,035      30,210       967.5      50.9      00:34:31
 29383       6   5,035      30,210       971.9      51.2      00:34:21
 29508       6   5,035      30,210       976.1      51.4      00:34:13
 29645       8   5,035      40,280       980.4      51.6      00:34:04
 29749       4   5,035      20,140       984.2      51.8      00:33:57
 29855       5   5,035      25,175       987.8      52.0      00:33:51
 29948       9   5,035      45,315       990.9      52.2      00:33:47
 30022       7   5,035      35,245       993.5      52.3      00:33:45
 30119       8   5,035      40,280       996.7      52.5      00:33:40
 30203       6   5,035      30,210       999.7      52.6      00:33:37
 30292       8   5,035      40,280     1,002.7      52.8      00:33:33
 30389       9   5,035      45,315     1,005.9      52.9      00:33:28
 30473       6   5,035      30,210     1,009.0      53.1      00:33:24
 30550       8   5,035      40,280     1,011.6      53.2      00:33:22
 30692       8   5,035      40,280     1,016.5      53.5      00:33:10
 30875       6   5,035      30,210     1,022.8      53.8      00:32:52
 31050       8   5,035      40,280     1,028.6      54.1      00:32:37
 31247       5   5,035      25,175     1,035.5      54.5      00:32:17
 31450       7   5,035      35,245     1,042.6      54.9      00:31:56
 31633       9   5,035      45,315     1,048.9      55.2      00:31:39
 31809       7   5,035      35,245     1,055.1      55.5      00:31:22
 31983       9   5,035      45,315     1,061.4      55.9      00:31:05
 32161       5   5,035      25,175     1,067.6      56.2      00:30:48
 32340       6   5,035      30,210     1,074.2      56.5      00:30:30
 32484       4   5,035      20,140     1,079.2      56.8      00:30:18
 32560       9   5,035      45,315     1,081.8      56.9      00:30:15
 32640      10   5,035      50,350     1,084.5      57.1      00:30:12
 32730       9   5,035      45,315     1,087.8      57.3      00:30:07
 32834       5   5,035      25,175     1,091.2      57.4      00:30:01
 32921       3   5,035      15,105     1,094.4      57.6      00:29:57
 33004       3   5,035      15,105     1,097.3      57.8      00:29:53
 33101       9   5,035      45,315     1,100.7      57.9      00:29:47
 33219       8   5,035      40,280     1,104.7      58.1      00:29:39
 33361      10   5,035      50,350     1,109.6      58.4      00:29:27
 33491       9   5,035      45,315     1,114.2      58.6      00:29:17
 33639       7   5,035      35,245     1,119.5      58.9      00:29:03
 33757       7   5,035      35,245     1,123.6      59.1      00:28:55
 33897      10   5,035      50,350     1,128.5      59.4      00:28:43
 34050       8   5,035      40,280     1,133.9      59.7      00:28:30
 34206      10   5,035      50,350     1,139.6      60.0      00:28:15
 34414       6   5,035      30,210     1,146.8      60.4      00:27:55
 34603       9   5,035      45,315     1,153.4      60.7      00:27:38
 34786       7   5,035      35,245     1,160.0      61.1      00:27:20
 34968       9   5,035      45,315     1,166.3      61.4      00:27:04
 35126       6   5,035      30,210     1,171.8      61.7      00:26:50
 35311       8   5,035      40,280     1,178.3      62.0      00:26:33
 35519       7   5,035      35,245     1,185.6      62.4      00:26:13
 35707       4   5,035      20,140     1,192.0      62.7      00:25:57
 35891      10   5,035      50,350     1,198.4      63.1      00:25:40
 36085       8   5,035      40,280     1,205.1      63.4      00:25:23
 36262       5   5,035      25,175     1,211.3      63.8      00:25:07
 36451       5   5,035      25,175     1,217.9      64.1      00:24:50
 36589      10   5,035      50,350     1,222.5      64.3      00:24:40
 36691       6   5,035      30,210     1,225.9      64.5      00:24:34
 36793       7   5,035      35,245     1,229.3      64.7      00:24:28
 36910       8   5,035      40,280     1,233.4      64.9      00:24:20
 37015      10   5,035      50,350     1,236.7      65.1      00:24:14
 37134       9   5,035      45,315     1,240.5      65.3      00:24:07
 37248       6   5,035      30,210     1,244.1      65.5      00:23:60
 37338       9   5,035      45,315     1,247.0      65.6      00:23:56
 37452       6   5,035      30,210     1,250.6      65.8      00:23:49
 37574       8   5,035      40,280     1,254.7      66.0      00:23:40
 37725       9   5,035      45,315     1,259.5      66.3      00:23:29
 37889      10   5,035      50,350     1,265.1      66.6      00:23:16
 38034       8   5,035      40,280     1,270.0      66.8      00:23:05
 38206       7   5,035      35,245     1,275.9      67.2      00:22:50
 38348       6   5,035      30,210     1,280.9      67.4      00:22:39
 38480       8   5,035      40,280     1,285.5      67.7      00:22:29
 38658       8   5,035      40,280     1,291.6      68.0      00:22:14
 38819       9   5,035      45,315     1,297.0      68.3      00:22:01
 38955       8   5,035      40,280     1,301.7      68.5      00:21:51
 39058       1   5,035       5,035     1,305.2      68.7      00:21:44
 39153       8   5,035      40,280     1,308.3      68.9      00:21:39
 39262       9   5,035      45,315     1,311.8      69.0      00:21:32
 39387      10   5,035      50,350     1,315.9      69.3      00:21:24
 39536       7   5,035      35,245     1,320.9      69.5      00:21:12
 39646       5   5,035      25,175     1,324.5      69.7      00:21:05
 39774       9   5,035      45,315     1,328.6      69.9      00:20:57
 39974       7   5,035      35,245     1,335.5      70.3      00:20:39
 40187       6   5,035      30,210     1,342.5      70.7      00:20:22
 40362       8   5,035      40,280     1,348.4      71.0      00:20:08
 40527      10   5,035      50,350     1,354.2      71.3      00:19:54
 40687       7   5,035      35,245     1,359.6      71.6      00:19:41
 40868       6   5,035      30,210     1,365.8      71.9      00:19:26
 40963       9   5,035      45,315     1,369.2      72.1      00:19:20
 41083      10   5,035      50,350     1,373.3      72.3      00:19:11
 41157       7   5,035      35,245     1,375.7      72.4      00:19:08
 41283       8   5,035      40,280     1,380.0      72.6      00:18:59
 41424       7   5,035      35,245     1,384.8      72.9      00:18:48
 41539       8   5,035      40,280     1,388.7      73.1      00:18:40
 41646       6   5,035      30,210     1,392.3      73.3      00:18:33
 41789      10   5,035      50,350     1,397.3      73.5      00:18:22
 41883       9   5,035      45,315     1,400.6      73.7      00:18:15
 41993       9   5,035      45,315     1,404.2      73.9      00:18:08
 42109       7   5,035      35,245     1,407.8      74.1      00:18:01
 42216       7   5,035      35,245     1,411.2      74.3      00:17:55
 42316       5   5,035      25,175     1,414.4      74.4      00:17:49
 42425       7   5,035      35,245     1,418.3      74.7      00:17:41
 42556       5   5,035      25,175     1,422.6      74.9      00:17:31
 42663       7   5,035      35,245     1,426.1      75.1      00:17:24
 42813       9   5,035      45,315     1,431.1      75.3      00:17:13
 42936       9   5,035      45,315     1,435.3      75.5      00:17:04
 43070      10   5,035      50,350     1,440.1      75.8      00:16:53
 43204       6   5,035      30,210     1,444.8      76.1      00:16:43
 43326       7   5,035      35,245     1,449.0      76.3      00:16:34
 43432       6   5,035      30,210     1,452.8      76.5      00:16:26
 43613       5   5,035      25,175     1,458.5      76.8      00:16:12
 43857       7   5,035      35,245     1,466.7      77.2      00:15:52
 44061      10   5,035      50,350     1,473.6      77.6      00:15:35
 44179       4   5,035      20,140     1,477.5      77.8      00:15:27
 44270      10   5,035      50,350     1,480.5      77.9      00:15:22
 44362       9   5,035      45,315     1,483.3      78.1      00:15:17
 44498      10   5,035      50,350     1,487.9      78.3      00:15:07
 44657       5   5,035      25,175     1,493.2      78.6      00:14:54
 44803       8   5,035      40,280     1,498.1      78.9      00:14:43
 44933       5   5,035      25,175     1,502.6      79.1      00:14:34
 45099      10   5,035      50,350     1,508.0      79.4      00:14:21
 45269      10   5,035      50,350     1,513.3      79.7      00:14:09
 45384      10   5,035      50,350     1,516.8      79.8      00:14:02
 45497       4   5,035      20,140     1,520.5      80.0      00:13:54
 45612       8   5,035      40,280     1,524.1      80.2      00:13:47
 45743       4   5,035      20,140     1,528.2      80.4      00:13:38
 45878      10   5,035      50,350     1,532.6      80.7      00:13:29
 45999      10   5,035      50,350     1,536.9      80.9      00:13:19
 46159       6   5,035      30,210     1,542.3      81.2      00:13:07
 46305       5   5,035      25,175     1,547.5      81.5      00:12:55
 46441       9   5,035      45,315     1,551.8      81.7      00:12:46
 46579       6   5,035      30,210     1,556.7      81.9      00:12:35
 46749       5   5,035      25,175     1,562.4      82.2      00:12:22
 46895       9   5,035      45,315     1,567.5      82.5      00:12:11
 47031       7   5,035      35,245     1,571.4      82.7      00:12:02
 47173       9   5,035      45,315     1,575.8      82.9      00:11:53
 47276       6   5,035      30,210     1,579.1      83.1      00:11:46
 47392       8   5,035      40,280     1,582.9      83.3      00:11:38
 47504       6   5,035      30,210     1,586.4      83.5      00:11:31
 47622      10   5,035      50,350     1,590.4      83.7      00:11:22
 47739       7   5,035      35,245     1,594.3      83.9      00:11:14
 47844      10   5,035      50,350     1,597.7      84.1      00:11:07
 47935       7   5,035      35,245     1,600.9      84.3      00:11:00
 48052       6   5,035      30,210     1,604.8      84.5      00:10:52
 48236      10   5,035      50,350     1,610.8      84.8      00:10:38
 48337       9   5,035      45,315     1,614.4      85.0      00:10:30
 48469       8   5,035      40,280     1,618.9      85.2      00:10:21
 48650       5   5,035      25,175     1,624.9      85.5      00:10:07
 48803       4   5,035      20,140     1,629.9      85.8      00:09:55
 48901       8   5,035      40,280     1,633.2      86.0      00:09:49
 49033       5   5,035      25,175     1,637.6      86.2      00:09:39
 49177       7   5,035      35,245     1,642.8      86.5      00:09:27
 49294       9   5,035      45,315     1,646.5      86.7      00:09:19
 49412       9   5,035      45,315     1,650.1      86.9      00:09:12
 49518       8   5,035      40,280     1,653.5      87.0      00:09:05
 49626       6   5,035      30,210     1,656.7      87.2      00:08:58
 49745      10   5,035      50,350     1,660.5      87.4      00:08:50
 49885       7   5,035      35,245     1,665.0      87.6      00:08:40
 50010      10   5,035      50,350     1,669.3      87.9      00:08:31
 50176       6   5,035      30,210     1,674.7      88.1      00:08:18
 50307       4   5,035      20,140     1,678.7      88.4      00:08:09
 50456       6   5,035      30,210     1,683.5      88.6      00:07:59
 50629      10   5,035      50,350     1,689.3      88.9      00:07:46
 50822       5   5,035      25,175     1,696.0      89.3      00:07:30
 50986       6   5,035      30,210     1,701.9      89.6      00:07:17
 51083       6   5,035      30,210     1,705.2      89.8      00:07:10
 51213       9   5,035      45,315     1,709.4      90.0      00:07:01
 51356       9   5,035      45,315     1,714.3      90.2      00:06:50
 51585       6   5,035      30,210     1,722.2      90.7      00:06:32
 51775       2   5,035      10,070     1,729.0      91.0      00:06:16
 51952       6   5,035      30,210     1,735.0      91.3      00:06:02
 52150      10   5,035      50,350     1,742.4      91.7      00:05:46
 52410       8   5,035      40,280     1,751.6      92.2      00:05:25
 52676       9   5,035      45,315     1,761.5      92.7      00:05:02
 52917       9   5,035      45,315     1,770.1      93.2      00:04:43
 53185      10   5,035      50,350     1,779.6      93.7      00:04:21
 53435       6   5,035      30,210     1,788.3      94.1      00:04:02
 53662       8   5,035      40,280     1,796.2      94.5      00:03:44
 53792       6   5,035      30,210     1,800.6      94.8      00:03:35
 53911       5   5,035      25,175     1,804.5      95.0      00:03:26
 54065       8   5,035      40,280     1,809.6      95.3      00:03:15
 54206      10   5,035      50,350     1,814.5      95.5      00:03:05
 54375       5   5,035      25,175     1,819.9      95.8      00:02:53
 54548       8   5,035      40,280     1,825.2      96.1      00:02:41
 54656       7   5,035      35,245     1,828.9      96.3      00:02:33
 54762       7   5,035      35,245     1,832.4      96.5      00:02:26
 54901       9   5,035      45,315     1,837.0      96.7      00:02:16
 55043       9   5,035      45,315     1,841.7      96.9      00:02:06
 55167       8   5,035      40,280     1,845.6      97.1      00:01:57
 55260       4   5,035      20,140     1,848.7      97.3      00:01:51
 55373      10   5,035      50,350     1,852.2      97.5      00:01:43
 55465       9   5,035      45,315     1,855.2      97.7      00:01:37
 55565       8   5,035      40,280     1,858.2      97.8      00:01:30
 55677       6   5,035      30,210     1,862.1      98.0      00:01:22
 55831      10   5,035      50,350     1,867.4      98.3      00:01:10
 55966       7   5,035      35,245     1,872.0      98.5      00:01:00
 56097       8   5,035      40,280     1,876.5      98.8      00:00:51
 56239       8   5,035      40,280     1,881.4      99.0      00:00:40
 56347       7   5,035      35,245     1,885.3      99.2      00:00:32
 56440       7   5,035      35,245     1,888.6      99.4      00:00:24
 56565       5   5,035      25,175     1,892.9      99.6      00:00:15
 56682       7   5,035      35,245     1,896.9      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 4152.866
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed457.csv sa
> ved

. 
. cap log close

. 
end of do-file
