
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A200_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   257       8   4,235      33,880         6.2       0.4      00:42:48
   517       8   4,235      33,880        12.7       0.8      00:41:30
   772       9   4,235      38,115        19.4       1.2      00:40:41
  1019       8   4,235      33,880        25.8       1.6      00:40:41
  1233       2   4,235       8,470        31.7       2.0      00:41:13
  1428      10   4,235      42,350        37.2       2.3      00:42:00
  1651       6   4,235      25,410        43.4       2.7      00:41:54
  1865       8   4,235      33,880        49.1       3.1      00:42:10
  2073       6   4,235      25,410        54.6       3.4      00:42:29
  2312       2   4,235       8,470        61.2       3.8      00:41:56
  2555       8   4,235      33,880        67.7       4.2      00:41:35
  2768       7   4,235      29,645        73.7       4.6      00:41:29
  2989       5   4,235      21,175        79.5       5.0      00:41:30
  3211       8   4,235      33,880        85.9       5.4      00:41:11
  3421       9   4,235      38,115        92.0       5.8      00:41:01
  3667      10   4,235      42,350        98.8       6.2      00:40:34
  3874       9   4,235      38,115       104.5       6.5      00:40:38
  4046       3   4,235      12,705       108.9       6.8      00:41:08
  4230       6   4,235      25,410       113.7       7.1      00:41:27
  4397       7   4,235      29,645       118.0       7.4      00:41:56
  4527       6   4,235      25,410       121.6       7.6      00:42:37
  4675       6   4,235      25,410       125.9       7.9      00:42:60
  4818       8   4,235      33,880       129.8       8.1      00:43:29
  4955       6   4,235      25,410       133.6       8.4      00:43:58
  5091       7   4,235      29,645       137.2       8.6      00:44:29
  5180       8   4,235      33,880       139.8       8.7      00:45:21
  5314      10   4,235      42,350       143.4       9.0      00:45:46
  5437       7   4,235      29,645       146.9       9.2      00:46:15
  5573       6   4,235      25,410       150.1       9.4      00:46:46
  5698       9   4,235      38,115       153.4       9.6      00:47:14
  5838       9   4,235      38,115       157.1       9.8      00:47:32
  5998       9   4,235      38,115       161.6      10.1      00:47:34
  6138       9   4,235      38,115       165.5      10.4      00:47:48
  6289       5   4,235      21,175       169.4      10.6      00:47:57
  6431       8   4,235      33,880       173.2      10.8      00:48:10
  6563       7   4,235      29,645       176.8      11.1      00:48:26
  6692       7   4,235      29,645       180.1      11.3      00:48:44
  6821       7   4,235      29,645       183.7      11.5      00:48:57
  6977       4   4,235      16,940       187.8      11.8      00:48:59
  7178       2   4,235       8,470       193.1      12.1      00:48:41
  7345       8   4,235      33,880       197.8      12.4      00:48:33
  7488       5   4,235      21,175       201.8      12.6      00:48:37
  7630       5   4,235      21,175       205.7      12.9      00:48:41
  7747       4   4,235      16,940       208.9      13.1      00:48:56
  7911       8   4,235      33,880       213.7      13.4      00:48:44
  8082       7   4,235      29,645       218.7      13.7      00:48:31
  8250       9   4,235      38,115       223.5      14.0      00:48:20
  8441       6   4,235      25,410       229.2      14.3      00:47:56
  8648      10   4,235      42,350       235.1      14.7      00:47:30
  8845       5   4,235      21,175       240.8      15.1      00:47:08
  9026      10   4,235      42,350       246.0      15.4      00:46:52
  9199       8   4,235      33,880       251.1      15.7      00:46:40
  9305       8   4,235      33,880       254.2      15.9      00:46:52
  9417       6   4,235      25,410       257.4      16.1      00:47:03
  9541       5   4,235      21,175       261.1      16.3      00:47:07
  9683       8   4,235      33,880       265.3      16.6      00:47:03
  9827       7   4,235      29,645       269.4      16.9      00:47:01
 10009       9   4,235      38,115       274.3      17.2      00:46:49
 10157       7   4,235      29,645       278.1      17.4      00:46:51
 10338      10   4,235      42,350       282.9      17.7      00:46:41
 10486       6   4,235      25,410       287.0      18.0      00:46:37
 10678       5   4,235      21,175       292.1      18.3      00:46:23
 10841      10   4,235      42,350       296.6      18.6      00:46:16
 11000       4   4,235      16,940       301.0      18.8      00:46:08
 11157       7   4,235      29,645       305.2      19.1      00:46:04
 11258      10   4,235      42,350       308.0      19.3      00:46:16
 11390      10   4,235      42,350       311.7      19.5      00:46:17
 11482       5   4,235      21,175       314.3      19.7      00:46:29
 11601       9   4,235      38,115       317.4      19.9      00:46:36
 11729       9   4,235      38,115       320.9      20.1      00:46:37
 11849       7   4,235      29,645       324.4      20.3      00:46:39
 12009       5   4,235      21,175       328.8      20.6      00:46:31
 12153       6   4,235      25,410       332.9      20.8      00:46:25
 12335       9   4,235      38,115       337.9      21.1      00:46:11
 12590       7   4,235      29,645       344.9      21.6      00:45:36
 12814       5   4,235      21,175       350.8      22.0      00:45:13
 13069       7   4,235      29,645       357.8      22.4      00:44:40
 13292       8   4,235      33,880       364.0      22.8      00:44:15
 13512       7   4,235      29,645       370.6      23.2      00:43:47
 13682       5   4,235      21,175       375.5      23.5      00:43:35
 13852       9   4,235      38,115       380.2      23.8      00:43:25
 14042       7   4,235      29,645       385.3      24.1      00:43:12
 14204       5   4,235      21,175       390.0      24.4      00:43:02
 14361       9   4,235      38,115       394.5      24.7      00:42:52
 14512       7   4,235      29,645       398.8      25.0      00:42:46
 14682       8   4,235      33,880       403.5      25.3      00:42:36
 14880       9   4,235      38,115       409.1      25.6      00:42:19
 15124       5   4,235      21,175       416.2      26.0      00:41:49
 15355       4   4,235      16,940       422.8      26.5      00:41:24
 15606      10   4,235      42,350       429.7      26.9      00:40:57
 15807       4   4,235      16,940       435.5      27.3      00:40:39
 16016       4   4,235      16,940       441.7      27.6      00:40:18
 16227       4   4,235      16,940       447.9      28.0      00:39:58
 16462       7   4,235      29,645       454.8      28.5      00:39:32
 16640       6   4,235      25,410       459.6      28.8      00:39:22
 16800      10   4,235      42,350       464.2      29.1      00:39:14
 16963       8   4,235      33,880       468.9      29.3      00:39:05
 17119       9   4,235      38,115       473.3      29.6      00:38:58
 17244       6   4,235      25,410       476.8      29.8      00:38:57
 17382       6   4,235      25,410       480.8      30.1      00:38:53
 17511       6   4,235      25,410       484.8      30.3      00:38:48
 17644       7   4,235      29,645       488.7      30.6      00:38:45
 17815       7   4,235      29,645       493.2      30.9      00:38:36
 18002       7   4,235      29,645       498.5      31.2      00:38:23
 18231       7   4,235      29,645       505.2      31.6      00:37:60
 18472      10   4,235      42,350       511.7      32.0      00:37:39
 18630      10   4,235      42,350       516.3      32.3      00:37:30
 18757       9   4,235      38,115       520.1      32.5      00:37:27
 18890       7   4,235      29,645       523.9      32.8      00:37:24
 19014       8   4,235      33,880       527.6      33.0      00:37:21
 19149       6   4,235      25,410       531.6      33.3      00:37:16
 19318      10   4,235      42,350       536.5      33.6      00:37:05
 19541       5   4,235      21,175       543.0      34.0      00:36:44
 19775       6   4,235      25,410       550.0      34.4      00:36:21
 19986       8   4,235      33,880       556.2      34.8      00:36:02
 20246       8   4,235      33,880       563.7      35.3      00:35:37
 20483      10   4,235      42,350       570.6      35.7      00:35:15
 20673       6   4,235      25,410       576.1      36.1      00:35:01
 20821       7   4,235      29,645       580.4      36.3      00:34:55
 20949       8   4,235      33,880       584.1      36.6      00:34:51
 21082       8   4,235      33,880       587.7      36.8      00:34:48
 21225      10   4,235      42,350       591.3      37.0      00:34:45
 21388      10   4,235      42,350       595.6      37.3      00:34:38
 21551       6   4,235      25,410       600.1      37.6      00:34:30
 21686       4   4,235      16,940       603.5      37.8      00:34:28
 21854       6   4,235      25,410       608.0      38.1      00:34:19
 22010       8   4,235      33,880       612.3      38.3      00:34:12
 22180       8   4,235      33,880       616.6      38.6      00:34:05
 22348       9   4,235      38,115       621.1      38.9      00:33:57
 22519      10   4,235      42,350       625.7      39.2      00:33:48
 22693       6   4,235      25,410       630.4      39.5      00:33:39
 22915       8   4,235      33,880       636.0      39.8      00:33:25
 23129       7   4,235      29,645       642.0      40.2      00:33:08
 23346       6   4,235      25,410       648.2      40.6      00:32:51
 23586      10   4,235      42,350       654.3      40.9      00:32:34
 23816       8   4,235      33,880       660.9      41.4      00:32:16
 24066       6   4,235      25,410       667.8      41.8      00:31:55
 24297       9   4,235      38,115       673.7      42.2      00:31:40
 24534       5   4,235      21,175       680.3      42.6      00:31:22
 24778       9   4,235      38,115       687.2      43.0      00:31:03
 25010      10   4,235      42,350       693.6      43.4      00:30:46
 25217       8   4,235      33,880       699.5      43.8      00:30:31
 25448       6   4,235      25,410       706.0      44.2      00:30:14
 25647       6   4,235      25,410       711.4      44.5      00:30:01
 25793      10   4,235      42,350       715.8      44.8      00:29:54
 25926       7   4,235      29,645       719.4      45.0      00:29:50
 26054       8   4,235      33,880       723.1      45.3      00:29:45
 26221      10   4,235      42,350       727.9      45.6      00:29:36
 26407       6   4,235      25,410       732.8      45.9      00:29:26
 26588       7   4,235      29,645       737.7      46.2      00:29:16
 26773       5   4,235      21,175       742.9      46.5      00:29:05
 26970      10   4,235      42,350       748.5      46.8      00:28:52
 27151       8   4,235      33,880       753.5      47.2      00:28:41
 27320       9   4,235      38,115       758.1      47.4      00:28:32
 27490       7   4,235      29,645       762.9      47.7      00:28:23
 27648       9   4,235      38,115       767.4      48.0      00:28:15
 27809       9   4,235      38,115       772.0      48.3      00:28:06
 27944       8   4,235      33,880       775.9      48.6      00:28:00
 28168      10   4,235      42,350       782.3      49.0      00:27:44
 28341       6   4,235      25,410       787.3      49.3      00:27:34
 28554       8   4,235      33,880       793.7      49.7      00:27:18
 28712      10   4,235      42,350       798.3      50.0      00:27:09
 28876       8   4,235      33,880       803.0      50.3      00:26:60
 29043       4   4,235      16,940       807.8      50.6      00:26:50
 29229      10   4,235      42,350       812.9      50.9      00:26:40
 29427       9   4,235      38,115       818.8      51.2      00:26:26
 29619       5   4,235      21,175       824.0      51.6      00:26:15
 29765      10   4,235      42,350       828.2      51.8      00:26:07
 29892       8   4,235      33,880       831.9      52.1      00:26:02
 30019       6   4,235      25,410       835.5      52.3      00:25:57
 30156       6   4,235      25,410       839.5      52.5      00:25:51
 30318       8   4,235      33,880       844.1      52.8      00:25:42
 30487       7   4,235      29,645       849.1      53.1      00:25:31
 30682       8   4,235      33,880       854.7      53.5      00:25:19
 30897       9   4,235      38,115       860.9      53.9      00:25:04
 31113       8   4,235      33,880       867.0      54.3      00:24:50
 31327       6   4,235      25,410       873.3      54.6      00:24:34
 31506       9   4,235      38,115       878.6      55.0      00:24:23
 31715       8   4,235      33,880       884.7      55.4      00:24:09
 31927       7   4,235      29,645       891.1      55.8      00:23:53
 32158       7   4,235      29,645       897.9      56.2      00:23:36
 32395       4   4,235      16,940       905.2      56.6      00:23:18
 32559       9   4,235      38,115       909.9      56.9      00:23:09
 32696       6   4,235      25,410       913.8      57.2      00:23:03
 32820       5   4,235      21,175       917.4      57.4      00:22:57
 32982      10   4,235      42,350       922.3      57.7      00:22:48
 33127       4   4,235      16,940       926.6      58.0      00:22:40
 33306       8   4,235      33,880       931.8      58.3      00:22:29
 33487       9   4,235      38,115       937.0      58.6      00:22:18
 33663       5   4,235      21,175       942.3      59.0      00:22:07
 33848       8   4,235      33,880       947.8      59.3      00:21:55
 33988       7   4,235      29,645       951.9      59.6      00:21:48
 34101       8   4,235      33,880       955.3      59.8      00:21:43
 34270       9   4,235      38,115       960.4      60.1      00:21:33
 34483       8   4,235      33,880       966.7      60.5      00:21:18
 34712       9   4,235      38,115       973.4      60.9      00:21:02
 34953       8   4,235      33,880       980.6      61.4      00:20:45
 35206       7   4,235      29,645       988.0      61.8      00:20:27
 35434       9   4,235      38,115       994.8      62.3      00:20:11
 35680       9   4,235      38,115     1,001.8      62.7      00:19:55
 35905       8   4,235      33,880     1,008.4      63.1      00:19:40
 36124      10   4,235      42,350     1,014.8      63.5      00:19:25
 36371       6   4,235      25,410     1,022.1      64.0      00:19:08
 36565       8   4,235      33,880     1,027.6      64.3      00:18:57
 36724       8   4,235      33,880     1,032.1      64.6      00:18:48
 36859       5   4,235      21,175     1,035.9      64.8      00:18:42
 36998       7   4,235      29,645     1,039.7      65.1      00:18:36
 37161       8   4,235      33,880     1,044.1      65.3      00:18:28
 37346       9   4,235      38,115     1,049.1      65.7      00:18:18
 37528      10   4,235      42,350     1,054.0      66.0      00:18:08
 37683       8   4,235      33,880     1,058.2      66.2      00:18:00
 37862      10   4,235      42,350     1,063.3      66.5      00:17:50
 38029       8   4,235      33,880     1,068.1      66.8      00:17:41
 38189       5   4,235      21,175     1,072.7      67.1      00:17:32
 38363       8   4,235      33,880     1,077.8      67.4      00:17:22
 38509       6   4,235      25,410     1,082.1      67.7      00:17:14
 38740       9   4,235      38,115     1,088.7      68.1      00:16:59
 38966       5   4,235      21,175     1,095.2      68.5      00:16:45
 39122       9   4,235      38,115     1,099.6      68.8      00:16:36
 39275       7   4,235      29,645     1,103.7      69.1      00:16:29
 39457       7   4,235      29,645     1,108.7      69.4      00:16:19
 39644       6   4,235      25,410     1,114.0      69.7      00:16:08
 39828       9   4,235      38,115     1,119.2      70.0      00:15:58
 40072       8   4,235      33,880     1,125.9      70.5      00:15:43
 40300      10   4,235      42,350     1,132.3      70.9      00:15:29
 40526       6   4,235      25,410     1,139.0      71.3      00:15:14
 40778       3   4,235      12,705     1,146.2      71.7      00:14:58
 40940       8   4,235      33,880     1,151.0      72.0      00:14:49
 41067       9   4,235      38,115     1,154.6      72.3      00:14:43
 41213       6   4,235      25,410     1,158.8      72.5      00:14:35
 41381      10   4,235      42,350     1,163.4      72.8      00:14:26
 41566       6   4,235      25,410     1,168.9      73.1      00:14:15
 41734       9   4,235      38,115     1,173.7      73.4      00:14:05
 41896       7   4,235      29,645     1,178.5      73.7      00:13:56
 42016       8   4,235      33,880     1,181.7      73.9      00:13:51
 42176       9   4,235      38,115     1,185.9      74.2      00:13:43
 42335       4   4,235      16,940     1,190.2      74.5      00:13:35
 42483       2   4,235       8,470     1,194.6      74.8      00:13:27
 42659       7   4,235      29,645     1,199.4      75.1      00:13:17
 42855      10   4,235      42,350     1,205.0      75.4      00:13:06
 42978       8   4,235      33,880     1,208.5      75.6      00:12:60
 43186       4   4,235      16,940     1,214.8      76.0      00:12:46
 43364      10   4,235      42,350     1,219.9      76.3      00:12:36
 43554       6   4,235      25,410     1,225.2      76.7      00:12:25
 43840       6   4,235      25,410     1,233.2      77.2      00:12:08
 44088       8   4,235      33,880     1,240.1      77.6      00:11:53
 44247       5   4,235      21,175     1,244.6      77.9      00:11:44
 44448       6   4,235      25,410     1,250.0      78.2      00:11:33
 44665       9   4,235      38,115     1,256.2      78.6      00:11:20
 44871       6   4,235      25,410     1,262.1      79.0      00:11:08
 45097       6   4,235      25,410     1,268.4      79.4      00:10:55
 45325       7   4,235      29,645     1,274.2      79.7      00:10:43
 45483       4   4,235      16,940     1,278.6      80.0      00:10:34
 45649       6   4,235      25,410     1,282.9      80.3      00:10:26
 45820       6   4,235      25,410     1,287.6      80.6      00:10:17
 46002       5   4,235      21,175     1,292.8      80.9      00:10:07
 46181       5   4,235      21,175     1,297.9      81.2      00:09:56
 46391       7   4,235      29,645     1,303.9      81.6      00:09:44
 46575       8   4,235      33,880     1,309.2      81.9      00:09:33
 46826       9   4,235      38,115     1,316.4      82.4      00:09:18
 47007      10   4,235      42,350     1,321.1      82.7      00:09:09
 47169       8   4,235      33,880     1,325.3      82.9      00:09:01
 47359       9   4,235      38,115     1,330.6      83.3      00:08:50
 47557       8   4,235      33,880     1,335.8      83.6      00:08:40
 47677       6   4,235      25,410     1,339.3      83.8      00:08:34
 47829       6   4,235      25,410     1,343.4      84.1      00:08:26
 47959       9   4,235      38,115     1,347.2      84.3      00:08:19
 48109       6   4,235      25,410     1,351.3      84.6      00:08:11
 48260       9   4,235      38,115     1,355.7      84.8      00:08:03
 48503       9   4,235      38,115     1,362.5      85.3      00:07:48
 48716       9   4,235      38,115     1,368.5      85.6      00:07:36
 48887       6   4,235      25,410     1,373.3      85.9      00:07:27
 49025       7   4,235      29,645     1,377.2      86.2      00:07:19
 49164      10   4,235      42,350     1,381.4      86.4      00:07:11
 49312       8   4,235      33,880     1,385.3      86.7      00:07:04
 49519       4   4,235      16,940     1,390.8      87.0      00:06:53
 49734       9   4,235      38,115     1,396.4      87.4      00:06:41
 49930       7   4,235      29,645     1,401.8      87.7      00:06:31
 50116       3   4,235      12,705     1,406.9      88.0      00:06:20
 50336       7   4,235      29,645     1,412.7      88.4      00:06:09
 50524      10   4,235      42,350     1,418.0      88.7      00:05:58
 50696       9   4,235      38,115     1,422.9      89.0      00:05:48
 50856       4   4,235      16,940     1,427.6      89.3      00:05:39
 51022      10   4,235      42,350     1,432.6      89.7      00:05:29
 51235      10   4,235      42,350     1,438.4      90.0      00:05:17
 51443       8   4,235      33,880     1,444.4      90.4      00:05:05
 51666       8   4,235      33,880     1,451.1      90.8      00:04:52
 51911       7   4,235      29,645     1,458.2      91.3      00:04:37
 52132       7   4,235      29,645     1,465.0      91.7      00:04:23
 52358       9   4,235      38,115     1,471.7      92.1      00:04:10
 52590       9   4,235      38,115     1,478.9      92.6      00:03:55
 52865       7   4,235      29,645     1,487.5      93.1      00:03:38
 53182       5   4,235      21,175     1,496.8      93.7      00:03:19
 53499       8   4,235      33,880     1,506.0      94.2      00:03:00
 53741       7   4,235      29,645     1,513.1      94.7      00:02:46
 53886      10   4,235      42,350     1,517.1      94.9      00:02:38
 54000       9   4,235      38,115     1,520.4      95.1      00:02:32
 54163      10   4,235      42,350     1,524.9      95.4      00:02:23
 54386       4   4,235      16,940     1,531.1      95.8      00:02:11
 54629       5   4,235      21,175     1,537.5      96.2      00:01:58
 54804       9   4,235      38,115     1,542.4      96.5      00:01:49
 55016       6   4,235      25,410     1,548.3      96.9      00:01:37
 55223       7   4,235      29,645     1,554.0      97.3      00:01:26
 55430      10   4,235      42,350     1,559.5      97.6      00:01:15
 55657      10   4,235      42,350     1,565.7      98.0      00:01:03
 55831      10   4,235      42,350     1,570.7      98.3      00:00:53
 55997       7   4,235      29,645     1,575.5      98.6      00:00:44
 56167      10   4,235      42,350     1,580.4      98.9      00:00:34
 56341       5   4,235      21,175     1,585.6      99.2      00:00:24
 56527       6   4,235      25,410     1,591.0      99.6      00:00:14

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 3129.635
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
