
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A300_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Apr 2024, 11:57:30

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   386       8   4,335      34,680         9.6       0.6      00:28:27
   796       6   4,335      26,010        20.5       1.3      00:26:23
  1177       4   4,335      17,340        30.7       1.9      00:26:11
  1573       8   4,335      34,680        42.1       2.6      00:25:19
  2000       9   4,335      39,015        53.8       3.3      00:24:33
  2417       8   4,335      34,680        65.4       4.0      00:24:04
  2816       3   4,335      13,005        76.6       4.7      00:23:48
  3219       7   4,335      30,345        87.9       5.4      00:23:31
  3617       7   4,335      30,345        99.4       6.1      00:23:13
  4003       8   4,335      34,680       110.1       6.7      00:23:09
  4356       1   4,335       4,335       119.5       7.3      00:23:18
  4713       7   4,335      30,345       129.8       7.9      00:23:14
  5062       8   4,335      34,680       139.6       8.5      00:23:15
  5392       5   4,335      21,675       149.0       9.1      00:23:20
  5686       9   4,335      39,015       156.5       9.6      00:23:41
  5978       8   4,335      34,680       164.6      10.1      00:23:53
  6337       6   4,335      26,010       174.5      10.7      00:23:46
  6695       8   4,335      34,680       184.3      11.3      00:23:40
  7032       8   4,335      34,680       193.6      11.8      00:23:38
  7462       9   4,335      39,015       205.6      12.6      00:23:14
  7881       9   4,335      39,015       217.7      13.3      00:22:51
  8286       8   4,335      34,680       229.7      14.0      00:22:30
  8696       9   4,335      39,015       241.8      14.8      00:22:08
  9099       5   4,335      21,675       253.8      15.5      00:21:50
  9428       5   4,335      21,675       263.6      16.1      00:21:44
  9779       6   4,335      26,010       274.2      16.8      00:21:34
 10105       4   4,335      17,340       283.2      17.3      00:21:32
 10420       7   4,335      30,345       291.7      17.8      00:21:33
 10786       5   4,335      21,675       301.8      18.4      00:21:25
 11184       6   4,335      26,010       313.0      19.1      00:21:10
 11490       6   4,335      26,010       321.7      19.7      00:21:09
 11822       8   4,335      34,680       331.1      20.2      00:21:04
 12117      10   4,335      43,350       339.5      20.7      00:21:02
 12474       6   4,335      26,010       349.5      21.4      00:20:54
 12910       4   4,335      17,340       361.6      22.1      00:20:36
 13322       9   4,335      39,015       373.3      22.8      00:20:20
 13703       6   4,335      26,010       384.8      23.5      00:20:05
 13991       7   4,335      30,345       392.7      24.0      00:20:05
 14327       8   4,335      34,680       402.6      24.6      00:19:57
 14681      10   4,335      43,350       412.9      25.2      00:19:47
 15089       6   4,335      26,010       424.7      25.9      00:19:32
 15554       7   4,335      30,345       438.2      26.8      00:19:10
 16024       6   4,335      26,010       452.1      27.6      00:18:48
 16470      10   4,335      43,350       465.6      28.4      00:18:28
 16842       9   4,335      39,015       476.2      29.1      00:18:18
 17170       8   4,335      34,680       485.6      29.7      00:18:12
 17468       8   4,335      34,680       494.5      30.2      00:18:07
 17754       5   4,335      21,675       503.0      30.7      00:18:04
 18107       8   4,335      34,680       513.2      31.4      00:17:54
 18480       6   4,335      26,010       523.7      32.0      00:17:44
 18938       8   4,335      34,680       537.4      32.8      00:17:25
 19390       8   4,335      34,680       550.9      33.7      00:17:07
 19841       8   4,335      34,680       564.7      34.5      00:16:48
 20297       7   4,335      30,345       578.3      35.3      00:16:30
 20658       5   4,335      21,675       589.0      36.0      00:16:20
 20966       5   4,335      21,675       598.2      36.5      00:16:14
 21325       5   4,335      21,675       607.5      37.1      00:16:07
 21644       5   4,335      21,675       616.4      37.7      00:16:01
 21954      10   4,335      43,350       624.9      38.2      00:15:57
 22344      10   4,335      43,350       635.3      38.8      00:15:47
 22689       6   4,335      26,010       644.9      39.4      00:15:40
 23056       9   4,335      39,015       654.8      40.0      00:15:31
 23396       7   4,335      30,345       664.7      40.6      00:15:23
 23798      10   4,335      43,350       675.8      41.3      00:15:12
 24187       6   4,335      26,010       686.5      41.9      00:15:01
 24649       9   4,335      39,015       699.6      42.7      00:14:46
 25094       6   4,335      26,010       712.3      43.5      00:14:31
 25518       6   4,335      26,010       724.6      44.3      00:14:17
 25861       9   4,335      39,015       734.4      44.9      00:14:09
 26171      10   4,335      43,350       743.2      45.4      00:14:03
 26503       6   4,335      26,010       752.5      46.0      00:13:56
 26845       7   4,335      30,345       762.1      46.6      00:13:48
 27165       7   4,335      30,345       771.3      47.1      00:13:40
 27450      10   4,335      43,350       779.4      47.6      00:13:35
 27772       8   4,335      34,680       788.8      48.2      00:13:28
 28174       8   4,335      34,680       800.6      48.9      00:13:15
 28514       9   4,335      39,015       810.8      49.5      00:13:06
 28762       5   4,335      21,675       818.2      50.0      00:13:02
 28989       7   4,335      30,345       825.0      50.4      00:12:59
 29328       8   4,335      34,680       834.7      51.0      00:12:50
 29698       7   4,335      30,345       845.3      51.6      00:12:40
 30005       4   4,335      17,340       854.4      52.2      00:12:32
 30329       5   4,335      21,675       864.0      52.8      00:12:24
 30630       3   4,335      13,005       873.0      53.3      00:12:16
 31103       7   4,335      30,345       886.7      54.2      00:12:00
 31556       4   4,335      17,340       900.4      55.0      00:11:44
 31945       8   4,335      34,680       912.3      55.7      00:11:32
 32345      10   4,335      43,350       924.5      56.5      00:11:19
 32693       8   4,335      34,680       934.9      57.1      00:11:09
 33019       8   4,335      34,680       944.8      57.7      00:11:00
 33369       3   4,335      13,005       955.3      58.4      00:10:50
 33753       9   4,335      39,015       966.9      59.1      00:10:38
 34088       8   4,335      34,680       977.0      59.7      00:10:29
 34488       5   4,335      21,675       989.2      60.4      00:10:16
 34927       7   4,335      30,345     1,002.6      61.3      00:10:02
 35364      10   4,335      43,350     1,015.7      62.1      00:09:48
 35780      10   4,335      43,350     1,028.0      62.8      00:09:35
 36171      10   4,335      43,350     1,039.8      63.5      00:09:24
 36578       5   4,335      21,675     1,051.8      64.3      00:09:11
 36822       9   4,335      39,015     1,058.9      64.7      00:09:07
 37060       6   4,335      26,010     1,065.7      65.1      00:09:02
 37311       7   4,335      30,345     1,072.6      65.5      00:08:57
 37616       8   4,335      34,680     1,081.1      66.0      00:08:50
 37930       4   4,335      17,340     1,090.0      66.6      00:08:43
 38238       7   4,335      30,345     1,099.1      67.1      00:08:35
 38540       8   4,335      34,680     1,108.2      67.7      00:08:26
 38971       5   4,335      21,675     1,120.8      68.5      00:08:13
 39280       6   4,335      26,010     1,129.5      69.0      00:08:06
 39636       7   4,335      30,345     1,139.8      69.6      00:07:56
 40042       4   4,335      17,340     1,151.4      70.3      00:07:45
 40490       7   4,335      30,345     1,164.3      71.1      00:07:31
 40903       7   4,335      30,345     1,176.6      71.9      00:07:19
 41192       8   4,335      34,680     1,185.1      72.4      00:07:11
 41545       8   4,335      34,680     1,195.5      73.0      00:07:02
 41896       7   4,335      30,345     1,205.8      73.7      00:06:52
 42191       5   4,335      21,675     1,214.0      74.2      00:06:45
 42482       4   4,335      17,340     1,222.4      74.7      00:06:37
 42831       5   4,335      21,675     1,232.3      75.3      00:06:28
 43163      10   4,335      43,350     1,242.3      75.9      00:06:18
 43508      10   4,335      43,350     1,252.6      76.5      00:06:09
 43859       5   4,335      21,675     1,262.4      77.1      00:05:59
 44204       7   4,335      30,345     1,272.4      77.7      00:05:50
 44578       8   4,335      34,680     1,282.9      78.4      00:05:40
 44953      10   4,335      43,350     1,293.9      79.0      00:05:29
 45356       8   4,335      34,680     1,304.9      79.7      00:05:18
 45688       8   4,335      34,680     1,314.0      80.3      00:05:10
 45995      10   4,335      43,350     1,322.7      80.8      00:05:02
 46351       7   4,335      30,345     1,333.4      81.5      00:04:52
 46740       8   4,335      34,680     1,344.6      82.1      00:04:41
 47118       5   4,335      21,675     1,355.2      82.8      00:04:31
 47434       1   4,335       4,335     1,363.8      83.3      00:04:23
 47739       9   4,335      39,015     1,372.4      83.8      00:04:15
 48030       9   4,335      39,015     1,380.8      84.4      00:04:07
 48279       8   4,335      34,680     1,387.8      84.8      00:04:01
 48546       7   4,335      30,345     1,395.7      85.3      00:03:54
 48839       4   4,335      17,340     1,404.1      85.8      00:03:46
 49144      10   4,335      43,350     1,412.9      86.3      00:03:38
 49426       4   4,335      17,340     1,420.8      86.8      00:03:30
 49672       6   4,335      26,010     1,427.4      87.2      00:03:24
 49969      10   4,335      43,350     1,435.6      87.7      00:03:17
 50255       4   4,335      17,340     1,443.8      88.2      00:03:09
 50548       8   4,335      34,680     1,451.9      88.7      00:03:01
 50876       7   4,335      30,345     1,461.4      89.3      00:02:52
 51191       5   4,335      21,675     1,470.7      89.9      00:02:43
 51528       8   4,335      34,680     1,480.6      90.5      00:02:33
 51804       6   4,335      26,010     1,489.1      91.0      00:02:25
 52107       5   4,335      21,675     1,498.1      91.5      00:02:16
 52465      10   4,335      43,350     1,509.3      92.2      00:02:05
 52847       9   4,335      39,015     1,521.4      92.9      00:01:53
 53231       6   4,335      26,010     1,533.1      93.7      00:01:42
 53657       8   4,335      34,680     1,545.9      94.4      00:01:29
 53959      10   4,335      43,350     1,554.6      95.0      00:01:21
 54238       7   4,335      30,345     1,562.7      95.5      00:01:13
 54584      10   4,335      43,350     1,572.1      96.0      00:01:04
 54973       7   4,335      30,345     1,583.3      96.7      00:00:53
 55333       5   4,335      21,675     1,593.3      97.3      00:00:43
 55673      10   4,335      43,350     1,602.7      97.9      00:00:34
 55966       9   4,335      39,015     1,611.4      98.4      00:00:25
 56229       9   4,335      39,015     1,619.1      98.9      00:00:17
 56507       8   4,335      34,680     1,627.6      99.4      00:00:09
 56784       8   4,335      34,680     1,635.9      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1619.432
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed42.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
