
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A800.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A800.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   285       7   4,835      33,845         7.9       0.4      00:38:18
   622       4   4,835      19,340        17.5       1.0      00:34:23
   972       6   4,835      29,010        28.0       1.5      00:32:09
  1235       9   4,835      43,515        36.3       2.0      00:32:54
  1559       4   4,835      19,340        46.6       2.6      00:31:50
  1870       7   4,835      33,845        56.3       3.1      00:31:29
  2223       6   4,835      29,010        67.2       3.7      00:30:32
  2526       9   4,835      43,515        76.3       4.2      00:30:36
  2828       7   4,835      33,845        86.1       4.7      00:30:21
  3138       8   4,835      38,680        95.7       5.2      00:30:09
  3454      10   4,835      48,350       106.1       5.8      00:29:45
  3762       7   4,835      33,845       115.9       6.4      00:29:32
  4013      10   4,835      48,350       123.3       6.8      00:29:57
  4211       9   4,835      43,515       129.4       7.1      00:30:38
  4444       3   4,835      14,505       136.2       7.5      00:31:03
  4685       8   4,835      38,680       144.1       7.9      00:31:10
  4869       7   4,835      33,845       149.8       8.2      00:31:44
  5119       3   4,835      14,505       157.6       8.6      00:31:48
  5336       8   4,835      38,680       164.4       9.0      00:32:02
  5522       8   4,835      38,680       169.9       9.3      00:32:32
  5691       5   4,835      24,175       174.9       9.6      00:33:05
  5908       4   4,835      19,340       181.6      10.0      00:33:15
  6154       1   4,835       4,835       189.4      10.4      00:33:10
  6400       7   4,835      33,845       196.8      10.8      00:33:10
  6627       8   4,835      38,680       203.7      11.2      00:33:14
  6899      10   4,835      48,350       212.1      11.6      00:33:01
  7190       9   4,835      43,515       220.8      12.1      00:32:46
  7479       7   4,835      33,845       230.1      12.6      00:32:25
  7751      10   4,835      48,350       238.6      13.1      00:32:12
  7990       6   4,835      29,010       246.7      13.5      00:32:03
  8250       9   4,835      43,515       255.2      14.0      00:31:51
  8513       7   4,835      33,845       264.1      14.5      00:31:35
  8810       6   4,835      29,010       273.7      15.0      00:31:14
  9092       9   4,835      43,515       283.1      15.5      00:30:56
  9307       7   4,835      33,845       290.2      15.9      00:30:54
  9486       7   4,835      33,845       296.1      16.2      00:31:02
  9654       9   4,835      43,515       301.9      16.6      00:31:10
  9865      10   4,835      48,350       308.8      16.9      00:31:09
 10065       7   4,835      33,845       315.0      17.3      00:31:13
 10298       7   4,835      33,845       321.6      17.6      00:31:13
 10454       8   4,835      38,680       326.6      17.9      00:31:24
 10674       6   4,835      29,010       333.4      18.3      00:31:23
 10890       8   4,835      38,680       340.1      18.6      00:31:21
 11099       8   4,835      38,680       346.7      19.0      00:31:20
 11256       8   4,835      38,680       351.5      19.3      00:31:30
 11455       5   4,835      24,175       357.9      19.6      00:31:29
 11620       9   4,835      43,515       363.0      19.9      00:31:36
 11808       9   4,835      43,515       369.1      20.2      00:31:37
 12015       7   4,835      33,845       375.6      20.6      00:31:34
 12235       8   4,835      38,680       382.7      21.0      00:31:28
 12578       6   4,835      29,010       393.3      21.6      00:30:59
 12944       7   4,835      33,845       404.5      22.2      00:30:29
 13307       9   4,835      43,515       416.1      22.8      00:29:58
 13570      10   4,835      48,350       425.0      23.3      00:29:42
 13793       6   4,835      29,010       432.1      23.7      00:29:36
 14028       9   4,835      43,515       439.4      24.1      00:29:29
 14255       2   4,835       9,670       446.9      24.5      00:29:21
 14494       6   4,835      29,010       454.8      24.9      00:29:10
 14709       9   4,835      43,515       461.5      25.3      00:29:06
 14957       7   4,835      33,845       469.6      25.7      00:28:54
 15254       8   4,835      38,680       479.4      26.3      00:28:35
 15595       6   4,835      29,010       490.2      26.9      00:28:11
 15919       9   4,835      43,515       501.0      27.5      00:27:47
 16148       6   4,835      29,010       508.8      27.9      00:27:38
 16372       7   4,835      33,845       516.2      28.3      00:27:31
 16590       8   4,835      38,680       523.2      28.7      00:27:25
 16784       4   4,835      19,340       529.5      29.0      00:27:22
 16938      10   4,835      48,350       534.5      29.3      00:27:24
 17085       7   4,835      33,845       539.2      29.6      00:27:28
 17257       8   4,835      38,680       544.7      29.9      00:27:28
 17454       8   4,835      38,680       551.4      30.2      00:27:23
 17632      10   4,835      48,350       557.5      30.6      00:27:20
 17928       5   4,835      24,175       566.7      31.1      00:27:04
 18265      10   4,835      48,350       577.8      31.7      00:26:40
 18548       6   4,835      29,010       586.6      32.2      00:26:26
 18739       5   4,835      24,175       593.1      32.5      00:26:21
 19022       8   4,835      38,680       602.6      33.0      00:26:04
 19307       7   4,835      33,845       612.1      33.6      00:25:48
 19614       4   4,835      19,340       622.3      34.1      00:25:29
 19887       5   4,835      24,175       631.6      34.6      00:25:14
 20173      10   4,835      48,350       641.4      35.2      00:24:57
 20461       9   4,835      43,515       650.6      35.7      00:24:43
 20680       7   4,835      33,845       658.0      36.1      00:24:35
 20903      10   4,835      48,350       665.4      36.5      00:24:26
 21047       5   4,835      24,175       669.9      36.7      00:24:28
 21218       6   4,835      29,010       674.9      37.0      00:24:28
 21454       8   4,835      38,680       682.1      37.4      00:24:20
 21708       8   4,835      38,680       689.7      37.8      00:24:11
 21988       7   4,835      33,845       698.3      38.3      00:23:58
 22273       9   4,835      43,515       706.7      38.7      00:23:46
 22546       4   4,835      19,340       715.1      39.2      00:23:35
 22824       8   4,835      38,680       723.2      39.6      00:23:24
 22983       5   4,835      24,175       728.3      39.9      00:23:23
 23201       6   4,835      29,010       735.4      40.3      00:23:15
 23450       6   4,835      29,010       743.0      40.7      00:23:06
 23742       6   4,835      29,010       752.1      41.2      00:22:52
 24044       7   4,835      33,845       761.7      41.8      00:22:36
 24401       8   4,835      38,680       772.3      42.3      00:22:18
 24711       6   4,835      29,010       782.6      42.9      00:22:01
 25018       8   4,835      38,680       792.1      43.4      00:21:46
 25327       6   4,835      29,010       802.2      44.0      00:21:30
 25571       6   4,835      29,010       809.8      44.4      00:21:21
 25788      10   4,835      48,350       817.0      44.8      00:21:13
 25966      10   4,835      48,350       822.6      45.1      00:21:09
 26122       6   4,835      29,010       827.7      45.4      00:21:07
 26424       9   4,835      43,515       837.2      45.9      00:20:53
 26751       7   4,835      33,845       847.4      46.5      00:20:36
 27113       8   4,835      38,680       859.0      47.1      00:20:16
 27387      10   4,835      48,350       867.7      47.6      00:20:04
 27616       9   4,835      43,515       875.1      48.0      00:19:56
 27950       9   4,835      43,515       886.1      48.6      00:19:38
 28327       6   4,835      29,010       898.4      49.2      00:19:17
 28636       5   4,835      24,175       908.8      49.8      00:19:01
 28842       7   4,835      33,845       915.7      50.2      00:18:54
 29053       9   4,835      43,515       922.6      50.6      00:18:46
 29338       8   4,835      38,680       931.8      51.1      00:18:34
 29539       8   4,835      38,680       938.2      51.4      00:18:27
 29747       9   4,835      43,515       945.0      51.8      00:18:20
 29955       4   4,835      19,340       951.7      52.2      00:18:14
 30212       8   4,835      38,680       960.2      52.6      00:18:02
 30483       7   4,835      33,845       969.3      53.1      00:17:50
 30776       7   4,835      33,845       978.9      53.7      00:17:36
 31146       7   4,835      33,845       990.9      54.3      00:17:17
 31494       6   4,835      29,010     1,002.7      55.0      00:16:58
 31851       7   4,835      33,845     1,014.7      55.6      00:16:40
 32191      10   4,835      48,350     1,026.4      56.3      00:16:22
 32497       8   4,835      38,680     1,036.8      56.8      00:16:07
 32729      10   4,835      48,350     1,044.5      57.3      00:15:58
 32924      10   4,835      48,350     1,051.0      57.6      00:15:51
 33148       6   4,835      29,010     1,058.5      58.0      00:15:43
 33468       8   4,835      38,680     1,069.1      58.6      00:15:27
 33736       5   4,835      24,175     1,078.2      59.1      00:15:15
 34005       7   4,835      33,845     1,087.3      59.6      00:15:03
 34257       8   4,835      38,680     1,096.0      60.1      00:14:52
 34562       8   4,835      38,680     1,106.2      60.6      00:14:38
 34838       9   4,835      43,515     1,115.7      61.2      00:14:26
 35197       8   4,835      38,680     1,127.7      61.8      00:14:08
 35539       8   4,835      38,680     1,139.1      62.4      00:13:52
 35871       8   4,835      38,680     1,150.1      63.0      00:13:37
 36218       8   4,835      38,680     1,161.7      63.7      00:13:20
 36545      10   4,835      48,350     1,172.5      64.3      00:13:06
 36802       7   4,835      33,845     1,180.7      64.7      00:12:56
 37020       9   4,835      43,515     1,187.8      65.1      00:12:48
 37266       7   4,835      33,845     1,195.3      65.5      00:12:40
 37508       8   4,835      38,680     1,202.7      65.9      00:12:31
 37715       9   4,835      43,515     1,209.1      66.3      00:12:25
 37887       5   4,835      24,175     1,214.8      66.6      00:12:19
 38139      10   4,835      48,350     1,223.0      67.0      00:12:09
 38391       9   4,835      43,515     1,231.5      67.5      00:11:59
 38694       8   4,835      38,680     1,241.5      68.1      00:11:46
 39008       4   4,835      19,340     1,251.8      68.6      00:11:32
 39243       9   4,835      43,515     1,259.0      69.0      00:11:24
 39520       6   4,835      29,010     1,267.9      69.5      00:11:13
 39811      10   4,835      48,350     1,277.2      70.0      00:11:01
 40149       6   4,835      29,010     1,288.0      70.6      00:10:47
 40485       9   4,835      43,515     1,299.0      71.2      00:10:32
 40809       5   4,835      24,175     1,309.6      71.8      00:10:19
 41027       3   4,835      14,505     1,316.9      72.2      00:10:10
 41212       5   4,835      24,175     1,323.0      72.5      00:10:04
 41439       7   4,835      33,845     1,330.3      72.9      00:09:56
 41691       8   4,835      38,680     1,338.5      73.4      00:09:46
 41894       6   4,835      29,010     1,345.3      73.7      00:09:38
 42088       8   4,835      38,680     1,351.3      74.1      00:09:32
 42308       6   4,835      29,010     1,357.9      74.4      00:09:25
 42495       9   4,835      43,515     1,364.2      74.8      00:09:18
 42694       7   4,835      33,845     1,370.4      75.1      00:09:11
 42903       5   4,835      24,175     1,377.2      75.5      00:09:03
 43094       7   4,835      33,845     1,383.7      75.8      00:08:56
 43262       7   4,835      33,845     1,389.4      76.2      00:08:50
 43433       7   4,835      33,845     1,395.1      76.5      00:08:44
 43697       7   4,835      33,845     1,403.2      76.9      00:08:34
 43972       4   4,835      19,340     1,412.2      77.4      00:08:23
 44162      10   4,835      48,350     1,418.2      77.7      00:08:17
 44348      10   4,835      48,350     1,424.0      78.1      00:08:10
 44581       7   4,835      33,845     1,431.5      78.5      00:08:01
 44814       6   4,835      29,010     1,439.0      78.9      00:07:52
 45054       3   4,835      14,505     1,446.6      79.3      00:07:43
 45322       6   4,835      29,010     1,454.6      79.7      00:07:34
 45539      10   4,835      48,350     1,461.4      80.1      00:07:26
 45755      10   4,835      48,350     1,467.9      80.5      00:07:18
 45967      10   4,835      48,350     1,474.8      80.8      00:07:10
 46181       5   4,835      24,175     1,481.8      81.2      00:07:02
 46393       3   4,835      14,505     1,488.7      81.6      00:06:54
 46619       3   4,835      14,505     1,496.1      82.0      00:06:45
 46864       8   4,835      38,680     1,504.2      82.5      00:06:35
 47073       9   4,835      43,515     1,510.4      82.8      00:06:28
 47258       9   4,835      43,515     1,515.8      83.1      00:06:22
 47444       7   4,835      33,845     1,521.6      83.4      00:06:15
 47604       7   4,835      33,845     1,526.6      83.7      00:06:10
 47774       8   4,835      38,680     1,532.0      84.0      00:06:03
 47899       8   4,835      38,680     1,536.0      84.2      00:05:59
 48078       3   4,835      14,505     1,541.9      84.5      00:05:53
 48249      10   4,835      48,350     1,547.3      84.8      00:05:46
 48509      10   4,835      48,350     1,555.8      85.3      00:05:36
 48797      10   4,835      48,350     1,565.0      85.8      00:05:24
 49007       9   4,835      43,515     1,571.7      86.1      00:05:16
 49209       6   4,835      29,010     1,578.6      86.5      00:05:07
 49418      10   4,835      48,350     1,584.8      86.9      00:04:60
 49606       9   4,835      43,515     1,590.3      87.2      00:04:54
 49797       7   4,835      33,845     1,596.1      87.5      00:04:47
 50007      10   4,835      48,350     1,602.9      87.9      00:04:38
 50223       6   4,835      29,010     1,609.6      88.2      00:04:30
 50441       6   4,835      29,010     1,616.2      88.6      00:04:22
 50642       3   4,835      14,505     1,622.6      88.9      00:04:14
 50846       6   4,835      29,010     1,629.5      89.3      00:04:06
 51028       9   4,835      43,515     1,635.8      89.7      00:03:58
 51220      10   4,835      48,350     1,641.7      90.0      00:03:51
 51428       8   4,835      38,680     1,648.6      90.4      00:03:42
 51626       8   4,835      38,680     1,655.3      90.7      00:03:34
 51835       5   4,835      24,175     1,662.3      91.1      00:03:25
 52080       8   4,835      38,680     1,670.6      91.6      00:03:15
 52341       8   4,835      38,680     1,679.6      92.1      00:03:03
 52605       9   4,835      43,515     1,689.0      92.6      00:02:51
 52872       7   4,835      33,845     1,698.4      93.1      00:02:39
 53149       6   4,835      29,010     1,707.6      93.6      00:02:27
 53430       6   4,835      29,010     1,717.1      94.1      00:02:15
 53692       6   4,835      29,010     1,725.8      94.6      00:02:04
 53911       5   4,835      24,175     1,732.8      95.0      00:01:55
 54108       4   4,835      19,340     1,739.2      95.3      00:01:47
 54292       6   4,835      29,010     1,745.2      95.7      00:01:40
 54533       5   4,835      24,175     1,752.2      96.0      00:01:31
 54751       5   4,835      24,175     1,759.3      96.4      00:01:22
 54982      10   4,835      48,350     1,766.5      96.8      00:01:13
 55220       6   4,835      29,010     1,774.1      97.2      00:01:04
 55412       6   4,835      29,010     1,779.8      97.6      00:00:56
 55606      10   4,835      48,350     1,785.8      97.9      00:00:49
 55800       5   4,835      24,175     1,792.1      98.2      00:00:41
 56041       1   4,835       4,835     1,800.0      98.7      00:00:31
 56245       7   4,835      33,845     1,806.9      99.0      00:00:22
 56496       6   4,835      29,010     1,815.5      99.5      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 2323.037
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800.csv saved

. 
. cap log close

. 
end of do-file
