
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A100.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   331       5   4,135      20,675         8.0       0.5      00:32:31
   696       8   4,135      33,080        16.9       1.1      00:30:34
  1052       6   4,135      24,810        26.1       1.7      00:29:24
  1410       8   4,135      33,080        35.8       2.3      00:28:23
  1757       5   4,135      20,675        45.2       2.9      00:27:57
  2118       8   4,135      33,080        54.6       3.5      00:27:37
  2486       6   4,135      24,810        64.2       4.1      00:27:13
  2825      10   4,135      41,350        73.5       4.7      00:26:59
  3142       9   4,135      37,215        82.0       5.3      00:27:05
  3491       5   4,135      20,675        91.7       5.9      00:26:43
  3848       9   4,135      37,215       101.4       6.5      00:26:25
  4141       7   4,135      28,945       108.8       7.0      00:26:43
  4397       7   4,135      28,945       115.2       7.4      00:27:13
  4647      10   4,135      41,350       122.2       7.8      00:27:30
  4951       8   4,135      33,080       130.4       8.4      00:27:28
  5301       9   4,135      37,215       139.7       9.0      00:27:10
  5555       5   4,135      20,675       146.1       9.4      00:27:27
  5774       7   4,135      28,945       151.8       9.7      00:27:53
  6075      10   4,135      41,350       159.9      10.2      00:27:47
  6364       4   4,135      16,540       167.3      10.7      00:27:48
  6659       8   4,135      33,080       175.0      11.2      00:27:44
  6960       7   4,135      28,945       183.0      11.7      00:27:38
  7322       9   4,135      37,215       192.5      12.3      00:27:17
  7652      10   4,135      41,350       201.5      12.9      00:27:01
  7975       6   4,135      24,810       210.6      13.5      00:26:45
  8294       8   4,135      33,080       219.6      14.1      00:26:30
  8546       4   4,135      16,540       226.8      14.5      00:26:30
  8809       8   4,135      33,080       234.0      15.0      00:26:29
  9100       5   4,135      20,675       242.3      15.5      00:26:20
  9324       6   4,135      24,810       248.7      15.9      00:26:25
  9562      10   4,135      41,350       255.5      16.4      00:26:26
  9830       6   4,135      24,810       263.2      16.9      00:26:20
 10162       6   4,135      24,810       271.6      17.4      00:26:08
 10415      10   4,135      41,350       278.3      17.8      00:26:09
 10661       6   4,135      24,810       284.8      18.3      00:26:10
 10933       9   4,135      37,215       292.1      18.7      00:26:06
 11160       5   4,135      20,675       298.1      19.1      00:26:09
 11408      10   4,135      41,350       304.9      19.5      00:26:08
 11671       5   4,135      20,675       311.9      20.0      00:26:04
 11956       9   4,135      37,215       319.6      20.5      00:25:56
 12194       5   4,135      20,675       326.2      20.9      00:25:54
 12520       6   4,135      24,810       335.0      21.5      00:25:39
 12899      10   4,135      41,350       344.8      22.1      00:25:19
 13273       6   4,135      24,810       354.9      22.7      00:24:57
 13580       5   4,135      20,675       363.8      23.3      00:24:43
 13839       9   4,135      37,215       370.8      23.8      00:24:38
 14120       4   4,135      16,540       378.3      24.2      00:24:31
 14372       6   4,135      24,810       385.5      24.7      00:24:25
 14526       7   4,135      28,945       389.8      25.0      00:24:34
 14783       5   4,135      20,675       396.8      25.4      00:24:29
 15175      10   4,135      41,350       407.9      26.1      00:24:04
 15539       6   4,135      24,810       417.8      26.8      00:23:45
 15927       6   4,135      24,810       428.7      27.5      00:23:21
 16271       6   4,135      24,810       438.6      28.1      00:23:04
 16631       6   4,135      24,810       448.5      28.7      00:22:46
 16926       6   4,135      24,810       456.7      29.3      00:22:36
 17169      10   4,135      41,350       463.4      29.7      00:22:32
 17436       7   4,135      28,945       471.0      30.2      00:22:24
 17653       5   4,135      20,675       477.3      30.6      00:22:21
 17956       9   4,135      37,215       485.5      31.1      00:22:11
 18246       9   4,135      37,215       493.7      31.6      00:22:00
 18516       7   4,135      28,945       500.8      32.1      00:21:54
 18753       9   4,135      37,215       507.6      32.5      00:21:49
 18955       8   4,135      33,080       513.4      32.9      00:21:48
 19155       7   4,135      28,945       519.1      33.3      00:21:46
 19418       4   4,135      16,540       526.6      33.8      00:21:38
 19738       9   4,135      37,215       536.0      34.4      00:21:23
 20113      10   4,135      41,350       546.9      35.1      00:21:03
 20457      10   4,135      41,350       556.3      35.7      00:20:48
 20665      10   4,135      41,350       562.3      36.0      00:20:45
 20873       8   4,135      33,080       568.2      36.4      00:20:42
 21114       6   4,135      24,810       574.7      36.8      00:20:37
 21342       9   4,135      37,215       580.2      37.2      00:20:36
 21602      10   4,135      41,350       587.2      37.6      00:20:29
 21894       5   4,135      20,675       594.7      38.1      00:20:20
 22251       3   4,135      12,405       603.9      38.7      00:20:06
 22559       7   4,135      28,945       611.9      39.2      00:19:56
 22865       8   4,135      33,080       619.6      39.7      00:19:46
 23157       7   4,135      28,945       627.7      40.2      00:19:36
 23463       6   4,135      24,810       635.8      40.7      00:19:26
 23738       5   4,135      20,675       643.1      41.2      00:19:18
 23976       9   4,135      37,215       649.6      41.6      00:19:12
 24273       8   4,135      33,080       657.2      42.1      00:19:03
 24604       5   4,135      20,675       666.3      42.7      00:18:49
 24905      10   4,135      41,350       674.3      43.2      00:18:39
 25189      10   4,135      41,350       682.3      43.7      00:18:29
 25522       3   4,135      12,405       691.4      44.3      00:18:15
 25711       8   4,135      33,080       696.5      44.6      00:18:14
 25987       9   4,135      37,215       704.1      45.1      00:18:04
 26354       7   4,135      28,945       714.2      45.8      00:17:48
 26743       8   4,135      33,080       724.5      46.4      00:17:32
 27110       5   4,135      20,675       734.5      47.1      00:17:16
 27389       9   4,135      37,215       742.1      47.6      00:17:07
 27653       6   4,135      24,810       749.4      48.0      00:16:59
 28013       3   4,135      12,405       759.5      48.7      00:16:44
 28364      10   4,135      41,350       769.4      49.3      00:16:29
 28666       4   4,135      16,540       778.0      49.9      00:16:17
 28903       8   4,135      33,080       784.8      50.3      00:16:10
 29167       2   4,135       8,270       792.1      50.8      00:16:02
 29489       6   4,135      24,810       801.1      51.3      00:15:50
 29789       8   4,135      33,080       809.3      51.9      00:15:39
 30042       6   4,135      24,810       816.4      52.3      00:15:31
 30376       7   4,135      28,945       825.7      52.9      00:15:18
 30676       8   4,135      33,080       834.3      53.5      00:15:07
 30996       7   4,135      28,945       843.3      54.0      00:14:55
 31396       7   4,135      28,945       854.6      54.8      00:14:37
 31832      10   4,135      41,350       867.2      55.6      00:14:17
 32200       7   4,135      28,945       878.0      56.3      00:14:01
 32523       9   4,135      37,215       887.4      56.9      00:13:48
 32719       5   4,135      20,675       893.0      57.2      00:13:44
 33017       7   4,135      28,945       901.5      57.8      00:13:33
 33340       7   4,135      28,945       910.7      58.4      00:13:20
 33695       6   4,135      24,810       921.0      59.0      00:13:06
 34017      10   4,135      41,350       930.2      59.6      00:12:54
 34360       7   4,135      28,945       940.3      60.3      00:12:40
 34768       5   4,135      20,675       952.1      61.0      00:12:22
 35201       5   4,135      20,675       964.5      61.8      00:12:04
 35626       4   4,135      16,540       976.7      62.6      00:11:46
 36028       6   4,135      24,810       988.0      63.3      00:11:31
 36399       9   4,135      37,215       998.7      64.0      00:11:16
 36710       4   4,135      16,540     1,007.3      64.6      00:11:05
 36933       9   4,135      37,215     1,013.6      65.0      00:10:59
 37157       8   4,135      33,080     1,019.4      65.3      00:10:54
 37473       3   4,135      12,405     1,027.7      65.9      00:10:44
 37717       7   4,135      28,945     1,034.1      66.3      00:10:37
 37913       5   4,135      20,675     1,039.6      66.6      00:10:32
 38103       4   4,135      16,540     1,044.9      67.0      00:10:28
 38347      10   4,135      41,350     1,051.9      67.4      00:10:20
 38583      10   4,135      41,350     1,058.6      67.9      00:10:12
 38918       6   4,135      24,810     1,067.9      68.4      00:10:00
 39203       6   4,135      24,810     1,075.6      68.9      00:09:51
 39501      10   4,135      41,350     1,083.8      69.5      00:09:41
 39835       7   4,135      28,945     1,092.9      70.1      00:09:30
 40298       4   4,135      16,540     1,105.5      70.9      00:09:12
 40737       8   4,135      33,080     1,117.9      71.7      00:08:55
 41057      10   4,135      41,350     1,127.0      72.2      00:08:44
 41333      10   4,135      41,350     1,134.7      72.7      00:08:35
 41611       7   4,135      28,945     1,142.6      73.2      00:08:25
 41914       8   4,135      33,080     1,151.2      73.8      00:08:15
 42193       8   4,135      33,080     1,158.3      74.2      00:08:07
 42417      10   4,135      41,350     1,164.6      74.6      00:07:60
 42677       9   4,135      37,215     1,171.6      75.1      00:07:52
 42908       5   4,135      20,675     1,178.0      75.5      00:07:45
 43183      10   4,135      41,350     1,186.0      76.0      00:07:35
 43479       9   4,135      37,215     1,194.3      76.5      00:07:25
 43799      10   4,135      41,350     1,202.9      77.1      00:07:15
 44064       4   4,135      16,540     1,210.3      77.6      00:07:06
 44266       5   4,135      20,675     1,215.7      77.9      00:07:00
 44541      10   4,135      41,350     1,223.1      78.4      00:06:52
 44794       7   4,135      28,945     1,230.1      78.8      00:06:43
 45085       9   4,135      37,215     1,238.1      79.4      00:06:34
 45409       5   4,135      20,675     1,246.4      79.9      00:06:23
 45700       8   4,135      33,080     1,253.9      80.4      00:06:14
 45993       6   4,135      24,810     1,262.0      80.9      00:06:05
 46293      10   4,135      41,350     1,270.5      81.4      00:05:54
 46581       7   4,135      28,945     1,278.5      81.9      00:05:44
 46895       9   4,135      37,215     1,287.3      82.5      00:05:34
 47128       9   4,135      37,215     1,293.0      82.9      00:05:27
 47369       4   4,135      16,540     1,299.4      83.3      00:05:20
 47634       5   4,135      20,675     1,306.5      83.7      00:05:11
 47864       6   4,135      24,810     1,312.6      84.1      00:05:04
 48096       9   4,135      37,215     1,319.1      84.5      00:04:57
 48311      10   4,135      41,350     1,325.1      84.9      00:04:50
 48563       8   4,135      33,080     1,332.1      85.4      00:04:41
 48816       7   4,135      28,945     1,338.9      85.8      00:04:33
 49025       7   4,135      28,945     1,344.6      86.2      00:04:27
 49208       5   4,135      20,675     1,350.0      86.5      00:04:21
 49414       4   4,135      16,540     1,355.2      86.9      00:04:15
 49620       8   4,135      33,080     1,360.4      87.2      00:04:09
 49821       8   4,135      33,080     1,365.7      87.5      00:04:03
 50039       9   4,135      37,215     1,371.7      87.9      00:03:56
 50279       9   4,135      37,215     1,377.9      88.3      00:03:48
 50536       4   4,135      16,540     1,384.9      88.8      00:03:40
 50769      10   4,135      41,350     1,391.4      89.2      00:03:31
 51018       8   4,135      33,080     1,398.7      89.6      00:03:23
 51267       7   4,135      28,945     1,405.4      90.1      00:03:14
 51503       7   4,135      28,945     1,412.0      90.5      00:03:06
 51745      10   4,135      41,350     1,419.1      91.0      00:02:57
 51945       3   4,135      12,405     1,424.7      91.3      00:02:51
 52255       8   4,135      33,080     1,433.9      91.9      00:02:39
 52545       7   4,135      28,945     1,442.6      92.5      00:02:28
 52842       2   4,135       8,270     1,451.6      93.0      00:02:16
 53162       8   4,135      33,080     1,460.8      93.6      00:02:05
 53477      10   4,135      41,350     1,469.8      94.2      00:01:53
 53750       5   4,135      20,675     1,477.6      94.7      00:01:44
 53976      10   4,135      41,350     1,483.7      95.1      00:01:36
 54205       8   4,135      33,080     1,490.1      95.5      00:01:28
 54436       7   4,135      28,945     1,496.1      95.9      00:01:21
 54727       8   4,135      33,080     1,503.9      96.4      00:01:11
 54990       7   4,135      28,945     1,511.0      96.8      00:01:02
 55192       4   4,135      16,540     1,516.5      97.2      00:00:55
 55401      10   4,135      41,350     1,521.9      97.5      00:00:48
 55599       8   4,135      33,080     1,527.0      97.9      00:00:42
 55800       5   4,135      20,675     1,532.6      98.2      00:00:35
 56050       6   4,135      24,810     1,539.7      98.7      00:00:26
 56319      10   4,135      41,350     1,547.4      99.2      00:00:16
 56595       4   4,135      16,540     1,555.4      99.7      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 1988.002
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100.csv saved

. 
. cap log close

. 
end of do-file
