
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed13.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A1000_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed13.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   361       6   5,035      30,210        10.5       0.6      00:30:00
   728       9   5,035      45,315        21.6       1.1      00:29:02
  1035       6   5,035      30,210        31.2       1.6      00:29:58
  1333      10   5,035      50,350        41.1       2.2      00:30:15
  1624       7   5,035      35,245        50.8       2.7      00:30:24
  1923       6   5,035      30,210        60.2       3.2      00:30:37
  2219      10   5,035      50,350        69.9       3.7      00:30:35
  2519       9   5,035      45,315        79.2       4.2      00:30:42
  2799       8   5,035      40,280        88.6       4.7      00:30:43
  3097       7   5,035      35,245        98.1       5.2      00:30:40
  3372       6   5,035      30,210       107.7       5.7      00:30:35
  3647       8   5,035      40,280       116.8       6.1      00:30:36
  3908       7   5,035      35,245       125.3       6.6      00:30:45
  4123       3   5,035      15,105       131.9       6.9      00:31:21
  4328       5   5,035      25,175       138.2       7.3      00:31:57
  4522       4   5,035      20,140       144.4       7.6      00:32:29
  4706       7   5,035      35,245       150.8       7.9      00:32:57
  4919       3   5,035      15,105       157.6       8.3      00:33:14
  5119       3   5,035      15,105       164.1       8.6      00:33:34
  5320      10   5,035      50,350       170.7       9.0      00:33:51
  5534       7   5,035      35,245       177.3       9.3      00:34:05
  5744       9   5,035      45,315       183.9       9.7      00:34:19
  5959       8   5,035      40,280       190.8      10.0      00:34:26
  6171      10   5,035      50,350       197.6      10.4      00:34:33
  6359       9   5,035      45,315       203.6      10.7      00:34:48
  6558       5   5,035      25,175       210.0      11.1      00:34:58
  6759       5   5,035      25,175       216.3      11.4      00:35:07
  6964       7   5,035      35,245       222.9      11.7      00:35:12
  7221       6   5,035      30,210       230.9      12.2      00:35:01
  7480      10   5,035      50,350       239.7      12.6      00:34:44
  7752       7   5,035      35,245       248.5      13.1      00:34:26
  8006      10   5,035      50,350       257.4      13.5      00:34:08
  8252       6   5,035      30,210       265.8      14.0      00:33:54
  8488       7   5,035      35,245       274.1      14.4      00:33:42
  8731       9   5,035      45,315       282.4      14.9      00:33:31
  8949       8   5,035      40,280       290.0      15.3      00:33:24
  9167       8   5,035      40,280       297.5      15.7      00:33:19
  9347       5   5,035      25,175       303.5      16.0      00:33:24
  9542       6   5,035      30,210       310.4      16.3      00:33:23
  9739       9   5,035      45,315       317.4      16.7      00:33:20
  9961       4   5,035      20,140       324.7      17.1      00:33:15
 10177       8   5,035      40,280       331.2      17.4      00:33:15
 10365       7   5,035      35,245       337.2      17.7      00:33:19
 10578       6   5,035      30,210       344.0      18.1      00:33:15
 10811       5   5,035      25,175       351.5      18.5      00:33:08
 11034       5   5,035      25,175       358.9      18.9      00:33:01
 11241       2   5,035      10,070       365.6      19.2      00:32:58
 11430       5   5,035      25,175       372.0      19.6      00:32:57
 11623       8   5,035      40,280       378.2      19.9      00:32:57
 11831       6   5,035      30,210       385.1      20.3      00:32:52
 12044      10   5,035      50,350       392.1      20.6      00:32:46
 12253       7   5,035      35,245       399.1      21.0      00:32:41
 12497       6   5,035      30,210       407.0      21.4      00:32:29
 12784       6   5,035      30,210       416.1      21.9      00:32:11
 13068       9   5,035      45,315       425.4      22.4      00:31:52
 13347       8   5,035      40,280       434.7      22.9      00:31:33
 13583      10   5,035      50,350       443.1      23.3      00:31:19
 13781       7   5,035      35,245       449.6      23.7      00:31:16
 14002       8   5,035      40,280       456.7      24.0      00:31:09
 14226       8   5,035      40,280       464.3      24.4      00:30:60
 14437       6   5,035      30,210       471.6      24.8      00:30:53
 14665       7   5,035      35,245       479.2      25.2      00:30:43
 14901       6   5,035      30,210       487.0      25.6      00:30:32
 15170       9   5,035      45,315       496.5      26.1      00:30:14
 15442       9   5,035      45,315       505.5      26.6      00:29:58
 15719       7   5,035      35,245       514.7      27.1      00:29:41
 15988       8   5,035      40,280       524.1      27.6      00:29:23
 16257       8   5,035      40,280       533.6      28.1      00:29:06
 16513       7   5,035      35,245       542.5      28.6      00:28:51
 16726       2   5,035      10,070       549.4      28.9      00:28:45
 16914       6   5,035      30,210       555.7      29.3      00:28:42
 17099       8   5,035      40,280       561.9      29.6      00:28:39
 17275       6   5,035      30,210       567.9      29.9      00:28:37
 17440       9   5,035      45,315       573.7      30.2      00:28:35
 17601       8   5,035      40,280       579.5      30.5      00:28:34
 17825       6   5,035      30,210       586.8      30.9      00:28:26
 18047       8   5,035      40,280       594.3      31.3      00:28:16
 18317       5   5,035      25,175       603.5      31.8      00:28:00
 18543       9   5,035      45,315       610.7      32.1      00:27:52
 18705       6   5,035      30,210       616.5      32.4      00:27:50
 18889      10   5,035      50,350       622.8      32.8      00:27:46
 19097       9   5,035      45,315       630.1      33.2      00:27:37
 19316       8   5,035      40,280       637.7      33.6      00:27:27
 19594      10   5,035      50,350       647.4      34.1      00:27:10
 19856       9   5,035      45,315       656.7      34.6      00:26:54
 20104       8   5,035      40,280       665.6      35.0      00:26:39
 20391       8   5,035      40,280       675.2      35.5      00:26:22
 20584       4   5,035      20,140       681.9      35.9      00:26:16
 20776       6   5,035      30,210       688.4      36.2      00:26:11
 20950       9   5,035      45,315       694.5      36.6      00:26:07
 21167       9   5,035      45,315       701.4      36.9      00:25:59
 21371       2   5,035      10,070       707.5      37.2      00:25:55
 21558       3   5,035      15,105       713.6      37.6      00:25:50
 21754       7   5,035      35,245       719.5      37.9      00:25:46
 21955       8   5,035      40,280       726.2      38.2      00:25:40
 22158       6   5,035      30,210       732.3      38.5      00:25:35
 22367       7   5,035      35,245       738.9      38.9      00:25:28
 22563       7   5,035      35,245       745.2      39.2      00:25:23
 22791       4   5,035      20,140       752.1      39.6      00:25:15
 23055      10   5,035      50,350       760.9      40.1      00:25:01
 23311       7   5,035      35,245       769.5      40.5      00:24:48
 23593       8   5,035      40,280       778.2      41.0      00:24:34
 23868       9   5,035      45,315       787.5      41.5      00:24:19
 24146       8   5,035      40,280       796.2      41.9      00:24:05
 24425      10   5,035      50,350       805.1      42.4      00:23:52
 24664      10   5,035      50,350       813.4      42.8      00:23:40
 24864       8   5,035      40,280       819.9      43.2      00:23:33
 25097       8   5,035      40,280       827.7      43.6      00:23:23
 25337       6   5,035      30,210       835.6      44.0      00:23:12
 25600       5   5,035      25,175       844.2      44.4      00:22:59
 25773      10   5,035      50,350       850.3      44.8      00:22:54
 25959       8   5,035      40,280       856.4      45.1      00:22:48
 26172       5   5,035      25,175       863.6      45.5      00:22:40
 26418       7   5,035      35,245       871.6      45.9      00:22:28
 26679      10   5,035      50,350       880.0      46.3      00:22:16
 26909       5   5,035      25,175       887.7      46.7      00:22:06
 27103       8   5,035      40,280       894.2      47.1      00:21:60
 27287       5   5,035      25,175       900.3      47.4      00:21:54
 27495       6   5,035      30,210       907.2      47.8      00:21:45
 27712       7   5,035      35,245       914.5      48.1      00:21:36
 27959       6   5,035      30,210       923.0      48.6      00:21:24
 28231       7   5,035      35,245       932.1      49.1      00:21:10
 28481       8   5,035      40,280       941.0      49.5      00:20:57
 28687      10   5,035      50,350       948.1      49.9      00:20:48
 28864      10   5,035      50,350       954.3      50.2      00:20:42
 29051       8   5,035      40,280       960.7      50.6      00:20:35
 29274       5   5,035      25,175       968.0      51.0      00:20:26
 29486       3   5,035      15,105       975.3      51.3      00:20:17
 29710       9   5,035      45,315       982.8      51.7      00:20:07
 29853       9   5,035      45,315       987.7      52.0      00:20:04
 30015       5   5,035      25,175       993.2      52.3      00:19:59
 30184      10   5,035      50,350       999.0      52.6      00:19:53
 30376       7   5,035      35,245     1,005.4      52.9      00:19:46
 30566      10   5,035      50,350     1,012.2      53.3      00:19:38
 30816      10   5,035      50,350     1,020.9      53.7      00:19:25
 31085       8   5,035      40,280     1,029.7      54.2      00:19:12
 31363       8   5,035      40,280     1,039.4      54.7      00:18:57
 31644       7   5,035      35,245     1,049.3      55.2      00:18:42
 31922       7   5,035      35,245     1,059.2      55.8      00:18:26
 32190       9   5,035      45,315     1,068.8      56.3      00:18:12
 32441       8   5,035      40,280     1,077.8      56.7      00:17:58
 32614      10   5,035      50,350     1,083.7      57.0      00:17:52
 32781       9   5,035      45,315     1,089.5      57.3      00:17:46
 32955       9   5,035      45,315     1,095.6      57.7      00:17:40
 33139       4   5,035      20,140     1,102.0      58.0      00:17:33
 33362       5   5,035      25,175     1,109.7      58.4      00:17:22
 33597       8   5,035      40,280     1,118.1      58.9      00:17:11
 33817       9   5,035      45,315     1,125.7      59.3      00:17:00
 34045      10   5,035      50,350     1,133.7      59.7      00:16:50
 34282       5   5,035      25,175     1,142.4      60.1      00:16:37
 34581       9   5,035      45,315     1,152.6      60.7      00:16:21
 34852       9   5,035      45,315     1,162.3      61.2      00:16:07
 35147      10   5,035      50,350     1,172.6      61.7      00:15:51
 35435       7   5,035      35,245     1,182.7      62.3      00:15:36
 35719       7   5,035      35,245     1,192.3      62.8      00:15:22
 35998       9   5,035      45,315     1,202.1      63.3      00:15:08
 36274       8   5,035      40,280     1,211.8      63.8      00:14:54
 36545      10   5,035      50,350     1,221.0      64.3      00:14:41
 36741       7   5,035      35,245     1,227.5      64.6      00:14:33
 36911       6   5,035      30,210     1,233.5      64.9      00:14:27
 37111       4   5,035      20,140     1,239.9      65.3      00:14:19
 37325       9   5,035      45,315     1,246.5      65.6      00:14:11
 37515       7   5,035      35,245     1,252.6      65.9      00:14:04
 37704       9   5,035      45,315     1,258.8      66.3      00:13:57
 37906      10   5,035      50,350     1,265.7      66.6      00:13:49
 38103       4   5,035      20,140     1,272.3      67.0      00:13:41
 38317       7   5,035      35,245     1,279.7      67.4      00:13:31
 38518       6   5,035      30,210     1,286.8      67.7      00:13:22
 38779       7   5,035      35,245     1,295.6      68.2      00:13:10
 38988       7   5,035      35,245     1,302.8      68.6      00:13:01
 39139       7   5,035      35,245     1,307.8      68.8      00:12:56
 39321       5   5,035      25,175     1,313.8      69.2      00:12:49
 39505       8   5,035      40,280     1,319.8      69.5      00:12:42
 39715       9   5,035      45,315     1,326.7      69.8      00:12:34
 39954       5   5,035      25,175     1,334.8      70.3      00:12:23
 40227       9   5,035      45,315     1,343.8      70.7      00:12:10
 40490      10   5,035      50,350     1,352.8      71.2      00:11:58
 40755       7   5,035      35,245     1,362.0      71.7      00:11:45
 40984       8   5,035      40,280     1,370.0      72.1      00:11:34
 41143       8   5,035      40,280     1,375.2      72.4      00:11:28
 41334       6   5,035      30,210     1,381.8      72.7      00:11:20
 41532       7   5,035      35,245     1,388.5      73.1      00:11:12
 41740       5   5,035      25,175     1,395.6      73.5      00:11:03
 41940       9   5,035      45,315     1,402.6      73.8      00:10:54
 42108       4   5,035      20,140     1,407.8      74.1      00:10:48
 42285       7   5,035      35,245     1,413.3      74.4      00:10:42
 42449       7   5,035      35,245     1,419.1      74.7      00:10:35
 42613       9   5,035      45,315     1,424.4      75.0      00:10:29
 42804       6   5,035      30,210     1,430.8      75.3      00:10:21
 42975      10   5,035      50,350     1,436.7      75.6      00:10:14
 43142       7   5,035      35,245     1,442.7      75.9      00:10:07
 43308      10   5,035      50,350     1,448.4      76.2      00:10:00
 43471       7   5,035      35,245     1,454.0      76.5      00:09:53
 43734       8   5,035      40,280     1,462.5      77.0      00:09:42
 44008       3   5,035      15,105     1,471.7      77.5      00:09:29
 44190       8   5,035      40,280     1,477.9      77.8      00:09:21
 44392       8   5,035      40,280     1,484.2      78.1      00:09:13
 44582       3   5,035      15,105     1,490.7      78.5      00:09:05
 44789       7   5,035      35,245     1,497.7      78.8      00:08:56
 45006      10   5,035      50,350     1,505.0      79.2      00:08:46
 45270       5   5,035      25,175     1,513.3      79.7      00:08:35
 45476       6   5,035      30,210     1,519.9      80.0      00:08:26
 45689       8   5,035      40,280     1,526.5      80.4      00:08:18
 45922      10   5,035      50,350     1,534.2      80.8      00:08:08
 46134       7   5,035      35,245     1,541.4      81.1      00:07:58
 46342       7   5,035      35,245     1,548.7      81.5      00:07:48
 46569       7   5,035      35,245     1,556.3      81.9      00:07:38
 46841       9   5,035      45,315     1,565.6      82.4      00:07:25
 47077       7   5,035      35,245     1,573.0      82.8      00:07:15
 47305       6   5,035      30,210     1,580.1      83.2      00:07:06
 47523       6   5,035      30,210     1,587.0      83.5      00:06:57
 47709      10   5,035      50,350     1,593.4      83.9      00:06:49
 47901       6   5,035      30,210     1,599.6      84.2      00:06:41
 48079       8   5,035      40,280     1,605.7      84.5      00:06:33
 48281       7   5,035      35,245     1,612.5      84.9      00:06:24
 48510       9   5,035      45,315     1,620.2      85.3      00:06:14
 48741       7   5,035      35,245     1,627.9      85.7      00:06:03
 48975      10   5,035      50,350     1,635.6      86.1      00:05:53
 49168       7   5,035      35,245     1,642.5      86.5      00:05:44
 49361      10   5,035      50,350     1,648.5      86.8      00:05:36
 49566       7   5,035      35,245     1,655.0      87.1      00:05:28
 49738       7   5,035      35,245     1,660.3      87.4      00:05:21
 49926       9   5,035      45,315     1,666.4      87.7      00:05:13
 50121       4   5,035      20,140     1,672.9      88.1      00:05:05
 50318      10   5,035      50,350     1,679.1      88.4      00:04:57
 50509       5   5,035      25,175     1,685.4      88.7      00:04:48
 50705      10   5,035      50,350     1,692.0      89.1      00:04:40
 50900       6   5,035      30,210     1,698.8      89.4      00:04:30
 51107       7   5,035      35,245     1,705.9      89.8      00:04:21
 51330       6   5,035      30,210     1,713.4      90.2      00:04:11
 51539       9   5,035      45,315     1,720.6      90.6      00:04:01
 51742      10   5,035      50,350     1,727.9      91.0      00:03:51
 51958       9   5,035      45,315     1,735.3      91.3      00:03:42
 52224       7   5,035      35,245     1,745.0      91.9      00:03:28
 52496       8   5,035      40,280     1,754.9      92.4      00:03:15
 52763       9   5,035      45,315     1,764.7      92.9      00:03:01
 53049       3   5,035      15,105     1,774.8      93.4      00:02:47
 53348       7   5,035      35,245     1,785.2      94.0      00:02:33
 53637       8   5,035      40,280     1,795.3      94.5      00:02:20
 53861       6   5,035      30,210     1,802.9      94.9      00:02:09
 54077       4   5,035      20,140     1,810.0      95.3      00:01:60
 54279       6   5,035      30,210     1,817.0      95.6      00:01:51
 54512       7   5,035      35,245     1,824.0      96.0      00:01:41
 54748      10   5,035      50,350     1,832.0      96.4      00:01:31
 55007       8   5,035      40,280     1,840.4      96.9      00:01:19
 55268       8   5,035      40,280     1,849.0      97.3      00:01:08
 55509       9   5,035      45,315     1,856.5      97.7      00:00:58
 55717      10   5,035      50,350     1,863.5      98.1      00:00:48
 55946       6   5,035      30,210     1,871.3      98.5      00:00:38
 56174       8   5,035      40,280     1,879.2      98.9      00:00:28
 56378       8   5,035      40,280     1,886.3      99.3      00:00:18
 56598       8   5,035      40,280     1,894.0      99.7      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 2545.136
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed13.csv sav
> ed

. 
. cap log close

. 
end of do-file
