
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl.dta /export/storage_covidvaccine/Result/MNL_part
> ial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_m
> nl.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   9 Apr 2024, 18:32:20

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   547       5   4,035      20,175        12.7       0.8      00:19:50
  1158       9   4,035      36,315        28.1       1.8      00:17:44
  1725       9   4,035      36,315        43.2       2.8      00:17:08
  2300       9   4,035      36,315        57.9       3.8      00:16:53
  2855       7   4,035      28,245        72.4       4.7      00:16:43
  3389       6   4,035      24,210        86.5       5.7      00:16:37
  3897       3   4,035      12,105       100.0       6.6      00:16:37
  4350       9   4,035      36,315       111.1       7.3      00:16:57
  4797       6   4,035      24,210       123.0       8.1      00:17:05
  5221      10   4,035      40,350       134.1       8.8      00:17:17
  5612       6   4,035      24,210       143.8       9.4      00:17:36
  5759       9   4,035      36,315       147.5       9.7      00:18:41
  5963       8   4,035      32,280       152.8      10.0      00:19:27
  6165      10   4,035      40,350       158.1      10.4      00:20:10
  6373       9   4,035      36,315       163.3      10.7      00:20:51
  6569       3   4,035      12,105       168.4      11.1      00:21:29
  6741       6   4,035      24,210       172.7      11.3      00:22:12
  6918      10   4,035      40,350       177.3      11.6      00:22:48
  7132       6   4,035      24,210       182.9      12.0      00:23:15
  7369       7   4,035      28,245       188.9      12.4      00:23:35
  7602      10   4,035      40,350       195.2      12.8      00:23:52
  7809       6   4,035      24,210       200.6      13.2      00:24:14
  7988       9   4,035      36,315       205.7      13.5      00:24:36
  8185       8   4,035      32,280       211.2      13.9      00:24:54
  8382       8   4,035      32,280       216.5      14.2      00:25:12
  8601       7   4,035      28,245       222.6      14.6      00:25:23
  9060       7   4,035      28,245       235.1      15.4      00:24:42
  9438       9   4,035      36,315       245.6      16.1      00:24:19
  9839       6   4,035      24,210       256.9      16.9      00:23:53
 10251       6   4,035      24,210       267.1      17.5      00:23:34
 10685       7   4,035      28,245       278.3      18.3      00:23:09
 11117       8   4,035      32,280       289.6      19.0      00:22:46
 11455      10   4,035      40,350       298.6      19.6      00:22:36
 11831       9   4,035      36,315       308.4      20.2      00:22:22
 12231       3   4,035      12,105       319.1      20.9      00:22:03
 12702       6   4,035      24,210       331.4      21.8      00:21:37
 13211       6   4,035      24,210       344.5      22.6      00:21:08
 13716       6   4,035      24,210       358.5      23.5      00:20:37
 14254      10   4,035      40,350       372.7      24.5      00:20:06
 14773       8   4,035      32,280       386.7      25.4      00:19:38
 15270       9   4,035      36,315       400.3      26.3      00:19:12
 15783       7   4,035      28,245       414.1      27.2      00:18:47
 16286       6   4,035      24,210       428.2      28.1      00:18:22
 16740       7   4,035      28,245       440.5      28.9      00:18:04
 17102       4   4,035      16,140       450.3      29.6      00:17:54
 17458       7   4,035      28,245       460.0      30.2      00:17:45
 17810       5   4,035      20,175       469.6      30.8      00:17:37
 18160       5   4,035      20,175       479.2      31.5      00:17:28
 18525       7   4,035      28,245       488.7      32.1      00:17:19
 18975       6   4,035      24,210       501.3      32.9      00:17:01
 19435       7   4,035      28,245       514.1      33.7      00:16:43
 19894       6   4,035      24,210       527.1      34.6      00:16:25
 20403       7   4,035      28,245       541.2      35.5      00:16:04
 20782       8   4,035      32,280       551.6      36.2      00:15:53
 21178       9   4,035      36,315       562.2      36.9      00:15:42
 21558      10   4,035      40,350       571.8      37.5      00:15:34
 21986       9   4,035      36,315       582.5      38.2      00:15:22
 22396       3   4,035      12,105       592.6      38.9      00:15:13
 22786       6   4,035      24,210       602.5      39.5      00:15:03
 23186      10   4,035      40,350       613.0      40.2      00:14:53
 23616       8   4,035      32,280       624.0      41.0      00:14:41
 24055       8   4,035      32,280       635.8      41.7      00:14:27
 24580       7   4,035      28,245       649.2      42.6      00:14:10
 25108       9   4,035      36,315       663.3      43.5      00:13:51
 25594       6   4,035      24,210       676.3      44.4      00:13:36
 25957       3   4,035      12,105       686.1      45.0      00:13:27
 26307       4   4,035      16,140       695.5      45.7      00:13:19
 26692       7   4,035      28,245       705.2      46.3      00:13:10
 27074       7   4,035      28,245       715.5      47.0      00:13:00
 27378       9   4,035      36,315       723.6      47.5      00:12:55
 27743       6   4,035      24,210       733.4      48.1      00:12:46
 28211       5   4,035      20,175       746.2      49.0      00:12:31
 28676       5   4,035      20,175       759.2      49.8      00:12:16
 29011       8   4,035      32,280       768.5      50.4      00:12:08
 29455       8   4,035      32,280       780.5      51.2      00:11:55
 29861       5   4,035      20,175       791.5      51.9      00:11:44
 30236       7   4,035      28,245       801.7      52.6      00:11:34
 30688       8   4,035      32,280       814.2      53.4      00:11:21
 31199       6   4,035      24,210       828.1      54.4      00:11:04
 31689       7   4,035      28,245       841.8      55.2      00:10:49
 32172       9   4,035      36,315       855.5      56.2      00:10:33
 32617       8   4,035      32,280       868.1      57.0      00:10:20
 32964      10   4,035      40,350       877.8      57.6      00:10:11
 33357       8   4,035      32,280       888.9      58.3      00:10:01
 33812       5   4,035      20,175       901.6      59.2      00:09:47
 34254       5   4,035      20,175       914.2      60.0      00:09:34
 34759       8   4,035      32,280       928.4      60.9      00:09:19
 35268       7   4,035      28,245       942.7      61.9      00:09:03
 35787       6   4,035      24,210       957.1      62.8      00:08:48
 36307       8   4,035      32,280       971.6      63.8      00:08:32
 36765       8   4,035      32,280       984.1      64.6      00:08:20
 37188       9   4,035      36,315       995.2      65.3      00:08:09
 37575       8   4,035      32,280     1,005.2      66.0      00:08:00
 37964       4   4,035      16,140     1,015.5      66.7      00:07:51
 38321       7   4,035      28,245     1,025.3      67.3      00:07:42
 38668      10   4,035      40,350     1,034.9      67.9      00:07:34
 39028       4   4,035      16,140     1,044.8      68.6      00:07:25
 39428       3   4,035      12,105     1,055.3      69.3      00:07:16
 39866       7   4,035      28,245     1,067.0      70.0      00:07:04
 40394       6   4,035      24,210     1,081.0      71.0      00:06:50
 40899       3   4,035      12,105     1,095.0      71.9      00:06:36
 41291       9   4,035      36,315     1,105.9      72.6      00:06:26
 41715       9   4,035      36,315     1,117.4      73.3      00:06:15
 42108       8   4,035      32,280     1,127.9      74.0      00:06:05
 42511       8   4,035      32,280     1,138.6      74.7      00:05:56
 42909       7   4,035      28,245     1,149.2      75.4      00:05:46
 43304       8   4,035      32,280     1,160.3      76.2      00:05:35
 43703      10   4,035      40,350     1,170.8      76.8      00:05:26
 44084       5   4,035      20,175     1,181.1      77.5      00:05:16
 44534       7   4,035      28,245     1,193.0      78.3      00:05:05
 44966       9   4,035      36,315     1,204.7      79.1      00:04:54
 45419       6   4,035      24,210     1,216.2      79.8      00:04:43
 45817       4   4,035      16,140     1,226.5      80.5      00:04:34
 46226      10   4,035      40,350     1,237.6      81.2      00:04:24
 46641       8   4,035      32,280     1,248.9      82.0      00:04:13
 47062       8   4,035      32,280     1,259.9      82.7      00:04:03
 47442       7   4,035      28,245     1,269.6      83.3      00:03:54
 47816       5   4,035      20,175     1,279.4      84.0      00:03:46
 48191       6   4,035      24,210     1,289.4      84.6      00:03:36
 48587       9   4,035      36,315     1,300.2      85.3      00:03:26
 49012       9   4,035      36,315     1,311.5      86.1      00:03:16
 49465      10   4,035      40,350     1,323.6      86.9      00:03:05
 50032       2   4,035       8,070     1,338.0      87.8      00:02:51
 50497       5   4,035      20,175     1,349.9      88.6      00:02:40
 50929       5   4,035      20,175     1,361.8      89.4      00:02:29
 51254       1   4,035       4,035     1,370.6      90.0      00:02:21
 51601       5   4,035      20,175     1,380.2      90.6      00:02:12
 51979       4   4,035      16,140     1,390.8      91.3      00:02:02
 52356       9   4,035      36,315     1,401.7      92.0      00:01:52
 52738       9   4,035      36,315     1,413.0      92.7      00:01:42
 53136       7   4,035      28,245     1,424.3      93.5      00:01:31
 53622       6   4,035      24,210     1,437.9      94.4      00:01:19
 54015       7   4,035      28,245     1,448.6      95.1      00:01:09
 54401       4   4,035      16,140     1,458.9      95.8      00:00:59
 54851       7   4,035      28,245     1,470.4      96.5      00:00:49
 55266       9   4,035      36,315     1,481.5      97.2      00:00:39
 55664      10   4,035      40,350     1,491.5      97.9      00:00:29
 56046       9   4,035      36,315     1,502.1      98.6      00:00:20
 56446       5   4,035      20,175     1,513.2      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1405.628
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
