
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M10_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_10_4q_mnl_A500.dta /export/storage_covidvaccine/Result/M
> NL_partial_new/M10_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_1000
> 0_10_4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M10_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_10_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M10_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_10_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   331       5   4,535      22,675         8.7       0.5      00:32:33
   705       5   4,535      22,675        18.8       1.1      00:30:06
  1099       7   4,535      31,745        30.0       1.8      00:28:06
  1482       8   4,535      36,280        41.5       2.4      00:26:52
  1899       9   4,535      40,815        53.5       3.1      00:25:52
  2357       6   4,535      27,210        66.8       3.9      00:24:39
  2781       9   4,535      40,815        79.3       4.6      00:24:02
  3154       8   4,535      36,280        90.3       5.3      00:23:59
  3541       6   4,535      27,210       102.0       6.0      00:23:41
  3847      10   4,535      45,350       111.1       6.5      00:24:01
  4106      10   4,535      45,350       118.4       6.9      00:24:42
  4348       8   4,535      36,280       125.0       7.3      00:25:25
  4559       8   4,535      36,280       131.3       7.7      00:26:07
  4718      10   4,535      45,350       136.2       8.0      00:27:02
  4940       9   4,535      40,815       142.6       8.3      00:27:33
  5164       5   4,535      22,675       149.2       8.7      00:27:59
  5305       8   4,535      36,280       153.3       9.0      00:28:51
  5449       7   4,535      31,745       157.6       9.2      00:29:39
  5589       1   4,535       4,535       161.2       9.4      00:30:31
  5798       4   4,535      18,140       167.1       9.8      00:30:52
  6082       8   4,535      36,280       175.6      10.3      00:30:41
  6354       9   4,535      40,815       183.2      10.7      00:30:39
  6585       3   4,535      13,605       189.9      11.1      00:30:46
  6808       7   4,535      31,745       196.3      11.5      00:30:56
  7054       6   4,535      27,210       203.3      11.9      00:30:58
  7348      10   4,535      45,350       211.9      12.4      00:30:44
  7579       9   4,535      40,815       218.8      12.8      00:30:46
  7860       8   4,535      36,280       227.2      13.3      00:30:33
  8124       6   4,535      27,210       235.5      13.8      00:30:21
  8384       8   4,535      36,280       243.6      14.2      00:30:11
  8632       8   4,535      36,280       251.3      14.7      00:30:05
  8886      10   4,535      45,350       259.1      15.1      00:29:57
  9170       8   4,535      36,280       268.0      15.7      00:29:41
  9378       9   4,535      40,815       274.3      16.0      00:29:45
  9594       8   4,535      36,280       281.2      16.4      00:29:44
  9816       9   4,535      40,815       288.2      16.8      00:29:42
 10020       7   4,535      31,745       294.1      17.2      00:29:47
 10227       4   4,535      18,140       299.7      17.5      00:29:54
 10430       8   4,535      36,280       305.7      17.9      00:29:58
 10666       6   4,535      27,210       312.5      18.3      00:29:55
 10923       8   4,535      36,280       320.0      18.7      00:29:47
 11164      10   4,535      45,350       327.1      19.1      00:29:42
 11365       4   4,535      18,140       333.0      19.5      00:29:44
 11532       7   4,535      31,745       337.9      19.7      00:29:52
 11731       7   4,535      31,745       343.7      20.1      00:29:55
 12020      10   4,535      45,350       352.5      20.6      00:29:38
 12230       7   4,535      31,745       358.8      21.0      00:29:36
 12535       7   4,535      31,745       367.8      21.5      00:29:17
 12921       5   4,535      22,675       378.7      22.1      00:28:48
 13257      10   4,535      45,350       388.7      22.7      00:28:25
 13584      10   4,535      45,350       399.1      23.3      00:28:01
 13840       9   4,535      40,815       406.7      23.8      00:27:52
 14084       6   4,535      27,210       413.8      24.2      00:27:46
 14338       6   4,535      27,210       421.7      24.6      00:27:35
 14545      10   4,535      45,350       428.1      25.0      00:27:33
 14759       8   4,535      36,280       434.4      25.4      00:27:30
 15031       6   4,535      27,210       442.8      25.9      00:27:17
 15339       7   4,535      31,745       452.3      26.4      00:26:59
 15654       9   4,535      40,815       461.6      27.0      00:26:41
 15966      10   4,535      45,350       471.4      27.5      00:26:22
 16288       5   4,535      22,675       481.5      28.1      00:26:02
 16577       9   4,535      40,815       490.4      28.7      00:25:47
 16787      10   4,535      45,350       496.8      29.0      00:25:44
 16944       8   4,535      36,280       501.6      29.3      00:25:48
 17150       7   4,535      31,745       507.6      29.7      00:25:45
 17381       7   4,535      31,745       514.9      30.1      00:25:37
 17615       9   4,535      40,815       522.4      30.5      00:25:29
 17937       7   4,535      31,745       531.9      31.1      00:25:12
 18333      10   4,535      45,350       544.1      31.8      00:24:44
 18598       9   4,535      40,815       551.8      32.2      00:24:35
 18782       7   4,535      31,745       557.6      32.6      00:24:33
 18962       7   4,535      31,745       563.3      32.9      00:24:31
 19129       9   4,535      40,815       568.6      33.2      00:24:31
 19317       6   4,535      27,210       574.4      33.6      00:24:28
 19604       6   4,535      27,210       583.4      34.1      00:24:14
 19932       7   4,535      31,745       594.0      34.7      00:23:53
 20276       6   4,535      27,210       604.6      35.3      00:23:33
 20560       5   4,535      22,675       613.4      35.9      00:23:19
 20810       5   4,535      22,675       621.1      36.3      00:23:10
 21036       6   4,535      27,210       627.9      36.7      00:23:03
 21279       6   4,535      27,210       634.6      37.1      00:22:57
 21561       8   4,535      36,280       642.9      37.6      00:22:46
 21784       7   4,535      31,745       649.0      37.9      00:22:42
 21961       7   4,535      31,745       654.2      38.2      00:22:41
 22119       4   4,535      18,140       658.5      38.5      00:22:42
 22382       7   4,535      31,745       665.9      38.9      00:22:33
 22646       7   4,535      31,745       673.7      39.4      00:22:23
 22947       7   4,535      31,745       682.0      39.9      00:22:11
 23299       9   4,535      40,815       692.7      40.5      00:21:52
 23689       8   4,535      36,280       703.8      41.1      00:21:32
 24023       5   4,535      22,675       713.8      41.7      00:21:15
 24348       5   4,535      22,675       722.8      42.2      00:21:01
 24695       5   4,535      22,675       733.5      42.9      00:20:43
 25066       9   4,535      40,815       744.5      43.5      00:20:23
 25422       6   4,535      27,210       755.3      44.1      00:20:05
 25699       7   4,535      31,745       763.4      44.6      00:19:55
 25963       4   4,535      18,140       771.5      45.1      00:19:44
 26260       2   4,535       9,070       780.6      45.6      00:19:31
 26596      10   4,535      45,350       790.3      46.2      00:19:17
 26913       9   4,535      40,815       799.7      46.7      00:19:03
 27181       8   4,535      36,280       807.7      47.2      00:18:52
 27444       6   4,535      27,210       815.6      47.7      00:18:43
 27646       9   4,535      40,815       821.7      48.0      00:18:38
 27849       6   4,535      27,210       828.0      48.4      00:18:32
 28163       8   4,535      36,280       837.6      48.9      00:18:18
 28485      10   4,535      45,350       847.7      49.5      00:18:02
 28717       5   4,535      22,675       855.0      50.0      00:17:54
 28918       7   4,535      31,745       861.2      50.3      00:17:48
 29115      10   4,535      45,350       867.3      50.7      00:17:43
 29340       7   4,535      31,745       874.0      51.1      00:17:36
 29560       8   4,535      36,280       880.6      51.5      00:17:30
 29737       6   4,535      27,210       886.1      51.8      00:17:25
 29883       5   4,535      22,675       890.5      52.0      00:17:24
 30071      10   4,535      45,350       896.3      52.4      00:17:19
 30284       7   4,535      31,745       902.9      52.8      00:17:12
 30469       5   4,535      22,675       908.7      53.1      00:17:07
 30702       7   4,535      31,745       915.8      53.5      00:16:59
 30994       9   4,535      40,815       924.8      54.0      00:16:46
 31298       6   4,535      27,210       934.2      54.6      00:16:32
 31565       8   4,535      36,280       942.6      55.1      00:16:21
 31863       5   4,535      22,675       952.2      55.6      00:16:07
 32155       8   4,535      36,280       961.4      56.2      00:15:54
 32466       8   4,535      36,280       971.6      56.8      00:15:39
 32718       9   4,535      40,815       979.3      57.2      00:15:29
 32914       6   4,535      27,210       985.5      57.6      00:15:23
 33080       7   4,535      31,745       990.8      57.9      00:15:18
 33292      10   4,535      45,350       997.4      58.3      00:15:11
 33494      10   4,535      45,350     1,003.7      58.7      00:15:05
 33731      10   4,535      45,350     1,011.2      59.1      00:14:55
 33935       8   4,535      36,280     1,017.7      59.5      00:14:48
 34138       5   4,535      22,675     1,024.2      59.9      00:14:41
 34413       6   4,535      27,210     1,032.9      60.4      00:14:29
 34701       7   4,535      31,745     1,042.0      60.9      00:14:16
 35017       8   4,535      36,280     1,052.0      61.5      00:14:02
 35316       9   4,535      40,815     1,061.4      62.0      00:13:48
 35616       5   4,535      22,675     1,070.8      62.6      00:13:35
 35891      10   4,535      45,350     1,079.4      63.1      00:13:24
 36193       5   4,535      22,675     1,088.8      63.6      00:13:11
 36470       7   4,535      31,745     1,097.6      64.1      00:12:59
 36649       7   4,535      31,745     1,103.0      64.5      00:12:54
 36803       8   4,535      36,280     1,107.5      64.7      00:12:50
 36995      10   4,535      45,350     1,113.3      65.1      00:12:44
 37212       7   4,535      31,745     1,119.5      65.4      00:12:38
 37413       2   4,535       9,070     1,125.3      65.8      00:12:32
 37554       6   4,535      27,210     1,129.6      66.0      00:12:28
 37703       9   4,535      40,815     1,133.8      66.3      00:12:25
 37915      10   4,535      45,350     1,140.2      66.6      00:12:18
 38162       6   4,535      27,210     1,147.9      67.1      00:12:08
 38435      10   4,535      45,350     1,156.4      67.6      00:11:57
 38740       9   4,535      40,815     1,165.9      68.1      00:11:43
 38978      10   4,535      45,350     1,173.2      68.6      00:11:34
 39167       4   4,535      18,140     1,178.7      68.9      00:11:28
 39360       6   4,535      27,210     1,184.5      69.2      00:11:22
 39555       8   4,535      36,280     1,190.3      69.6      00:11:16
 39791       7   4,535      31,745     1,197.3      70.0      00:11:07
 40115       9   4,535      40,815     1,207.0      70.5      00:10:53
 40449       8   4,535      36,280     1,217.2      71.1      00:10:39
 40717       8   4,535      36,280     1,225.5      71.6      00:10:28
 40956      10   4,535      45,350     1,233.1      72.1      00:10:18
 41116       8   4,535      36,280     1,237.9      72.3      00:10:13
 41292       9   4,535      40,815     1,243.3      72.7      00:10:07
 41488       7   4,535      31,745     1,249.3      73.0      00:10:01
 41689       7   4,535      31,745     1,255.4      73.4      00:09:53
 41915       6   4,535      27,210     1,262.6      73.8      00:09:44
 42095       9   4,535      40,815     1,267.7      74.1      00:09:39
 42339       5   4,535      22,675     1,274.7      74.5      00:09:30
 42505       9   4,535      40,815     1,279.8      74.8      00:09:24
 42689       7   4,535      31,745     1,285.3      75.1      00:09:18
 42889       6   4,535      27,210     1,291.3      75.5      00:09:11
 43108       8   4,535      36,280     1,298.3      75.9      00:09:02
 43319      10   4,535      45,350     1,304.9      76.3      00:08:54
 43581       9   4,535      40,815     1,312.8      76.7      00:08:43
 43970       5   4,535      22,675     1,324.5      77.4      00:08:26
 44202       8   4,535      36,280     1,331.4      77.8      00:08:17
 44402      10   4,535      45,350     1,337.1      78.1      00:08:11
 44627      10   4,535      45,350     1,344.0      78.5      00:08:02
 44827       7   4,535      31,745     1,350.1      78.9      00:07:55
 45086       3   4,535      13,605     1,357.9      79.4      00:07:44
 45338      10   4,535      45,350     1,364.8      79.8      00:07:35
 45524       8   4,535      36,280     1,370.3      80.1      00:07:29
 45753       3   4,535      13,605     1,376.8      80.5      00:07:21
 45995       5   4,535      22,675     1,384.1      80.9      00:07:11
 46223       9   4,535      40,815     1,391.2      81.3      00:07:02
 46454       8   4,535      36,280     1,398.1      81.7      00:06:53
 46686       6   4,535      27,210     1,405.3      82.1      00:06:44
 46925       7   4,535      31,745     1,412.5      82.5      00:06:34
 47157       7   4,535      31,745     1,418.9      82.9      00:06:26
 47413       5   4,535      22,675     1,426.3      83.4      00:06:16
 47592       9   4,535      40,815     1,431.5      83.7      00:06:10
 47818       6   4,535      27,210     1,438.3      84.1      00:06:01
 47990       6   4,535      27,210     1,443.6      84.4      00:05:55
 48165      10   4,535      45,350     1,448.7      84.7      00:05:49
 48381       6   4,535      27,210     1,455.4      85.1      00:05:40
 48607       6   4,535      27,210     1,462.2      85.5      00:05:31
 48844       7   4,535      31,745     1,469.3      85.9      00:05:22
 49034       9   4,535      40,815     1,475.0      86.2      00:05:15
 49250       8   4,535      36,280     1,481.7      86.6      00:05:06
 49537       6   4,535      27,210     1,489.8      87.1      00:04:55
 49821       8   4,535      36,280     1,497.8      87.5      00:04:44
 50057       7   4,535      31,745     1,504.9      87.9      00:04:35
 50297       6   4,535      27,210     1,511.8      88.3      00:04:26
 50538       6   4,535      27,210     1,518.9      88.8      00:04:16
 50726       6   4,535      27,210     1,524.6      89.1      00:04:09
 50880       9   4,535      40,815     1,529.5      89.4      00:04:03
 51043       3   4,535      13,605     1,534.8      89.7      00:03:56
 51278       8   4,535      36,280     1,541.7      90.1      00:03:47
 51501       8   4,535      36,280     1,548.5      90.5      00:03:38
 51697       8   4,535      36,280     1,554.9      90.9      00:03:30
 51915      10   4,535      45,350     1,561.6      91.3      00:03:21
 52161       9   4,535      40,815     1,569.7      91.7      00:03:10
 52420       8   4,535      36,280     1,578.0      92.2      00:02:58
 52712       5   4,535      22,675     1,587.8      92.8      00:02:45
 53009       7   4,535      31,745     1,597.3      93.3      00:02:32
 53333       9   4,535      40,815     1,607.5      93.9      00:02:18
 53664       7   4,535      31,745     1,617.9      94.5      00:02:04
 53855       7   4,535      31,745     1,623.7      94.9      00:01:57
 54033      10   4,535      45,350     1,629.1      95.2      00:01:50
 54203       7   4,535      31,745     1,634.2      95.5      00:01:43
 54380       8   4,535      36,280     1,639.4      95.8      00:01:36
 54595       6   4,535      27,210     1,645.4      96.2      00:01:28
 54874       8   4,535      36,280     1,653.8      96.6      00:01:17
 55118      10   4,535      45,350     1,661.0      97.1      00:01:07
 55372       6   4,535      27,210     1,668.2      97.5      00:00:58
 55612       7   4,535      31,745     1,675.2      97.9      00:00:48
 55843       8   4,535      36,280     1,682.4      98.3      00:00:39
 56095       4   4,535      18,140     1,690.1      98.8      00:00:28
 56307      10   4,535      45,350     1,696.7      99.2      00:00:19
 56573       7   4,535      31,745     1,705.1      99.6      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 2301.645
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M10_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_10_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
