
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl.dta /export/storage_covidvaccine/Result/MNL_part
> ial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_m
> nl.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   364       9   4,035      36,315         8.5       0.6      00:29:46
   757       9   4,035      36,315        18.1       1.2      00:27:47
  1143       9   4,035      36,315        27.9       1.8      00:26:53
  1520       6   4,035      24,210        38.0       2.5      00:26:07
  1895       6   4,035      24,210        47.5       3.1      00:25:55
  2278       9   4,035      36,315        57.5       3.8      00:25:32
  2664       2   4,035       8,070        67.3       4.4      00:25:16
  3067       5   4,035      20,175        77.7       5.1      00:24:49
  3441      10   4,035      40,350        88.2       5.8      00:24:27
  3833       9   4,035      36,315        98.5       6.5      00:24:08
  4156       8   4,035      32,280       106.6       7.0      00:24:24
  4480       9   4,035      36,315       114.7       7.5      00:24:36
  4783       6   4,035      24,210       122.8       8.1      00:24:44
  5108       7   4,035      28,245       131.2       8.6      00:24:48
  5390       8   4,035      32,280       138.8       9.1      00:24:59
  5665       8   4,035      32,280       145.3       9.5      00:25:20
  5954      10   4,035      40,350       152.8      10.0      00:25:28
  6254       9   4,035      36,315       160.6      10.5      00:25:30
  6571      10   4,035      40,350       168.6      11.1      00:25:29
  6888       7   4,035      28,245       176.7      11.6      00:25:27
  7253       8   4,035      32,280       185.9      12.2      00:25:14
  7611       8   4,035      32,280       195.5      12.8      00:24:57
  7963       9   4,035      36,315       205.1      13.5      00:24:40
  8307       9   4,035      36,315       214.6      14.1      00:24:26
  8654       7   4,035      28,245       224.2      14.7      00:24:11
  9005       4   4,035      16,140       233.8      15.4      00:23:56
  9291       6   4,035      24,210       241.8      15.9      00:23:53
  9537       9   4,035      36,315       248.6      16.3      00:23:58
  9800       9   4,035      36,315       256.0      16.8      00:23:58
 10075       6   4,035      24,210       263.1      17.3      00:23:59
 10354       6   4,035      24,210       269.9      17.7      00:24:02
 10664       5   4,035      20,175       278.0      18.3      00:23:56
 10964       6   4,035      24,210       285.8      18.8      00:23:51
 11255       7   4,035      28,245       293.3      19.3      00:23:48
 11510       5   4,035      20,175       300.1      19.7      00:23:48
 11799       8   4,035      32,280       307.8      20.2      00:23:44
 12077       9   4,035      36,315       315.2      20.7      00:23:40
 12371       8   4,035      32,280       322.9      21.2      00:23:35
 12727       5   4,035      20,175       332.2      21.8      00:23:20
 13098       9   4,035      36,315       341.7      22.4      00:23:05
 13453       5   4,035      20,175       351.4      23.1      00:22:49
 13718       9   4,035      36,315       358.7      23.6      00:22:45
 13981      10   4,035      40,350       365.5      24.0      00:22:44
 14304       4   4,035      16,140       374.3      24.6      00:22:32
 14623       9   4,035      36,315       382.9      25.2      00:22:22
 14963      10   4,035      40,350       392.1      25.8      00:22:09
 15332       9   4,035      36,315       402.2      26.4      00:21:52
 15704       8   4,035      32,280       412.0      27.1      00:21:36
 16054       8   4,035      32,280       422.0      27.7      00:21:20
 16402       7   4,035      28,245       431.7      28.4      00:21:06
 16686       9   4,035      36,315       439.3      28.9      00:21:00
 16941       9   4,035      36,315       446.2      29.3      00:20:57
 17198      10   4,035      40,350       453.0      29.8      00:20:54
 17454       8   4,035      32,280       460.2      30.2      00:20:49
 17708      10   4,035      40,350       467.3      30.7      00:20:45
 18013       7   4,035      28,245       475.3      31.2      00:20:36
 18315       7   4,035      28,245       483.6      31.8      00:20:27
 18598       9   4,035      36,315       491.0      32.2      00:20:21
 18840       7   4,035      28,245       497.7      32.7      00:20:17
 19098       8   4,035      32,280       505.0      33.2      00:20:12
 19386       5   4,035      20,175       513.0      33.7      00:20:03
 19734       5   4,035      20,175       522.9      34.3      00:19:48
 20092       8   4,035      32,280       533.1      35.0      00:19:32
 20456       2   4,035       8,070       542.8      35.7      00:19:18
 20705       9   4,035      36,315       549.8      36.1      00:19:13
 20946       8   4,035      32,280       556.5      36.5      00:19:08
 21225      10   4,035      40,350       563.4      37.0      00:19:03
 21492       7   4,035      28,245       570.3      37.5      00:18:58
 21776       2   4,035       8,070       577.2      37.9      00:18:52
 22052       7   4,035      28,245       584.4      38.4      00:18:46
 22340       9   4,035      36,315       591.5      38.9      00:18:40
 22611       7   4,035      28,245       598.5      39.3      00:18:34
 22903       5   4,035      20,175       605.6      39.8      00:18:28
 23182       5   4,035      20,175       613.1      40.3      00:18:20
 23479       5   4,035      20,175       620.8      40.8      00:18:12
 23747       6   4,035      24,210       627.8      41.2      00:18:05
 24006       6   4,035      24,210       634.6      41.7      00:17:60
 24330       5   4,035      20,175       642.7      42.2      00:17:50
 24691       7   4,035      28,245       652.6      42.9      00:17:35
 25053       9   4,035      36,315       662.0      43.5      00:17:22
 25412       6   4,035      24,210       671.7      44.1      00:17:08
 25688      10   4,035      40,350       679.0      44.6      00:17:01
 25943       8   4,035      32,280       685.9      45.1      00:16:54
 26218       3   4,035      12,105       693.4      45.5      00:16:46
 26539       9   4,035      36,315       701.7      46.1      00:16:36
 26857      10   4,035      40,350       710.0      46.6      00:16:26
 27129       8   4,035      32,280       717.3      47.1      00:16:19
 27374       7   4,035      28,245       723.7      47.5      00:16:13
 27615       9   4,035      36,315       730.3      48.0      00:16:08
 27897       9   4,035      36,315       738.0      48.5      00:15:59
 28222       9   4,035      36,315       746.7      49.0      00:15:47
 28538       9   4,035      36,315       755.8      49.6      00:15:35
 28757       9   4,035      36,315       761.8      50.0      00:15:31
 28978       5   4,035      20,175       767.9      50.4      00:15:26
 29144       6   4,035      24,210       772.4      50.7      00:15:24
 29433       9   4,035      36,315       780.3      51.3      00:15:15
 29716       9   4,035      36,315       787.8      51.7      00:15:07
 29949       8   4,035      32,280       794.1      52.2      00:15:01
 30157      10   4,035      40,350       799.9      52.5      00:14:56
 30431       9   4,035      36,315       807.5      53.0      00:14:47
 30720       7   4,035      28,245       815.3      53.6      00:14:38
 31050       8   4,035      32,280       824.3      54.1      00:14:26
 31389       5   4,035      20,175       833.7      54.8      00:14:13
 31731       8   4,035      32,280       843.4      55.4      00:13:59
 32065       7   4,035      28,245       852.9      56.0      00:13:46
 32393       3   4,035      12,105       862.4      56.6      00:13:33
 32626       6   4,035      24,210       868.8      57.1      00:13:27
 32829       8   4,035      32,280       874.4      57.4      00:13:22
 33061       8   4,035      32,280       881.0      57.9      00:13:15
 33328       3   4,035      12,105       888.4      58.4      00:13:07
 33617       7   4,035      28,245       896.6      58.9      00:12:57
 33898      10   4,035      40,350       904.4      59.4      00:12:47
 34180       3   4,035      12,105       912.5      59.9      00:12:37
 34512       6   4,035      24,210       921.8      60.5      00:12:24
 34843       6   4,035      24,210       931.2      61.2      00:12:12
 35184      10   4,035      40,350       940.7      61.8      00:11:59
 35487      10   4,035      40,350       949.3      62.4      00:11:48
 35822       7   4,035      28,245       958.4      63.0      00:11:36
 36154       8   4,035      32,280       967.7      63.6      00:11:24
 36493       4   4,035      16,140       977.1      64.2      00:11:11
 36740       5   4,035      20,175       983.6      64.6      00:11:04
 36961       4   4,035      16,140       989.7      65.0      00:10:58
 37210       8   4,035      32,280       996.0      65.4      00:10:52
 37469       7   4,035      28,245     1,002.7      65.9      00:10:44
 37717       7   4,035      28,245     1,009.1      66.3      00:10:37
 37936       7   4,035      28,245     1,015.0      66.7      00:10:31
 38164       9   4,035      36,315     1,021.4      67.1      00:10:24
 38414       7   4,035      28,245     1,028.4      67.5      00:10:16
 38719       8   4,035      32,280     1,036.8      68.1      00:10:06
 39013       7   4,035      28,245     1,044.8      68.6      00:09:56
 39249       9   4,035      36,315     1,050.9      69.0      00:09:49
 39514       7   4,035      28,245     1,057.9      69.5      00:09:41
 39804       6   4,035      24,210     1,065.7      70.0      00:09:31
 40168       7   4,035      28,245     1,075.4      70.6      00:09:18
 40522       8   4,035      32,280     1,085.1      71.3      00:09:05
 40860       9   4,035      36,315     1,094.3      71.9      00:08:53
 41114      10   4,035      40,350     1,101.4      72.3      00:08:45
 41394       9   4,035      36,315     1,108.9      72.8      00:08:36
 41663       7   4,035      28,245     1,116.3      73.3      00:08:27
 41915       6   4,035      24,210     1,123.4      73.8      00:08:19
 42148       5   4,035      20,175     1,129.2      74.2      00:08:12
 42383       5   4,035      20,175     1,135.5      74.6      00:08:05
 42647       5   4,035      20,175     1,142.4      75.0      00:07:57
 42880      10   4,035      40,350     1,148.7      75.4      00:07:50
 43107       8   4,035      32,280     1,155.1      75.9      00:07:42
 43338      10   4,035      40,350     1,161.6      76.3      00:07:35
 43591       8   4,035      32,280     1,168.3      76.7      00:07:27
 43915       7   4,035      28,245     1,177.0      77.3      00:07:15
 44181       9   4,035      36,315     1,184.1      77.8      00:07:07
 44420       7   4,035      28,245     1,190.2      78.2      00:06:60
 44675      10   4,035      40,350     1,197.2      78.6      00:06:51
 44954       9   4,035      36,315     1,204.7      79.1      00:06:42
 45256       4   4,035      16,140     1,212.5      79.6      00:06:32
 45462       8   4,035      32,280     1,217.7      80.0      00:06:26
 45720      10   4,035      40,350     1,224.1      80.4      00:06:19
 45997       7   4,035      28,245     1,231.6      80.9      00:06:09
 46254       8   4,035      32,280     1,238.7      81.4      00:06:00
 46533       9   4,035      36,315     1,246.2      81.9      00:05:51
 46861       6   4,035      24,210     1,255.2      82.4      00:05:39
 47116       6   4,035      24,210     1,261.4      82.9      00:05:32
 47373       8   4,035      32,280     1,268.1      83.3      00:05:24
 47620       3   4,035      12,105     1,274.5      83.7      00:05:16
 47857       5   4,035      20,175     1,280.7      84.1      00:05:08
 48092       8   4,035      32,280     1,287.1      84.5      00:05:01
 48327       9   4,035      36,315     1,293.5      85.0      00:04:53
 48611       8   4,035      32,280     1,301.1      85.5      00:04:43
 48876       9   4,035      36,315     1,308.1      85.9      00:04:34
 49106       6   4,035      24,210     1,314.4      86.3      00:04:27
 49339       5   4,035      20,175     1,320.6      86.7      00:04:19
 49583       9   4,035      36,315     1,326.6      87.1      00:04:12
 49813      10   4,035      40,350     1,332.5      87.5      00:04:04
 50060       7   4,035      28,245     1,339.0      87.9      00:03:56
 50296       8   4,035      32,280     1,345.1      88.3      00:03:49
 50554      10   4,035      40,350     1,351.9      88.8      00:03:40
 50805       8   4,035      32,280     1,358.7      89.2      00:03:31
 51045      10   4,035      40,350     1,365.6      89.7      00:03:23
 51315       8   4,035      32,280     1,372.7      90.2      00:03:14
 51569       9   4,035      36,315     1,379.7      90.6      00:03:05
 51830      10   4,035      40,350     1,387.1      91.1      00:02:55
 52126      10   4,035      40,350     1,395.6      91.7      00:02:44
 52444       9   4,035      36,315     1,404.7      92.3      00:02:32
 52758       7   4,035      28,245     1,414.1      92.9      00:02:20
 53091       6   4,035      24,210     1,423.5      93.5      00:02:08
 53411       6   4,035      24,210     1,432.4      94.1      00:01:56
 53717      10   4,035      40,350     1,440.9      94.6      00:01:45
 53954       5   4,035      20,175     1,447.3      95.1      00:01:37
 54155       5   4,035      20,175     1,452.7      95.4      00:01:30
 54374       7   4,035      28,245     1,458.5      95.8      00:01:23
 54669       9   4,035      36,315     1,466.0      96.3      00:01:13
 54957       2   4,035       8,070     1,473.7      96.8      00:01:03
 55210       4   4,035      16,140     1,480.3      97.2      00:00:55
 55467       6   4,035      24,210     1,486.8      97.7      00:00:46
 55710       7   4,035      28,245     1,493.2      98.1      00:00:38
 55959      10   4,035      40,350     1,500.0      98.5      00:00:29
 56197       6   4,035      24,210     1,506.6      99.0      00:00:21
 56449       8   4,035      32,280     1,513.8      99.4      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,522.5        Number of regions         = 56,767    
Computed distances (M)  = 1,522.49       Total run time (seconds)  = 1981.995
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
