
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A200_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   215      10   4,235      42,350         5.2       0.3      00:51:06
   467       8   4,235      33,880        11.4       0.7      00:46:26
   687       8   4,235      33,880        17.1       1.1      00:46:29
   939       9   4,235      38,115        23.6       1.5      00:44:45
  1152       3   4,235      12,705        29.5       1.8      00:44:31
  1366       6   4,235      25,410        35.4       2.2      00:44:14
  1578       6   4,235      25,410        41.4       2.6      00:43:59
  1798       6   4,235      25,410        47.4       3.0      00:43:47
  2008       6   4,235      25,410        52.9       3.3      00:43:56
  2214       9   4,235      38,115        58.6       3.7      00:43:53
  2441      10   4,235      42,350        64.6       4.0      00:43:38
  2664       2   4,235       8,470        70.6       4.4      00:43:23
  2871       8   4,235      33,880        76.5       4.8      00:43:13
  3119       8   4,235      33,880        83.2       5.2      00:42:36
  3351      10   4,235      42,350        90.0       5.6      00:42:02
  3563       8   4,235      33,880        96.0       6.0      00:41:52
  3785       7   4,235      29,645       102.1       6.4      00:41:38
  3964       6   4,235      25,410       106.7       6.7      00:42:04
  4125       6   4,235      25,410       111.0       6.9      00:42:34
  4278       5   4,235      21,175       114.9       7.2      00:43:09
  4461       9   4,235      38,115       119.8       7.5      00:43:19
  4619      10   4,235      42,350       124.3       7.8      00:43:35
  4774      10   4,235      42,350       128.7       8.1      00:43:54
  4884       7   4,235      29,645       131.7       8.2      00:44:41
  4995       7   4,235      29,645       134.7       8.4      00:45:24
  5120       7   4,235      29,645       138.1       8.6      00:45:59
  5262       6   4,235      25,410       141.9       8.9      00:46:20
  5385       5   4,235      21,175       145.6       9.1      00:46:44
  5525       5   4,235      21,175       148.9       9.3      00:47:12
  5624       7   4,235      29,645       151.4       9.5      00:47:56
  5768       6   4,235      25,410       155.3       9.7      00:48:10
  5898      10   4,235      42,350       158.8       9.9      00:48:32
  6025       5   4,235      21,175       162.4      10.2      00:48:48
  6162       7   4,235      29,645       166.0      10.4      00:49:03
  6326       4   4,235      16,940       170.3      10.7      00:49:04
  6446       6   4,235      25,410       173.6      10.9      00:49:24
  6597       6   4,235      25,410       177.6      11.1      00:49:29
  6740       7   4,235      29,645       181.4      11.4      00:49:38
  6861       6   4,235      25,410       184.8      11.6      00:49:55
  7017       7   4,235      29,645       188.9      11.8      00:49:56
  7196       9   4,235      38,115       193.6      12.1      00:49:46
  7362       7   4,235      29,645       198.3      12.4      00:49:36
  7547       8   4,235      33,880       203.4      12.7      00:49:19
  7732       8   4,235      33,880       208.5      13.0      00:49:04
  7900       8   4,235      33,880       213.4      13.4      00:48:51
  8033       5   4,235      21,175       217.3      13.6      00:48:53
  8219       7   4,235      29,645       222.8      13.9      00:48:33
  8393       7   4,235      29,645       227.8      14.3      00:48:18
  8557       6   4,235      25,410       232.6      14.6      00:48:08
  8714       9   4,235      38,115       237.0      14.8      00:48:03
  8884      10   4,235      42,350       241.9      15.1      00:47:50
  9040       5   4,235      21,175       246.4      15.4      00:47:44
  9207       6   4,235      25,410       251.3      15.7      00:47:31
  9314       7   4,235      29,645       254.4      15.9      00:47:43
  9434       5   4,235      21,175       257.9      16.1      00:47:50
  9562      10   4,235      42,350       261.7      16.4      00:47:51
  9707      10   4,235      42,350       266.0      16.6      00:47:45
  9861      10   4,235      42,350       270.3      16.9      00:47:40
  9987      10   4,235      42,350       273.7      17.1      00:47:45
 10130       7   4,235      29,645       277.3      17.4      00:47:48
 10247       9   4,235      38,115       280.4      17.5      00:47:58
 10402       8   4,235      33,880       284.6      17.8      00:47:52
 10596      10   4,235      42,350       289.8      18.1      00:47:35
 10776       3   4,235      12,705       294.7      18.4      00:47:21
 10948      10   4,235      42,350       299.6      18.7      00:47:08
 11104       8   4,235      33,880       303.8      19.0      00:47:03
 11253      10   4,235      42,350       307.8      19.3      00:46:59
 11370       5   4,235      21,175       311.1      19.5      00:47:04
 11494       6   4,235      25,410       314.6      19.7      00:47:05
 11606      10   4,235      42,350       317.6      19.9      00:47:14
 11736       6   4,235      25,410       321.1      20.1      00:47:15
 11885       8   4,235      33,880       325.4      20.4      00:47:07
 12002       5   4,235      21,175       328.6      20.6      00:47:11
 12095       5   4,235      21,175       331.3      20.7      00:47:21
 12191       6   4,235      25,410       334.0      20.9      00:47:30
 12322       7   4,235      29,645       337.5      21.1      00:47:30
 12554       8   4,235      33,880       343.9      21.5      00:46:58
 12776       9   4,235      38,115       349.8      21.9      00:46:34
 12977       8   4,235      33,880       355.2      22.2      00:46:15
 13191      10   4,235      42,350       361.3      22.6      00:45:49
 13421       6   4,235      25,410       367.8      23.0      00:45:20
 13577      10   4,235      42,350       372.5      23.3      00:45:08
 13718       9   4,235      38,115       376.5      23.6      00:45:03
 13880       1   4,235       4,235       380.9      23.8      00:44:54
 14066       4   4,235      16,940       386.0      24.2      00:44:39
 14231       7   4,235      29,645       390.7      24.4      00:44:27
 14402       6   4,235      25,410       395.6      24.8      00:44:14
 14556       6   4,235      25,410       400.0      25.0      00:44:05
 14696       8   4,235      33,880       403.9      25.3      00:44:01
 14815       9   4,235      38,115       407.3      25.5      00:44:01
 14987       8   4,235      33,880       412.2      25.8      00:43:48
 15200       9   4,235      38,115       418.5      26.2      00:43:23
 15413       9   4,235      38,115       424.4      26.6      00:43:01
 15635       7   4,235      29,645       430.6      26.9      00:42:38
 15861       5   4,235      21,175       437.1      27.4      00:42:13
 16071       5   4,235      21,175       443.4      27.7      00:41:49
 16297       8   4,235      33,880       449.9      28.2      00:41:24
 16480       9   4,235      38,115       455.4      28.5      00:41:08
 16619       5   4,235      21,175       459.0      28.7      00:41:06
 16776       6   4,235      25,410       463.6      29.0      00:40:56
 16910       9   4,235      38,115       467.3      29.2      00:40:53
 17018       7   4,235      29,645       470.5      29.4      00:40:53
 17166       7   4,235      29,645       474.5      29.7      00:40:48
 17300       7   4,235      29,645       478.4      29.9      00:40:43
 17425       8   4,235      33,880       482.1      30.2      00:40:40
 17533       8   4,235      33,880       485.5      30.4      00:40:39
 17641       5   4,235      21,175       488.6      30.6      00:40:39
 17786       9   4,235      38,115       492.4      30.8      00:40:34
 17943       8   4,235      33,880       496.9      31.1      00:40:25
 18132       7   4,235      29,645       502.4      31.4      00:40:08
 18352       4   4,235      16,940       508.6      31.8      00:39:47
 18531      10   4,235      42,350       513.4      32.1      00:39:36
 18660       9   4,235      38,115       517.2      32.4      00:39:31
 18763       8   4,235      33,880       520.2      32.6      00:39:31
 18903       9   4,235      38,115       524.3      32.8      00:39:25
 19030       5   4,235      21,175       528.1      33.0      00:39:20
 19156       9   4,235      38,115       531.7      33.3      00:39:15
 19282       8   4,235      33,880       535.4      33.5      00:39:11
 19425       9   4,235      38,115       539.6      33.8      00:39:04
 19601       6   4,235      25,410       544.7      34.1      00:38:50
 19790      10   4,235      42,350       550.5      34.4      00:38:32
 19984       9   4,235      38,115       556.1      34.8      00:38:15
 20191       6   4,235      25,410       562.3      35.2      00:37:54
 20391       8   4,235      33,880       567.9      35.5      00:37:38
 20535       6   4,235      25,410       572.1      35.8      00:37:30
 20665      10   4,235      42,350       575.9      36.0      00:37:25
 20810       5   4,235      21,175       580.0      36.3      00:37:18
 20936      10   4,235      42,350       583.8      36.5      00:37:12
 21038       7   4,235      29,645       586.5      36.7      00:37:14
 21173       7   4,235      29,645       590.1      36.9      00:37:09
 21317       9   4,235      38,115       593.5      37.1      00:37:06
 21434       5   4,235      21,175       596.8      37.3      00:37:03
 21569       7   4,235      29,645       600.5      37.6      00:36:58
 21714       5   4,235      21,175       604.2      37.8      00:36:53
 21862       7   4,235      29,645       608.3      38.1      00:36:45
 22007       7   4,235      29,645       612.2      38.3      00:36:38
 22169       7   4,235      29,645       616.3      38.6      00:36:31
 22291       7   4,235      29,645       619.5      38.8      00:36:28
 22408       9   4,235      38,115       622.6      39.0      00:36:26
 22533      10   4,235      42,350       626.0      39.2      00:36:23
 22674       8   4,235      33,880       629.9      39.4      00:36:16
 22841      10   4,235      42,350       633.9      39.7      00:36:08
 23014       7   4,235      29,645       638.8      40.0      00:35:56
 23179       9   4,235      38,115       643.5      40.3      00:35:45
 23348       6   4,235      25,410       648.2      40.6      00:35:33
 23525       8   4,235      33,880       652.7      40.8      00:35:23
 23697       6   4,235      25,410       657.4      41.1      00:35:12
 23884       7   4,235      29,645       662.8      41.5      00:34:57
 24085       9   4,235      38,115       668.3      41.8      00:34:42
 24289       5   4,235      21,175       673.5      42.1      00:34:27
 24473       5   4,235      21,175       678.6      42.5      00:34:14
 24664      10   4,235      42,350       684.2      42.8      00:33:59
 24873       8   4,235      33,880       689.9      43.2      00:33:42
 25075       8   4,235      33,880       695.5      43.5      00:33:26
 25265       8   4,235      33,880       700.9      43.9      00:33:12
 25465       8   4,235      33,880       706.5      44.2      00:32:56
 25563       2   4,235       8,470       709.1      44.4      00:32:56
 25691       8   4,235      33,880       712.7      44.6      00:32:51
 25813       7   4,235      29,645       716.3      44.8      00:32:45
 25949       6   4,235      25,410       720.0      45.1      00:32:39
 26069       4   4,235      16,940       723.5      45.3      00:32:34
 26224      10   4,235      42,350       728.0      45.6      00:32:24
 26403       2   4,235       8,470       732.8      45.9      00:32:13
 26559       6   4,235      25,410       737.1      46.1      00:32:04
 26755      10   4,235      42,350       742.4      46.5      00:31:49
 26934       9   4,235      38,115       747.4      46.8      00:31:37
 27103       8   4,235      33,880       752.1      47.1      00:31:26
 27252       9   4,235      38,115       756.2      47.3      00:31:18
 27376       5   4,235      21,175       759.7      47.5      00:31:13
 27533       6   4,235      25,410       764.1      47.8      00:31:03
 27691      10   4,235      42,350       768.6      48.1      00:30:53
 27798       6   4,235      25,410       771.7      48.3      00:30:49
 27965       6   4,235      25,410       776.5      48.6      00:30:38
 28168      10   4,235      42,350       782.3      49.0      00:30:22
 28374       7   4,235      29,645       788.3      49.3      00:30:05
 28548      10   4,235      42,350       793.5      49.7      00:29:52
 28680       8   4,235      33,880       797.3      49.9      00:29:45
 28823       6   4,235      25,410       801.5      50.2      00:29:36
 28954       9   4,235      38,115       805.3      50.4      00:29:29
 29078      10   4,235      42,350       808.8      50.6      00:29:24
 29251       7   4,235      29,645       813.6      50.9      00:29:13
 29429       7   4,235      29,645       818.9      51.2      00:28:59
 29620       7   4,235      29,645       824.0      51.6      00:28:46
 29749       4   4,235      16,940       827.8      51.8      00:28:39
 29858       6   4,235      25,410       830.9      52.0      00:28:35
 29970       4   4,235      16,940       834.1      52.2      00:28:31
 30073       2   4,235       8,470       837.0      52.4      00:28:27
 30194       7   4,235      29,645       840.6      52.6      00:28:21
 30337       9   4,235      38,115       844.6      52.9      00:28:13
 30495       6   4,235      25,410       849.4      53.2      00:28:02
 30660       7   4,235      29,645       854.0      53.4      00:27:51
 30844       9   4,235      38,115       859.5      53.8      00:27:37
 31061       5   4,235      21,175       865.4      54.2      00:27:21
 31283      10   4,235      42,350       872.0      54.6      00:27:02
 31506       9   4,235      38,115       878.6      55.0      00:26:43
 31699       7   4,235      29,645       884.2      55.3      00:26:29
 31842       7   4,235      29,645       888.5      55.6      00:26:20
 32026       9   4,235      38,115       894.0      55.9      00:26:06
 32225       9   4,235      38,115       900.0      56.3      00:25:50
 32399       7   4,235      29,645       905.3      56.7      00:25:37
 32521      10   4,235      42,350       908.8      56.9      00:25:31
 32634       6   4,235      25,410       912.1      57.1      00:25:25
 32750       8   4,235      33,880       915.5      57.3      00:25:20
 32859       4   4,235      16,940       918.6      57.5      00:25:15
 32961       9   4,235      38,115       921.7      57.7      00:25:10
 33097       5   4,235      21,175       925.7      57.9      00:25:02
 33215      10   4,235      42,350       929.0      58.1      00:24:57
 33354       8   4,235      33,880       933.1      58.4      00:24:48
 33470       5   4,235      21,175       936.5      58.6      00:24:43
 33621       7   4,235      29,645       941.1      58.9      00:24:32
 33757       7   4,235      29,645       945.1      59.1      00:24:24
 33911       7   4,235      29,645       949.6      59.4      00:24:14
 34048      10   4,235      42,350       953.7      59.7      00:24:05
 34197       4   4,235      16,940       958.3      60.0      00:23:55
 34419       4   4,235      16,940       964.7      60.4      00:23:37
 34606       9   4,235      38,115       970.3      60.7      00:23:23
 34815       8   4,235      33,880       976.5      61.1      00:23:07
 35022       7   4,235      29,645       982.5      61.5      00:22:51
 35216       7   4,235      29,645       988.3      61.8      00:22:37
 35425       7   4,235      29,645       994.5      62.2      00:22:21
 35621       7   4,235      29,645     1,000.2      62.6      00:22:07
 35832       8   4,235      33,880     1,006.2      63.0      00:21:51
 36057      10   4,235      42,350     1,012.8      63.4      00:21:34
 36249       9   4,235      38,115     1,018.5      63.7      00:21:20
 36458      10   4,235      42,350     1,024.6      64.1      00:21:04
 36607       5   4,235      21,175     1,028.9      64.4      00:20:55
 36720       9   4,235      38,115     1,032.0      64.6      00:20:50
 36823       9   4,235      38,115     1,034.8      64.8      00:20:46
 36971       7   4,235      29,645     1,039.0      65.0      00:20:37
 37114       4   4,235      16,940     1,043.0      65.3      00:20:29
 37252       6   4,235      25,410     1,046.6      65.5      00:20:22
 37404       8   4,235      33,880     1,050.7      65.7      00:20:14
 37531      10   4,235      42,350     1,054.2      66.0      00:20:07
 37668       6   4,235      25,410     1,057.8      66.2      00:19:60
 37819       6   4,235      25,410     1,062.0      66.5      00:19:51
 37986       7   4,235      29,645     1,066.8      66.8      00:19:40
 38159       9   4,235      38,115     1,071.9      67.1      00:19:28
 38321       9   4,235      38,115     1,076.5      67.4      00:19:18
 38464       3   4,235      12,705     1,080.8      67.6      00:19:08
 38653       9   4,235      38,115     1,086.2      68.0      00:18:56
 38855       9   4,235      38,115     1,092.0      68.3      00:18:41
 39013       7   4,235      29,645     1,096.6      68.6      00:18:31
 39140       8   4,235      33,880     1,100.0      68.8      00:18:25
 39272       8   4,235      33,880     1,103.7      69.1      00:18:17
 39359       6   4,235      25,410     1,106.1      69.2      00:18:14
 39486       8   4,235      33,880     1,109.6      69.4      00:18:07
 39636       6   4,235      25,410     1,113.8      69.7      00:17:58
 39772      10   4,235      42,350     1,117.5      69.9      00:17:51
 39957       9   4,235      38,115     1,122.8      70.3      00:17:38
 40129       7   4,235      29,645     1,127.5      70.6      00:17:27
 40312       8   4,235      33,880     1,132.7      70.9      00:17:15
 40515       8   4,235      33,880     1,138.7      71.3      00:17:01
 40682       9   4,235      38,115     1,143.4      71.6      00:16:50
 40878       4   4,235      16,940     1,149.1      71.9      00:16:36
 41016      10   4,235      42,350     1,153.2      72.2      00:16:28
 41115       7   4,235      29,645     1,156.0      72.3      00:16:23
 41228       4   4,235      16,940     1,159.2      72.5      00:16:17
 41379       5   4,235      21,175     1,163.4      72.8      00:16:08
 41528       7   4,235      29,645     1,167.8      73.1      00:15:58
 41684       7   4,235      29,645     1,172.2      73.4      00:15:48
 41852       5   4,235      21,175     1,177.1      73.7      00:15:37
 41963       9   4,235      38,115     1,180.3      73.9      00:15:31
 42075       9   4,235      38,115     1,183.3      74.0      00:15:26
 42191       9   4,235      38,115     1,186.3      74.2      00:15:20
 42301       9   4,235      38,115     1,189.2      74.4      00:15:15
 42404       6   4,235      25,410     1,192.4      74.6      00:15:09
 42502       7   4,235      29,645     1,195.1      74.8      00:15:04
 42625       9   4,235      38,115     1,198.4      75.0      00:14:57
 42772       6   4,235      25,410     1,202.6      75.3      00:14:48
 42907       5   4,235      21,175     1,206.4      75.5      00:14:40
 43033       7   4,235      29,645     1,210.1      75.7      00:14:32
 43153      10   4,235      42,350     1,213.8      76.0      00:14:25
 43300       6   4,235      25,410     1,218.0      76.2      00:14:15
 43426       6   4,235      25,410     1,221.8      76.5      00:14:07
 43637       9   4,235      38,115     1,227.4      76.8      00:13:54
 43898       4   4,235      16,940     1,234.8      77.3      00:13:35
 44115       2   4,235       8,470     1,240.8      77.6      00:13:21
 44246       7   4,235      29,645     1,244.6      77.9      00:13:13
 44377       6   4,235      25,410     1,248.0      78.1      00:13:06
 44554       6   4,235      25,410     1,253.0      78.4      00:12:54
 44719       8   4,235      33,880     1,257.7      78.7      00:12:43
 44873       4   4,235      16,940     1,262.2      79.0      00:12:33
 45027       4   4,235      16,940     1,266.4      79.3      00:12:24
 45210       6   4,235      25,410     1,271.4      79.6      00:12:13
 45380       4   4,235      16,940     1,275.7      79.8      00:12:03
 45513      10   4,235      42,350     1,279.4      80.1      00:11:55
 45654       1   4,235       4,235     1,283.0      80.3      00:11:47
 45797       6   4,235      25,410     1,286.9      80.5      00:11:39
 45957       5   4,235      21,175     1,291.5      80.8      00:11:29
 46123       9   4,235      38,115     1,296.2      81.1      00:11:18
 46269       6   4,235      25,410     1,300.6      81.4      00:11:08
 46391       7   4,235      29,645     1,303.9      81.6      00:11:01
 46562       9   4,235      38,115     1,308.9      81.9      00:10:50
 46781       7   4,235      29,645     1,315.1      82.3      00:10:35
 46927       3   4,235      12,705     1,319.1      82.6      00:10:26
 47042       9   4,235      38,115     1,322.0      82.7      00:10:20
 47180       8   4,235      33,880     1,325.6      83.0      00:10:13
 47310      10   4,235      42,350     1,329.2      83.2      00:10:05
 47428       6   4,235      25,410     1,332.4      83.4      00:09:59
 47555       9   4,235      38,115     1,335.8      83.6      00:09:51
 47672       9   4,235      38,115     1,339.1      83.8      00:09:44
 47799       7   4,235      29,645     1,342.6      84.0      00:09:37
 47918       8   4,235      33,880     1,346.0      84.2      00:09:29
 48024      10   4,235      42,350     1,349.0      84.4      00:09:23
 48207       5   4,235      21,175     1,354.0      84.7      00:09:12
 48373       6   4,235      25,410     1,358.9      85.0      00:09:01
 48561       9   4,235      38,115     1,364.2      85.4      00:08:48
 48708       7   4,235      29,645     1,368.3      85.6      00:08:39
 48848       5   4,235      21,175     1,372.2      85.9      00:08:30
 48971       6   4,235      25,410     1,375.6      86.1      00:08:23
 49112      10   4,235      42,350     1,379.7      86.3      00:08:14
 49255       8   4,235      33,880     1,383.8      86.6      00:08:05
 49417      10   4,235      42,350     1,388.1      86.9      00:07:55
 49526      10   4,235      42,350     1,391.0      87.0      00:07:49
 49688       7   4,235      29,645     1,395.2      87.3      00:07:40
 49819       6   4,235      25,410     1,398.7      87.5      00:07:32
 49895       9   4,235      38,115     1,400.8      87.7      00:07:28
 50027       8   4,235      33,880     1,404.5      87.9      00:07:20
 50140       9   4,235      38,115     1,407.6      88.1      00:07:13
 50250       8   4,235      33,880     1,410.5      88.3      00:07:07
 50353       4   4,235      16,940     1,413.1      88.4      00:07:02
 50473      10   4,235      42,350     1,416.5      88.6      00:06:54
 50579       9   4,235      38,115     1,419.6      88.8      00:06:48
 50711       8   4,235      33,880     1,423.4      89.1      00:06:39
 50836       7   4,235      29,645     1,427.0      89.3      00:06:31
 50938       5   4,235      21,175     1,430.1      89.5      00:06:24
 51066       9   4,235      38,115     1,433.8      89.7      00:06:16
 51230       8   4,235      33,880     1,438.2      90.0      00:06:06
 51448       6   4,235      25,410     1,444.6      90.4      00:05:51
 51661       8   4,235      33,880     1,450.9      90.8      00:05:36
 51872      10   4,235      42,350     1,457.1      91.2      00:05:21
 52064       6   4,235      25,410     1,462.8      91.5      00:05:08
 52272       9   4,235      38,115     1,469.1      91.9      00:04:53
 52447       9   4,235      38,115     1,474.5      92.3      00:04:41
 52644       9   4,235      38,115     1,480.7      92.7      00:04:26
 52863      10   4,235      42,350     1,487.4      93.1      00:04:11
 53063      10   4,235      42,350     1,493.3      93.4      00:03:57
 53275       5   4,235      21,175     1,499.4      93.8      00:03:43
 53522       7   4,235      29,645     1,506.7      94.3      00:03:26
 53715       7   4,235      29,645     1,512.3      94.6      00:03:13
 53864       6   4,235      25,410     1,516.5      94.9      00:03:04
 54014       4   4,235      16,940     1,520.7      95.2      00:02:54
 54162      10   4,235      42,350     1,524.9      95.4      00:02:45
 54280      10   4,235      42,350     1,528.3      95.6      00:02:37
 54420       8   4,235      33,880     1,531.9      95.9      00:02:29
 54580       8   4,235      33,880     1,536.1      96.1      00:02:20
 54710       9   4,235      38,115     1,539.8      96.4      00:02:12
 54857       7   4,235      29,645     1,543.9      96.6      00:02:02
 55012       8   4,235      33,880     1,548.2      96.9      00:01:53
 55161      10   4,235      42,350     1,552.3      97.1      00:01:43
 55290      10   4,235      42,350     1,555.7      97.4      00:01:36
 55408       5   4,235      21,175     1,558.9      97.6      00:01:29
 55531       4   4,235      16,940     1,562.0      97.8      00:01:21
 55631       8   4,235      33,880     1,564.9      97.9      00:01:15
 55743       8   4,235      33,880     1,568.2      98.1      00:01:08
 55891       9   4,235      38,115     1,572.5      98.4      00:00:58
 56058       7   4,235      29,645     1,577.2      98.7      00:00:47
 56219       7   4,235      29,645     1,581.9      99.0      00:00:36
 56362       5   4,235      21,175     1,586.1      99.3      00:00:27
 56522       6   4,235      25,410     1,590.9      99.6      00:00:16
 56670      10   4,235      42,350     1,595.2      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 3645.491
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
