
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_Do
> llar_locations_total_fixR400.dta /export/storage_covidvaccine/Result/MaxVaxHP
> IDistBLP/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR4
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  30 Oct 2023, 17:57:58

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capc
> oef/Dollar/vaccinated/ca_Dollar_locations_total_fixR400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capco
> ef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
  2810       9   4,035      36,315        71.2       4.7      00:23:50
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   382       9   4,035      36,315         8.8       0.6      00:28:40
  3224       8   4,035      32,280        82.0       5.4      00:23:28
   789       6   4,035      24,210        18.9       1.2      00:26:38
  3631       9   4,035      36,315        92.9       6.1      00:23:07
  1194       8   4,035      32,280        29.0       1.9      00:25:46
  4032       8   4,035      32,280       103.2       6.8      00:22:58
  1592       8   4,035      32,280        39.7       2.6      00:24:57
  4389      10   4,035      40,350       112.1       7.4      00:23:07
  2016       7   4,035      28,245        50.5       3.3      00:24:21
  4739       6   4,035      24,210       121.6       8.0      00:23:06
  2437       6   4,035      24,210        61.3       4.0      00:23:52
  5094       2   4,035       8,070       130.7       8.6      00:23:07
  2876       7   4,035      28,245        72.9       4.8      00:23:15
  5435       8   4,035      32,280       139.7       9.2      00:23:08
  3306       6   4,035      24,210        84.3       5.5      00:22:46
  5721       5   4,035      20,175       146.6       9.6      00:23:31
  3730       6   4,035      24,210        95.6       6.3      00:22:25
  5986      10   4,035      40,350       153.4      10.1      00:23:51
  4132       9   4,035      36,315       105.8       6.9      00:22:21
  6251       7   4,035      28,245       160.4      10.5      00:24:07
  4491       4   4,035      16,140       114.8       7.5      00:22:31
  6498       8   4,035      32,280       166.6      10.9      00:24:28
  4839       6   4,035      24,210       124.0       8.1      00:22:35
  6767       7   4,035      28,245       173.4      11.4      00:24:42
  5199       9   4,035      36,315       133.5       8.8      00:22:35
  7105       1   4,035       4,035       182.1      12.0      00:24:36
  5540       5   4,035      20,175       142.1       9.3      00:22:42
  7470       7   4,035      28,245       191.6      12.6      00:24:22
  5830       6   4,035      24,210       149.3       9.8      00:23:02
  7834       8   4,035      32,280       201.3      13.2      00:24:08
  6122       8   4,035      32,280       157.0      10.3      00:23:14
  8176       6   4,035      24,210       210.9      13.8      00:23:54
  6397       7   4,035      28,245       164.0      10.8      00:23:31
  8525      10   4,035      40,350       220.6      14.5      00:23:40
  6646       8   4,035      32,280       170.3      11.2      00:23:52
  8889       8   4,035      32,280       230.4      15.1      00:23:25
  6986       4   4,035      16,140       179.0      11.8      00:23:48
  9235       8   4,035      32,280       240.1      15.8      00:23:12
  7375       5   4,035      20,175       189.1      12.4      00:23:33
  9497       7   4,035      28,245       247.2      16.2      00:23:16
  7769       6   4,035      24,210       199.4      13.1      00:23:16
  9802       9   4,035      36,315       255.9      16.8      00:23:10
  8149      10   4,035      40,350       210.1      13.8      00:22:57
 10081       8   4,035      32,280       263.1      17.3      00:23:12
  8525      10   4,035      40,350       220.6      14.5      00:22:40
 10400       6   4,035      24,210       271.0      17.8      00:23:09
  8907       9   4,035      36,315       231.0      15.2      00:22:25
 10728       6   4,035      24,210       279.5      18.3      00:23:02
  9252       7   4,035      28,245       240.5      15.8      00:22:15
 11065       6   4,035      24,210       288.3      18.9      00:22:54
  9527       6   4,035      24,210       248.1      16.3      00:22:18
 11348       7   4,035      28,245       295.7      19.4      00:22:53
  9826       7   4,035      28,245       256.5      16.8      00:22:15
 11646       8   4,035      32,280       303.5      19.9      00:22:49
 10101       4   4,035      16,140       263.5      17.3      00:22:20
 11999       6   4,035      24,210       312.8      20.5      00:22:37
 10435       8   4,035      32,280       271.9      17.8      00:22:17
 12307       9   4,035      36,315       321.0      21.1      00:22:31
 10747       4   4,035      16,140       280.0      18.4      00:22:14
 12684       7   4,035      28,245       331.0      21.7      00:22:16
 11045       5   4,035      20,175       287.8      18.9      00:22:13
 13046      10   4,035      40,350       340.1      22.3      00:22:04
 11300       9   4,035      36,315       294.3      19.3      00:22:18
 13395       4   4,035      16,140       349.4      22.9      00:21:53
 11552       4   4,035      16,140       301.0      19.8      00:22:22
 13663       7   4,035      28,245       357.0      23.4      00:21:49
 11856       8   4,035      32,280       309.1      20.3      00:22:17
 13901       9   4,035      36,315       363.3      23.8      00:21:52
 12173       6   4,035      24,210       317.6      20.8      00:22:11
 14195       7   4,035      28,245       371.1      24.4      00:21:47
 12511      10   4,035      40,350       326.4      21.4      00:22:02
 14508       7   4,035      28,245       379.7      24.9      00:21:38
 12905      10   4,035      40,350       336.4      22.1      00:21:47
 14843       4   4,035      16,140       388.6      25.5      00:21:28
 13347       6   4,035      24,210       348.1      22.8      00:21:25
 15227       7   4,035      28,245       399.3      26.2      00:21:10
 13688      10   4,035      40,350       357.7      23.5      00:21:13
 15616       6   4,035      24,210       409.5      26.9      00:20:54
 13977      10   4,035      40,350       365.2      24.0      00:21:10
 16004       7   4,035      28,245       420.3      27.6      00:20:36
 14367       9   4,035      36,315       375.8      24.7      00:20:54
 16375       6   4,035      24,210       430.7      28.3      00:20:20
 14756       6   4,035      24,210       386.2      25.3      00:20:39
 16693      10   4,035      40,350       439.3      28.8      00:20:12
 15166      10   4,035      40,350       397.5      26.1      00:20:20
 16952      10   4,035      40,350       446.2      29.3      00:20:10
 15592       2   4,035       8,070       408.9      26.8      00:20:01
 17255      10   4,035      40,350       454.4      29.8      00:20:03
 16001       6   4,035      24,210       420.2      27.6      00:19:43
 17539       6   4,035      24,210       462.5      30.4      00:19:55
 16407       8   4,035      32,280       431.6      28.3      00:19:25
 17888      10   4,035      40,350       471.7      31.0      00:19:44
 16735       7   4,035      28,245       440.4      28.9      00:19:18
 18178       9   4,035      36,315       479.7      31.5      00:19:37
 17046       7   4,035      28,245       448.9      29.5      00:19:11
 18465       2   4,035       8,070       487.2      32.0      00:19:32
 17368       5   4,035      20,175       457.5      30.0      00:19:03
 18734       9   4,035      36,315       494.6      32.5      00:19:27
 17676       4   4,035      16,140       466.2      30.6      00:18:55
 19022      10   4,035      40,350       502.7      33.0      00:19:20
 18056       8   4,035      32,280       476.2      31.3      00:18:43
 19345       8   4,035      32,280       511.6      33.6      00:19:09
 18333       6   4,035      24,210       483.9      31.8      00:18:39
 19715      10   4,035      40,350       522.1      34.3      00:18:54
 18633       8   4,035      32,280       491.7      32.3      00:18:34
 20099       9   4,035      36,315       533.0      35.0      00:18:37
 18930       8   4,035      32,280       500.0      32.8      00:18:27
 20490       9   4,035      36,315       543.6      35.7      00:18:22
 19278      10   4,035      40,350       509.7      33.5      00:18:15
 20737       7   4,035      28,245       550.4      36.1      00:18:18
 19673       5   4,035      20,175       520.8      34.2      00:17:60
 20986       6   4,035      24,210       557.2      36.6      00:18:15
 20077       8   4,035      32,280       532.4      34.9      00:17:43
 21303       9   4,035      36,315       565.1      37.1      00:18:08
 20493       8   4,035      32,280       543.7      35.7      00:17:27
 21556       9   4,035      36,315       571.7      37.5      00:18:04
 20759       6   4,035      24,210       551.0      36.2      00:17:23
 21822       7   4,035      28,245       578.1      37.9      00:18:02
 21049      10   4,035      40,350       558.9      36.7      00:17:17
 22062      10   4,035      40,350       584.4      38.4      00:17:59
 21373       3   4,035      12,105       566.7      37.2      00:17:11
 22333       8   4,035      32,280       591.1      38.8      00:17:55
 21673       7   4,035      28,245       574.5      37.7      00:17:06
 22609       8   4,035      32,280       598.2      39.3      00:17:50
 21988       4   4,035      16,140       582.5      38.2      00:16:59
 22887       7   4,035      28,245       605.0      39.7      00:17:45
 22286       8   4,035      32,280       589.9      38.7      00:16:54
 23140       4   4,035      16,140       611.8      40.2      00:17:41
 22591       5   4,035      20,175       597.7      39.2      00:16:48
 23421      10   4,035      40,350       619.4      40.7      00:17:33
 22898       8   4,035      32,280       605.3      39.7      00:16:43
 23735       6   4,035      24,210       627.2      41.2      00:17:26
 23183      10   4,035      40,350       612.9      40.2      00:16:37
 24030       8   4,035      32,280       635.1      41.7      00:17:17
 23521       4   4,035      16,140       621.6      40.8      00:16:28
 24404       7   4,035      28,245       644.4      42.3      00:17:06
 23808      10   4,035      40,350       629.2      41.3      00:16:22
 24788       9   4,035      36,315       654.8      43.0      00:16:50
 24107       8   4,035      32,280       637.2      41.8      00:16:15
 25179       4   4,035      16,140       665.3      43.7      00:16:35
 24513       8   4,035      32,280       647.4      42.5      00:16:02
 25555       8   4,035      32,280       675.4      44.3      00:16:22
 24908       3   4,035      12,105       658.0      43.2      00:15:48
 25795       7   4,035      28,245       681.7      44.7      00:16:18
 25308       9   4,035      36,315       668.7      43.9      00:15:35
 26093       6   4,035      24,210       689.8      45.3      00:16:09
 25657      10   4,035      40,350       677.8      44.5      00:15:25
 26441       6   4,035      24,210       698.8      45.9      00:15:58
 25855       4   4,035      16,140       683.4      44.9      00:15:23
 26795      10   4,035      40,350       708.1      46.5      00:15:46
 26120      10   4,035      40,350       690.5      45.3      00:15:18
 27125       9   4,035      36,315       716.8      47.0      00:15:36
 26432       8   4,035      32,280       698.6      45.9      00:15:11
 27388       6   4,035      24,210       723.8      47.5      00:15:30
 26751       6   4,035      24,210       706.8      46.4      00:15:03
 27645       9   4,035      36,315       730.7      48.0      00:15:24
 27062       1   4,035       4,035       715.2      46.9      00:14:54
 27923       6   4,035      24,210       738.4      48.5      00:15:16
 27284       5   4,035      20,175       721.0      47.3      00:14:52
 28282       6   4,035      24,210       748.1      49.1      00:15:04
 27504       8   4,035      32,280       726.9      47.7      00:14:49
 28627      10   4,035      40,350       757.9      49.7      00:14:51
 27740       8   4,035      32,280       733.3      48.1      00:14:45
 28863       6   4,035      24,210       764.4      50.2      00:14:46
 28003       9   4,035      36,315       740.5      48.6      00:14:39
 29168       8   4,035      32,280       772.8      50.7      00:14:36
 28332       6   4,035      24,210       749.6      49.2      00:14:29
 29492       9   4,035      36,315       781.5      51.3      00:14:26
 28663       2   4,035       8,070       758.9      49.8      00:14:18
 29799       8   4,035      32,280       789.7      51.8      00:14:17
 28872       8   4,035      32,280       764.7      50.2      00:14:15
 30095       9   4,035      36,315       797.8      52.4      00:14:08
 29169       5   4,035      20,175       772.8      50.7      00:14:07
 30380       6   4,035      24,210       805.6      52.9      00:13:60
 29483       9   4,035      36,315       781.3      51.3      00:13:57
 30677       6   4,035      24,210       813.9      53.4      00:13:50
 29796      10   4,035      40,350       789.6      51.8      00:13:49
 31062       7   4,035      28,245       824.3      54.1      00:13:36
 30082       6   4,035      24,210       797.4      52.3      00:13:41
 31439       8   4,035      32,280       834.8      54.8      00:13:22
 30379       7   4,035      28,245       805.6      52.9      00:13:32
 31801       5   4,035      20,175       845.0      55.5      00:13:09
 30685       6   4,035      24,210       814.1      53.4      00:13:23
 32156       9   4,035      36,315       855.1      56.1      00:12:55
 31066       8   4,035      32,280       824.4      54.1      00:13:10
 32524       6   4,035      24,210       865.6      56.8      00:12:42
 31446       7   4,035      28,245       835.0      54.8      00:12:56
 32811       8   4,035      32,280       873.6      57.3      00:12:33
 31816       8   4,035      32,280       845.4      55.5      00:12:43
 33078      10   4,035      40,350       881.1      57.8      00:12:25
 32190       7   4,035      28,245       856.1      56.2      00:12:30
 33374       8   4,035      32,280       889.3      58.4      00:12:16
 32548       6   4,035      24,210       866.3      56.9      00:12:17
 33681       5   4,035      20,175       898.0      58.9      00:12:06
 32823       7   4,035      28,245       873.9      57.4      00:12:10
 34005      10   4,035      40,350       907.1      59.5      00:11:55
 33068      10   4,035      40,350       880.8      57.8      00:12:04
 34331       7   4,035      28,245       916.5      60.2      00:11:44
 33341       2   4,035       8,070       888.4      58.3      00:11:56
 34714      10   4,035      40,350       927.1      60.8      00:11:30
 33659       8   4,035      32,280       897.4      58.9      00:11:46
 35079       7   4,035      28,245       937.3      61.5      00:11:17
 33950       8   4,035      32,280       905.5      59.4      00:11:37
 35420       8   4,035      32,280       947.0      62.2      00:11:05
 34236      10   4,035      40,350       913.7      60.0      00:11:29
 35766       7   4,035      28,245       956.4      62.8      00:10:54
 34580      10   4,035      40,350       923.3      60.6      00:11:17
 36119       8   4,035      32,280       966.3      63.4      00:10:41
 34925       4   4,035      16,140       933.1      61.2      00:11:05
 36465       9   4,035      36,315       976.1      64.1      00:10:30
 35271       6   4,035      24,210       942.8      61.9      00:10:54
 36749       3   4,035      12,105       983.7      64.6      00:10:21
 35616       7   4,035      28,245       952.4      62.5      00:10:43
 37017       7   4,035      28,245       990.8      65.0      00:10:14
 35965       7   4,035      28,245       962.0      63.1      00:10:31
 37283       5   4,035      20,175       997.6      65.5      00:10:07
 36315       8   4,035      32,280       971.9      63.8      00:10:20
 37541       7   4,035      28,245     1,004.3      65.9      00:10:01
 36637       6   4,035      24,210       980.7      64.4      00:10:10
 37788       8   4,035      32,280     1,010.7      66.3      00:09:55
 36934      10   4,035      40,350       988.8      64.9      00:10:01
 38038       5   4,035      20,175     1,017.5      66.8      00:09:48
 37237       5   4,035      20,175       996.4      65.4      00:09:54
 38266       4   4,035      16,140     1,023.8      67.2      00:09:42
 37513       7   4,035      28,245     1,003.6      65.9      00:09:46
 38510       5   4,035      20,175     1,030.7      67.6      00:09:35
 37779      10   4,035      40,350     1,010.5      66.3      00:09:40
 38887       6   4,035      24,210     1,040.9      68.3      00:09:22
 38041       2   4,035       8,070     1,017.5      66.8      00:09:33
 39176       5   4,035      20,175     1,048.7      68.8      00:09:13
 38291       7   4,035      28,245     1,024.4      67.2      00:09:26
 39452       6   4,035      24,210     1,055.9      69.3      00:09:06
 38539      10   4,035      40,350     1,031.5      67.7      00:09:19
 39746      10   4,035      40,350     1,063.7      69.8      00:08:57
 38900       9   4,035      36,315     1,041.3      68.3      00:09:07
 40105       4   4,035      16,140     1,073.4      70.4      00:08:45
 39162       4   4,035      16,140     1,048.4      68.8      00:09:00
 40499       8   4,035      32,280     1,084.0      71.2      00:08:32
 39407       6   4,035      24,210     1,054.8      69.2      00:08:54
 40891       8   4,035      32,280     1,094.8      71.9      00:08:18
 39673       6   4,035      24,210     1,061.8      69.7      00:08:47
 41153       9   4,035      36,315     1,102.1      72.3      00:08:10
 39976       4   4,035      16,140     1,070.0      70.2      00:08:38
 41416       9   4,035      36,315     1,109.1      72.8      00:08:03
 40362       7   4,035      28,245     1,080.2      70.9      00:08:26
 41677       6   4,035      24,210     1,116.4      73.3      00:07:55
 40740       8   4,035      32,280     1,090.7      71.6      00:08:13
 41957       6   4,035      24,210     1,124.2      73.8      00:07:46
 41056       4   4,035      16,140     1,099.5      72.2      00:08:03
 42231       5   4,035      20,175     1,131.0      74.2      00:07:39
 41320      10   4,035      40,350     1,106.6      72.6      00:07:56
 42522       6   4,035      24,210     1,138.9      74.8      00:07:30
 41607       8   4,035      32,280     1,114.4      73.1      00:07:47
 42775       8   4,035      32,280     1,145.5      75.2      00:07:23
 41875       4   4,035      16,140     1,121.8      73.6      00:07:39
 43004       8   4,035      32,280     1,151.8      75.6      00:07:17
 42126       2   4,035       8,070     1,128.4      74.1      00:07:33
 43212       9   4,035      36,315     1,157.7      76.0      00:07:11
 42393       9   4,035      36,315     1,135.3      74.5      00:07:25
 43425      10   4,035      40,350     1,163.7      76.4      00:07:05
 42638       5   4,035      20,175     1,141.8      74.9      00:07:19
 43736       9   4,035      36,315     1,171.7      76.9      00:06:55
 42879       6   4,035      24,210     1,148.4      75.4      00:07:12
 44093      10   4,035      40,350     1,181.4      77.5      00:06:43
 43113      10   4,035      40,350     1,154.9      75.8      00:07:05
 44307       9   4,035      36,315     1,187.1      77.9      00:06:38
 43349       4   4,035      16,140     1,161.5      76.2      00:06:58
 44559       7   4,035      28,245     1,193.7      78.3      00:06:30
 43625       6   4,035      24,210     1,168.9      76.7      00:06:50
 44829       9   4,035      36,315     1,200.9      78.8      00:06:22
 43983       6   4,035      24,210     1,178.5      77.3      00:06:39
 45103       7   4,035      28,245     1,208.3      79.3      00:06:14
 44245       4   4,035      16,140     1,185.4      77.8      00:06:31
 45427      10   4,035      40,350     1,216.4      79.8      00:06:04
 44471       9   4,035      36,315     1,191.3      78.2      00:06:26
 45683       4   4,035      16,140     1,222.9      80.3      00:05:57
 44743       5   4,035      20,175     1,198.6      78.7      00:06:18
 45966       5   4,035      20,175     1,230.4      80.8      00:05:49
 44997       6   4,035      24,210     1,205.5      79.1      00:06:10
 46249       6   4,035      24,210     1,238.3      81.3      00:05:39
 45317       1   4,035       4,035     1,213.7      79.7      00:06:01
 46542      10   4,035      40,350     1,246.2      81.8      00:05:30
 45597       7   4,035      28,245     1,220.8      80.1      00:05:53
 46874       7   4,035      28,245     1,255.3      82.4      00:05:19
 45889      10   4,035      40,350     1,228.3      80.6      00:05:44
 47115       9   4,035      36,315     1,261.3      82.8      00:05:12
 46170       6   4,035      24,210     1,236.0      81.1      00:05:36
 47386       8   4,035      32,280     1,268.2      83.2      00:05:05
 46450      10   4,035      40,350     1,243.6      81.6      00:05:27
 47665      10   4,035      40,350     1,275.4      83.7      00:04:56
 46782       6   4,035      24,210     1,252.7      82.2      00:05:16
 47988       7   4,035      28,245     1,284.1      84.3      00:04:46
 47057       7   4,035      28,245     1,259.8      82.7      00:05:08
 48309       7   4,035      28,245     1,292.7      84.8      00:04:36
 47294      10   4,035      40,350     1,265.8      83.1      00:05:02
 48635       9   4,035      36,315     1,301.5      85.4      00:04:25
 47580       8   4,035      32,280     1,273.1      83.6      00:04:54
 48995       6   4,035      24,210     1,311.1      86.1      00:04:13
 47894      10   4,035      40,350     1,281.5      84.1      00:04:44
 49370       9   4,035      36,315     1,321.2      86.7      00:04:01
 48222       8   4,035      32,280     1,290.3      84.7      00:04:34
 49652       9   4,035      36,315     1,328.2      87.2      00:03:53
 48549       9   4,035      36,315     1,299.2      85.3      00:04:23
 49921       9   4,035      36,315     1,335.0      87.6      00:03:45
 48882       8   4,035      32,280     1,308.0      85.9      00:04:13
 50179       9   4,035      36,315     1,341.9      88.1      00:03:37
 49259       7   4,035      28,245     1,318.4      86.5      00:04:00
 50449       9   4,035      36,315     1,348.7      88.5      00:03:29
 49554       6   4,035      24,210     1,325.8      87.0      00:03:52
 50723       9   4,035      36,315     1,356.0      89.0      00:03:21
 49808       5   4,035      20,175     1,332.1      87.4      00:03:45
 50991       6   4,035      24,210     1,363.6      89.5      00:03:12
 50064       6   4,035      24,210     1,338.8      87.9      00:03:37
 51275       9   4,035      36,315     1,371.2      90.0      00:03:03
 50344       5   4,035      20,175     1,346.0      88.3      00:03:29
 51559       6   4,035      24,210     1,379.0      90.5      00:02:53
 50623       6   4,035      24,210     1,353.4      88.8      00:03:20
 51845       8   4,035      32,280     1,387.1      91.0      00:02:44
 50888       8   4,035      32,280     1,360.6      89.3      00:03:12
 52137       5   4,035      20,175     1,395.3      91.6      00:02:34
 51145       2   4,035       8,070     1,367.8      89.8      00:03:04
 52463       8   4,035      32,280     1,404.8      92.2      00:02:22
 51424       8   4,035      32,280     1,375.3      90.3      00:02:55
 52819       7   4,035      28,245     1,415.4      92.9      00:02:09
 51694       8   4,035      32,280     1,382.9      90.8      00:02:46
 53185       7   4,035      28,245     1,425.6      93.6      00:01:57
 51961       8   4,035      32,280     1,390.3      91.3      00:02:38
 53548       8   4,035      32,280     1,435.9      94.2      00:01:45
 52220       7   4,035      28,245     1,397.8      91.7      00:02:29
 53857       7   4,035      28,245     1,444.4      94.8      00:01:35
 52548       8   4,035      32,280     1,407.3      92.4      00:02:17
 54157       8   4,035      32,280     1,452.4      95.3      00:01:25
 52888      10   4,035      40,350     1,417.4      93.0      00:02:05
 54452       3   4,035      12,105     1,460.1      95.8      00:01:16
 53238      10   4,035      40,350     1,427.2      93.7      00:01:54
 54765       6   4,035      24,210     1,468.2      96.4      00:01:06
 53601       9   4,035      36,315     1,437.4      94.3      00:01:42
 55077       9   4,035      36,315     1,476.5      96.9      00:00:56
 53856      10   4,035      40,350     1,444.3      94.8      00:01:33
 55361       7   4,035      28,245     1,483.7      97.4      00:00:48
 54143       5   4,035      20,175     1,452.0      95.3      00:01:24
 55680       9   4,035      36,315     1,492.0      97.9      00:00:38
 54407       8   4,035      32,280     1,459.1      95.8      00:01:16
 55944       9   4,035      36,315     1,499.2      98.4      00:00:29
 54679       5   4,035      20,175     1,465.9      96.2      00:01:08
 56195      10   4,035      40,350     1,506.1      98.9      00:00:21
 54957       8   4,035      32,280     1,473.3      96.7      00:00:60
 56441       7   4,035      28,245     1,513.0      99.3      00:00:13
 55190       7   4,035      28,245     1,479.5      97.1      00:00:52
 56762       8   4,035      32,280     1,522.0      99.9      00:00:02
 55436       4   4,035      16,140     1,485.6      97.5      00:00:45

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1831.764
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 55716       7   4,035      28,245     1,493.0      98.0      00:00:36
 55986       7   4,035      28,245     1,500.4      98.5      00:00:28
 56249      10   4,035      40,350     1,507.7      99.0      00:00:19
 56493       5   4,035      20,175     1,514.6      99.4      00:00:11
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/
    > Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv saved

. 
. cap log close

. 
end of do-file

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1818.761
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv saved

. 
. cap log close

. 
end of do-file
