
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A100.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   525       8   4,135      33,080        12.5       0.8      00:20:37
  1084      10   4,135      41,350        26.8       1.7      00:19:04
  1634       7   4,135      28,945        41.8       2.7      00:18:11
  2190       5   4,135      20,675        56.4       3.6      00:17:48
  2771       8   4,135      33,080        71.8       4.6      00:17:18
  3355       8   4,135      33,080        87.7       5.6      00:16:49
  3895       5   4,135      20,675       102.4       6.6      00:16:38
  4355       4   4,135      16,540       114.0       7.3      00:16:56
  4816       8   4,135      33,080       126.5       8.1      00:17:01
  5260       8   4,135      33,080       138.4       8.9      00:17:10
  5678       8   4,135      33,080       149.0       9.5      00:17:24
  6018       7   4,135      28,945       158.1      10.1      00:17:46
  6366       7   4,135      28,945       167.2      10.7      00:18:06
  6833       1   4,135       4,135       179.5      11.5      00:17:59
  7298       8   4,135      33,080       191.6      12.3      00:17:54
  7726       3   4,135      12,405       203.2      13.0      00:17:51
  8150       9   4,135      37,215       215.3      13.8      00:17:44
  8601       7   4,135      28,945       228.1      14.6      00:17:34
  9047       6   4,135      24,810       240.6      15.4      00:17:24
  9415       9   4,135      37,215       251.0      16.1      00:17:25
  9728       7   4,135      28,945       260.1      16.7      00:17:32
 10060       9   4,135      37,215       269.0      17.2      00:17:38
 10390       7   4,135      28,945       277.4      17.8      00:17:46
 10784       9   4,135      37,215       287.8      18.4      00:17:44
 11204       5   4,135      20,675       299.2      19.2      00:17:36
 11555       7   4,135      28,945       308.6      19.8      00:17:37
 11865       6   4,135      24,810       317.0      20.3      00:17:41
 12180       8   4,135      33,080       325.6      20.9      00:17:44
 12630       8   4,135      33,080       337.7      21.6      00:17:32
 13165       9   4,135      37,215       351.8      22.5      00:17:13
 13694       5   4,135      20,675       366.8      23.5      00:16:51
 14240       7   4,135      28,945       381.6      24.4      00:16:31
 14766       7   4,135      28,945       396.1      25.4      00:16:12
 15299       6   4,135      24,810       411.0      26.3      00:15:53
 15822       7   4,135      28,945       425.5      27.2      00:15:36
 16308       7   4,135      28,945       439.4      28.1      00:15:21
 16735       7   4,135      28,945       451.3      28.9      00:15:11
 17116       9   4,135      37,215       461.8      29.6      00:15:06
 17472       7   4,135      28,945       471.9      30.2      00:15:02
 17803       9   4,135      37,215       481.1      30.8      00:14:60
 18171       9   4,135      37,215       491.4      31.5      00:14:54
 18613       6   4,135      24,810       503.3      32.2      00:14:44
 19171      10   4,135      41,350       519.4      33.3      00:14:24
 19713      10   4,135      41,350       534.9      34.3      00:14:06
 20259       2   4,135       8,270       550.6      35.3      00:13:47
 20710       7   4,135      28,945       563.3      36.1      00:13:36
 21140      10   4,135      41,350       575.1      36.8      00:13:27
 21586       8   4,135      33,080       586.6      37.6      00:13:19
 22035      10   4,135      41,350       598.2      38.3      00:13:10
 22512       9   4,135      37,215       610.5      39.1      00:12:60
 22963       9   4,135      37,215       622.0      39.8      00:12:51
 23391       8   4,135      33,080       633.9      40.6      00:12:42
 23852       9   4,135      37,215       646.1      41.4      00:12:32
 24330       7   4,135      28,945       658.5      42.2      00:12:22
 24869       7   4,135      28,945       673.2      43.1      00:12:07
 25403       8   4,135      33,080       687.9      44.1      00:11:52
 25851       3   4,135      12,405       700.2      44.8      00:11:42
 26266      10   4,135      41,350       711.7      45.6      00:11:33
 26799       8   4,135      33,080       725.8      46.5      00:11:20
 27238       1   4,135       4,135       737.6      47.2      00:11:11
 27634       9   4,135      37,215       748.5      47.9      00:11:03
 28095       8   4,135      33,080       761.4      48.8      00:10:52
 28542       3   4,135      12,405       774.2      49.6      00:10:41
 28858       8   4,135      33,080       783.2      50.2      00:10:37
 29211       7   4,135      28,945       793.0      50.8      00:10:31
 29656       3   4,135      12,405       805.2      51.6      00:10:21
 30036       9   4,135      37,215       815.9      52.3      00:10:13
 30456       5   4,135      20,675       827.7      53.0      00:10:03
 30978       9   4,135      37,215       842.5      54.0      00:09:50
 31522       6   4,135      24,810       857.9      54.9      00:09:35
 32057      10   4,135      41,350       873.5      55.9      00:09:20
 32553       6   4,135      24,810       887.9      56.9      00:09:07
 32906       5   4,135      20,675       897.9      57.5      00:09:00
 33307       9   4,135      37,215       909.4      58.2      00:08:51
 33804       9   4,135      37,215       923.7      59.2      00:08:38
 34275       4   4,135      16,540       937.5      60.0      00:08:26
 34816       7   4,135      28,945       953.1      61.0      00:08:12
 35383       5   4,135      20,675       969.3      62.1      00:07:57
 35940       9   4,135      37,215       985.2      63.1      00:07:43
 36494      10   4,135      41,350     1,001.1      64.1      00:07:28
 36938       7   4,135      28,945     1,013.4      64.9      00:07:19
 37384       7   4,135      28,945     1,025.0      65.6      00:07:10
 37774       8   4,135      33,080     1,035.4      66.3      00:07:02
 38153       7   4,135      28,945     1,045.9      67.0      00:06:54
 38527       9   4,135      37,215     1,056.7      67.7      00:06:46
 38921       9   4,135      37,215     1,067.7      68.4      00:06:38
 39471       6   4,135      24,810     1,082.6      69.3      00:06:25
 40035       4   4,135      16,540     1,098.1      70.3      00:06:12
 40581       9   4,135      37,215     1,113.2      71.3      00:05:59
 41061       6   4,135      24,810     1,126.9      72.2      00:05:47
 41489       9   4,135      37,215     1,138.8      72.9      00:05:38
 41932       8   4,135      33,080     1,151.3      73.7      00:05:28
 42327       6   4,135      24,810     1,161.5      74.4      00:05:21
 42741       5   4,135      20,675     1,172.9      75.1      00:05:12
 43147       8   4,135      33,080     1,184.5      75.9      00:05:03
 43533       3   4,135      12,405     1,195.5      76.6      00:04:54
 43912       9   4,135      37,215     1,205.7      77.2      00:04:46
 44340       5   4,135      20,675     1,217.4      78.0      00:04:37
 44810       4   4,135      16,540     1,230.1      78.8      00:04:27
 45296       6   4,135      24,810     1,243.3      79.6      00:04:16
 45706       5   4,135      20,675     1,253.8      80.3      00:04:08
 46137       5   4,135      20,675     1,265.7      81.1      00:03:59
 46560       6   4,135      24,810     1,277.6      81.8      00:03:49
 47050       1   4,135       4,135     1,290.8      82.7      00:03:38
 47444       7   4,135      28,945     1,301.1      83.3      00:03:30
 47852       8   4,135      33,080     1,312.1      84.0      00:03:22
 48235       7   4,135      28,945     1,322.6      84.7      00:03:13
 48647       6   4,135      24,810     1,334.1      85.4      00:03:04
 49103       4   4,135      16,540     1,346.5      86.2      00:02:54
 49614       7   4,135      28,945     1,360.2      87.1      00:02:43
 50212       6   4,135      24,810     1,376.1      88.1      00:02:30
 50652       5   4,135      20,675     1,387.8      88.9      00:02:20
 51054      10   4,135      41,350     1,399.2      89.6      00:02:11
 51463       8   4,135      33,080     1,410.5      90.3      00:02:02
 51891       5   4,135      20,675     1,422.8      91.1      00:01:52
 52324       9   4,135      37,215     1,435.4      91.9      00:01:42
 52745       7   4,135      28,945     1,448.2      92.8      00:01:31
 53170       7   4,135      28,945     1,460.6      93.5      00:01:21
 53697       3   4,135      12,405     1,475.6      94.5      00:01:09
 54071       9   4,135      37,215     1,486.0      95.2      00:01:01
 54487       8   4,135      33,080     1,497.2      95.9      00:00:52
 54956       5   4,135      20,675     1,509.8      96.7      00:00:42
 55365       8   4,135      33,080     1,520.6      97.4      00:00:33
 55751       6   4,135      24,810     1,530.9      98.1      00:00:25
 56134      10   4,135      41,350     1,541.7      98.7      00:00:16
 56562       8   4,135      33,080     1,554.1      99.5      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1272.301
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A100.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A100.csv saved

. 
. cap log close

. 
end of do-file
