
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A800.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A800.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A800.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A800.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   296      10   4,835      48,350         8.2       0.5      00:36:54
   651       8   4,835      38,680        18.4       1.0      00:32:50
  1001       4   4,835      19,340        28.9       1.6      00:31:10
  1342       7   4,835      33,845        39.7       2.2      00:30:01
  1671       8   4,835      38,680        50.3       2.8      00:29:27
  2014       8   4,835      38,680        60.6       3.3      00:29:12
  2350       5   4,835      24,175        71.0       3.9      00:28:53
  2690       5   4,835      24,175        81.5       4.5      00:28:35
  3030       6   4,835      29,010        92.1       5.0      00:28:17
  3358       8   4,835      38,680       103.0       5.6      00:27:55
  3702       3   4,835      14,505       113.9       6.2      00:27:35
  4003       9   4,835      43,515       123.0       6.7      00:27:44
  4275      10   4,835      48,350       131.1       7.2      00:28:02
  4535       6   4,835      29,010       139.1       7.6      00:28:19
  4792       8   4,835      38,680       147.5       8.1      00:28:29
  5057       7   4,835      33,845       155.8       8.5      00:28:37
  5315       3   4,835      14,505       163.8       9.0      00:28:48
  5544       8   4,835      38,680       170.6       9.3      00:29:10
  5736      10   4,835      48,350       176.3       9.7      00:29:41
  5965       5   4,835      24,175       183.4      10.1      00:29:54
  6202       5   4,835      24,175       190.8      10.5      00:30:02
  6447       7   4,835      33,845       198.3      10.9      00:30:08
  6700       8   4,835      38,680       205.9      11.3      00:30:12
  6938       5   4,835      24,175       213.3      11.7      00:30:17
  7241       6   4,835      29,010       222.4      12.2      00:30:05
  7515       9   4,835      43,515       231.2      12.7      00:29:56
  7773       9   4,835      43,515       239.4      13.1      00:29:52
  8023       6   4,835      29,010       247.8      13.6      00:29:46
  8289       7   4,835      33,845       256.5      14.1      00:29:36
  8542      10   4,835      48,350       265.1      14.5      00:29:29
  8797       6   4,835      29,010       273.3      15.0      00:29:23
  9058       6   4,835      29,010       281.9      15.5      00:29:15
  9282       5   4,835      24,175       289.5      15.9      00:29:14
  9498       9   4,835      43,515       296.6      16.3      00:29:15
  9725       6   4,835      29,010       304.3      16.7      00:29:12
  9948       8   4,835      38,680       311.3      17.1      00:29:13
 10186       7   4,835      33,845       318.3      17.4      00:29:15
 10404       7   4,835      33,845       325.0      17.8      00:29:17
 10662       6   4,835      29,010       333.0      18.3      00:29:10
 10937       5   4,835      24,175       341.6      18.7      00:28:60
 11178       9   4,835      43,515       349.2      19.1      00:28:56
 11382       8   4,835      38,680       355.6      19.5      00:28:59
 11573       8   4,835      38,680       361.5      19.8      00:29:04
 11803       8   4,835      38,680       368.9      20.2      00:28:60
 12020      10   4,835      48,350       375.8      20.6      00:28:59
 12240       3   4,835      14,505       382.8      21.0      00:28:56
 12526       6   4,835      29,010       391.8      21.5      00:28:42
 12840      10   4,835      48,350       401.3      22.0      00:28:26
 13144       6   4,835      29,010       410.9      22.5      00:28:09
 13448       6   4,835      29,010       420.9      23.1      00:27:51
 13654       9   4,835      43,515       427.8      23.5      00:27:49
 13857       6   4,835      29,010       434.2      23.8      00:27:49
 14113      10   4,835      48,350       442.1      24.2      00:27:41
 14374       8   4,835      38,680       450.8      24.7      00:27:29
 14648       6   4,835      29,010       459.6      25.2      00:27:17
 14926       8   4,835      38,680       468.5      25.7      00:27:04
 15214       6   4,835      29,010       478.2      26.2      00:26:48
 15509       2   4,835       9,670       487.6      26.7      00:26:33
 15803       7   4,835      33,845       497.1      27.2      00:26:19
 16087       7   4,835      33,845       506.8      27.8      00:26:03
 16388       8   4,835      38,680       516.8      28.3      00:25:47
 16629       7   4,835      33,845       524.4      28.7      00:25:40
 16855       5   4,835      24,175       531.7      29.1      00:25:35
 17060       8   4,835      38,680       538.4      29.5      00:25:32
 17268      10   4,835      48,350       545.2      29.9      00:25:28
 17462       9   4,835      43,515       551.7      30.2      00:25:26
 17656      10   4,835      48,350       558.3      30.6      00:25:23
 17910       6   4,835      29,010       566.2      31.0      00:25:14
 18190      10   4,835      48,350       575.5      31.5      00:25:00
 18487       8   4,835      38,680       584.6      32.0      00:24:48
 18684       7   4,835      33,845       591.3      32.4      00:24:44
 18900       4   4,835      19,340       598.4      32.8      00:24:38
 19139       6   4,835      29,010       606.6      33.2      00:24:29
 19407       5   4,835      24,175       615.4      33.7      00:24:17
 19689      10   4,835      48,350       625.0      34.3      00:24:02
 19972       6   4,835      29,010       634.6      34.8      00:23:48
 20264       3   4,835      14,505       644.2      35.3      00:23:34
 20527       9   4,835      43,515       652.9      35.8      00:23:23
 20743       7   4,835      33,845       660.0      36.2      00:23:17
 20953       7   4,835      33,845       667.0      36.6      00:23:11
 21195       7   4,835      33,845       674.3      37.0      00:23:05
 21446       6   4,835      29,010       681.8      37.4      00:22:57
 21681       7   4,835      33,845       688.9      37.8      00:22:51
 21927       6   4,835      29,010       696.5      38.2      00:22:43
 22176       8   4,835      38,680       703.8      38.6      00:22:36
 22417       8   4,835      38,680       711.1      39.0      00:22:29
 22661       8   4,835      38,680       718.7      39.4      00:22:21
 22965       9   4,835      43,515       727.7      39.9      00:22:09
 23259       8   4,835      38,680       737.3      40.4      00:21:55
 23560       7   4,835      33,845       746.2      40.9      00:21:43
 23854       5   4,835      24,175       755.8      41.4      00:21:29
 24173       3   4,835      14,505       765.4      42.0      00:21:16
 24468       9   4,835      43,515       774.6      42.5      00:21:03
 24673       7   4,835      33,845       781.4      42.8      00:20:57
 24950       7   4,835      33,845       789.9      43.3      00:20:47
 25240       8   4,835      38,680       799.3      43.8      00:20:34
 25511       7   4,835      33,845       808.2      44.3      00:20:22
 25704      10   4,835      48,350       814.1      44.6      00:20:19
 25903       5   4,835      24,175       820.7      45.0      00:20:13
 26107       8   4,835      38,680       827.3      45.3      00:20:08
 26348       1   4,835       4,835       834.9      45.8      00:19:60
 26585       3   4,835      14,505       842.2      46.2      00:19:52
 26847       6   4,835      29,010       850.5      46.6      00:19:42
 27088       9   4,835      43,515       858.1      47.0      00:19:34
 27269       8   4,835      38,680       863.9      47.4      00:19:30
 27478      10   4,835      48,350       870.6      47.7      00:19:24
 27684       6   4,835      29,010       877.3      48.1      00:19:18
 27930       4   4,835      19,340       885.4      48.5      00:19:08
 28236       8   4,835      38,680       895.3      49.1      00:18:54
 28522       4   4,835      19,340       905.1      49.6      00:18:40
 28748      10   4,835      48,350       912.5      50.0      00:18:32
 28950       5   4,835      24,175       919.2      50.4      00:18:25
 29175       8   4,835      38,680       926.5      50.8      00:18:18
 29420      10   4,835      48,350       934.6      51.2      00:18:08
 29680       5   4,835      24,175       942.7      51.7      00:17:58
 29886       9   4,835      43,515       949.5      52.0      00:17:51
 30090       3   4,835      14,505       956.2      52.4      00:17:45
 30286       5   4,835      24,175       962.7      52.8      00:17:39
 30510       6   4,835      29,010       970.2      53.2      00:17:30
 30784       6   4,835      29,010       979.2      53.7      00:17:18
 31083       5   4,835      24,175       988.8      54.2      00:17:05
 31371       9   4,835      43,515       998.4      54.7      00:16:52
 31669       9   4,835      43,515     1,008.4      55.3      00:16:37
 31954       5   4,835      24,175     1,018.3      55.8      00:16:24
 32239       9   4,835      43,515     1,028.0      56.3      00:16:11
 32503       7   4,835      33,845     1,036.9      56.8      00:15:59
 32676       6   4,835      29,010     1,042.6      57.2      00:15:54
 32878      10   4,835      48,350     1,049.4      57.5      00:15:48
 33075      10   4,835      48,350     1,056.1      57.9      00:15:41
 33310       9   4,835      43,515     1,063.9      58.3      00:15:31
 33552       9   4,835      43,515     1,072.1      58.8      00:15:22
 33783       8   4,835      38,680     1,079.9      59.2      00:15:12
 34010       6   4,835      29,010     1,087.5      59.6      00:15:03
 34237       6   4,835      29,010     1,095.3      60.0      00:14:54
 34524       8   4,835      38,680     1,104.9      60.6      00:14:41
 34822       3   4,835      14,505     1,115.1      61.1      00:14:27
 35123       7   4,835      33,845     1,125.1      61.7      00:14:14
 35431       7   4,835      33,845     1,135.6      62.2      00:13:59
 35724       2   4,835       9,670     1,145.1      62.8      00:13:46
 36036       9   4,835      43,515     1,155.5      63.3      00:13:32
 36333       9   4,835      43,515     1,165.6      63.9      00:13:19
 36597       6   4,835      29,010     1,174.2      64.4      00:13:08
 36812       6   4,835      29,010     1,181.1      64.7      00:13:01
 37025       9   4,835      43,515     1,187.9      65.1      00:12:53
 37238       9   4,835      43,515     1,194.4      65.5      00:12:47
 37445      10   4,835      48,350     1,200.8      65.8      00:12:40
 37666       1   4,835       4,835     1,207.6      66.2      00:12:32
 37850       9   4,835      43,515     1,213.5      66.5      00:12:27
 38050       6   4,835      29,010     1,220.2      66.9      00:12:20
 38265       8   4,835      38,680     1,227.2      67.3      00:12:12
 38490       6   4,835      29,010     1,234.8      67.7      00:12:03
 38793       8   4,835      38,680     1,244.6      68.2      00:11:50
 39022       8   4,835      38,680     1,252.2      68.6      00:11:41
 39210       3   4,835      14,505     1,258.0      69.0      00:11:35
 39439       7   4,835      33,845     1,265.2      69.4      00:11:27
 39691       6   4,835      29,010     1,273.3      69.8      00:11:17
 39969       7   4,835      33,845     1,282.3      70.3      00:11:05
 40248       6   4,835      29,010     1,291.0      70.8      00:10:54
 40547       7   4,835      33,845     1,300.9      71.3      00:10:41
 40855       8   4,835      38,680     1,311.1      71.9      00:10:28
 41060      10   4,835      48,350     1,318.0      72.2      00:10:20
 41270       9   4,835      43,515     1,324.8      72.6      00:10:12
 41506       7   4,835      33,845     1,332.5      73.0      00:10:03
 41724       6   4,835      29,010     1,339.6      73.4      00:09:55
 41946       1   4,835       4,835     1,347.0      73.8      00:09:46
 42159       3   4,835      14,505     1,353.4      74.2      00:09:39
 42386       7   4,835      33,845     1,360.7      74.6      00:09:30
 42617       6   4,835      29,010     1,367.9      75.0      00:09:22
 42833       4   4,835      19,340     1,375.0      75.4      00:09:14
 43028       3   4,835      14,505     1,381.4      75.7      00:09:06
 43216       9   4,835      43,515     1,387.8      76.1      00:08:59
 43415       6   4,835      29,010     1,394.5      76.4      00:08:51
 43694       6   4,835      29,010     1,403.1      76.9      00:08:41
 43991       8   4,835      38,680     1,412.7      77.4      00:08:28
 44208       7   4,835      33,845     1,419.7      77.8      00:08:20
 44402      10   4,835      48,350     1,425.6      78.1      00:08:13
 44629       9   4,835      43,515     1,433.0      78.5      00:08:05
 44869      10   4,835      48,350     1,440.9      79.0      00:07:55
 45122       6   4,835      29,010     1,448.8      79.4      00:07:45
 45391       7   4,835      33,845     1,456.8      79.9      00:07:35
 45606       9   4,835      43,515     1,463.4      80.2      00:07:28
 45847       7   4,835      33,845     1,470.8      80.6      00:07:19
 46080       5   4,835      24,175     1,478.4      81.0      00:07:09
 46283       7   4,835      33,845     1,485.3      81.4      00:07:01
 46501      10   4,835      48,350     1,492.2      81.8      00:06:53
 46779       6   4,835      29,010     1,501.3      82.3      00:06:41
 46985       7   4,835      33,845     1,507.7      82.6      00:06:34
 47181       9   4,835      43,515     1,513.4      83.0      00:06:27
 47364      10   4,835      48,350     1,519.3      83.3      00:06:20
 47577      10   4,835      48,350     1,525.8      83.6      00:06:13
 47794       7   4,835      33,845     1,532.6      84.0      00:06:04
 47998      10   4,835      48,350     1,539.3      84.4      00:05:56
 48209       8   4,835      38,680     1,546.0      84.7      00:05:48
 48424       9   4,835      43,515     1,553.0      85.1      00:05:40
 48656       8   4,835      38,680     1,560.5      85.5      00:05:30
 48879       9   4,835      43,515     1,567.6      85.9      00:05:22
 49074       8   4,835      38,680     1,573.9      86.3      00:05:14
 49283       5   4,835      24,175     1,580.7      86.6      00:05:06
 49504       8   4,835      38,680     1,587.4      87.0      00:04:58
 49734       9   4,835      43,515     1,594.2      87.4      00:04:49
 49941       9   4,835      43,515     1,600.8      87.7      00:04:41
 50148       5   4,835      24,175     1,607.3      88.1      00:04:33
 50390       7   4,835      33,845     1,614.6      88.5      00:04:24
 50600       7   4,835      33,845     1,621.4      88.9      00:04:16
 50812       7   4,835      33,845     1,628.3      89.3      00:04:07
 51030       4   4,835      19,340     1,635.9      89.7      00:03:58
 51267       7   4,835      33,845     1,643.3      90.1      00:03:49
 51504       7   4,835      33,845     1,651.1      90.5      00:03:39
 51713      10   4,835      48,350     1,658.2      90.9      00:03:30
 51958       9   4,835      43,515     1,666.4      91.3      00:03:20
 52251       9   4,835      43,515     1,676.5      91.9      00:03:07
 52549       7   4,835      33,845     1,687.0      92.5      00:02:53
 52847       9   4,835      43,515     1,697.5      93.0      00:02:40
 53155      10   4,835      48,350     1,707.9      93.6      00:02:26
 53459       5   4,835      24,175     1,718.0      94.2      00:02:13
 53726       8   4,835      38,680     1,726.9      94.7      00:02:02
 53972      10   4,835      48,350     1,734.8      95.1      00:01:52
 54173      10   4,835      48,350     1,741.3      95.4      00:01:44
 54406       8   4,835      38,680     1,748.5      95.8      00:01:35
 54697       8   4,835      38,680     1,757.6      96.3      00:01:24
 54962       9   4,835      43,515     1,766.0      96.8      00:01:13
 55201       9   4,835      43,515     1,773.5      97.2      00:01:04
 55454      10   4,835      48,350     1,781.2      97.6      00:00:54
 55714       4   4,835      19,340     1,789.3      98.1      00:00:44
 55950       5   4,835      24,175     1,797.1      98.5      00:00:34
 56219       7   4,835      33,845     1,806.0      99.0      00:00:23
 56481       5   4,835      24,175     1,814.9      99.5      00:00:12

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 2291.484
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A800.csv saved

. 
. cap log close

. 
end of do-file
