
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A600_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   348       6   4,635      27,810         9.2       0.5      00:31:37
   714       5   4,635      23,175        19.3       1.1      00:29:58
  1085       9   4,635      41,715        30.1       1.7      00:28:36
  1449       6   4,635      27,810        41.2       2.4      00:27:41
  1844      10   4,635      46,350        53.0       3.0      00:26:44
  2229       9   4,635      41,715        64.4       3.7      00:26:12
  2614       4   4,635      18,540        75.6       4.3      00:25:52
  3003      10   4,635      46,350        87.2       5.0      00:25:28
  3370       7   4,635      32,445        98.9       5.6      00:25:06
  3760       7   4,635      32,445       110.8       6.3      00:24:42
  4073       9   4,635      41,715       119.8       6.8      00:24:59
  4365      10   4,635      46,350       128.1       7.3      00:25:23
  4660       9   4,635      41,715       137.2       7.8      00:25:32
  5006       8   4,635      37,080       147.6       8.4      00:25:23
  5317       7   4,635      32,445       156.9       9.0      00:25:27
  5649       6   4,635      27,810       166.2       9.5      00:25:28
  5981       7   4,635      32,445       176.0      10.1      00:25:23
  6312       3   4,635      13,905       185.9      10.6      00:25:18
  6644      10   4,635      46,350       195.5      11.2      00:25:13
  7000       7   4,635      32,445       206.1      11.8      00:25:01
  7428       7   4,635      32,445       218.8      12.5      00:24:32
  7862       6   4,635      27,810       232.1      13.3      00:24:02
  8249       7   4,635      32,445       244.5      14.0      00:23:39
  8650       8   4,635      37,080       257.2      14.7      00:23:15
  9054       3   4,635      13,905       269.9      15.4      00:22:53
  9395       9   4,635      41,715       280.7      16.0      00:22:43
  9727      10   4,635      46,350       291.5      16.7      00:22:33
 10064       8   4,635      37,080       301.7      17.2      00:22:26
 10406       9   4,635      41,715       311.4      17.8      00:22:22
 10787       9   4,635      41,715       322.7      18.4      00:22:09
 11171       4   4,635      18,540       334.3      19.1      00:21:55
 11486       7   4,635      32,445       343.9      19.6      00:21:51
 11801       9   4,635      41,715       353.3      20.2      00:21:47
 12133      10   4,635      46,350       363.5      20.8      00:21:39
 12530       7   4,635      32,445       375.5      21.5      00:21:23
 13011       9   4,635      41,715       389.6      22.3      00:20:59
 13456       5   4,635      23,175       403.4      23.1      00:20:37
 13794      10   4,635      46,350       414.1      23.7      00:20:28
 14160      10   4,635      46,350       425.1      24.3      00:20:17
 14576       8   4,635      37,080       438.2      25.0      00:19:59
 15002       6   4,635      27,810       451.4      25.8      00:19:41
 15470       5   4,635      23,175       466.0      26.6      00:19:19
 15930       7   4,635      32,445       480.3      27.4      00:18:58
 16409       6   4,635      27,810       495.8      28.3      00:18:35
 16790       7   4,635      32,445       507.6      29.0      00:18:23
 17145       8   4,635      37,080       518.5      29.6      00:18:14
 17469      10   4,635      46,350       528.8      30.2      00:18:07
 17824       5   4,635      23,175       539.8      30.8      00:17:58
 18221       6   4,635      27,810       552.5      31.6      00:17:44
 18659       8   4,635      37,080       565.7      32.3      00:17:28
 19151      10   4,635      46,350       581.5      33.2      00:17:06
 19641       7   4,635      32,445       597.1      34.1      00:16:46
 20118       8   4,635      37,080       612.9      35.0      00:16:25
 20570       8   4,635      37,080       627.0      35.8      00:16:09
 20912       6   4,635      27,810       637.9      36.4      00:16:00
 21328       6   4,635      27,810       649.6      37.1      00:15:50
 21723       6   4,635      27,810       661.3      37.8      00:15:40
 22105       6   4,635      27,810       672.4      38.4      00:15:31
 22503       7   4,635      32,445       684.0      39.1      00:15:21
 22895       6   4,635      27,810       695.2      39.7      00:15:12
 23254       7   4,635      32,445       706.4      40.4      00:15:03
 23650       9   4,635      41,715       717.9      41.0      00:14:53
 24034       8   4,635      37,080       729.7      41.7      00:14:42
 24516       6   4,635      27,810       743.8      42.5      00:14:27
 24984       7   4,635      32,445       758.0      43.3      00:14:12
 25436       6   4,635      27,810       772.1      44.1      00:13:57
 25802       6   4,635      27,810       783.3      44.8      00:13:48
 26147       7   4,635      32,445       794.0      45.4      00:13:40
 26609       6   4,635      27,810       807.8      46.2      00:13:26
 27057       8   4,635      37,080       821.5      46.9      00:13:13
 27387       8   4,635      37,080       831.4      47.5      00:13:06
 27756       9   4,635      41,715       842.9      48.2      00:12:56
 28220       5   4,635      23,175       857.4      49.0      00:12:41
 28695       4   4,635      18,540       872.6      49.9      00:12:25
 29011       8   4,635      37,080       882.7      50.4      00:12:18
 29384       9   4,635      41,715       894.3      51.1      00:12:08
 29781      10   4,635      46,350       906.6      51.8      00:11:57
 30101       7   4,635      32,445       916.6      52.4      00:11:50
 30464       7   4,635      32,445       928.1      53.0      00:11:41
 30918       6   4,635      27,810       942.5      53.9      00:11:26
 31419       8   4,635      37,080       958.3      54.8      00:11:10
 31909       7   4,635      32,445       974.2      55.7      00:10:54
 32396       5   4,635      23,175       990.2      56.6      00:10:38
 32743       9   4,635      41,715     1,001.2      57.2      00:10:29
 33066       9   4,635      41,715     1,011.7      57.8      00:10:21
 33461       8   4,635      37,080     1,024.3      58.5      00:10:10
 33844       8   4,635      37,080     1,036.7      59.2      00:09:60
 34221       3   4,635      13,905     1,049.1      59.9      00:09:49
 34667       6   4,635      27,810     1,063.4      60.8      00:09:36
 35143       5   4,635      23,175     1,078.7      61.6      00:09:21
 35627       4   4,635      18,540     1,094.4      62.5      00:09:06
 36106      10   4,635      46,350     1,109.5      63.4      00:08:52
 36578       5   4,635      23,175     1,124.6      64.3      00:08:38
 36934      10   4,635      46,350     1,135.8      64.9      00:08:29
 37290       6   4,635      27,810     1,146.2      65.5      00:08:21
 37627      10   4,635      46,350     1,156.3      66.1      00:08:14
 37972       8   4,635      37,080     1,166.7      66.7      00:08:06
 38303       7   4,635      32,445     1,177.2      67.3      00:07:58
 38605       9   4,635      41,715     1,186.9      67.8      00:07:50
 38927       6   4,635      27,810     1,197.0      68.4      00:07:43
 39269       7   4,635      32,445     1,207.4      69.0      00:07:35
 39668      10   4,635      46,350     1,219.6      69.7      00:07:24
 40132      10   4,635      46,350     1,233.8      70.5      00:07:12
 40625      10   4,635      46,350     1,249.3      71.4      00:06:58
 41069       3   4,635      13,905     1,263.4      72.2      00:06:45
 41455       7   4,635      32,445     1,275.3      72.9      00:06:35
 41842       8   4,635      37,080     1,287.5      73.6      00:06:25
 42136       5   4,635      23,175     1,296.5      74.1      00:06:18
 42500       9   4,635      41,715     1,307.5      74.7      00:06:10
 42847       6   4,635      27,810     1,318.1      75.3      00:06:01
 43159       7   4,635      32,445     1,328.2      75.9      00:05:53
 43484       8   4,635      37,080     1,338.6      76.5      00:05:45
 43834       8   4,635      37,080     1,349.0      77.1      00:05:36
 44192       7   4,635      32,445     1,360.0      77.7      00:05:28
 44548       8   4,635      37,080     1,370.8      78.3      00:05:19
 44936       7   4,635      32,445     1,382.9      79.0      00:05:08
 45336       7   4,635      32,445     1,394.7      79.7      00:04:59
 45692       6   4,635      27,810     1,405.0      80.3      00:04:50
 46059       6   4,635      27,810     1,416.4      80.9      00:04:41
 46431       8   4,635      37,080     1,428.0      81.6      00:04:31
 46837       8   4,635      37,080     1,440.8      82.3      00:04:20
 47183       6   4,635      27,810     1,450.8      82.9      00:04:12
 47527       8   4,635      37,080     1,460.8      83.5      00:04:04
 47855       9   4,635      41,715     1,470.8      84.0      00:03:56
 48186       7   4,635      32,445     1,481.0      84.6      00:03:47
 48547       8   4,635      37,080     1,492.3      85.3      00:03:38
 48884      10   4,635      46,350     1,502.6      85.9      00:03:30
 49224       7   4,635      32,445     1,513.4      86.5      00:03:21
 49585       6   4,635      27,810     1,523.8      87.1      00:03:12
 49934       7   4,635      32,445     1,533.9      87.6      00:03:04
 50284       9   4,635      41,715     1,544.5      88.3      00:02:55
 50651       9   4,635      41,715     1,555.5      88.9      00:02:45
 50982       9   4,635      41,715     1,566.1      89.5      00:02:37
 51349       8   4,635      37,080     1,577.4      90.1      00:02:27
 51724       6   4,635      27,810     1,589.5      90.8      00:02:17
 52066       8   4,635      37,080     1,600.4      91.4      00:02:07
 52401       8   4,635      37,080     1,611.6      92.1      00:01:58
 52728       8   4,635      37,080     1,622.8      92.7      00:01:48
 53064       8   4,635      37,080     1,633.8      93.4      00:01:39
 53461       5   4,635      23,175     1,646.5      94.1      00:01:28
 53855       7   4,635      32,445     1,659.1      94.8      00:01:18
 54201       5   4,635      23,175     1,669.7      95.4      00:01:09
 54575       8   4,635      37,080     1,680.6      96.0      00:00:59
 54975      10   4,635      46,350     1,692.9      96.7      00:00:49
 55322       8   4,635      37,080     1,703.3      97.3      00:00:40
 55664      10   4,635      46,350     1,713.3      97.9      00:00:31
 56003       6   4,635      27,810     1,724.0      98.5      00:00:22
 56381       4   4,635      18,540     1,736.1      99.2      00:00:12
 56760      10   4,635      46,350     1,748.2      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1499.571
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
