
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_1_4q_flexthresh2_3_15_norandomterm.dta /export/storage_co
> vidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_blk_Doll
> ar_dist_total_10000_1_4q_flexthresh2_3_15_norandomterm.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 19:13:50

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_1_4q_flexthresh2_3_15_norandom
> term.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15_norandomte
> rm.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   487       6   4,035      24,210        11.2       0.7      00:22:25
   965       8   4,035      32,280        23.0       1.5      00:21:48
  1448       7   4,035      28,245        35.9       2.4      00:20:47
  1940       8   4,035      32,280        48.5       3.2      00:20:19
  2388       3   4,035      12,105        60.1       3.9      00:20:20
  2871       2   4,035       8,070        72.7       4.8      00:19:58
  3329       4   4,035      16,140        84.9       5.6      00:19:48
  3807       3   4,035      12,105        97.7       6.4      00:19:29
  4208       6   4,035      24,210       107.8       7.1      00:19:43
  4610       9   4,035      36,315       118.0       7.7      00:19:53
  4985       6   4,035      24,210       127.9       8.4      00:20:02
  5363      10   4,035      40,350       137.9       9.0      00:20:08
  5650       9   4,035      36,315       144.7       9.5      00:20:40
  5976       8   4,035      32,280       153.1      10.1      00:20:55
  6364       3   4,035      12,105       163.1      10.7      00:20:53
  6747       8   4,035      32,280       172.8      11.3      00:20:52
  7166      10   4,035      40,350       183.5      12.0      00:20:43
  7602      10   4,035      40,350       195.2      12.8      00:20:27
  8063       9   4,035      36,315       207.7      13.6      00:20:05
  8525      10   4,035      40,350       220.6      14.5      00:19:43
  8999      10   4,035      40,350       233.5      15.3      00:19:22
  9392       7   4,035      28,245       244.3      16.0      00:19:13
  9740       8   4,035      32,280       254.2      16.7      00:19:10
 10114       8   4,035      32,280       263.8      17.3      00:19:07
 10518       9   4,035      36,315       274.1      18.0      00:19:01
 10938       9   4,035      36,315       285.0      18.7      00:18:51
 11318       6   4,035      24,210       294.8      19.3      00:18:47
 11644       8   4,035      32,280       303.4      19.9      00:18:47
 11994       6   4,035      24,210       312.7      20.5      00:18:45
 12352       6   4,035      24,210       322.2      21.1      00:18:40
 12868       5   4,035      20,175       335.5      22.0      00:18:19
 13370       8   4,035      32,280       348.7      22.9      00:17:59
 13864       9   4,035      36,315       362.3      23.8      00:17:39
 14404      10   4,035      40,350       376.9      24.7      00:17:16
 14921       6   4,035      24,210       390.6      25.6      00:16:56
 15433       7   4,035      28,245       404.7      26.6      00:16:36
 15947       6   4,035      24,210       418.7      27.5      00:16:17
 16472       7   4,035      28,245       433.5      28.5      00:15:57
 16857       6   4,035      24,210       443.7      29.1      00:15:50
 17213      10   4,035      40,350       453.2      29.7      00:15:46
 17553       5   4,035      20,175       462.9      30.4      00:15:41
 17954       7   4,035      28,245       473.5      31.1      00:15:33
 18358      10   4,035      40,350       484.6      31.8      00:15:23
 18851       8   4,035      32,280       497.7      32.7      00:15:08
 19357       6   4,035      24,210       511.9      33.6      00:14:50
 19856       6   4,035      24,210       526.0      34.5      00:14:33
 20369       8   4,035      32,280       540.2      35.5      00:14:17
 20750       3   4,035      12,105       550.7      36.1      00:14:09
 21117       3   4,035      12,105       560.6      36.8      00:14:03
 21517       8   4,035      32,280       570.6      37.5      00:13:56
 21916       8   4,035      32,280       580.6      38.1      00:13:49
 22362       3   4,035      12,105       591.8      38.8      00:13:40
 22792       9   4,035      36,315       602.7      39.6      00:13:31
 23205       8   4,035      32,280       613.5      40.3      00:13:22
 23648       4   4,035      16,140       624.9      41.0      00:13:12
 24071       7   4,035      28,245       636.2      41.8      00:13:02
 24570       7   4,035      28,245       649.0      42.6      00:12:49
 25086       8   4,035      32,280       662.7      43.5      00:12:34
 25588       8   4,035      32,280       676.1      44.4      00:12:20
 25955       9   4,035      36,315       686.0      45.0      00:12:13
 26372       6   4,035      24,210       697.2      45.8      00:12:04
 26847       3   4,035      12,105       709.4      46.6      00:11:52
 27219       7   4,035      28,245       719.4      47.2      00:11:45
 27575       3   4,035      12,105       728.8      47.8      00:11:39
 27960       5   4,035      20,175       739.4      48.5      00:11:30
 28448      10   4,035      40,350       752.7      49.4      00:11:17
 28828       9   4,035      36,315       763.4      50.1      00:11:08
 29187      10   4,035      40,350       773.3      50.8      00:11:01
 29587       9   4,035      36,315       784.0      51.5      00:10:52
 29934       7   4,035      28,245       793.4      52.1      00:10:45
 30287       7   4,035      28,245       803.0      52.7      00:10:38
 30695       6   4,035      24,210       814.3      53.4      00:10:28
 31204       6   4,035      24,210       828.2      54.4      00:10:14
 31715       5   4,035      20,175       842.5      55.3      00:09:59
 32233       6   4,035      24,210       857.3      56.3      00:09:44
 32653       3   4,035      12,105       869.1      57.0      00:09:33
 32977       7   4,035      28,245       878.2      57.6      00:09:27
 33351       9   4,035      36,315       888.7      58.3      00:09:18
 33767       6   4,035      24,210       900.3      59.1      00:09:08
 34190       7   4,035      28,245       912.4      59.9      00:08:57
 34706       5   4,035      20,175       926.8      60.8      00:08:42
 35220       6   4,035      24,210       941.4      61.8      00:08:28
 35734       8   4,035      32,280       955.7      62.7      00:08:14
 36251       9   4,035      36,315       970.0      63.7      00:07:60
 36714       8   4,035      32,280       982.8      64.5      00:07:48
 37121       3   4,035      12,105       993.7      65.2      00:07:39
 37491       5   4,035      20,175     1,003.0      65.8      00:07:32
 37840       6   4,035      24,210     1,012.1      66.4      00:07:25
 38194       6   4,035      24,210     1,021.9      67.1      00:07:17
 38541       7   4,035      28,245     1,031.5      67.7      00:07:10
 38901       4   4,035      16,140     1,041.3      68.3      00:07:02
 39269       7   4,035      28,245     1,051.1      69.0      00:06:54
 39685       7   4,035      28,245     1,062.2      69.7      00:06:45
 40156       8   4,035      32,280     1,074.7      70.5      00:06:33
 40674       9   4,035      36,315     1,088.9      71.5      00:06:20
 41120       6   4,035      24,210     1,101.2      72.3      00:06:09
 41535       6   4,035      24,210     1,112.4      73.0      00:05:59
 41952       3   4,035      12,105     1,124.0      73.8      00:05:49
 42351       6   4,035      24,210     1,134.1      74.4      00:05:40
 42754      10   4,035      40,350     1,144.9      75.1      00:05:31
 43125       8   4,035      32,280     1,155.2      75.8      00:05:22
 43510       7   4,035      28,245     1,165.9      76.5      00:05:13
 43890       6   4,035      24,210     1,175.9      77.2      00:05:05
 44283       5   4,035      20,175     1,186.5      77.9      00:04:56
 44707      10   4,035      40,350     1,197.7      78.6      00:04:46
 45112      10   4,035      40,350     1,208.5      79.3      00:04:37
 45545       7   4,035      28,245     1,219.5      80.0      00:04:27
 45941      10   4,035      40,350     1,229.7      80.7      00:04:18
 46318      10   4,035      40,350     1,240.2      81.4      00:04:09
 46736       8   4,035      32,280     1,251.5      82.1      00:03:59
 47160       6   4,035      24,210     1,262.3      82.9      00:03:50
 47556       4   4,035      16,140     1,272.5      83.5      00:03:41
 47923       7   4,035      28,245     1,282.2      84.2      00:03:33
 48269       8   4,035      32,280     1,291.5      84.8      00:03:25
 48646       5   4,035      20,175     1,301.8      85.4      00:03:16
 49053       9   4,035      36,315     1,312.6      86.2      00:03:07
 49503       3   4,035      12,105     1,324.5      86.9      00:02:56
 50064       6   4,035      24,210     1,338.8      87.9      00:02:43
 50514       5   4,035      20,175     1,350.4      88.6      00:02:33
 50895      10   4,035      40,350     1,360.8      89.3      00:02:24
 51291       8   4,035      32,280     1,371.6      90.0      00:02:14
 51677       8   4,035      32,280     1,382.4      90.7      00:02:05
 52067      10   4,035      40,350     1,393.3      91.4      00:01:55
 52432      10   4,035      40,350     1,403.9      92.1      00:01:46
 52800       7   4,035      28,245     1,414.8      92.9      00:01:36
 53184       5   4,035      20,175     1,425.6      93.6      00:01:27
 53661       5   4,035      20,175     1,439.0      94.4      00:01:15
 54044      10   4,035      40,350     1,449.4      95.1      00:01:06
 54427       7   4,035      28,245     1,459.5      95.8      00:00:57
 54849       6   4,035      24,210     1,470.4      96.5      00:00:47
 55237       9   4,035      36,315     1,480.7      97.2      00:00:38
 55604       8   4,035      32,280     1,489.9      97.8      00:00:30
 55947      10   4,035      40,350     1,499.3      98.4      00:00:22
 56351       8   4,035      32,280     1,510.4      99.1      00:00:12
 56760      10   4,035      40,350     1,521.9      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1358.443
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15_norando
    > mterm.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15_norandomterm.c
> sv saved

. 
. cap log close

. 
end of do-file
