
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A600_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   209      10   4,635      46,350         5.6       0.3      00:52:33
   439       6   4,635      27,810        11.7       0.7      00:49:49
   651       8   4,635      37,080        17.6       1.0      00:49:19
   865       7   4,635      32,445        23.7       1.4      00:48:37
  1079       6   4,635      27,810        30.1       1.7      00:47:42
  1277       5   4,635      23,175        36.0       2.1      00:47:40
  1465       7   4,635      32,445        41.9       2.4      00:47:42
  1675       6   4,635      27,810        48.4       2.8      00:47:01
  1888       3   4,635      13,905        54.4       3.1      00:46:51
  2111       5   4,635      23,175        61.0       3.5      00:46:12
  2319      10   4,635      46,350        67.2       3.8      00:45:59
  2531       7   4,635      32,445        73.3       4.2      00:45:51
  2725       5   4,635      23,175        79.3       4.5      00:45:45
  2936       9   4,635      41,715        85.6       4.9      00:45:27
  3153       8   4,635      37,080        92.2       5.3      00:45:02
  3345       9   4,635      41,715        98.3       5.6      00:44:55
  3547      10   4,635      46,350       104.5       6.0      00:44:42
  3764       7   4,635      32,445       111.2       6.4      00:44:19
  3947       9   4,635      41,715       116.3       6.6      00:44:35
  4075       8   4,635      37,080       120.1       6.9      00:45:21
  4207       7   4,635      32,445       123.9       7.1      00:46:02
  4366       7   4,635      32,445       128.3       7.3      00:46:29
  4537       9   4,635      41,715       133.4       7.6      00:46:33
  4678       5   4,635      23,175       137.9       7.9      00:46:52
  4814       7   4,635      32,445       141.9       8.1      00:47:19
  4982       4   4,635      18,540       147.0       8.4      00:47:21
  5144       5   4,635      23,175       151.8       8.7      00:47:29
  5316       9   4,635      41,715       157.0       9.0      00:47:27
  5426      10   4,635      46,350       160.4       9.2      00:48:00
  5588       7   4,635      32,445       164.7       9.4      00:48:14
  5746       7   4,635      32,445       169.3       9.7      00:48:22
  5907       9   4,635      41,715       174.1      10.0      00:48:24
  6094       8   4,635      37,080       179.8      10.3      00:48:09
  6291      10   4,635      46,350       185.5      10.6      00:47:55
  6462       7   4,635      32,445       190.5      10.9      00:47:52
  6611       3   4,635      13,905       194.8      11.1      00:48:02
  6762       9   4,635      41,715       199.2      11.4      00:48:07
  6923       8   4,635      37,080       204.1      11.7      00:48:05
  7111       8   4,635      37,080       209.6      12.0      00:47:53
  7315       7   4,635      32,445       215.5      12.3      00:47:35
  7507       4   4,635      18,540       221.3      12.7      00:47:19
  7684       7   4,635      32,445       226.6      13.0      00:47:10
  7833       5   4,635      23,175       231.4      13.2      00:47:10
  7964       6   4,635      27,810       235.7      13.5      00:47:14
  8150       8   4,635      37,080       241.6      13.8      00:46:56
  8322       7   4,635      32,445       247.0      14.1      00:46:46
  8477       8   4,635      37,080       252.0      14.4      00:46:40
  8645       9   4,635      41,715       257.2      14.7      00:46:32
  8816       9   4,635      41,715       262.6      15.0      00:46:23
  8980      10   4,635      46,350       267.8      15.3      00:46:14
  9157       7   4,635      32,445       273.5      15.6      00:45:60
  9298       9   4,635      41,715       278.0      15.9      00:46:00
  9455       6   4,635      27,810       282.8      16.2      00:45:56
  9593       9   4,635      41,715       287.4      16.4      00:45:55
  9740       5   4,635      23,175       292.2      16.7      00:45:51
  9904       9   4,635      41,715       297.2      17.0      00:45:45
 10050       7   4,635      32,445       301.5      17.2      00:45:46
 10195       6   4,635      27,810       305.4      17.5      00:45:51
 10314       5   4,635      23,175       308.7      17.7      00:46:01
 10432       2   4,635       9,270       312.5      17.9      00:46:08
 10581      10   4,635      46,350       316.8      18.1      00:46:07
 10758       9   4,635      41,715       322.0      18.4      00:45:56
 10913      10   4,635      46,350       326.8      18.7      00:45:51
 11079       4   4,635      18,540       331.7      19.0      00:45:44
 11230       8   4,635      37,080       336.2      19.2      00:45:40
 11362       9   4,635      41,715       340.3      19.5      00:45:42
 11500       5   4,635      23,175       344.5      19.7      00:45:41
 11621       8   4,635      37,080       348.1      19.9      00:45:47
 11748       7   4,635      32,445       351.8      20.1      00:45:50
 11885       8   4,635      37,080       356.1      20.4      00:45:47
 12027       6   4,635      27,810       360.5      20.6      00:45:44
 12147       6   4,635      27,810       364.2      20.8      00:45:47
 12295      10   4,635      46,350       368.6      21.1      00:45:44
 12498       6   4,635      27,810       374.7      21.4      00:45:23
 12709       6   4,635      27,810       381.1      21.8      00:45:02
 12957       6   4,635      27,810       388.1      22.2      00:44:34
 13163       6   4,635      27,810       394.5      22.6      00:44:12
 13389       8   4,635      37,080       401.4      23.0      00:43:47
 13562       7   4,635      32,445       407.1      23.3      00:43:33
 13687       4   4,635      18,540       411.1      23.5      00:43:32
 13823       2   4,635       9,270       415.1      23.7      00:43:31
 13945       3   4,635      13,905       418.8      23.9      00:43:34
 14124       9   4,635      41,715       424.2      24.3      00:43:21
 14306       9   4,635      41,715       430.0      24.6      00:43:05
 14488       9   4,635      41,715       435.8      24.9      00:42:50
 14675       8   4,635      37,080       441.4      25.2      00:42:36
 14853       5   4,635      23,175       446.9      25.6      00:42:24
 15054       8   4,635      37,080       453.3      25.9      00:42:04
 15266       6   4,635      27,810       459.9      26.3      00:41:43
 15473      10   4,635      46,350       466.3      26.7      00:41:24
 15662       5   4,635      23,175       472.0      27.0      00:41:10
 15854      10   4,635      46,350       478.2      27.3      00:40:54
 16032       6   4,635      27,810       484.0      27.7      00:40:39
 16237      10   4,635      46,350       490.5      28.0      00:40:20
 16438       5   4,635      23,175       497.1      28.4      00:40:01
 16587       5   4,635      23,175       501.5      28.7      00:39:56
 16725       5   4,635      23,175       505.8      28.9      00:39:52
 16879       7   4,635      32,445       510.5      29.2      00:39:46
 17042       9   4,635      41,715       515.7      29.5      00:39:36
 17171       8   4,635      37,080       519.5      29.7      00:39:35
 17257       8   4,635      37,080       522.2      29.9      00:39:41
 17396       5   4,635      23,175       526.7      30.1      00:39:35
 17517       6   4,635      27,810       530.8      30.4      00:39:32
 17641       5   4,635      23,175       534.7      30.6      00:39:30
 17775      10   4,635      46,350       538.6      30.8      00:39:28
 17900       4   4,635      18,540       542.5      31.0      00:39:26
 18063       8   4,635      37,080       547.6      31.3      00:39:15
 18248       8   4,635      37,080       553.4      31.6      00:39:01
 18438       7   4,635      32,445       559.1      32.0      00:38:48
 18554       4   4,635      18,540       562.6      32.2      00:38:48
 18652       5   4,635      23,175       565.8      32.4      00:38:49
 18750       5   4,635      23,175       568.9      32.5      00:38:51
 18843       9   4,635      41,715       571.8      32.7      00:38:55
 18963       4   4,635      18,540       575.8      32.9      00:38:51
 19086       5   4,635      23,175       579.7      33.1      00:38:48
 19186       4   4,635      18,540       582.9      33.3      00:38:49
 19269       8   4,635      37,080       585.5      33.5      00:38:53
 19440      10   4,635      46,350       591.0      33.8      00:38:40
 19601       6   4,635      27,810       596.2      34.1      00:38:29
 19751       8   4,635      37,080       601.2      34.4      00:38:19
 19923       6   4,635      27,810       606.7      34.7      00:38:06
 20075       9   4,635      41,715       611.9      35.0      00:37:55
 20262       9   4,635      41,715       617.5      35.3      00:37:42
 20438       4   4,635      18,540       623.1      35.6      00:37:28
 20554       7   4,635      32,445       626.8      35.8      00:37:26
 20654       7   4,635      32,445       630.0      36.0      00:37:26
 20767       6   4,635      27,810       633.5      36.2      00:37:24
 20872       8   4,635      37,080       636.8      36.4      00:37:23
 20974       4   4,635      18,540       639.9      36.6      00:37:23
 21095       3   4,635      13,905       643.6      36.8      00:37:21
 21189       6   4,635      27,810       646.2      36.9      00:37:24
 21327       6   4,635      27,810       649.9      37.2      00:37:20
 21465       6   4,635      27,810       654.2      37.4      00:37:13
 21585       7   4,635      32,445       657.7      37.6      00:37:11
 21703       9   4,635      41,715       661.0      37.8      00:37:10
 21829       9   4,635      41,715       664.7      38.0      00:37:06
 21935       8   4,635      37,080       667.9      38.2      00:37:06
 22065       5   4,635      23,175       671.6      38.4      00:37:01
 22209       9   4,635      41,715       675.7      38.6      00:36:56
 22352       6   4,635      27,810       679.8      38.9      00:36:50
 22479       9   4,635      41,715       683.6      39.1      00:36:45
 22602       8   4,635      37,080       687.2      39.3      00:36:42
 22754       8   4,635      37,080       691.4      39.5      00:36:35
 22963      10   4,635      46,350       697.5      39.9      00:36:19
 23139       9   4,635      41,715       703.0      40.2      00:36:05
 23313       6   4,635      27,810       708.4      40.5      00:35:52
 23518       7   4,635      32,445       714.1      40.8      00:35:38
 23710       5   4,635      23,175       719.9      41.2      00:35:23
 23894       7   4,635      32,445       725.7      41.5      00:35:08
 24086       3   4,635      13,905       731.4      41.8      00:34:54
 24286       3   4,635      13,905       737.1      42.1      00:34:40
 24499      10   4,635      46,350       743.5      42.5      00:34:23
 24674       7   4,635      32,445       749.1      42.8      00:34:09
 24858      10   4,635      46,350       754.6      43.1      00:33:57
 25044      10   4,635      46,350       760.2      43.5      00:33:43
 25188       5   4,635      23,175       764.8      43.7      00:33:35
 25373      10   4,635      46,350       770.4      44.0      00:33:21
 25554       8   4,635      37,080       775.9      44.4      00:33:09
 25667      10   4,635      46,350       779.2      44.6      00:33:06
 25784       7   4,635      32,445       783.1      44.8      00:33:01
 25896       8   4,635      37,080       786.6      45.0      00:32:57
 26017       8   4,635      37,080       790.2      45.2      00:32:53
 26121       8   4,635      37,080       793.5      45.4      00:32:50
 26222       6   4,635      27,810       796.6      45.6      00:32:48
 26384       9   4,635      41,715       801.4      45.8      00:32:38
 26562       8   4,635      37,080       806.8      46.1      00:32:26
 26746       4   4,635      18,540       812.2      46.4      00:32:13
 26935       8   4,635      37,080       818.1      46.8      00:31:59
 27104       6   4,635      27,810       823.1      47.1      00:31:48
 27217       8   4,635      37,080       826.6      47.3      00:31:44
 27345       8   4,635      37,080       830.5      47.5      00:31:38
 27457       6   4,635      27,810       833.9      47.7      00:31:34
 27579       9   4,635      41,715       837.8      47.9      00:31:28
 27739       6   4,635      27,810       842.7      48.2      00:31:18
 27907       5   4,635      23,175       848.1      48.5      00:31:05
 28110       8   4,635      37,080       854.4      48.9      00:30:49
 28318       6   4,635      27,810       860.9      49.2      00:30:32
 28514       4   4,635      18,540       867.3      49.6      00:30:16
 28669       9   4,635      41,715       872.2      49.9      00:30:06
 28762      10   4,635      46,350       875.3      50.0      00:30:03
 28873       9   4,635      41,715       878.7      50.2      00:29:59
 28989       8   4,635      37,080       882.4      50.5      00:29:54
 29091       8   4,635      37,080       885.7      50.6      00:29:50
 29235       5   4,635      23,175       889.9      50.9      00:29:43
 29381       8   4,635      37,080       894.6      51.2      00:29:33
 29547       9   4,635      41,715       899.7      51.4      00:29:22
 29699       8   4,635      37,080       904.4      51.7      00:29:13
 29818       5   4,635      23,175       908.2      51.9      00:29:07
 29936       5   4,635      23,175       911.8      52.1      00:29:02
 30057       8   4,635      37,080       915.6      52.4      00:28:56
 30164       8   4,635      37,080       919.1      52.6      00:28:51
 30291      10   4,635      46,350       923.0      52.8      00:28:44
 30425       9   4,635      41,715       927.3      53.0      00:28:36
 30538       6   4,635      27,810       930.9      53.2      00:28:31
 30714       6   4,635      27,810       936.4      53.5      00:28:18
 30886       5   4,635      23,175       941.9      53.9      00:28:06
 31061       5   4,635      23,175       947.2      54.2      00:27:54
 31206       7   4,635      32,445       951.9      54.4      00:27:44
 31390       6   4,635      27,810       957.7      54.8      00:27:30
 31569       9   4,635      41,715       963.5      55.1      00:27:16
 31751       8   4,635      37,080       969.4      55.4      00:27:02
 31939       7   4,635      32,445       975.6      55.8      00:26:47
 32122       8   4,635      37,080       981.6      56.1      00:26:33
 32288       5   4,635      23,175       987.0      56.4      00:26:21
 32463       7   4,635      32,445       992.9      56.8      00:26:07
 32583       7   4,635      32,445       996.5      57.0      00:26:01
 32691       9   4,635      41,715     1,000.0      57.2      00:25:56
 32789       7   4,635      32,445     1,003.2      57.4      00:25:52
 32913      10   4,635      46,350     1,007.2      57.6      00:25:45
 33036       9   4,635      41,715     1,011.2      57.8      00:25:38
 33170       7   4,635      32,445     1,015.4      58.1      00:25:30
 33298       9   4,635      41,715     1,019.6      58.3      00:25:22
 33429       7   4,635      32,445     1,023.7      58.5      00:25:15
 33562       6   4,635      27,810     1,028.1      58.8      00:25:06
 33722       6   4,635      27,810     1,033.2      59.1      00:24:55
 33837       8   4,635      37,080     1,036.9      59.3      00:24:49
 33987       8   4,635      37,080     1,041.8      59.6      00:24:39
 34097       4   4,635      18,540     1,045.4      59.8      00:24:33
 34188       9   4,635      41,715     1,048.5      60.0      00:24:28
 34341       8   4,635      37,080     1,053.4      60.2      00:24:18
 34517       8   4,635      37,080     1,059.1      60.6      00:24:05
 34674       9   4,635      41,715     1,064.1      60.8      00:23:54
 34845       6   4,635      27,810     1,069.7      61.2      00:23:41
 35036       5   4,635      23,175     1,075.7      61.5      00:23:27
 35211       8   4,635      37,080     1,081.5      61.8      00:23:14
 35380       6   4,635      27,810     1,086.9      62.2      00:23:02
 35550       6   4,635      27,810     1,092.3      62.5      00:22:50
 35745       9   4,635      41,715     1,098.5      62.8      00:22:35
 35957       5   4,635      23,175     1,105.3      63.2      00:22:19
 36173       9   4,635      41,715     1,112.2      63.6      00:22:02
 36371       6   4,635      27,810     1,118.6      64.0      00:21:46
 36542      10   4,635      46,350     1,123.9      64.3      00:21:35
 36640       5   4,635      23,175     1,127.1      64.4      00:21:30
 36763      10   4,635      46,350     1,130.7      64.7      00:21:24
 36863       5   4,635      23,175     1,133.8      64.8      00:21:20
 36965       5   4,635      23,175     1,137.0      65.0      00:21:15
 37090      10   4,635      46,350     1,140.8      65.2      00:21:08
 37228       5   4,635      23,175     1,144.7      65.5      00:21:01
 37335       6   4,635      27,810     1,147.8      65.6      00:20:56
 37461       7   4,635      32,445     1,151.6      65.8      00:20:50
 37558       7   4,635      32,445     1,154.6      66.0      00:20:45
 37675      10   4,635      46,350     1,157.9      66.2      00:20:40
 37808       4   4,635      18,540     1,162.1      66.4      00:20:32
 37919      10   4,635      46,350     1,165.5      66.6      00:20:26
 38049       7   4,635      32,445     1,169.7      66.9      00:20:18
 38195       4   4,635      18,540     1,174.2      67.1      00:20:08
 38318       6   4,635      27,810     1,178.1      67.4      00:20:01
 38434       4   4,635      18,540     1,181.9      67.6      00:19:54
 38597      10   4,635      46,350     1,187.0      67.9      00:19:43
 38765       6   4,635      27,810     1,192.3      68.2      00:19:32
 38930       7   4,635      32,445     1,197.5      68.5      00:19:20
 39049      10   4,635      46,350     1,201.2      68.7      00:19:13
 39162       8   4,635      37,080     1,204.5      68.9      00:19:08
 39267       6   4,635      27,810     1,207.7      69.1      00:19:03
 39406       2   4,635       9,270     1,211.9      69.3      00:18:54
 39523       8   4,635      37,080     1,215.5      69.5      00:18:48
 39663       8   4,635      37,080     1,219.8      69.7      00:18:39
 39788      10   4,635      46,350     1,223.6      70.0      00:18:32
 39981       8   4,635      37,080     1,229.6      70.3      00:18:18
 40189       9   4,635      41,715     1,235.9      70.7      00:18:03
 40399       9   4,635      41,715     1,242.4      71.0      00:17:48
 40597       5   4,635      23,175     1,248.7      71.4      00:17:33
 40777      10   4,635      46,350     1,254.5      71.7      00:17:20
 40955       9   4,635      41,715     1,260.2      72.1      00:17:08
 41085       7   4,635      32,445     1,264.2      72.3      00:16:60
 41179      10   4,635      46,350     1,267.2      72.5      00:16:55
 41303       9   4,635      41,715     1,271.0      72.7      00:16:48
 41437       4   4,635      18,540     1,275.2      72.9      00:16:39
 41552       7   4,635      32,445     1,278.8      73.1      00:16:33
 41676       7   4,635      32,445     1,282.7      73.3      00:16:25
 41819       5   4,635      23,175     1,287.2      73.6      00:16:16
 41946       1   4,635       4,635     1,291.3      73.8      00:16:08
 42067       9   4,635      41,715     1,294.8      74.0      00:16:01
 42203       7   4,635      32,445     1,298.7      74.3      00:15:54
 42305       9   4,635      41,715     1,301.7      74.4      00:15:49
 42393       6   4,635      27,810     1,304.6      74.6      00:15:44
 42522      10   4,635      46,350     1,308.6      74.8      00:15:36
 42670       9   4,635      41,715     1,313.1      75.1      00:15:26
 42809       5   4,635      23,175     1,317.3      75.3      00:15:18
 42949       9   4,635      41,715     1,321.7      75.6      00:15:09
 43050       6   4,635      27,810     1,325.0      75.8      00:15:03
 43144       5   4,635      23,175     1,328.1      75.9      00:14:57
 43232       7   4,635      32,445     1,330.9      76.1      00:14:52
 43319      10   4,635      46,350     1,333.7      76.3      00:14:48
 43416       8   4,635      37,080     1,336.9      76.4      00:14:42
 43492       1   4,635       4,635     1,339.1      76.6      00:14:39
 43646       6   4,635      27,810     1,343.6      76.8      00:14:29
 43839       8   4,635      37,080     1,349.6      77.2      00:14:15
 44028       9   4,635      41,715     1,355.4      77.5      00:14:02
 44145       9   4,635      41,715     1,359.0      77.7      00:13:55
 44225       8   4,635      37,080     1,361.5      77.8      00:13:51
 44316       4   4,635      18,540     1,364.1      78.0      00:13:47
 44440      10   4,635      46,350     1,367.8      78.2      00:13:40
 44543       7   4,635      32,445     1,371.1      78.4      00:13:33
 44701       8   4,635      37,080     1,375.9      78.7      00:13:23
 44804       6   4,635      27,810     1,379.1      78.9      00:13:17
 44947       8   4,635      37,080     1,383.6      79.1      00:13:07
 45081       3   4,635      13,905     1,387.7      79.3      00:12:59
 45259      10   4,635      46,350     1,392.8      79.6      00:12:47
 45383      10   4,635      46,350     1,396.3      79.8      00:12:41
 45500       5   4,635      23,175     1,399.8      80.0      00:12:34
 45603       8   4,635      37,080     1,402.8      80.2      00:12:28
 45718      10   4,635      46,350     1,406.1      80.4      00:12:22
 45843       5   4,635      23,175     1,409.8      80.6      00:12:14
 45980       8   4,635      37,080     1,414.2      80.9      00:12:05
 46126       5   4,635      23,175     1,418.7      81.1      00:11:55
 46278       7   4,635      32,445     1,423.7      81.4      00:11:44
 46447       6   4,635      27,810     1,428.7      81.7      00:11:33
 46620       9   4,635      41,715     1,434.2      82.0      00:11:21
 46800       8   4,635      37,080     1,440.0      82.3      00:11:08
 46936       4   4,635      18,540     1,444.0      82.6      00:10:59
 47053       9   4,635      41,715     1,447.3      82.8      00:10:53
 47170       7   4,635      32,445     1,450.5      82.9      00:10:47
 47286       6   4,635      27,810     1,454.0      83.1      00:10:39
 47436      10   4,635      46,350     1,458.4      83.4      00:10:30
 47562       8   4,635      37,080     1,462.2      83.6      00:10:22
 47678       6   4,635      27,810     1,465.8      83.8      00:10:15
 47793      10   4,635      46,350     1,469.2      84.0      00:10:08
 47901       6   4,635      27,810     1,472.6      84.2      00:10:01
 48004       6   4,635      27,810     1,475.8      84.4      00:09:55
 48139      10   4,635      46,350     1,479.9      84.6      00:09:46
 48260       9   4,635      41,715     1,483.7      84.8      00:09:38
 48375       3   4,635      13,905     1,487.3      85.0      00:09:30
 48526       5   4,635      23,175     1,492.0      85.3      00:09:20
 48665       8   4,635      37,080     1,496.3      85.6      00:09:11
 48787       8   4,635      37,080     1,499.9      85.8      00:09:03
 48913       9   4,635      41,715     1,503.9      86.0      00:08:55
 49027       8   4,635      37,080     1,507.3      86.2      00:08:48
 49139       3   4,635      13,905     1,511.0      86.4      00:08:40
 49254       2   4,635       9,270     1,514.5      86.6      00:08:33
 49371       5   4,635      23,175     1,517.8      86.8      00:08:26
 49501       8   4,635      37,080     1,521.7      87.0      00:08:18
 49643       6   4,635      27,810     1,525.6      87.2      00:08:09
 49755       7   4,635      32,445     1,528.9      87.4      00:08:03
 49853       9   4,635      41,715     1,531.7      87.6      00:07:57
 49967       5   4,635      23,175     1,535.4      87.8      00:07:49
 50073       8   4,635      37,080     1,538.5      88.0      00:07:43
 50183       3   4,635      13,905     1,541.8      88.2      00:07:36
 50336       7   4,635      32,445     1,546.1      88.4      00:07:26
 50460       8   4,635      37,080     1,549.9      88.6      00:07:18
 50550      10   4,635      46,350     1,552.8      88.8      00:07:13
 50674       7   4,635      32,445     1,556.5      89.0      00:07:04
 50791       5   4,635      23,175     1,560.3      89.2      00:06:56
 50905       5   4,635      23,175     1,564.0      89.4      00:06:48
 51020       9   4,635      41,715     1,567.9      89.6      00:06:40
 51182       9   4,635      41,715     1,572.7      89.9      00:06:29
 51315       8   4,635      37,080     1,576.8      90.2      00:06:20
 51520       8   4,635      37,080     1,583.4      90.5      00:06:05
 51722      10   4,635      46,350     1,589.9      90.9      00:05:50
 51898       6   4,635      27,810     1,595.5      91.2      00:05:38
 52077       7   4,635      32,445     1,601.4      91.6      00:05:25
 52259       7   4,635      32,445     1,607.4      91.9      00:05:11
 52448       8   4,635      37,080     1,613.8      92.3      00:04:57
 52596       5   4,635      23,175     1,618.9      92.6      00:04:46
 52778       6   4,635      27,810     1,625.0      92.9      00:04:32
 53003       8   4,635      37,080     1,632.3      93.3      00:04:15
 53214       8   4,635      37,080     1,639.2      93.7      00:03:60
 53395       8   4,635      37,080     1,644.9      94.1      00:03:47
 53557       7   4,635      32,445     1,650.2      94.4      00:03:36
 53686       9   4,635      41,715     1,654.2      94.6      00:03:27
 53815      10   4,635      46,350     1,658.3      94.8      00:03:18
 53911       5   4,635      23,175     1,661.2      95.0      00:03:12
 53992      10   4,635      46,350     1,663.7      95.1      00:03:07
 54092       9   4,635      41,715     1,666.7      95.3      00:03:00
 54183       8   4,635      37,080     1,669.6      95.5      00:02:54
 54280      10   4,635      46,350     1,672.7      95.6      00:02:48
 54401       6   4,635      27,810     1,676.1      95.8      00:02:40
 54545      10   4,635      46,350     1,680.1      96.1      00:02:31
 54658       5   4,635      23,175     1,683.7      96.3      00:02:24
 54776       5   4,635      23,175     1,687.2      96.5      00:02:16
 54906       5   4,635      23,175     1,691.2      96.7      00:02:07
 55011       9   4,635      41,715     1,694.4      96.9      00:02:00
 55115       9   4,635      41,715     1,697.6      97.1      00:01:53
 55226      10   4,635      46,350     1,700.9      97.3      00:01:46
 55319       5   4,635      23,175     1,703.4      97.4      00:01:41
 55393       8   4,635      37,080     1,705.6      97.5      00:01:36
 55480       1   4,635       4,635     1,708.3      97.7      00:01:30
 55601       6   4,635      27,810     1,711.7      97.9      00:01:22
 55736       8   4,635      37,080     1,716.0      98.1      00:01:13
 55868      10   4,635      46,350     1,720.2      98.4      00:01:04
 56012       4   4,635      18,540     1,724.8      98.6      00:00:54
 56178       7   4,635      32,445     1,730.0      98.9      00:00:42
 56351       9   4,635      41,715     1,735.7      99.2      00:00:29
 56512       6   4,635      27,810     1,740.8      99.5      00:00:18
 56688       9   4,635      41,715     1,746.4      99.9      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 3882
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
