
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A800_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   373      10   4,835      48,350        10.3       0.6      00:29:28
   733       4   4,835      19,340        20.7       1.1      00:29:06
  1087      10   4,835      48,350        31.5       1.7      00:28:33
  1443       8   4,835      38,680        42.8       2.3      00:27:49
  1806       7   4,835      33,845        54.2       3.0      00:27:19
  2177       9   4,835      43,515        65.5       3.6      00:26:56
  2535       8   4,835      38,680        76.4       4.2      00:26:46
  2887       4   4,835      19,340        87.6       4.8      00:26:30
  3232       7   4,835      33,845        98.5       5.4      00:26:21
  3556       8   4,835      38,680       109.0       6.0      00:26:17
  3900       9   4,835      43,515       119.9       6.6      00:26:08
  4187       9   4,835      43,515       128.5       7.0      00:26:28
  4473       8   4,835      38,680       137.0       7.5      00:26:46
  4747       3   4,835      14,505       145.9       8.0      00:26:55
  5042       6   4,835      29,010       155.1       8.5      00:26:58
  5278       7   4,835      33,845       162.3       8.9      00:27:22
  5481       6   4,835      29,010       168.7       9.2      00:27:53
  5707       6   4,835      29,010       175.2       9.6      00:28:19
  5967      10   4,835      48,350       183.3      10.0      00:28:26
  6251       7   4,835      33,845       192.2      10.5      00:28:23
  6528       7   4,835      33,845       200.6      11.0      00:28:25
  6820       6   4,835      29,010       209.4      11.5      00:28:20
  7127       3   4,835      14,505       219.0      12.0      00:28:10
  7458      10   4,835      48,350       229.2      12.6      00:27:54
  7783       6   4,835      29,010       239.5      13.1      00:27:39
  8112       6   4,835      29,010       250.5      13.7      00:27:17
  8421       9   4,835      43,515       260.8      14.3      00:27:02
  8746       8   4,835      38,680       271.4      14.9      00:26:46
  9090       6   4,835      29,010       282.8      15.5      00:26:25
  9311       8   4,835      38,680       290.2      15.9      00:26:30
  9496       7   4,835      33,845       296.2      16.2      00:26:43
  9719      10   4,835      48,350       303.9      16.6      00:26:45
  9935       9   4,835      43,515       310.7      17.0      00:26:52
 10142       5   4,835      24,175       316.8      17.4      00:27:02
 10350       8   4,835      38,680       323.1      17.7      00:27:11
 10610       6   4,835      29,010       331.2      18.1      00:27:08
 10869       9   4,835      43,515       339.3      18.6      00:27:04
 11129       9   4,835      43,515       347.4      19.0      00:26:60
 11329       8   4,835      38,680       353.6      19.4      00:27:06
 11517       6   4,835      29,010       359.7      19.7      00:27:13
 11765       5   4,835      24,175       367.3      20.1      00:27:11
 12037       9   4,835      43,515       376.1      20.6      00:27:02
 12267      10   4,835      48,350       383.5      21.0      00:27:00
 12542       6   4,835      29,010       392.2      21.5      00:26:51
 12864      10   4,835      48,350       401.9      22.0      00:26:37
 13203       5   4,835      24,175       412.6      22.6      00:26:19
 13521       7   4,835      33,845       423.2      23.2      00:26:01
 13756       2   4,835       9,670       430.7      23.6      00:25:57
 13983      10   4,835      48,350       437.8      24.0      00:25:56
 14261       9   4,835      43,515       446.8      24.5      00:25:46
 14496      10   4,835      48,350       454.6      24.9      00:25:41
 14817       5   4,835      24,175       464.8      25.5      00:25:25
 15205       9   4,835      43,515       477.7      26.2      00:24:58
 15589       9   4,835      43,515       489.8      26.8      00:24:35
 15967       6   4,835      29,010       502.3      27.5      00:24:12
 16326       6   4,835      29,010       514.4      28.2      00:23:50
 16626       5   4,835      24,175       524.1      28.7      00:23:38
 16855       5   4,835      24,175       531.6      29.1      00:23:35
 17096       6   4,835      29,010       539.3      29.5      00:23:30
 17348       6   4,835      29,010       547.6      30.0      00:23:23
 17617      10   4,835      48,350       556.7      30.5      00:23:13
 17874       3   4,835      14,505       564.8      30.9      00:23:07
 18177       6   4,835      29,010       574.8      31.5      00:22:54
 18531       8   4,835      38,680       585.7      32.1      00:22:37
 18768       9   4,835      43,515       593.8      32.5      00:22:31
 19060      10   4,835      48,350       603.6      33.1      00:22:19
 19361       5   4,835      24,175       613.5      33.6      00:22:06
 19746       8   4,835      38,680       626.6      34.3      00:21:44
 20138       7   4,835      33,845       640.0      35.1      00:21:21
 20512       5   4,835      24,175       652.1      35.7      00:21:02
 20766       8   4,835      38,680       660.5      36.2      00:20:55
 20998       6   4,835      29,010       668.1      36.6      00:20:50
 21297       8   4,835      38,680       676.9      37.1      00:20:41
 21579       7   4,835      33,845       685.7      37.6      00:20:33
 21867       8   4,835      38,680       694.2      38.0      00:20:25
 22164       7   4,835      33,845       703.1      38.5      00:20:16
 22438      10   4,835      48,350       711.4      39.0      00:20:08
 22747       9   4,835      43,515       720.9      39.5      00:19:57
 23019       7   4,835      33,845       729.1      39.9      00:19:50
 23331       8   4,835      38,680       739.3      40.5      00:19:38
 23678      10   4,835      48,350       749.7      41.1      00:19:25
 23994       9   4,835      43,515       759.9      41.6      00:19:12
 24389      10   4,835      48,350       771.7      42.3      00:18:56
 24782       3   4,835      14,505       784.4      43.0      00:18:37
 25174       6   4,835      29,010       797.1      43.7      00:18:19
 25557       8   4,835      38,680       809.4      44.3      00:18:02
 25822       5   4,835      24,175       817.8      44.8      00:17:54
 26100       5   4,835      24,175       826.7      45.3      00:17:45
 26440       7   4,835      33,845       837.4      45.9      00:17:32
 26793       7   4,835      33,845       848.4      46.5      00:17:18
 27132       6   4,835      29,010       859.2      47.1      00:17:05
 27383       8   4,835      38,680       867.2      47.5      00:16:59
 27623       7   4,835      33,845       874.9      47.9      00:16:52
 27938       8   4,835      38,680       885.3      48.5      00:16:40
 28294       4   4,835      19,340       896.8      49.1      00:16:26
 28647       8   4,835      38,680       908.8      49.8      00:16:10
 28886       9   4,835      43,515       916.7      50.2      00:16:04
 29133       9   4,835      43,515       924.8      50.7      00:15:56
 29455       8   4,835      38,680       935.3      51.2      00:15:44
 29773       9   4,835      43,515       945.5      51.8      00:15:33
 30023       9   4,835      43,515       953.6      52.2      00:15:25
 30267       7   4,835      33,845       961.6      52.7      00:15:18
 30586       8   4,835      38,680       972.2      53.3      00:15:06
 30926       5   4,835      24,175       983.5      53.9      00:14:52
 31294       8   4,835      38,680       995.5      54.5      00:14:37
 31650       8   4,835      38,680     1,007.4      55.2      00:14:23
 31996       8   4,835      38,680     1,019.2      55.8      00:14:08
 32342      10   4,835      48,350     1,031.0      56.5      00:13:54
 32623       6   4,835      29,010     1,040.4      57.0      00:13:44
 32838       7   4,835      33,845     1,047.7      57.4      00:13:38
 33072       9   4,835      43,515     1,055.6      57.8      00:13:31
 33333      10   4,835      48,350     1,064.3      58.3      00:13:23
 33621       8   4,835      38,680     1,074.0      58.8      00:13:12
 33934       6   4,835      29,010     1,084.5      59.4      00:13:01
 34211       7   4,835      33,845     1,094.0      59.9      00:12:50
 34580      10   4,835      48,350     1,106.4      60.6      00:12:36
 34978      10   4,835      48,350     1,119.9      61.3      00:12:19
 35370       3   4,835      14,505     1,133.0      62.1      00:12:03
 35772       7   4,835      33,845     1,146.3      62.8      00:11:46
 36113       8   4,835      38,680     1,157.7      63.4      00:11:34
 36493       6   4,835      29,010     1,170.5      64.1      00:11:18
 36794       5   4,835      24,175     1,180.0      64.6      00:11:09
 37071      10   4,835      48,350     1,189.0      65.1      00:10:60
 37366       9   4,835      43,515     1,197.9      65.6      00:10:51
 37628      10   4,835      48,350     1,206.3      66.1      00:10:43
 37866       5   4,835      24,175     1,213.6      66.5      00:10:37
 38105       5   4,835      24,175     1,221.5      66.9      00:10:29
 38384       6   4,835      29,010     1,230.7      67.4      00:10:20
 38722      10   4,835      48,350     1,241.9      68.0      00:10:07
 39083       5   4,835      24,175     1,253.7      68.7      00:09:54
 39384       4   4,835      19,340     1,263.2      69.2      00:09:44
 39710       9   4,835      43,515     1,273.5      69.8      00:09:33
 40101       8   4,835      38,680     1,286.0      70.4      00:09:19
 40494       8   4,835      38,680     1,298.8      71.1      00:09:05
 40872       8   4,835      38,680     1,311.2      71.8      00:08:51
 41150       6   4,835      29,010     1,320.5      72.3      00:08:41
 41462       8   4,835      38,680     1,330.6      72.9      00:08:31
 41709       5   4,835      24,175     1,338.7      73.3      00:08:23
 41951       9   4,835      43,515     1,346.9      73.8      00:08:15
 42248       6   4,835      29,010     1,355.8      74.3      00:08:06
 42530       7   4,835      33,845     1,364.9      74.8      00:07:57
 42797       9   4,835      43,515     1,373.3      75.2      00:07:49
 43059       8   4,835      38,680     1,382.0      75.7      00:07:40
 43315       5   4,835      24,175     1,390.7      76.2      00:07:31
 43584      10   4,835      48,350     1,399.4      76.7      00:07:22
 43888       6   4,835      29,010     1,409.0      77.2      00:07:12
 44171       9   4,835      43,515     1,418.0      77.7      00:07:03
 44404       6   4,835      29,010     1,425.3      78.1      00:06:56
 44700       7   4,835      33,845     1,434.9      78.6      00:06:47
 45027       4   4,835      19,340     1,445.5      79.2      00:06:35
 45364       3   4,835      14,505     1,455.6      79.7      00:06:25
 45637       5   4,835      24,175     1,464.0      80.2      00:06:16
 45937       6   4,835      29,010     1,473.3      80.7      00:06:07
 46225      10   4,835      48,350     1,482.9      81.2      00:05:57
 46531       5   4,835      24,175     1,492.8      81.8      00:05:46
 46885       5   4,835      24,175     1,504.6      82.4      00:05:34
 47123       3   4,835      14,505     1,511.7      82.8      00:05:27
 47386       8   4,835      38,680     1,519.6      83.2      00:05:19
 47656       8   4,835      38,680     1,527.9      83.7      00:05:10
 47941       7   4,835      33,845     1,537.1      84.2      00:05:01
 48223      10   4,835      48,350     1,546.1      84.7      00:04:52
 48494      10   4,835      48,350     1,555.0      85.2      00:04:42
 48802       6   4,835      29,010     1,564.9      85.7      00:04:32
 49110       7   4,835      33,845     1,574.7      86.3      00:04:22
 49409       4   4,835      19,340     1,584.2      86.8      00:04:12
 49703       7   4,835      33,845     1,593.0      87.3      00:04:03
 49981       8   4,835      38,680     1,601.7      87.7      00:03:54
 50299       5   4,835      24,175     1,611.6      88.3      00:03:44
 50633       8   4,835      38,680     1,622.1      88.8      00:03:32
 50925      10   4,835      48,350     1,631.7      89.4      00:03:22
 51251       6   4,835      29,010     1,642.3      90.0      00:03:11
 51566       7   4,835      33,845     1,652.7      90.5      00:03:00
 51869       7   4,835      33,845     1,663.0      91.1      00:02:50
 52171      10   4,835      48,350     1,673.3      91.7      00:02:39
 52491       7   4,835      33,845     1,684.3      92.3      00:02:27
 52843       8   4,835      38,680     1,696.8      92.9      00:02:14
 53203      10   4,835      48,350     1,709.0      93.6      00:02:01
 53570       9   4,835      43,515     1,721.3      94.3      00:01:48
 53874       4   4,835      19,340     1,731.2      94.8      00:01:38
 54135      10   4,835      48,350     1,739.6      95.3      00:01:29
 54408       9   4,835      43,515     1,748.4      95.8      00:01:20
 54780       8   4,835      38,680     1,759.8      96.4      00:01:08
 55119       6   4,835      29,010     1,770.5      97.0      00:00:57
 55406       5   4,835      24,175     1,779.3      97.5      00:00:48
 55664      10   4,835      48,350     1,787.2      97.9      00:00:40
 55909      10   4,835      48,350     1,795.3      98.3      00:00:31
 56196       8   4,835      38,680     1,804.7      98.9      00:00:22
 56491       6   4,835      29,010     1,814.8      99.4      00:00:11
 56792       4   4,835      19,340     1,824.8     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1900.526
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
