
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A600_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   250      10   4,635      46,350         6.6       0.4      00:43:60
   535       4   4,635      18,540        14.4       0.8      00:40:20
   805       3   4,635      13,905        22.3       1.3      00:38:50
  1085       6   4,635      27,810        30.3       1.7      00:37:56
  1339       6   4,635      27,810        38.0       2.2      00:37:38
  1623       5   4,635      23,175        46.7       2.7      00:36:31
  1919       8   4,635      37,080        55.3       3.2      00:35:50
  2207       4   4,635      18,540        63.9       3.7      00:35:12
  2505       7   4,635      32,445        72.5       4.1      00:34:44
  2802      10   4,635      46,350        81.7       4.7      00:34:04
  3103       7   4,635      32,445        90.5       5.2      00:33:40
  3391       8   4,635      37,080        99.7       5.7      00:33:10
  3687       6   4,635      27,810       108.7       6.2      00:32:45
  3956       2   4,635       9,270       116.5       6.7      00:32:45
  4168       4   4,635      18,540       122.8       7.0      00:33:11
  4401       8   4,635      37,080       129.3       7.4      00:33:29
  4601       7   4,635      32,445       135.5       7.7      00:33:49
  4804       5   4,635      23,175       141.7       8.1      00:34:06
  5023      10   4,635      46,350       148.3       8.5      00:34:15
  5222       5   4,635      23,175       154.2       8.8      00:34:33
  5409       7   4,635      32,445       160.0       9.1      00:34:50
  5636       3   4,635      13,905       166.1       9.5      00:35:01
  5850      10   4,635      46,350       172.3       9.9      00:35:09
  6063       9   4,635      41,715       178.9      10.2      00:35:11
  6304       7   4,635      32,445       185.9      10.6      00:35:07
  6532       8   4,635      37,080       192.5      11.0      00:35:06
  6740       7   4,635      32,445       198.5      11.4      00:35:13
  6953       9   4,635      41,715       204.9      11.7      00:35:15
  7236       4   4,635      18,540       213.0      12.2      00:34:56
  7503       4   4,635      18,540       221.2      12.6      00:34:36
  7779      10   4,635      46,350       229.7      13.1      00:34:15
  8039       5   4,635      23,175       238.0      13.6      00:33:56
  8294       8   4,635      37,080       246.1      14.1      00:33:40
  8526       9   4,635      41,715       253.6      14.5      00:33:29
  8773       6   4,635      27,810       261.2      14.9      00:33:18
  9006       7   4,635      32,445       268.6      15.4      00:33:08
  9242       8   4,635      37,080       276.2      15.8      00:32:57
  9464       8   4,635      37,080       283.1      16.2      00:32:52
  9645       8   4,635      37,080       289.1      16.5      00:32:53
  9855       4   4,635      18,540       295.6      16.9      00:32:51
 10070       3   4,635      13,905       302.1      17.3      00:32:48
 10281       3   4,635      13,905       307.8      17.6      00:32:51
 10472       6   4,635      27,810       313.7      17.9      00:32:52
 10733       6   4,635      27,810       321.3      18.4      00:32:39
 10986       7   4,635      32,445       329.0      18.8      00:32:26
 11198       7   4,635      32,445       335.3      19.2      00:32:23
 11395      10   4,635      46,350       341.3      19.5      00:32:23
 11603       6   4,635      27,810       347.5      19.9      00:32:20
 11808       9   4,635      41,715       353.8      20.2      00:32:16
 12025      10   4,635      46,350       360.4      20.6      00:32:10
 12235       8   4,635      37,080       366.9      21.0      00:32:05
 12504       7   4,635      32,445       374.9      21.4      00:31:50
 12801       5   4,635      23,175       383.6      21.9      00:31:31
 13103       7   4,635      32,445       392.7      22.5      00:31:09
 13391       5   4,635      23,175       401.5      23.0      00:30:50
 13630       7   4,635      32,445       409.4      23.4      00:30:36
 13808       9   4,635      41,715       414.7      23.7      00:30:38
 13993      10   4,635      46,350       420.2      24.0      00:30:38
 14242       9   4,635      41,715       428.0      24.5      00:30:25
 14475       7   4,635      32,445       435.4      24.9      00:30:14
 14675       8   4,635      37,080       441.4      25.2      00:30:11
 14926       8   4,635      37,080       449.1      25.7      00:29:58
 15206       2   4,635       9,270       458.2      26.2      00:29:39
 15501      10   4,635      46,350       467.2      26.7      00:29:19
 15794       8   4,635      37,080       476.3      27.2      00:29:01
 16082       8   4,635      37,080       485.6      27.8      00:28:41
 16375       8   4,635      37,080       494.9      28.3      00:28:21
 16636       6   4,635      27,810       502.9      28.8      00:28:08
 16866       8   4,635      37,080       510.1      29.2      00:27:59
 17068       6   4,635      27,810       516.4      29.5      00:27:54
 17272       9   4,635      41,715       522.7      29.9      00:27:49
 17454       8   4,635      37,080       528.6      30.2      00:27:46
 17632      10   4,635      46,350       534.5      30.6      00:27:42
 17880       8   4,635      37,080       541.9      31.0      00:27:32
 18156      10   4,635      46,350       550.6      31.5      00:27:16
 18461       7   4,635      32,445       559.6      32.0      00:26:59
 18644       4   4,635      18,540       565.5      32.3      00:26:55
 18826       5   4,635      23,175       571.2      32.7      00:26:52
 19013       9   4,635      41,715       577.4      33.0      00:26:46
 19230       6   4,635      27,810       584.3      33.4      00:26:38
 19493      10   4,635      46,350       592.7      33.9      00:26:24
 19802       5   4,635      23,175       602.8      34.5      00:26:03
 20086       5   4,635      23,175       612.2      35.0      00:25:45
 20385       9   4,635      41,715       621.4      35.5      00:25:28
 20595       8   4,635      37,080       628.1      35.9      00:25:20
 20788       5   4,635      23,175       634.1      36.3      00:25:15
 20979       8   4,635      37,080       640.1      36.6      00:25:10
 21194       7   4,635      32,445       646.4      37.0      00:25:04
 21427       8   4,635      37,080       653.0      37.3      00:24:57
 21659       7   4,635      32,445       659.9      37.7      00:24:48
 21873      10   4,635      46,350       666.1      38.1      00:24:43
 22076       5   4,635      23,175       671.8      38.4      00:24:38
 22284      10   4,635      46,350       677.9      38.8      00:24:33
 22497       6   4,635      27,810       684.1      39.1      00:24:26
 22703       8   4,635      37,080       690.2      39.5      00:24:20
 23008       7   4,635      32,445       698.9      40.0      00:24:05
 23296       7   4,635      32,445       707.9      40.5      00:23:50
 23612       5   4,635      23,175       716.9      41.0      00:23:34
 23876       8   4,635      37,080       725.2      41.5      00:23:21
 24156       6   4,635      27,810       733.3      41.9      00:23:08
 24436      10   4,635      46,350       741.5      42.4      00:22:55
 24682       3   4,635      13,905       749.3      42.8      00:22:44
 24978       6   4,635      27,810       758.1      43.3      00:22:29
 25257       9   4,635      41,715       766.8      43.8      00:22:15
 25537       3   4,635      13,905       775.4      44.3      00:22:01
 25740       7   4,635      32,445       781.7      44.7      00:21:55
 25928       7   4,635      32,445       787.5      45.0      00:21:49
 26117       6   4,635      27,810       793.3      45.4      00:21:44
 26383       4   4,635      18,540       801.4      45.8      00:21:32
 26674       8   4,635      37,080       809.9      46.3      00:21:18
 26947       7   4,635      32,445       818.4      46.8      00:21:05
 27156       7   4,635      32,445       824.8      47.2      00:20:58
 27372       7   4,635      32,445       831.3      47.5      00:20:50
 27581       3   4,635      13,905       837.8      47.9      00:20:43
 27799      10   4,635      46,350       844.6      48.3      00:20:34
 28089       5   4,635      23,175       853.8      48.8      00:20:19
 28399       6   4,635      27,810       863.5      49.4      00:20:02
 28661       9   4,635      41,715       871.9      49.9      00:19:49
 28857       7   4,635      32,445       878.3      50.2      00:19:42
 29068       4   4,635      18,540       884.9      50.6      00:19:34
 29299       7   4,635      32,445       891.9      51.0      00:19:25
 29532       7   4,635      32,445       899.2      51.4      00:19:15
 29765      10   4,635      46,350       906.5      51.8      00:19:06
 29953       7   4,635      32,445       912.3      52.2      00:18:60
 30145       6   4,635      27,810       918.4      52.5      00:18:53
 30394      10   4,635      46,350       926.2      53.0      00:18:42
 30620       6   4,635      27,810       933.5      53.4      00:18:32
 30921       6   4,635      27,810       943.0      53.9      00:18:16
 31226       4   4,635      18,540       952.5      54.5      00:18:01
 31524       5   4,635      23,175       962.1      55.0      00:17:45
 31822      10   4,635      46,350       971.8      55.6      00:17:30
 32132       9   4,635      41,715       981.9      56.1      00:17:13
 32416       7   4,635      32,445       991.4      56.7      00:16:59
 32601       8   4,635      37,080       997.2      57.0      00:16:52
 32771       9   4,635      41,715     1,002.6      57.3      00:16:47
 32969       6   4,635      27,810     1,009.0      57.7      00:16:39
 33162       6   4,635      27,810     1,015.2      58.0      00:16:32
 33401       6   4,635      27,810     1,022.8      58.5      00:16:22
 33644       9   4,635      41,715     1,030.8      58.9      00:16:10
 33883       7   4,635      32,445     1,038.4      59.4      00:15:60
 34119       6   4,635      27,810     1,046.1      59.8      00:15:49
 34400       9   4,635      41,715     1,055.3      60.3      00:15:35
 34712       9   4,635      41,715     1,065.3      60.9      00:15:19
 35016       5   4,635      23,175     1,075.1      61.5      00:15:04
 35328       8   4,635      37,080     1,085.2      62.1      00:14:49
 35638       6   4,635      27,810     1,095.2      62.6      00:14:33
 35951       6   4,635      27,810     1,105.1      63.2      00:14:18
 36252       9   4,635      41,715     1,114.8      63.7      00:14:04
 36542      10   4,635      46,350     1,123.9      64.3      00:13:50
 36745      10   4,635      46,350     1,130.1      64.6      00:13:43
 36957      10   4,635      46,350     1,136.8      65.0      00:13:35
 37190      10   4,635      46,350     1,143.5      65.4      00:13:26
 37378      10   4,635      46,350     1,149.1      65.7      00:13:20
 37577      10   4,635      46,350     1,155.1      66.1      00:13:13
 37785       5   4,635      23,175     1,161.3      66.4      00:13:06
 38005      10   4,635      46,350     1,168.1      66.8      00:12:57
 38238      10   4,635      46,350     1,175.5      67.2      00:12:47
 38443       7   4,635      32,445     1,182.2      67.6      00:12:39
 38721       8   4,635      37,080     1,191.0      68.1      00:12:26
 38990      10   4,635      46,350     1,199.4      68.6      00:12:15
 39202       5   4,635      23,175     1,205.7      68.9      00:12:07
 39434       8   4,635      37,080     1,212.7      69.3      00:11:58
 39699       7   4,635      32,445     1,220.8      69.8      00:11:47
 39968       5   4,635      23,175     1,229.2      70.3      00:11:35
 40290       4   4,635      18,540     1,238.9      70.8      00:11:21
 40602       8   4,635      37,080     1,248.9      71.4      00:11:06
 40905       9   4,635      41,715     1,258.5      72.0      00:10:52
 41085       7   4,635      32,445     1,264.2      72.3      00:10:45
 41272      10   4,635      46,350     1,270.0      72.6      00:10:39
 41497       7   4,635      32,445     1,277.1      73.0      00:10:29
 41702       8   4,635      37,080     1,283.5      73.4      00:10:21
 41900       9   4,635      41,715     1,289.9      73.8      00:10:13
 42080       8   4,635      37,080     1,295.2      74.1      00:10:07
 42295       9   4,635      41,715     1,301.3      74.4      00:09:60
 42478       7   4,635      32,445     1,307.3      74.7      00:09:52
 42680       7   4,635      32,445     1,313.4      75.1      00:09:45
 42868       8   4,635      37,080     1,319.2      75.4      00:09:38
 43049      10   4,635      46,350     1,325.0      75.8      00:09:31
 43230       6   4,635      27,810     1,330.9      76.1      00:09:23
 43418       6   4,635      27,810     1,336.9      76.4      00:09:16
 43653       2   4,635       9,270     1,343.8      76.8      00:09:07
 43912       7   4,635      32,445     1,351.9      77.3      00:08:56
 44136       9   4,635      41,715     1,358.6      77.7      00:08:47
 44305       7   4,635      32,445     1,363.9      78.0      00:08:41
 44495       7   4,635      32,445     1,369.6      78.3      00:08:34
 44717       9   4,635      41,715     1,376.4      78.7      00:08:24
 44973       9   4,635      41,715     1,384.4      79.2      00:08:13
 45222       6   4,635      27,810     1,391.8      79.6      00:08:03
 45429       9   4,635      41,715     1,397.7      79.9      00:07:56
 45629      10   4,635      46,350     1,403.5      80.3      00:07:49
 45856       6   4,635      27,810     1,410.2      80.6      00:07:40
 46062       5   4,635      23,175     1,416.6      81.0      00:07:31
 46257       5   4,635      23,175     1,423.0      81.4      00:07:23
 46467       9   4,635      41,715     1,429.4      81.7      00:07:15
 46713       7   4,635      32,445     1,437.2      82.2      00:07:04
 46942       6   4,635      27,810     1,444.1      82.6      00:06:55
 47115       9   4,635      41,715     1,449.0      82.8      00:06:49
 47312       8   4,635      37,080     1,454.8      83.2      00:06:41
 47508       8   4,635      37,080     1,460.5      83.5      00:06:34
 47709      10   4,635      46,350     1,466.8      83.9      00:06:25
 47925       7   4,635      32,445     1,473.4      84.2      00:06:17
 48154      10   4,635      46,350     1,480.4      84.6      00:06:07
 48389       8   4,635      37,080     1,487.7      85.1      00:05:57
 48607       6   4,635      27,810     1,494.5      85.5      00:05:48
 48840       9   4,635      41,715     1,501.6      85.9      00:05:38
 49060       4   4,635      18,540     1,508.3      86.2      00:05:29
 49252       9   4,635      41,715     1,514.4      86.6      00:05:21
 49459       5   4,635      23,175     1,520.4      86.9      00:05:13
 49701       6   4,635      27,810     1,527.3      87.3      00:05:04
 49924       4   4,635      18,540     1,534.0      87.7      00:04:55
 50144       8   4,635      37,080     1,540.7      88.1      00:04:46
 50365       5   4,635      23,175     1,546.9      88.5      00:04:37
 50590       9   4,635      41,715     1,554.0      88.9      00:04:28
 50811       7   4,635      32,445     1,560.9      89.3      00:04:18
 51012       9   4,635      41,715     1,567.6      89.6      00:04:09
 51237       9   4,635      41,715     1,574.4      90.0      00:03:60
 51460       8   4,635      37,080     1,581.4      90.4      00:03:50
 51661       8   4,635      37,080     1,588.0      90.8      00:03:41
 51884       9   4,635      41,715     1,595.1      91.2      00:03:32
 52139       5   4,635      23,175     1,603.6      91.7      00:03:20
 52415       5   4,635      23,175     1,612.7      92.2      00:03:07
 52674       9   4,635      41,715     1,621.5      92.7      00:02:55
 52954      10   4,635      46,350     1,630.7      93.2      00:02:42
 53241       7   4,635      32,445     1,640.0      93.8      00:02:29
 53524       9   4,635      41,715     1,649.1      94.3      00:02:16
 53770      10   4,635      46,350     1,656.9      94.7      00:02:06
 53983      10   4,635      46,350     1,663.4      95.1      00:01:57
 54193       9   4,635      41,715     1,670.0      95.5      00:01:48
 54393       9   4,635      41,715     1,675.9      95.8      00:01:40
 54643      10   4,635      46,350     1,683.2      96.2      00:01:30
 54909       8   4,635      37,080     1,691.3      96.7      00:01:19
 55139      10   4,635      46,350     1,698.3      97.1      00:01:09
 55392       7   4,635      32,445     1,705.6      97.5      00:00:59
 55606      10   4,635      46,350     1,711.9      97.9      00:00:51
 55808      10   4,635      46,350     1,718.3      98.2      00:00:42
 56072       6   4,635      27,810     1,726.6      98.7      00:00:31
 56328       8   4,635      37,080     1,734.9      99.2      00:00:19
 56625       7   4,635      32,445     1,744.5      99.7      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 2397.12
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
