
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A400_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   354       5   4,435      22,175         8.9       0.5      00:31:09
   740       7   4,435      31,045        19.3       1.1      00:28:42
  1121       7   4,435      31,045        29.8       1.8      00:27:40
  1489       4   4,435      17,740        40.6       2.4      00:26:52
  1881       7   4,435      31,045        51.7       3.1      00:26:10
  2304       9   4,435      39,915        63.8       3.8      00:25:18
  2685       9   4,435      39,915        74.4       4.4      00:25:08
  3052       6   4,435      26,610        84.9       5.1      00:25:01
  3382       8   4,435      35,480        94.9       5.7      00:24:60
  3751       9   4,435      39,915       105.7       6.3      00:24:46
  4098       8   4,435      35,480       115.4       6.9      00:24:49
  4460       8   4,435      35,480       125.2       7.5      00:24:47
  4751       7   4,435      31,045       133.9       8.0      00:24:58
  5053       6   4,435      26,610       142.6       8.5      00:25:06
  5375      10   4,435      44,350       151.9       9.1      00:25:05
  5683       8   4,435      35,480       160.0       9.6      00:25:17
  6020       5   4,435      22,175       169.6      10.1      00:25:11
  6285       5   4,435      22,175       177.2      10.6      00:25:23
  6588      10   4,435      44,350       185.6      11.1      00:25:26
  6904       7   4,435      31,045       194.5      11.6      00:25:24
  7282       5   4,435      22,175       205.0      12.2      00:25:08
  7677       8   4,435      35,480       216.7      12.9      00:24:43
  8048       7   4,435      31,045       227.9      13.6      00:24:23
  8380       4   4,435      17,740       237.9      14.2      00:24:12
  8753       7   4,435      31,045       249.2      14.9      00:23:52
  9098       7   4,435      31,045       259.6      15.5      00:23:39
  9406       8   4,435      35,480       268.9      16.1      00:23:33
  9688       2   4,435       8,870       277.8      16.6      00:23:30
  9933       5   4,435      22,175       285.0      17.0      00:23:36
 10174       8   4,435      35,480       291.5      17.4      00:23:46
 10452       8   4,435      35,480       299.4      17.9      00:23:46
 10803       8   4,435      35,480       309.3      18.5      00:23:35
 11102       4   4,435      17,740       317.8      19.0      00:23:31
 11364       8   4,435      35,480       325.4      19.4      00:23:32
 11589       8   4,435      35,480       331.9      19.8      00:23:38
 11816       6   4,435      26,610       338.5      20.2      00:23:43
 12048      10   4,435      44,350       345.3      20.6      00:23:47
 12385       9   4,435      39,915       355.1      21.2      00:23:35
 12792       7   4,435      31,045       366.6      21.9      00:23:14
 13209       8   4,435      35,480       378.6      22.6      00:22:52
 13580       5   4,435      22,175       389.9      23.3      00:22:33
 13824      10   4,435      44,350       397.0      23.7      00:22:34
 14086       8   4,435      35,480       404.6      24.2      00:22:32
 14406       7   4,435      31,045       414.3      24.7      00:22:21
 14715       6   4,435      26,610       423.3      25.3      00:22:13
 15050       9   4,435      39,915       433.4      25.9      00:21:60
 15398       9   4,435      39,915       443.9      26.5      00:21:45
 15825      10   4,435      44,350       456.4      27.3      00:21:23
 16214       9   4,435      39,915       468.5      28.0      00:21:04
 16567       8   4,435      35,480       479.2      28.6      00:20:50
 16838       7   4,435      31,045       487.1      29.1      00:20:45
 17088       5   4,435      22,175       494.5      29.5      00:20:43
 17326       6   4,435      26,610       501.5      29.9      00:20:42
 17561       9   4,435      39,915       509.0      30.4      00:20:39
 17822       8   4,435      35,480       516.5      30.8      00:20:35
 18101       9   4,435      39,915       524.9      31.3      00:20:29
 18424       7   4,435      31,045       534.4      31.9      00:20:18
 18720      10   4,435      44,350       543.2      32.4      00:20:10
 19017       6   4,435      26,610       552.3      33.0      00:20:01
 19361       5   4,435      22,175       562.7      33.6      00:19:48
 19714       9   4,435      39,915       573.8      34.3      00:19:32
 20062       8   4,435      35,480       584.7      34.9      00:19:18
 20475       6   4,435      26,610       597.0      35.7      00:18:59
 20720       6   4,435      26,610       604.5      36.1      00:18:55
 21004       7   4,435      31,045       613.0      36.6      00:18:48
 21282       7   4,435      31,045       620.5      37.1      00:18:43
 21598      10   4,435      44,350       629.4      37.6      00:18:34
 21928      10   4,435      44,350       638.5      38.1      00:18:25
 22260       9   4,435      39,915       647.7      38.7      00:18:16
 22571       6   4,435      26,610       656.4      39.2      00:18:08
 22898       8   4,435      35,480       665.3      39.7      00:17:59
 23212       9   4,435      39,915       674.6      40.3      00:17:49
 23500      10   4,435      44,350       682.8      40.8      00:17:42
 23791       8   4,435      35,480       691.1      41.3      00:17:35
 24122       7   4,435      31,045       700.7      41.8      00:17:25
 24560       5   4,435      22,175       712.9      42.6      00:17:07
 24934       4   4,435      17,740       723.9      43.2      00:16:53
 25331       4   4,435      17,740       735.6      43.9      00:16:37
 25711       9   4,435      39,915       746.7      44.6      00:16:24
 26018       6   4,435      26,610       755.8      45.1      00:16:14
 26389       3   4,435      13,305       766.7      45.8      00:16:01
 26731       5   4,435      22,175       776.3      46.4      00:15:51
 27063       8   4,435      35,480       786.2      46.9      00:15:40
 27336       7   4,435      31,045       794.1      47.4      00:15:33
 27636       7   4,435      31,045       802.9      47.9      00:15:25
 27941      10   4,435      44,350       812.1      48.5      00:15:15
 28286       5   4,435      22,175       822.4      49.1      00:15:03
 28651       6   4,435      26,610       833.7      49.8      00:14:49
 29006       6   4,435      26,610       844.5      50.4      00:14:36
 29320       7   4,435      31,045       853.7      51.0      00:14:27
 29678       5   4,435      22,175       864.2      51.6      00:14:15
 29961       4   4,435      17,740       872.8      52.1      00:14:07
 30249       5   4,435      22,175       881.5      52.6      00:13:58
 30643       9   4,435      39,915       893.5      53.4      00:13:43
 31091       7   4,435      31,045       906.9      54.2      00:13:26
 31525       8   4,435      35,480       920.3      55.0      00:13:08
 31944       7   4,435      31,045       933.3      55.7      00:12:52
 32355       7   4,435      31,045       946.2      56.5      00:12:36
 32709       9   4,435      39,915       957.0      57.1      00:12:24
 32977       7   4,435      31,045       965.3      57.6      00:12:16
 33287      10   4,435      44,350       974.8      58.2      00:12:06
 33620       8   4,435      35,480       985.1      58.8      00:11:55
 33938      10   4,435      44,350       994.9      59.4      00:11:45
 34194       9   4,435      39,915     1,003.0      59.9      00:11:38
 34532      10   4,435      44,350     1,013.4      60.5      00:11:26
 34972      10   4,435      44,350     1,027.1      61.3      00:11:10
 35430      10   4,435      44,350     1,041.2      62.2      00:10:52
 35867      10   4,435      44,350     1,054.4      63.0      00:10:36
 36267      10   4,435      44,350     1,066.7      63.7      00:10:22
 36645       9   4,435      39,915     1,078.2      64.4      00:10:09
 36901       9   4,435      39,915     1,085.7      64.8      00:10:03
 37171       8   4,435      35,480     1,093.5      65.3      00:09:56
 37487      10   4,435      44,350     1,102.3      65.8      00:09:48
 37786       9   4,435      39,915     1,110.9      66.3      00:09:40
 38092       6   4,435      26,610     1,120.1      66.9      00:09:30
 38360       6   4,435      26,610     1,128.1      67.4      00:09:23
 38576       9   4,435      39,915     1,134.9      67.8      00:09:17
 38930       6   4,435      26,610     1,145.4      68.4      00:09:06
 39180       4   4,435      17,740     1,152.8      68.8      00:08:60
 39470       8   4,435      35,480     1,161.1      69.3      00:08:52
 39778       7   4,435      31,045     1,170.1      69.9      00:08:43
 40144       9   4,435      39,915     1,180.9      70.5      00:08:31
 40556       6   4,435      26,610     1,193.3      71.3      00:08:17
 40977       9   4,435      39,915     1,206.1      72.0      00:08:03
 41288       6   4,435      26,610     1,215.4      72.6      00:07:53
 41633       7   4,435      31,045     1,225.7      73.2      00:07:42
 41960       3   4,435      13,305     1,235.7      73.8      00:07:32
 42229       7   4,435      31,045     1,243.1      74.2      00:07:25
 42539      10   4,435      44,350     1,252.3      74.8      00:07:16
 42862       9   4,435      39,915     1,261.7      75.3      00:07:06
 43166      10   4,435      44,350     1,271.1      75.9      00:06:57
 43483       5   4,435      22,175     1,280.8      76.5      00:06:47
 43743       7   4,435      31,045     1,288.1      76.9      00:06:40
 44055       5   4,435      22,175     1,297.4      77.5      00:06:30
 44394       6   4,435      26,610     1,307.1      78.1      00:06:20
 44758       7   4,435      31,045     1,317.9      78.7      00:06:09
 45065       6   4,435      26,610     1,327.0      79.2      00:05:60
 45373       7   4,435      31,045     1,335.5      79.7      00:05:51
 45611       6   4,435      26,610     1,342.2      80.2      00:05:45
 45943       4   4,435      17,740     1,351.6      80.7      00:05:35
 46254       7   4,435      31,045     1,361.2      81.3      00:05:25
 46592       9   4,435      39,915     1,371.3      81.9      00:05:15
 47010       1   4,435       4,435     1,383.4      82.6      00:05:02
 47381       7   4,435      31,045     1,393.7      83.2      00:04:51
 47666       3   4,435      13,305     1,401.9      83.7      00:04:43
 47950       6   4,435      26,610     1,410.2      84.2      00:04:34
 48265       8   4,435      35,480     1,419.4      84.8      00:04:25
 48589      10   4,435      44,350     1,429.2      85.3      00:04:15
 48955       8   4,435      35,480     1,439.9      86.0      00:04:03
 49296       8   4,435      35,480     1,450.1      86.6      00:03:53
 49566       8   4,435      35,480     1,457.6      87.0      00:03:45
 49864       5   4,435      22,175     1,465.7      87.5      00:03:37
 50180       8   4,435      35,480     1,475.0      88.1      00:03:27
 50522       8   4,435      35,480     1,484.5      88.6      00:03:18
 50851       4   4,435      17,740     1,494.4      89.2      00:03:07
 51137       3   4,435      13,305     1,503.1      89.8      00:02:58
 51458       8   4,435      35,480     1,512.6      90.3      00:02:48
 51780       7   4,435      31,045     1,522.6      90.9      00:02:38
 52088       7   4,435      31,045     1,532.1      91.5      00:02:28
 52414       9   4,435      39,915     1,542.5      92.1      00:02:17
 52837       8   4,435      35,480     1,556.2      92.9      00:02:03
 53290       8   4,435      35,480     1,570.3      93.8      00:01:48
 53714       7   4,435      31,045     1,583.3      94.5      00:01:34
 53966       3   4,435      13,305     1,590.7      95.0      00:01:27
 54256       7   4,435      31,045     1,599.4      95.5      00:01:18
 54607       9   4,435      39,915     1,609.1      96.1      00:01:08
 54968       8   4,435      35,480     1,619.7      96.7      00:00:57
 55234       5   4,435      22,175     1,627.3      97.2      00:00:49
 55551       4   4,435      17,740     1,636.1      97.7      00:00:40
 55867      10   4,435      44,350     1,645.5      98.3      00:00:30
 56173       7   4,435      31,045     1,654.7      98.8      00:00:21
 56402       6   4,435      26,610     1,661.9      99.2      00:00:13
 56732      10   4,435      44,350     1,671.9      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1741.324
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
