
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A700_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   316       7   4,735      33,145         8.5       0.5      00:34:59
   656       6   4,735      28,410        18.0       1.0      00:32:50
  1002       9   4,735      42,615        28.1       1.6      00:31:18
  1350       5   4,735      23,675        39.0       2.2      00:29:57
  1687       8   4,735      37,880        49.6       2.8      00:29:14
  2027       5   4,735      23,675        59.5       3.3      00:29:04
  2370       8   4,735      37,880        70.0       3.9      00:28:41
  2721       7   4,735      33,145        80.5       4.5      00:28:17
  3089       7   4,735      33,145        91.7       5.1      00:27:46
  3461       3   4,735      14,205       103.9       5.8      00:27:03
  3828       6   4,735      28,410       115.3       6.4      00:26:38
  4134       7   4,735      33,145       124.2       6.9      00:26:49
  4411       7   4,735      33,145       132.2       7.4      00:27:10
  4683       8   4,735      37,880       140.9       7.9      00:27:19
  4975       6   4,735      28,410       149.8       8.4      00:27:22
  5253       1   4,735       4,735       158.2       8.8      00:27:30
  5541       5   4,735      23,675       166.8       9.3      00:27:35
  5798       4   4,735      18,940       174.3       9.7      00:27:49
  6067       9   4,735      42,615       182.6      10.2      00:27:52
  6370       6   4,735      28,410       191.6      10.7      00:27:49
  6650      10   4,735      47,350       199.9      11.2      00:27:51
  6886      10   4,735      47,350       207.1      11.6      00:28:02
  7151       7   4,735      33,145       215.0      12.0      00:28:06
  7528       4   4,735      18,940       226.6      12.7      00:27:37
  7909       8   4,735      37,880       238.7      13.3      00:27:05
  8236       5   4,735      23,675       249.4      13.9      00:26:47
  8539       8   4,735      37,880       259.3      14.5      00:26:35
  8851       4   4,735      18,940       269.2      15.1      00:26:22
  9200       8   4,735      37,880       280.5      15.7      00:26:01
  9427       9   4,735      42,615       287.9      16.1      00:26:06
  9634       7   4,735      33,145       294.7      16.5      00:26:13
  9875       4   4,735      18,940       302.4      16.9      00:26:15
 10176       9   4,735      42,615       311.3      17.4      00:26:08
 10431       9   4,735      42,615       318.9      17.8      00:26:09
 10730       7   4,735      33,145       328.0      18.3      00:26:01
 11043      10   4,735      47,350       337.6      18.9      00:25:49
 11315       8   4,735      37,880       345.8      19.3      00:25:46
 11592       4   4,735      18,940       354.4      19.8      00:25:40
 11872       7   4,735      33,145       363.2      20.3      00:25:33
 12172       8   4,735      37,880       372.6      20.8      00:25:22
 12498       9   4,735      42,615       382.5      21.4      00:25:09
 12812       7   4,735      33,145       392.0      21.9      00:24:58
 13128      10   4,735      47,350       401.7      22.5      00:24:46
 13436       7   4,735      33,145       411.4      23.0      00:24:35
 13681       4   4,735      18,940       419.6      23.5      00:24:30
 13978      10   4,735      47,350       428.6      24.0      00:24:22
 14285       4   4,735      18,940       438.3      24.5      00:24:10
 14598       4   4,735      18,940       448.3      25.1      00:23:57
 14908       7   4,735      33,145       458.0      25.6      00:23:45
 15247       5   4,735      23,675       469.1      26.2      00:23:28
 15608       8   4,735      37,880       480.3      26.9      00:23:11
 15951       6   4,735      28,410       491.5      27.5      00:22:54
 16308       7   4,735      33,145       503.2      28.1      00:22:36
 16645       6   4,735      28,410       513.8      28.7      00:22:21
 16938       5   4,735      23,675       523.1      29.3      00:22:12
 17195       6   4,735      28,410       531.2      29.7      00:22:07
 17494      10   4,735      47,350       541.1      30.3      00:21:56
 17699       4   4,735      18,940       547.8      30.6      00:21:55
 17969       5   4,735      23,675       556.1      31.1      00:21:49
 18241       9   4,735      42,615       565.0      31.6      00:21:41
 18543       7   4,735      33,145       574.0      32.1      00:21:32
 18811       6   4,735      28,410       582.8      32.6      00:21:24
 19119       8   4,735      37,880       593.0      33.2      00:21:12
 19392      10   4,735      47,350       601.8      33.7      00:21:04
 19803       6   4,735      28,410       615.6      34.4      00:20:40
 20175       5   4,735      23,675       627.9      35.1      00:20:21
 20530       7   4,735      33,145       639.2      35.8      00:20:06
 20772       6   4,735      28,410       647.0      36.2      00:20:01
 20993       7   4,735      33,145       654.1      36.6      00:19:58
 21291       9   4,735      42,615       662.7      37.1      00:19:51
 21566       5   4,735      23,675       671.2      37.5      00:19:43
 21882       7   4,735      33,145       680.3      38.1      00:19:34
 22219       5   4,735      23,675       690.2      38.6      00:19:23
 22554       7   4,735      33,145       700.3      39.2      00:19:11
 22839       3   4,735      14,205       708.4      39.6      00:19:05
 23140       4   4,735      18,940       717.9      40.2      00:18:55
 23460       6   4,735      28,410       727.9      40.7      00:18:43
 23751       5   4,735      23,675       736.5      41.2      00:18:36
 24018       5   4,735      23,675       744.9      41.7      00:18:28
 24353       8   4,735      37,880       754.7      42.2      00:18:17
 24745       6   4,735      28,410       767.2      42.9      00:17:60
 25134       1   4,735       4,735       779.2      43.6      00:17:43
 25487       9   4,735      42,615       790.4      44.2      00:17:29
 25789       7   4,735      33,145       799.8      44.7      00:17:20
 26059       9   4,735      42,615       808.3      45.2      00:17:12
 26341      10   4,735      47,350       817.1      45.7      00:17:04
 26610       7   4,735      33,145       825.3      46.2      00:16:57
 26890       6   4,735      28,410       833.8      46.6      00:16:49
 27140       8   4,735      37,880       841.7      47.1      00:16:42
 27432       9   4,735      42,615       850.8      47.6      00:16:33
 27725       7   4,735      33,145       860.1      48.1      00:16:24
 28085       5   4,735      23,675       871.6      48.7      00:16:09
 28471       7   4,735      33,145       884.1      49.4      00:15:52
 28762       5   4,735      23,675       893.8      50.0      00:15:42
 28981       7   4,735      33,145       900.9      50.4      00:15:37
 29255       6   4,735      28,410       909.3      50.9      00:15:29
 29610      10   4,735      47,350       920.7      51.5      00:15:15
 29899       5   4,735      23,675       929.9      52.0      00:15:06
 30179      10   4,735      47,350       938.9      52.5      00:14:57
 30540       5   4,735      23,675       950.7      53.2      00:14:42
 30913       9   4,735      42,615       962.7      53.8      00:14:27
 31336       7   4,735      33,145       976.2      54.6      00:14:10
 31704       9   4,735      42,615       988.3      55.3      00:13:55
 31993       8   4,735      37,880       998.1      55.8      00:13:45
 32320       8   4,735      37,880     1,009.0      56.4      00:13:32
 32592       8   4,735      37,880     1,018.0      56.9      00:13:23
 32780       7   4,735      33,145     1,024.1      57.3      00:13:19
 32981       7   4,735      33,145     1,030.7      57.6      00:13:15
 33233       6   4,735      28,410     1,039.0      58.1      00:13:07
 33550       9   4,735      42,615     1,049.4      58.7      00:12:56
 33866       8   4,735      37,880     1,059.8      59.3      00:12:44
 34216      10   4,735      47,350     1,071.6      59.9      00:12:30
 34626       7   4,735      33,145     1,085.0      60.7      00:12:13
 34993       4   4,735      18,940     1,097.2      61.4      00:11:59
 35388       7   4,735      33,145     1,110.1      62.1      00:11:43
 35727       7   4,735      33,145     1,121.2      62.7      00:11:31
 36039       9   4,735      42,615     1,131.4      63.3      00:11:20
 36394      10   4,735      47,350     1,143.1      63.9      00:11:07
 36703       6   4,735      28,410     1,152.9      64.5      00:10:57
 36937       6   4,735      28,410     1,160.4      64.9      00:10:50
 37192       7   4,735      33,145     1,168.0      65.3      00:10:43
 37472      10   4,735      47,350     1,176.4      65.8      00:10:35
 37754       4   4,735      18,940     1,185.0      66.3      00:10:27
 38075       9   4,735      42,615     1,195.2      66.9      00:10:16
 38371       9   4,735      42,615     1,204.8      67.4      00:10:06
 38705       5   4,735      23,675     1,215.7      68.0      00:09:54
 39053       9   4,735      42,615     1,226.9      68.6      00:09:42
 39310       6   4,735      28,410     1,234.7      69.1      00:09:35
 39642       6   4,735      28,410     1,245.2      69.6      00:09:23
 40037       4   4,735      18,940     1,257.5      70.3      00:09:09
 40463       8   4,735      37,880     1,271.0      71.1      00:08:54
 40886       8   4,735      37,880     1,284.6      71.8      00:08:38
 41163       6   4,735      28,410     1,293.6      72.4      00:08:29
 41473       7   4,735      33,145     1,303.5      72.9      00:08:19
 41756      10   4,735      47,350     1,312.6      73.4      00:08:10
 41995       7   4,735      33,145     1,320.4      73.8      00:08:02
 42212       2   4,735       9,470     1,326.7      74.2      00:07:57
 42469       7   4,735      33,145     1,334.8      74.7      00:07:49
 42753       7   4,735      33,145     1,343.5      75.1      00:07:41
 43044       9   4,735      42,615     1,352.9      75.7      00:07:31
 43334       8   4,735      37,880     1,362.5      76.2      00:07:21
 43612       7   4,735      33,145     1,371.2      76.7      00:07:12
 43920      10   4,735      47,350     1,380.9      77.2      00:07:02
 44213       6   4,735      28,410     1,390.1      77.8      00:06:53
 44535       7   4,735      33,145     1,400.0      78.3      00:06:43
 44890       7   4,735      33,145     1,411.3      78.9      00:06:30
 45266       6   4,735      28,410     1,422.8      79.6      00:06:18
 45586       7   4,735      33,145     1,432.4      80.1      00:06:08
 45892      10   4,735      47,350     1,441.5      80.6      00:05:59
 46217       8   4,735      37,880     1,452.0      81.2      00:05:48
 46522       9   4,735      42,615     1,461.6      81.8      00:05:38
 46865       5   4,735      23,675     1,472.8      82.4      00:05:26
 47115       9   4,735      42,615     1,480.1      82.8      00:05:19
 47355      10   4,735      47,350     1,487.2      83.2      00:05:12
 47664      10   4,735      47,350     1,496.6      83.7      00:05:02
 47976       6   4,735      28,410     1,506.5      84.3      00:04:52
 48248       4   4,735      18,940     1,514.9      84.7      00:04:43
 48549       9   4,735      42,615     1,524.6      85.3      00:04:33
 48851       7   4,735      33,145     1,534.0      85.8      00:04:24
 49134       7   4,735      33,145     1,542.9      86.3      00:04:15
 49381       1   4,735       4,735     1,550.7      86.7      00:04:07
 49611       9   4,735      42,615     1,557.4      87.1      00:04:00
 49854       7   4,735      33,145     1,564.5      87.5      00:03:53
 50123      10   4,735      47,350     1,572.9      88.0      00:03:45
 50434       8   4,735      37,880     1,582.2      88.5      00:03:35
 50742       5   4,735      23,675     1,591.9      89.0      00:03:25
 51038       7   4,735      33,145     1,601.7      89.6      00:03:14
 51358       4   4,735      18,940     1,611.7      90.1      00:03:04
 51656       7   4,735      33,145     1,621.5      90.7      00:02:54
 51954       8   4,735      37,880     1,631.3      91.2      00:02:44
 52275       7   4,735      33,145     1,642.2      91.9      00:02:32
 52672      10   4,735      47,350     1,655.8      92.6      00:02:17
 53009       5   4,735      23,675     1,667.2      93.2      00:02:05
 53366       5   4,735      23,675     1,679.0      93.9      00:01:53
 53750       7   4,735      33,145     1,691.5      94.6      00:01:40
 54050       9   4,735      42,615     1,701.0      95.1      00:01:30
 54348       8   4,735      37,880     1,710.4      95.7      00:01:20
 54688       8   4,735      37,880     1,720.5      96.2      00:01:10
 55047       6   4,735      28,410     1,731.6      96.9      00:00:58
 55337       9   4,735      42,615     1,740.5      97.3      00:00:49
 55625       6   4,735      28,410     1,749.0      97.8      00:00:40
 55922      10   4,735      47,350     1,758.6      98.4      00:00:30
 56235       7   4,735      33,145     1,768.7      98.9      00:00:20
 56564       6   4,735      28,410     1,779.6      99.5      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1857.614
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
