
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A200.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   514       8   4,235      33,880        12.5       0.8      00:21:10
  1053       7   4,235      29,645        26.6       1.7      00:19:42
  1573       8   4,235      33,880        41.1       2.6      00:18:59
  2114      10   4,235      42,350        55.7       3.5      00:18:29
  2663       8   4,235      33,880        70.5       4.4      00:18:06
  3214       7   4,235      29,645        85.8       5.4      00:17:40
  3714      10   4,235      42,350        99.9       6.2      00:17:31
  4137       3   4,235      12,705       111.1       6.9      00:17:52
  4544       6   4,235      25,410       121.9       7.6      00:18:12
  4899       8   4,235      33,880       131.9       8.3      00:18:33
  5248       9   4,235      38,115       141.4       8.8      00:18:55
  5615       8   4,235      33,880       151.0       9.4      00:19:12
  5999       8   4,235      33,880       161.4      10.1      00:19:20
  6413       5   4,235      21,175       172.5      10.8      00:19:19
  6818       8   4,235      33,880       183.4      11.5      00:19:19
  7290       7   4,235      29,645       195.9      12.3      00:19:07
  7797      10   4,235      42,350       210.2      13.1      00:18:45
  8272       5   4,235      21,175       224.0      14.0      00:18:26
  8762       3   4,235      12,705       238.2      14.9      00:18:07
  9222       8   4,235      33,880       251.6      15.7      00:17:53
  9550      10   4,235      42,350       261.1      16.3      00:17:57
  9911       9   4,235      38,115       271.6      17.0      00:17:57
 10323       8   4,235      33,880       282.2      17.6      00:17:55
 10730       7   4,235      29,645       293.4      18.3      00:17:49
 11140       6   4,235      25,410       304.6      19.0      00:17:44
 11484       5   4,235      21,175       314.1      19.6      00:17:45
 11896      10   4,235      42,350       325.5      20.4      00:17:38
 12298       4   4,235      16,940       336.7      21.1      00:17:31
 12801       6   4,235      25,410       350.3      21.9      00:17:15
 13297       6   4,235      25,410       364.0      22.8      00:16:59
 13817       6   4,235      25,410       378.9      23.7      00:16:39
 14362       6   4,235      25,410       394.3      24.7      00:16:19
 14914      10   4,235      42,350       409.8      25.6      00:15:59
 15438       6   4,235      25,410       424.9      26.6      00:15:41
 15975       8   4,235      33,880       440.2      27.5      00:15:23
 16514      10   4,235      42,350       456.1      28.5      00:15:03
 16914       7   4,235      29,645       467.2      29.2      00:14:58
 17271       8   4,235      33,880       477.3      29.8      00:14:54
 17589       8   4,235      33,880       486.9      30.4      00:14:52
 18004      10   4,235      42,350       498.4      31.2      00:14:45
 18447      10   4,235      42,350       510.9      31.9      00:14:34
 18937       5   4,235      21,175       525.0      32.8      00:14:20
 19476       8   4,235      33,880       540.8      33.8      00:14:03
 20000       6   4,235      25,410       556.4      34.8      00:13:46
 20524       9   4,235      38,115       571.5      35.7      00:13:30
 20941       9   4,235      38,115       583.7      36.5      00:13:21
 21365      10   4,235      42,350       594.6      37.2      00:13:15
 21788       9   4,235      38,115       605.9      37.9      00:13:08
 22214       4   4,235      16,940       617.2      38.6      00:13:00
 22643       9   4,235      38,115       628.8      39.3      00:12:53
 23063      10   4,235      42,350       639.9      40.0      00:12:45
 23463       6   4,235      25,410       651.1      40.7      00:12:38
 23897       4   4,235      16,940       663.0      41.5      00:12:29
 24432       7   4,235      29,645       677.1      42.3      00:12:16
 24981       6   4,235      25,410       692.5      43.3      00:12:01
 25529      10   4,235      42,350       708.2      44.3      00:11:45
 25932       8   4,235      33,880       719.4      45.0      00:11:38
 26391       7   4,235      29,645       732.2      45.8      00:11:28
 26932       9   4,235      38,115       746.9      46.7      00:11:14
 27378       9   4,235      38,115       759.4      47.5      00:11:04
 27821       4   4,235      16,940       772.0      48.3      00:10:54
 28337       6   4,235      25,410       786.8      49.2      00:10:41
 28802      10   4,235      42,350       800.5      50.1      00:10:29
 29220       7   4,235      29,645       812.4      50.8      00:10:21
 29712       9   4,235      38,115       826.3      51.7      00:10:09
 30093       8   4,235      33,880       837.3      52.4      00:10:01
 30515       9   4,235      38,115       849.6      53.1      00:09:52
 31058       3   4,235      12,705       865.0      54.1      00:09:38
 31596       8   4,235      33,880       880.8      55.1      00:09:23
 32138      10   4,235      42,350       896.9      56.1      00:09:09
 32617       8   4,235      33,880       911.2      57.0      00:08:57
 32961      10   4,235      42,350       921.3      57.6      00:08:50
 33356      10   4,235      42,350       932.9      58.3      00:08:42
 33764       6   4,235      25,410       944.9      59.1      00:08:33
 34218       8   4,235      33,880       958.5      59.9      00:08:22
 34765       8   4,235      33,880       974.6      60.9      00:08:08
 35307      10   4,235      42,350       990.6      61.9      00:07:54
 35840       8   4,235      33,880     1,006.0      62.9      00:07:40
 36360       8   4,235      33,880     1,021.4      63.9      00:07:27
 36795       6   4,235      25,410     1,033.6      64.6      00:07:18
 37200       2   4,235       8,470     1,044.9      65.3      00:07:10
 37582       6   4,235      25,410     1,055.3      66.0      00:07:03
 37941       5   4,235      21,175     1,065.1      66.6      00:06:57
 38308       7   4,235      29,645     1,075.7      67.3      00:06:49
 38667      10   4,235      42,350     1,086.2      67.9      00:06:42
 39017      10   4,235      42,350     1,096.3      68.6      00:06:35
 39460       5   4,235      21,175     1,108.4      69.3      00:06:26
 39921       9   4,235      38,115     1,121.4      70.1      00:06:15
 40409       9   4,235      38,115     1,135.1      71.0      00:06:04
 40951       9   4,235      38,115     1,150.9      72.0      00:05:51
 41321       6   4,235      25,410     1,161.5      72.6      00:05:43
 41781       6   4,235      25,410     1,174.7      73.5      00:05:33
 42197       6   4,235      25,410     1,186.2      74.2      00:05:24
 42591       8   4,235      33,880     1,197.2      74.9      00:05:16
 42983       5   4,235      21,175     1,208.2      75.6      00:05:08
 43338       6   4,235      25,410     1,218.8      76.2      00:04:60
 43728       6   4,235      25,410     1,229.6      76.9      00:04:52
 44106       7   4,235      29,645     1,240.4      77.6      00:04:44
 44563       8   4,235      33,880     1,252.9      78.4      00:04:34
 45005       8   4,235      33,880     1,265.5      79.1      00:04:24
 45484       5   4,235      21,175     1,278.3      79.9      00:04:14
 45923       5   4,235      21,175     1,290.1      80.7      00:04:05
 46330      10   4,235      42,350     1,302.0      81.4      00:03:55
 46789       8   4,235      33,880     1,315.0      82.2      00:03:45
 47200       9   4,235      38,115     1,326.0      82.9      00:03:37
 47613       7   4,235      29,645     1,337.2      83.6      00:03:28
 48006       7   4,235      29,645     1,348.2      84.3      00:03:19
 48392       3   4,235      12,705     1,359.2      85.0      00:03:11
 48820       1   4,235       4,235     1,371.2      85.7      00:03:01
 49258       7   4,235      29,645     1,383.8      86.5      00:02:51
 49812       6   4,235      25,410     1,398.2      87.4      00:02:40
 50313       9   4,235      38,115     1,412.0      88.3      00:02:29
 50744       8   4,235      33,880     1,423.9      89.0      00:02:19
 51148       3   4,235      12,705     1,435.6      89.8      00:02:10
 51573       8   4,235      33,880     1,447.8      90.5      00:02:00
 51999       7   4,235      29,645     1,460.3      91.3      00:01:50
 52404       6   4,235      25,410     1,472.6      92.1      00:01:41
 52809       6   4,235      25,410     1,485.2      92.9      00:01:31
 53238      10   4,235      42,350     1,498.0      93.7      00:01:20
 53767      10   4,235      42,350     1,513.4      94.6      00:01:08
 54197       6   4,235      25,410     1,525.5      95.4      00:00:58
 54650       9   4,235      38,115     1,537.8      96.2      00:00:49
 55082       8   4,235      33,880     1,549.8      96.9      00:00:39
 55451       8   4,235      33,880     1,559.7      97.5      00:00:31
 55842      10   4,235      42,350     1,570.5      98.2      00:00:23
 56224       7   4,235      29,645     1,581.6      98.9      00:00:14
 56630       9   4,235      38,115     1,593.5      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1281.414
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A200.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A200.csv saved

. 
. cap log close

. 
end of do-file
