
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A300_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   470      10   4,335      43,350        11.6       0.7      00:23:19
  1012       6   4,335      26,010        26.0       1.6      00:20:40
  1524       6   4,335      26,010        40.7       2.5      00:19:36
  2053       6   4,335      26,010        55.3       3.4      00:19:06
  2569      10   4,335      43,350        69.5       4.2      00:18:49
  3083       9   4,335      39,015        83.8       5.1      00:18:33
  3517       7   4,335      30,345        96.6       5.9      00:18:37
  3921       7   4,335      30,345       108.0       6.6      00:18:53
  4261       3   4,335      13,005       117.1       7.2      00:19:29
  4592       4   4,335      17,340       126.2       7.7      00:19:58
  4910       9   4,335      39,015       135.3       8.3      00:20:22
  5269       6   4,335      26,010       145.3       8.9      00:20:34
  5566       7   4,335      30,345       153.4       9.4      00:20:59
  5847       5   4,335      21,675       160.9       9.8      00:21:26
  6160       6   4,335      26,010       169.7      10.4      00:21:38
  6501       1   4,335       4,335       179.1      10.9      00:21:44
  6860       6   4,335      26,010       188.9      11.5      00:21:45
  7257       6   4,335      26,010       199.6      12.2      00:21:37
  7644       7   4,335      30,345       210.8      12.9      00:21:27
  8046       9   4,335      39,015       222.7      13.6      00:21:12
  8434       8   4,335      34,680       234.2      14.3      00:20:59
  8836       8   4,335      34,680       246.0      15.0      00:20:46
  9217       6   4,335      26,010       257.3      15.7      00:20:35
  9527       6   4,335      26,010       266.6      16.3      00:20:35
  9848       8   4,335      34,680       276.2      16.9      00:20:33
 10163       5   4,335      21,675       284.6      17.4      00:20:37
 10459       6   4,335      26,010       292.9      17.9      00:20:41
 10838      10   4,335      43,350       303.2      18.5      00:20:33
 11215       5   4,335      21,675       313.9      19.2      00:20:24
 11467      10   4,335      43,350       321.1      19.6      00:20:31
 11761       6   4,335      26,010       329.2      20.1      00:20:33
 12074       9   4,335      39,015       338.3      20.7      00:20:30
 12368       6   4,335      26,010       346.6      21.2      00:20:30
 12803       9   4,335      39,015       358.6      21.9      00:20:14
 13241       4   4,335      17,340       371.0      22.7      00:19:56
 13632       7   4,335      30,345       382.8      23.4      00:19:41
 13944       7   4,335      30,345       391.5      23.9      00:19:39
 14304       7   4,335      30,345       401.9      24.6      00:19:29
 14687       4   4,335      17,340       413.0      25.2      00:19:17
 15120      10   4,335      43,350       425.7      26.0      00:18:60
 15571       9   4,335      39,015       438.7      26.8      00:18:41
 16016       6   4,335      26,010       451.9      27.6      00:18:23
 16453       6   4,335      26,010       465.1      28.4      00:18:05
 16825       8   4,335      34,680       475.7      29.1      00:17:56
 17161       4   4,335      17,340       485.4      29.7      00:17:49
 17454      10   4,335      43,350       494.1      30.2      00:17:45
 17734       1   4,335       4,335       502.5      30.7      00:17:43
 18073       6   4,335      26,010       512.2      31.3      00:17:35
 18424       7   4,335      30,345       522.3      31.9      00:17:27
 18733       7   4,335      30,345       531.3      32.5      00:17:22
 19053       7   4,335      30,345       541.0      33.0      00:17:15
 19410       5   4,335      21,675       551.6      33.7      00:17:05
 19866       9   4,335      39,015       565.4      34.5      00:16:46
 20344       9   4,335      39,015       579.6      35.4      00:16:26
 20688       9   4,335      39,015       589.9      36.0      00:16:18
 20957      10   4,335      43,350       597.9      36.5      00:16:15
 21296       4   4,335      17,340       606.9      37.1      00:16:09
 21669       6   4,335      26,010       617.1      37.7      00:15:60
 21994      10   4,335      43,350       626.0      38.2      00:15:54
 22344      10   4,335      43,350       635.3      38.8      00:15:47
 22713       6   4,335      26,010       645.6      39.4      00:15:38
 23075       8   4,335      34,680       655.4      40.0      00:15:30
 23440       2   4,335       8,670       665.9      40.7      00:15:20
 23821       6   4,335      26,010       676.4      41.3      00:15:10
 24213       4   4,335      17,340       687.2      42.0      00:14:60
 24629       9   4,335      39,015       699.0      42.7      00:14:47
 25048      10   4,335      43,350       710.8      43.4      00:14:34
 25490       4   4,335      17,340       723.7      44.2      00:14:19
 25857       7   4,335      30,345       734.2      44.9      00:14:10
 26183      10   4,335      43,350       743.6      45.4      00:14:02
 26579       9   4,335      39,015       754.6      46.1      00:13:51
 26992       5   4,335      21,675       766.4      46.8      00:13:39
 27341       4   4,335      17,340       776.3      47.4      00:13:30
 27660       7   4,335      30,345       785.5      48.0      00:13:23
 28048       5   4,335      21,675       796.9      48.7      00:13:12
 28446       9   4,335      39,015       808.6      49.4      00:12:60
 28786       6   4,335      26,010       818.9      50.0      00:12:50
 29121      10   4,335      43,350       828.8      50.6      00:12:42
 29528       8   4,335      34,680       840.6      51.4      00:12:29
 29894       9   4,335      39,015       851.2      52.0      00:12:19
 30220       8   4,335      34,680       860.8      52.6      00:12:11
 30571       8   4,335      34,680       871.3      53.2      00:12:02
 31022       5   4,335      21,675       884.5      54.0      00:11:47
 31479      10   4,335      43,350       898.2      54.9      00:11:32
 31907      10   4,335      43,350       911.1      55.7      00:11:18
 32322       7   4,335      30,345       923.8      56.4      00:11:05
 32666       7   4,335      30,345       934.2      57.1      00:10:55
 33010       6   4,335      26,010       944.5      57.7      00:10:46
 33401       8   4,335      34,680       956.2      58.4      00:10:35
 33847       9   4,335      39,015       969.7      59.2      00:10:20
 34262      10   4,335      43,350       982.5      60.0      00:10:07
 34741       7   4,335      30,345       996.8      60.9      00:09:52
 35216      10   4,335      43,350     1,011.2      61.8      00:09:36
 35712       4   4,335      17,340     1,026.0      62.7      00:09:20
 36217       9   4,335      39,015     1,041.1      63.6      00:09:04
 36666       4   4,335      17,340     1,054.6      64.4      00:08:51
 37042       9   4,335      39,015     1,065.2      65.1      00:08:41
 37404       6   4,335      26,010     1,075.1      65.7      00:08:33
 37751       7   4,335      30,345     1,084.8      66.3      00:08:25
 38088       8   4,335      34,680     1,094.7      66.9      00:08:16
 38445       7   4,335      30,345     1,105.4      67.5      00:08:06
 38789       9   4,335      39,015     1,115.5      68.1      00:07:57
 39132      10   4,335      43,350     1,125.5      68.8      00:07:49
 39529      10   4,335      43,350     1,136.7      69.4      00:07:38
 40002      10   4,335      43,350     1,150.3      70.3      00:07:25
 40518      10   4,335      43,350     1,165.2      71.2      00:07:10
 40993       8   4,335      34,680     1,179.4      72.1      00:06:56
 41360       9   4,335      39,015     1,190.1      72.7      00:06:46
 41749      10   4,335      43,350     1,201.5      73.4      00:06:36
 42107       9   4,335      39,015     1,211.7      74.0      00:06:26
 42463       5   4,335      21,675     1,221.9      74.6      00:06:18
 42836       6   4,335      26,010     1,232.4      75.3      00:06:08
 43206       7   4,335      30,345     1,243.6      76.0      00:05:58
 43560       8   4,335      34,680     1,253.9      76.6      00:05:49
 43898       6   4,335      26,010     1,263.6      77.2      00:05:40
 44262      10   4,335      43,350     1,274.1      77.8      00:05:31
 44674       3   4,335      13,005     1,285.7      78.5      00:05:20
 45084       7   4,335      30,345     1,297.7      79.3      00:05:09
 45502      10   4,335      43,350     1,309.1      80.0      00:04:58
 45897       7   4,335      30,345     1,319.9      80.6      00:04:49
 46253       6   4,335      26,010     1,330.4      81.3      00:04:39
 46600       8   4,335      34,680     1,340.6      81.9      00:04:30
 47033       3   4,335      13,005     1,352.8      82.6      00:04:19
 47400      10   4,335      43,350     1,362.9      83.3      00:04:10
 47725       6   4,335      26,010     1,372.0      83.8      00:04:02
 48042       9   4,335      39,015     1,381.1      84.4      00:03:54
 48385       6   4,335      26,010     1,391.1      85.0      00:03:45
 48750       7   4,335      30,345     1,401.6      85.6      00:03:35
 49155       9   4,335      39,015     1,413.2      86.3      00:03:24
 49643       8   4,335      34,680     1,426.7      87.2      00:03:12
 50172       9   4,335      39,015     1,441.5      88.1      00:02:58
 50582       9   4,335      39,015     1,452.8      88.8      00:02:47
 50978      10   4,335      43,350     1,464.6      89.5      00:02:37
 51360       8   4,335      34,680     1,475.6      90.1      00:02:27
 51735       9   4,335      39,015     1,487.0      90.8      00:02:16
 52122       7   4,335      30,345     1,498.6      91.6      00:02:06
 52495       7   4,335      30,345     1,510.2      92.3      00:01:55
 52828      10   4,335      43,350     1,520.9      92.9      00:01:45
 53158      10   4,335      43,350     1,530.9      93.5      00:01:36
 53614       9   4,335      39,015     1,544.6      94.4      00:01:24
 53998      10   4,335      43,350     1,555.8      95.0      00:01:14
 54320      10   4,335      43,350     1,565.2      95.6      00:01:05
 54698       7   4,335      30,345     1,575.5      96.2      00:00:56
 55102       6   4,335      26,010     1,587.0      97.0      00:00:45
 55464       5   4,335      21,675     1,596.9      97.6      00:00:36
 55776       6   4,335      26,010     1,605.7      98.1      00:00:28
 56143       6   4,335      26,010     1,616.6      98.8      00:00:18
 56519       6   4,335      26,010     1,628.0      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1494.617
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
