
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_1_4q_mnl_flexthresh2_3_15_norandomterm.dta /export/storag
> e_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_blk_
> Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_norandomterm.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 19:13:50

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_1_4q_mnl_flexthresh2_3_15_nora
> ndomterm.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_norand
> omterm.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   517      10   4,035      40,350        12.0       0.8      00:20:60
  1032       9   4,035      36,315        24.8       1.6      00:20:10
  1566       4   4,035      16,140        38.9       2.6      00:19:05
  2109       6   4,035      24,210        52.9       3.5      00:18:32
  2564       7   4,035      28,245        64.5       4.2      00:18:52
  3033      10   4,035      40,350        76.7       5.0      00:18:52
  3503       7   4,035      28,245        89.6       5.9      00:18:41
  3955       8   4,035      32,280       101.3       6.6      00:18:45
  4301       7   4,035      28,245       109.9       7.2      00:19:19
  4637       9   4,035      36,315       118.8       7.8      00:19:44
  4988       8   4,035      32,280       128.0       8.4      00:20:01
  5358       9   4,035      36,315       137.7       9.0      00:20:09
  5704       6   4,035      24,210       146.1       9.6      00:20:27
  6077      10   4,035      40,350       155.9      10.2      00:20:30
  6471       4   4,035      16,140       165.9      10.9      00:20:29
  6845       6   4,035      24,210       175.4      11.5      00:20:31
  7258       7   4,035      28,245       185.9      12.2      00:20:25
  7664       8   4,035      32,280       196.8      12.9      00:20:16
  8046       9   4,035      36,315       207.3      13.6      00:20:08
  8458       5   4,035      20,175       218.7      14.4      00:19:55
  8879      10   4,035      40,350       230.2      15.1      00:19:42
  9247      10   4,035      40,350       240.4      15.8      00:19:36
  9556       9   4,035      36,315       248.9      16.3      00:19:39
  9925       4   4,035      16,140       259.1      17.0      00:19:33
 10327       6   4,035      24,210       269.0      17.7      00:19:28
 10725       8   4,035      32,280       279.4      18.3      00:19:19
 11136       9   4,035      36,315       290.1      19.0      00:19:10
 11450       7   4,035      28,245       298.5      19.6      00:19:11
 11781       7   4,035      28,245       307.0      20.2      00:19:11
 12118       5   4,035      20,175       316.1      20.7      00:19:08
 12509       7   4,035      28,245       326.3      21.4      00:18:59
 13012       9   4,035      36,315       339.2      22.3      00:18:39
 13476       2   4,035       8,070       351.8      23.1      00:18:21
 13798       8   4,035      32,280       360.6      23.7      00:18:18
 14167       5   4,035      20,175       370.3      24.3      00:18:12
 14552       8   4,035      32,280       380.9      25.0      00:18:02
 14968       8   4,035      32,280       392.0      25.7      00:17:50
 15453       4   4,035      16,140       405.2      26.6      00:17:30
 15948       5   4,035      20,175       418.7      27.5      00:17:10
 16432       8   4,035      32,280       432.3      28.4      00:16:51
 16788       7   4,035      28,245       441.8      29.0      00:16:45
 17131       6   4,035      24,210       451.0      29.6      00:16:40
 17469      10   4,035      40,350       460.4      30.2      00:16:35
 17837       3   4,035      12,105       470.3      30.9      00:16:27
 18223       4   4,035      16,140       481.0      31.6      00:16:17
 18652       9   4,035      36,315       492.3      32.3      00:16:05
 19105       6   4,035      24,210       504.9      33.1      00:15:50
 19584       5   4,035      20,175       518.3      34.0      00:15:32
 20095       8   4,035      32,280       532.9      35.0      00:15:12
 20565       6   4,035      24,210       545.7      35.8      00:14:57
 20867       9   4,035      36,315       554.0      36.4      00:14:54
 21209       9   4,035      36,315       562.9      36.9      00:14:49
 21640       5   4,035      20,175       573.7      37.7      00:14:39
 22033       4   4,035      16,140       583.7      38.3      00:14:31
 22437       6   4,035      24,210       593.7      39.0      00:14:23
 22821       6   4,035      24,210       603.3      39.6      00:14:15
 23129       8   4,035      32,280       611.5      40.1      00:14:11
 23449       7   4,035      28,245       620.1      40.7      00:14:06
 23817      10   4,035      40,350       629.5      41.3      00:13:59
 24227       6   4,035      24,210       640.1      42.0      00:13:49
 24696       7   4,035      28,245       652.5      42.8      00:13:35
 25155       9   4,035      36,315       664.7      43.6      00:13:22
 25614       8   4,035      32,280       676.8      44.4      00:13:09
 25911       6   4,035      24,210       684.8      44.9      00:13:05
 26266      10   4,035      40,350       694.5      45.6      00:12:57
 26722      10   4,035      40,350       706.0      46.3      00:12:45
 27128       9   4,035      36,315       716.9      47.1      00:12:35
 27468      10   4,035      40,350       726.0      47.6      00:12:28
 27880       7   4,035      28,245       737.2      48.4      00:12:17
 28329      10   4,035      40,350       749.5      49.2      00:12:04
 28729       8   4,035      32,280       760.6      49.9      00:11:53
 29007       5   4,035      20,175       768.4      50.4      00:11:49
 29320       7   4,035      28,245       776.7      51.0      00:11:43
 29682       5   4,035      20,175       786.4      51.6      00:11:35
 30021       8   4,035      32,280       795.8      52.2      00:11:27
 30377       9   4,035      36,315       805.5      52.9      00:11:18
 30795       6   4,035      24,210       817.1      53.6      00:11:07
 31277       8   4,035      32,280       830.3      54.5      00:10:52
 31766       9   4,035      36,315       844.0      55.4      00:10:37
 32229       5   4,035      20,175       857.2      56.3      00:10:23
 32650       9   4,035      36,315       869.0      57.0      00:10:11
 32976       7   4,035      28,245       878.2      57.6      00:10:04
 33270       7   4,035      28,245       886.4      58.2      00:09:58
 33624       7   4,035      28,245       896.4      58.8      00:09:49
 34003       5   4,035      20,175       907.0      59.5      00:09:39
 34430      10   4,035      40,350       919.1      60.3      00:09:26
 34913       9   4,035      36,315       932.8      61.2      00:09:12
 35400       7   4,035      28,245       946.4      62.1      00:08:57
 35884       9   4,035      36,315       959.8      63.0      00:08:44
 36347       9   4,035      36,315       972.8      63.8      00:08:30
 36779       3   4,035      12,105       984.4      64.6      00:08:19
 37153       8   4,035      32,280       994.5      65.3      00:08:10
 37531       7   4,035      28,245     1,004.0      65.9      00:08:02
 37898       8   4,035      32,280     1,013.7      66.5      00:07:53
 38221      10   4,035      40,350     1,022.6      67.1      00:07:46
 38525       8   4,035      32,280     1,031.1      67.7      00:07:39
 38858       8   4,035      32,280     1,040.1      68.3      00:07:32
 39147      10   4,035      40,350     1,048.0      68.8      00:07:25
 39506       6   4,035      24,210     1,057.3      69.4      00:07:17
 39903       5   4,035      20,175     1,067.9      70.1      00:07:07
 40396       6   4,035      24,210     1,081.1      71.0      00:06:54
 40883      10   4,035      40,350     1,094.6      71.8      00:06:40
 41213       8   4,035      32,280     1,103.7      72.4      00:06:32
 41603       4   4,035      16,140     1,114.3      73.1      00:06:23
 41982       9   4,035      36,315     1,124.8      73.8      00:06:13
 42341       7   4,035      28,245     1,133.8      74.4      00:06:05
 42715       6   4,035      24,210     1,144.0      75.1      00:05:56
 43075      10   4,035      40,350     1,153.8      75.7      00:05:47
 43415       7   4,035      28,245     1,163.4      76.4      00:05:38
 43742      10   4,035      40,350     1,171.9      76.9      00:05:31
 44037      10   4,035      40,350     1,179.9      77.4      00:05:24
 44313       7   4,035      28,245     1,187.3      77.9      00:05:18
 44637      10   4,035      40,350     1,195.8      78.5      00:05:10
 45011       5   4,035      20,175     1,205.9      79.1      00:05:01
 45387       6   4,035      24,210     1,215.3      79.8      00:04:52
 45719       8   4,035      32,280     1,223.8      80.3      00:04:45
 46039       7   4,035      28,245     1,232.4      80.9      00:04:37
 46369       4   4,035      16,140     1,241.5      81.5      00:04:28
 46747       8   4,035      32,280     1,251.8      82.2      00:04:19
 47113       7   4,035      28,245     1,261.3      82.8      00:04:10
 47422       3   4,035      12,105     1,269.1      83.3      00:04:03
 47715       6   4,035      24,210     1,276.8      83.8      00:03:56
 48023       9   4,035      36,315     1,285.1      84.3      00:03:49
 48348       6   4,035      24,210     1,293.8      84.9      00:03:41
 48692      10   4,035      40,350     1,303.0      85.5      00:03:32
 49021       6   4,035      24,210     1,311.7      86.1      00:03:24
 49333      10   4,035      40,350     1,320.3      86.7      00:03:16
 49640       6   4,035      24,210     1,327.8      87.2      00:03:09
 49947       7   4,035      28,245     1,335.7      87.7      00:03:02
 50273      10   4,035      40,350     1,344.3      88.2      00:02:54
 50588       6   4,035      24,210     1,352.5      88.8      00:02:46
 50924       5   4,035      20,175     1,361.7      89.4      00:02:37
 51273      10   4,035      40,350     1,371.1      90.0      00:02:28
 51606       4   4,035      16,140     1,380.3      90.6      00:02:19
 51962       5   4,035      20,175     1,390.3      91.3      00:02:10
 52294       6   4,035      24,210     1,399.9      91.9      00:02:00
 52712       5   4,035      20,175     1,412.2      92.7      00:01:48
 53146       9   4,035      36,315     1,424.6      93.5      00:01:36
 53618       7   4,035      28,245     1,437.9      94.4      00:01:23
 53946       9   4,035      36,315     1,446.7      95.0      00:01:14
 54278       7   4,035      28,245     1,455.7      95.5      00:01:06
 54611       6   4,035      24,210     1,464.1      96.1      00:00:58
 54968       8   4,035      32,280     1,473.6      96.7      00:00:49
 55314       6   4,035      24,210     1,482.7      97.3      00:00:40
 55602       8   4,035      32,280     1,489.8      97.8      00:00:33
 55885      10   4,035      40,350     1,497.6      98.3      00:00:25
 56189       8   4,035      32,280     1,505.9      98.8      00:00:17
 56502       8   4,035      32,280     1,514.8      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1497.089
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_nor
    > andomterm.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_norandomte
> rm.csv saved

. 
. cap log close

. 
end of do-file
