
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A100_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   494      10   4,135      41,350        11.7       0.8      00:22:04
  1021       9   4,135      37,215        25.1       1.6      00:20:26
  1547       1   4,135       4,135        39.4       2.5      00:19:20
  2104       7   4,135      28,945        54.1       3.5      00:18:36
  2648       7   4,135      28,945        68.4       4.4      00:18:12
  3168      10   4,135      41,350        82.5       5.3      00:17:57
  3640       7   4,135      28,945        95.5       6.1      00:17:56
  4089       8   4,135      33,080       107.3       6.9      00:18:05
  4462       9   4,135      37,215       116.8       7.5      00:18:34
  4800       8   4,135      33,080       126.2       8.1      00:18:59
  5165       8   4,135      33,080       135.9       8.7      00:19:15
  5509       3   4,135      12,405       144.8       9.3      00:19:35
  5809       7   4,135      28,945       152.5       9.8      00:20:03
  6142       3   4,135      12,405       161.4      10.3      00:20:15
  6534       4   4,135      16,540       171.7      11.0      00:20:16
  6888       6   4,135      24,810       180.9      11.6      00:20:22
  7323       8   4,135      33,080       192.3      12.3      00:20:12
  7764       9   4,135      37,215       204.3      13.1      00:19:57
  8187       6   4,135      24,810       216.4      13.9      00:19:42
  8563       7   4,135      28,945       227.1      14.5      00:19:36
  8923       4   4,135      16,540       237.2      15.2      00:19:34
  9271       4   4,135      16,540       247.0      15.8      00:19:32
  9579       7   4,135      28,945       255.8      16.4      00:19:35
  9891      10   4,135      41,350       264.6      16.9      00:19:38
 10235       6   4,135      24,810       273.3      17.5      00:19:39
 10531      10   4,135      41,350       281.2      18.0      00:19:45
 10931      10   4,135      41,350       291.8      18.7      00:19:36
 11296       7   4,135      28,945       301.5      19.3      00:19:31
 11624       9   4,135      37,215       310.4      19.9      00:19:30
 11985       4   4,135      16,540       320.1      20.5      00:19:25
 12329       8   4,135      33,080       329.5      21.1      00:19:20
 12816       8   4,135      33,080       342.4      21.9      00:19:01
 13269       6   4,135      24,810       354.6      22.7      00:18:45
 13658       6   4,135      24,810       365.8      23.4      00:18:33
 13952       8   4,135      33,080       373.6      23.9      00:18:34
 14348       8   4,135      33,080       384.6      24.6      00:18:23
 14714       6   4,135      24,810       394.7      25.3      00:18:15
 15150      10   4,135      41,350       406.9      26.1      00:17:60
 15623       7   4,135      28,945       419.8      26.9      00:17:42
 16079       9   4,135      37,215       432.9      27.7      00:17:24
 16510       7   4,135      28,945       445.2      28.5      00:17:09
 16870       9   4,135      37,215       455.0      29.1      00:17:03
 17195       6   4,135      24,810       463.9      29.7      00:16:59
 17537      10   4,135      41,350       473.9      30.4      00:16:51
 17920       6   4,135      24,810       484.3      31.0      00:16:42
 18252       9   4,135      37,215       493.7      31.6      00:16:36
 18619       8   4,135      33,080       503.5      32.2      00:16:29
 19040       8   4,135      33,080       515.6      33.0      00:16:15
 19479       5   4,135      20,675       528.1      33.8      00:16:00
 19924       9   4,135      37,215       541.0      34.7      00:15:44
 20363      10   4,135      41,350       553.4      35.4      00:15:30
 20692      10   4,135      41,350       562.8      36.0      00:15:24
 20936       5   4,135      20,675       569.7      36.5      00:15:24
 21270       7   4,135      28,945       578.3      37.0      00:15:19
 21603       8   4,135      33,080       587.0      37.6      00:15:14
 21936       3   4,135      12,405       595.5      38.1      00:15:10
 22267       2   4,135       8,270       604.1      38.7      00:15:05
 22628       8   4,135      33,080       613.5      39.3      00:14:58
 22967       8   4,135      33,080       622.1      39.8      00:14:52
 23293       6   4,135      24,810       631.2      40.4      00:14:45
 23669       8   4,135      33,080       640.9      41.0      00:14:37
 24000       7   4,135      28,945       650.0      41.6      00:14:31
 24410       9   4,135      37,215       660.5      42.3      00:14:21
 24860       9   4,135      37,215       673.0      43.1      00:14:06
 25294       6   4,135      24,810       684.9      43.9      00:13:53
 25684       8   4,135      33,080       695.4      44.5      00:13:43
 26013       5   4,135      20,675       704.6      45.1      00:13:36
 26416       5   4,135      20,675       715.5      45.8      00:13:25
 26844      10   4,135      41,350       726.9      46.6      00:13:13
 27197       5   4,135      20,675       736.6      47.2      00:13:05
 27471      10   4,135      41,350       744.0      47.7      00:13:01
 27805       9   4,135      37,215       753.3      48.2      00:12:54
 28233       6   4,135      24,810       765.3      49.0      00:12:41
 28660       3   4,135      12,405       777.6      49.8      00:12:27
 28920       8   4,135      33,080       784.9      50.3      00:12:23
 29236       3   4,135      12,405       793.6      50.8      00:12:16
 29651       7   4,135      28,945       805.1      51.6      00:12:04
 29978       2   4,135       8,270       814.2      52.1      00:11:57
 30314      10   4,135      41,350       823.8      52.8      00:11:48
 30646       6   4,135      24,810       833.2      53.4      00:11:40
 31108       4   4,135      16,540       846.0      54.2      00:11:26
 31586       3   4,135      12,405       859.7      55.1      00:11:10
 32050       8   4,135      33,080       873.2      55.9      00:10:55
 32496       6   4,135      24,810       886.3      56.8      00:10:41
 32785       7   4,135      28,945       894.5      57.3      00:10:35
 33126       9   4,135      37,215       904.3      57.9      00:10:26
 33523       9   4,135      37,215       915.6      58.6      00:10:15
 33859       9   4,135      37,215       925.3      59.3      00:10:06
 34192       4   4,135      16,540       935.1      59.9      00:09:57
 34687      10   4,135      41,350       949.2      60.8      00:09:41
 35199       5   4,135      20,675       964.1      61.7      00:09:25
 35673       9   4,135      37,215       977.6      62.6      00:09:10
 36165      10   4,135      41,350       991.7      63.5      00:08:55
 36628       8   4,135      33,080     1,004.7      64.3      00:08:42
 36998      10   4,135      41,350     1,014.9      65.0      00:08:32
 37374       8   4,135      33,080     1,024.7      65.6      00:08:24
 37698       7   4,135      28,945     1,033.4      66.2      00:08:16
 38005       9   4,135      37,215     1,041.8      66.7      00:08:09
 38290       5   4,135      20,675     1,049.8      67.2      00:08:03
 38597       8   4,135      33,080     1,058.7      67.8      00:07:56
 38911       3   4,135      12,405     1,067.3      68.4      00:07:48
 39230       4   4,135      16,540     1,076.1      68.9      00:07:41
 39632       7   4,135      28,945     1,087.1      69.6      00:07:30
 40048       8   4,135      33,080     1,098.5      70.4      00:07:19
 40527       9   4,135      37,215     1,111.7      71.2      00:07:05
 40992       9   4,135      37,215     1,124.9      72.0      00:06:52
 41328       9   4,135      37,215     1,134.2      72.6      00:06:43
 41718       7   4,135      28,945     1,145.2      73.3      00:06:33
 42091       7   4,135      28,945     1,155.4      74.0      00:06:23
 42505      10   4,135      41,350     1,166.6      74.7      00:06:13
 42888       7   4,135      28,945     1,177.1      75.4      00:06:03
 43288       9   4,135      37,215     1,188.6      76.1      00:05:52
 43684       9   4,135      37,215     1,199.4      76.8      00:05:41
 44079       7   4,135      28,945     1,210.3      77.5      00:05:31
 44513       9   4,135      37,215     1,222.1      78.3      00:05:20
 44927       5   4,135      20,675     1,233.5      79.0      00:05:09
 45376       6   4,135      24,810     1,245.2      79.8      00:04:57
 45769       5   4,135      20,675     1,255.5      80.4      00:04:48
 46188       7   4,135      28,945     1,267.2      81.2      00:04:37
 46604       2   4,135       8,270     1,278.8      81.9      00:04:25
 47048       7   4,135      28,945     1,290.8      82.7      00:04:14
 47448       7   4,135      28,945     1,301.3      83.3      00:04:04
 47837       6   4,135      24,810     1,311.7      84.0      00:03:54
 48217       4   4,135      16,540     1,322.1      84.7      00:03:45
 48625       8   4,135      33,080     1,333.5      85.4      00:03:34
 49029       9   4,135      37,215     1,344.5      86.1      00:03:24
 49446       8   4,135      33,080     1,355.8      86.8      00:03:13
 49994       7   4,135      28,945     1,370.2      87.8      00:02:59
 50459       7   4,135      28,945     1,382.4      88.5      00:02:47
 50841       9   4,135      37,215     1,393.1      89.2      00:02:37
 51252       6   4,135      24,810     1,404.6      90.0      00:02:26
 51670       9   4,135      37,215     1,416.5      90.7      00:02:15
 52082      10   4,135      41,350     1,428.2      91.5      00:02:04
 52461       8   4,135      33,080     1,439.6      92.2      00:01:54
 52845       7   4,135      28,945     1,451.2      92.9      00:01:43
 53230       6   4,135      24,810     1,462.4      93.7      00:01:32
 53730      10   4,135      41,350     1,476.6      94.6      00:01:19
 54078       6   4,135      24,810     1,486.2      95.2      00:01:10
 54443       5   4,135      20,675     1,496.1      95.8      00:01:01
 54860       4   4,135      16,540     1,507.1      96.5      00:00:50
 55285       6   4,135      24,810     1,518.7      97.3      00:00:40
 55664      10   4,135      41,350     1,528.5      97.9      00:00:31
 56033       5   4,135      20,675     1,538.9      98.6      00:00:21
 56444       5   4,135      20,675     1,550.6      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1456.097
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
