
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A400_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   212       8   4,435      35,480         5.4       0.3      00:51:46
   440       7   4,435      31,045        11.2       0.7      00:49:30
   676       8   4,435      35,480        17.6       1.1      00:47:09
   899       2   4,435       8,870        23.5       1.4      00:46:47
  1113       9   4,435      39,915        29.7       1.8      00:46:10
  1317       6   4,435      26,610        35.7       2.1      00:45:58
  1538       8   4,435      35,480        42.2       2.5      00:45:12
  1760       6   4,435      26,610        48.6       2.9      00:44:39
  1999       9   4,435      39,915        55.2       3.3      00:44:05
  2261       2   4,435       8,870        62.7       3.7      00:42:54
  2515       7   4,435      31,045        69.7       4.2      00:42:17
  2775       9   4,435      39,915        77.3       4.6      00:41:21
  3012       9   4,435      39,915        83.9       5.0      00:41:07
  3247       9   4,435      39,915        91.1       5.4      00:40:35
  3468       9   4,435      39,915        97.7       5.8      00:40:23
  3686       7   4,435      31,045       104.0       6.2      00:40:19
  3883       6   4,435      26,610       109.7       6.6      00:40:28
  4064       7   4,435      31,045       114.6       6.8      00:40:54
  4237       9   4,435      39,915       119.3       7.1      00:41:20
  4415       9   4,435      39,915       124.1       7.4      00:41:41
  4589       9   4,435      39,915       129.2       7.7      00:41:55
  4759       6   4,435      26,610       134.3       8.0      00:42:07
  4940       9   4,435      39,915       139.5       8.3      00:42:15
  5113       8   4,435      35,480       144.4       8.6      00:42:29
  5294      10   4,435      44,350       149.6       8.9      00:42:33
  5466       3   4,435      13,305       154.4       9.2      00:42:44
  5650       6   4,435      26,610       159.3       9.5      00:42:53
  5849      10   4,435      44,350       164.8       9.8      00:42:50
  6037       3   4,435      13,305       170.4      10.2      00:42:45
  6234       5   4,435      22,175       176.0      10.5      00:42:40
  6426       3   4,435      13,305       181.2      10.8      00:42:39
  6622       8   4,435      35,480       186.7      11.2      00:42:36
  6805       8   4,435      35,480       191.9      11.5      00:42:35
  6976      10   4,435      44,350       196.7      11.8      00:42:41
  7173       5   4,435      22,175       202.1      12.1      00:42:36
  7358       4   4,435      17,740       207.6      12.4      00:42:30
  7571       4   4,435      17,740       213.7      12.8      00:42:15
  7748       7   4,435      31,045       218.8      13.1      00:42:14
  7943       9   4,435      39,915       224.8      13.4      00:42:00
  8141       8   4,435      35,480       230.9      13.8      00:41:46
  8337       9   4,435      39,915       236.9      14.2      00:41:34
  8533       7   4,435      31,045       242.9      14.5      00:41:21
  8723       9   4,435      39,915       248.5      14.8      00:41:13
  8906       6   4,435      26,610       254.1      15.2      00:41:05
  9084       7   4,435      31,045       259.4      15.5      00:41:00
  9229       9   4,435      39,915       263.9      15.8      00:41:04
  9358       8   4,435      35,480       267.7      16.0      00:41:15
  9489       9   4,435      39,915       271.7      16.2      00:41:24
  9622       5   4,435      22,175       275.9      16.5      00:41:29
  9768       6   4,435      26,610       280.4      16.8      00:41:31
  9926       8   4,435      35,480       285.0      17.0      00:41:32
 10070       3   4,435      13,305       289.0      17.3      00:41:38
 10210       5   4,435      22,175       292.6      17.5      00:41:49
 10347       7   4,435      31,045       296.5      17.7      00:41:56
 10468      10   4,435      44,350       300.1      17.9      00:42:06
 10630       6   4,435      26,610       304.4      18.2      00:42:06
 10788      10   4,435      44,350       309.0      18.5      00:42:06
 10909      10   4,435      44,350       312.5      18.7      00:42:14
 11081       8   4,435      35,480       317.4      19.0      00:42:09
 11203      10   4,435      44,350       321.0      19.2      00:42:16
 11325       7   4,435      31,045       324.5      19.4      00:42:24
 11465       6   4,435      26,610       328.6      19.6      00:42:26
 11613       7   4,435      31,045       332.8      19.9      00:42:27
 11771      10   4,435      44,350       337.4      20.2      00:42:23
 11913       7   4,435      31,045       341.5      20.4      00:42:24
 12045       9   4,435      39,915       345.4      20.6      00:42:26
 12174       8   4,435      35,480       349.3      20.9      00:42:29
 12338      10   4,435      44,350       353.9      21.2      00:42:24
 12588       8   4,435      35,480       361.1      21.6      00:41:56
 12812       9   4,435      39,915       367.3      22.0      00:41:38
 13005       8   4,435      35,480       372.9      22.3      00:41:25
 13244       6   4,435      26,610       379.8      22.7      00:41:01
 13454       6   4,435      26,610       386.2      23.1      00:40:41
 13604      10   4,435      44,350       391.0      23.4      00:40:36
 13749       5   4,435      22,175       395.1      23.6      00:40:36
 13865       7   4,435      31,045       398.5      23.8      00:40:40
 14001       9   4,435      39,915       402.2      24.0      00:40:42
 14138      10   4,435      44,350       406.4      24.3      00:40:41
 14282       8   4,435      35,480       410.7      24.5      00:40:37
 14444      10   4,435      44,350       415.6      24.8      00:40:30
 14618       9   4,435      39,915       420.7      25.1      00:40:20
 14791       7   4,435      31,045       425.8      25.4      00:40:11
 14999       6   4,435      26,610       432.0      25.8      00:39:53
 15209       7   4,435      31,045       438.5      26.2      00:39:34
 15436       7   4,435      31,045       445.1      26.6      00:39:14
 15651       7   4,435      31,045       451.3      27.0      00:38:56
 15857       9   4,435      39,915       457.6      27.3      00:38:39
 16056       7   4,435      31,045       463.9      27.7      00:38:22
 16283       6   4,435      26,610       470.8      28.1      00:38:01
 16477       2   4,435       8,870       476.8      28.5      00:37:47
 16604       8   4,435      35,480       480.3      28.7      00:37:49
 16718       9   4,435      39,915       483.8      28.9      00:37:51
 16865       4   4,435      17,740       488.0      29.2      00:37:48
 17001       8   4,435      35,480       492.2      29.4      00:37:44
 17143       7   4,435      31,045       496.2      29.7      00:37:42
 17266      10   4,435      44,350       500.0      29.9      00:37:42
 17403       7   4,435      31,045       504.2      30.1      00:37:38
 17542       8   4,435      35,480       508.7      30.4      00:37:33
 17656      10   4,435      44,350       512.1      30.6      00:37:34
 17822       7   4,435      31,045       516.8      30.9      00:37:27
 17991       5   4,435      22,175       521.8      31.2      00:37:18
 18220       4   4,435      17,740       528.8      31.6      00:36:56
 18459       6   4,435      26,610       535.4      32.0      00:36:37
 18577       6   4,435      26,610       539.0      32.2      00:36:37
 18698       6   4,435      26,610       542.8      32.4      00:36:35
 18858       6   4,435      26,610       547.6      32.7      00:36:28
 19017       9   4,435      39,915       552.6      33.0      00:36:18
 19189       6   4,435      26,610       557.8      33.3      00:36:08
 19397       9   4,435      39,915       564.1      33.7      00:35:51
 19632       9   4,435      39,915       571.4      34.1      00:35:29
 19863       9   4,435      39,915       578.6      34.6      00:35:08
 20067       5   4,435      22,175       585.2      35.0      00:34:51
 20253      10   4,435      44,350       590.6      35.3      00:34:40
 20454       3   4,435      13,305       596.6      35.7      00:34:25
 20544       8   4,435      35,480       599.4      35.8      00:34:28
 20642       9   4,435      39,915       602.4      36.0      00:34:30
 20745       9   4,435      39,915       605.5      36.2      00:34:31
 20853       9   4,435      39,915       608.8      36.4      00:34:31
 20964       4   4,435      17,740       612.1      36.6      00:34:31
 21099       6   4,435      26,610       615.9      36.8      00:34:28
 21224       6   4,435      26,610       619.2      37.0      00:34:28
 21377       4   4,435      17,740       623.4      37.3      00:34:23
 21497       9   4,435      39,915       626.9      37.5      00:34:21
 21649       8   4,435      35,480       631.1      37.7      00:34:16
 21784       7   4,435      31,045       634.7      37.9      00:34:14
 21898      10   4,435      44,350       638.0      38.1      00:34:13
 22041       7   4,435      31,045       642.1      38.4      00:34:08
 22179       9   4,435      39,915       645.7      38.6      00:34:05
 22339       9   4,435      39,915       650.1      38.8      00:33:59
 22430       6   4,435      26,610       652.6      39.0      00:34:01
 22597       9   4,435      39,915       657.4      39.3      00:33:52
 22745       7   4,435      31,045       661.3      39.5      00:33:48
 22945       6   4,435      26,610       666.9      39.9      00:33:35
 23151       4   4,435      17,740       673.0      40.2      00:33:20
 23353       6   4,435      26,610       679.0      40.6      00:33:05
 23547       7   4,435      31,045       684.2      40.9      00:32:54
 23714       9   4,435      39,915       689.0      41.2      00:32:45
 23872       8   4,435      35,480       693.8      41.5      00:32:36
 24034       7   4,435      31,045       698.4      41.7      00:32:28
 24220       4   4,435      17,740       703.6      42.0      00:32:17
 24415      10   4,435      44,350       708.9      42.4      00:32:06
 24585       6   4,435      26,610       714.1      42.7      00:31:55
 24731       5   4,435      22,175       718.4      42.9      00:31:48
 24917       7   4,435      31,045       723.5      43.2      00:31:38
 25093       8   4,435      35,480       729.0      43.6      00:31:26
 25305       7   4,435      31,045       735.1      43.9      00:31:11
 25502       7   4,435      31,045       741.0      44.3      00:30:57
 25645      10   4,435      44,350       744.9      44.5      00:30:52
 25752       5   4,435      22,175       748.3      44.7      00:30:49
 25879       6   4,435      26,610       752.1      44.9      00:30:44
 26022       7   4,435      31,045       756.2      45.2      00:30:38
 26131       2   4,435       8,870       759.4      45.4      00:30:36
 26266       9   4,435      39,915       763.6      45.6      00:30:30
 26450       8   4,435      35,480       768.7      45.9      00:30:19
 26624       8   4,435      35,480       773.6      46.2      00:30:10
 26776       7   4,435      31,045       778.1      46.5      00:30:02
 26954       9   4,435      39,915       783.3      46.8      00:29:51
 27095      10   4,435      44,350       787.4      47.1      00:29:45
 27217       8   4,435      35,480       790.9      47.3      00:29:41
 27326       8   4,435      35,480       794.1      47.5      00:29:38
 27444       6   4,435      26,610       797.6      47.7      00:29:35
 27562       5   4,435      22,175       801.1      47.9      00:29:31
 27721       7   4,435      31,045       805.8      48.2      00:29:22
 27881       5   4,435      22,175       810.7      48.4      00:29:12
 28063       5   4,435      22,175       816.1      48.8      00:29:00
 28199       8   4,435      35,480       820.1      49.0      00:28:54
 28406       9   4,435      39,915       826.5      49.4      00:28:38
 28548      10   4,435      44,350       831.0      49.7      00:28:30
 28642       5   4,435      22,175       833.8      49.8      00:28:28
 28777       6   4,435      26,610       837.9      50.1      00:28:22
 28906       9   4,435      39,915       841.9      50.3      00:28:15
 29044      10   4,435      44,350       846.0      50.6      00:28:09
 29213       8   4,435      35,480       850.8      50.8      00:27:59
 29367       6   4,435      26,610       855.6      51.1      00:27:50
 29530       8   4,435      35,480       860.4      51.4      00:27:40
 29685       9   4,435      39,915       864.9      51.7      00:27:31
 29796       9   4,435      39,915       868.3      51.9      00:27:27
 29912      10   4,435      44,350       871.7      52.1      00:27:23
 30029       8   4,435      35,480       875.3      52.3      00:27:19
 30120       7   4,435      31,045       878.0      52.5      00:27:17
 30239       6   4,435      26,610       881.6      52.7      00:27:12
 30372       6   4,435      26,610       885.5      52.9      00:27:06
 30513      10   4,435      44,350       890.0      53.2      00:26:57
 30681      10   4,435      44,350       895.0      53.5      00:26:47
 30883       4   4,435      17,740       901.2      53.9      00:26:31
 31067       6   4,435      26,610       906.5      54.2      00:26:20
 31235       9   4,435      39,915       911.7      54.5      00:26:08
 31415       8   4,435      35,480       917.3      54.8      00:25:56
 31598      10   4,435      44,350       922.8      55.1      00:25:43
 31784       6   4,435      26,610       928.6      55.5      00:25:30
 31959       5   4,435      22,175       934.2      55.8      00:25:17
 32117       8   4,435      35,480       939.1      56.1      00:25:07
 32307      10   4,435      44,350       945.1      56.5      00:24:53
 32467       8   4,435      35,480       950.2      56.8      00:24:42
 32546       7   4,435      31,045       952.5      56.9      00:24:42
 32633       6   4,435      26,610       955.1      57.1      00:24:40
 32718       9   4,435      39,915       957.7      57.2      00:24:38
 32822      10   4,435      44,350       960.8      57.4      00:24:34
 32916       8   4,435      35,480       963.8      57.6      00:24:31
 33048       6   4,435      26,610       967.9      57.8      00:24:24
 33152       9   4,435      39,915       971.1      58.0      00:24:20
 33291       8   4,435      35,480       975.3      58.3      00:24:12
 33401       6   4,435      26,610       978.7      58.5      00:24:07
 33545       6   4,435      26,610       983.2      58.8      00:23:58
 33650       5   4,435      22,175       986.5      58.9      00:23:53
 33772       8   4,435      35,480       990.2      59.2      00:23:47
 33895       5   4,435      22,175       993.9      59.4      00:23:41
 34016       5   4,435      22,175       997.7      59.6      00:23:34
 34156       8   4,435      35,480     1,002.3      59.9      00:23:25
 34316       8   4,435      35,480     1,007.2      60.2      00:23:14
 34503       5   4,435      22,175     1,012.9      60.5      00:23:01
 34659       6   4,435      26,610     1,017.6      60.8      00:22:52
 34841       8   4,435      35,480     1,023.5      61.2      00:22:38
 35039       9   4,435      39,915     1,029.4      61.5      00:22:24
 35233       6   4,435      26,610     1,035.5      61.9      00:22:10
 35450       7   4,435      31,045     1,042.2      62.3      00:21:53
 35670       8   4,435      35,480     1,048.8      62.7      00:21:37
 35874       6   4,435      26,610     1,055.0      63.0      00:21:23
 36064      10   4,435      44,350     1,060.8      63.4      00:21:10
 36228       4   4,435      17,740     1,065.9      63.7      00:20:59
 36426       5   4,435      22,175     1,072.0      64.1      00:20:45
 36579       4   4,435      17,740     1,076.5      64.3      00:20:36
 36733       8   4,435      35,480     1,081.0      64.6      00:20:27
 36867      10   4,435      44,350     1,085.0      64.8      00:20:19
 36983       8   4,435      35,480     1,088.4      65.0      00:20:14
 37051       7   4,435      31,045     1,090.4      65.2      00:20:13
 37183       6   4,435      26,610     1,094.0      65.4      00:20:07
 37340       5   4,435      22,175     1,098.4      65.6      00:19:58
 37492       9   4,435      39,915     1,102.7      65.9      00:19:50
 37639       4   4,435      17,740     1,107.1      66.2      00:19:41
 37812       8   4,435      35,480     1,112.0      66.5      00:19:31
 37979       6   4,435      26,610     1,116.9      66.7      00:19:20
 38142       8   4,435      35,480     1,122.0      67.0      00:19:10
 38286       8   4,435      35,480     1,126.3      67.3      00:19:01
 38433       7   4,435      31,045     1,130.9      67.6      00:18:52
 38629      10   4,435      44,350     1,136.8      67.9      00:18:38
 38831       4   4,435      17,740     1,142.8      68.3      00:18:25
 38987       8   4,435      35,480     1,147.5      68.6      00:18:15
 39096       6   4,435      26,610     1,150.7      68.8      00:18:10
 39215       9   4,435      39,915     1,154.1      69.0      00:18:04
 39347       6   4,435      26,610     1,158.0      69.2      00:17:57
 39504       4   4,435      17,740     1,162.5      69.5      00:17:48
 39638      10   4,435      44,350     1,166.4      69.7      00:17:40
 39800       8   4,435      35,480     1,171.2      70.0      00:17:30
 40001      10   4,435      44,350     1,177.1      70.3      00:17:17
 40226       3   4,435      13,305     1,183.6      70.7      00:17:02
 40457       8   4,435      35,480     1,190.6      71.1      00:16:45
 40696       9   4,435      39,915     1,197.9      71.6      00:16:28
 40885       6   4,435      26,610     1,203.5      71.9      00:16:16
 40980       7   4,435      31,045     1,206.6      72.1      00:16:11
 41088       7   4,435      31,045     1,209.8      72.3      00:16:06
 41227       6   4,435      26,610     1,214.0      72.5      00:15:57
 41401      10   4,435      44,350     1,219.1      72.8      00:15:46
 41502       6   4,435      26,610     1,222.1      73.0      00:15:42
 41596       9   4,435      39,915     1,225.0      73.2      00:15:37
 41722       9   4,435      39,915     1,228.7      73.4      00:15:30
 41858      10   4,435      44,350     1,232.9      73.7      00:15:22
 41977       5   4,435      22,175     1,236.4      73.9      00:15:15
 42126       8   4,435      35,480     1,240.5      74.1      00:15:07
 42261       5   4,435      22,175     1,244.3      74.4      00:15:00
 42365      10   4,435      44,350     1,247.4      74.5      00:14:55
 42487       7   4,435      31,045     1,251.1      74.8      00:14:48
 42608       8   4,435      35,480     1,254.5      75.0      00:14:42
 42720       9   4,435      39,915     1,257.8      75.2      00:14:36
 42827       9   4,435      39,915     1,261.1      75.4      00:14:30
 42943       8   4,435      35,480     1,264.4      75.6      00:14:24
 43051       8   4,435      35,480     1,267.9      75.8      00:14:17
 43178       7   4,435      31,045     1,271.9      76.0      00:14:09
 43293       9   4,435      39,915     1,275.3      76.2      00:14:03
 43413       8   4,435      35,480     1,279.1      76.4      00:13:56
 43580       8   4,435      35,480     1,283.8      76.7      00:13:46
 43758      10   4,435      44,350     1,288.9      77.0      00:13:35
 43979       8   4,435      35,480     1,295.5      77.4      00:13:19
 44161       7   4,435      31,045     1,300.9      77.7      00:13:08
 44311       2   4,435       8,870     1,305.1      78.0      00:12:59
 44479      10   4,435      44,350     1,310.0      78.3      00:12:49
 44618       8   4,435      35,480     1,314.1      78.5      00:12:40
 44775      10   4,435      44,350     1,318.7      78.8      00:12:31
 44953       6   4,435      26,610     1,324.1      79.1      00:12:19
 45079       7   4,435      31,045     1,327.7      79.3      00:12:12
 45263       8   4,435      35,480     1,332.8      79.6      00:12:01
 45364       5   4,435      22,175     1,335.5      79.8      00:11:56
 45481       5   4,435      22,175     1,338.9      80.0      00:11:50
 45624       7   4,435      31,045     1,342.8      80.2      00:11:42
 45741       8   4,435      35,480     1,346.1      80.4      00:11:36
 45871       5   4,435      22,175     1,349.8      80.7      00:11:28
 46005       9   4,435      39,915     1,353.9      80.9      00:11:20
 46152       6   4,435      26,610     1,358.3      81.2      00:11:11
 46289       9   4,435      39,915     1,362.6      81.4      00:11:02
 46426       5   4,435      22,175     1,366.4      81.7      00:10:54
 46563      10   4,435      44,350     1,370.7      81.9      00:10:45
 46764       9   4,435      39,915     1,376.7      82.3      00:10:32
 46923       2   4,435       8,870     1,381.3      82.5      00:10:22
 47050       6   4,435      26,610     1,384.7      82.7      00:10:15
 47192       7   4,435      31,045     1,388.6      83.0      00:10:07
 47310      10   4,435      44,350     1,392.0      83.2      00:10:01
 47458       6   4,435      26,610     1,396.1      83.4      00:09:52
 47585       8   4,435      35,480     1,399.7      83.6      00:09:45
 47697      10   4,435      44,350     1,403.1      83.8      00:09:38
 47832       8   4,435      35,480     1,406.9      84.1      00:09:30
 47934       5   4,435      22,175     1,410.1      84.3      00:09:24
 48031       7   4,435      31,045     1,412.9      84.4      00:09:19
 48148       7   4,435      31,045     1,416.3      84.6      00:09:12
 48267       7   4,435      31,045     1,419.9      84.8      00:09:05
 48406       8   4,435      35,480     1,424.0      85.1      00:08:56
 48539       8   4,435      35,480     1,428.0      85.3      00:08:48
 48679       7   4,435      31,045     1,432.1      85.6      00:08:39
 48831       5   4,435      22,175     1,436.5      85.8      00:08:30
 48965       9   4,435      39,915     1,440.4      86.1      00:08:22
 49104       5   4,435      22,175     1,444.6      86.3      00:08:13
 49236       6   4,435      26,610     1,448.6      86.6      00:08:05
 49376       8   4,435      35,480     1,452.5      86.8      00:07:57
 49501       8   4,435      35,480     1,456.0      87.0      00:07:49
 49643       6   4,435      26,610     1,459.7      87.2      00:07:41
 49765       6   4,435      26,610     1,463.2      87.4      00:07:34
 49895       9   4,435      39,915     1,466.9      87.7      00:07:27
 50020      10   4,435      44,350     1,470.6      87.9      00:07:19
 50157       7   4,435      31,045     1,474.6      88.1      00:07:11
 50288       8   4,435      35,480     1,478.2      88.3      00:07:03
 50404       9   4,435      39,915     1,481.4      88.5      00:06:57
 50514       8   4,435      35,480     1,484.7      88.7      00:06:50
 50637       6   4,435      26,610     1,488.2      88.9      00:06:42
 50766       6   4,435      26,610     1,492.3      89.2      00:06:34
 50877       7   4,435      31,045     1,495.6      89.4      00:06:27
 50977       8   4,435      35,480     1,498.8      89.6      00:06:20
 51133       8   4,435      35,480     1,503.4      89.8      00:06:10
 51310      10   4,435      44,350     1,508.6      90.2      00:05:59
 51512       7   4,435      31,045     1,514.8      90.5      00:05:45
 51724       8   4,435      35,480     1,521.4      90.9      00:05:30
 51912       4   4,435      17,740     1,527.1      91.3      00:05:18
 52107       8   4,435      35,480     1,533.3      91.6      00:05:04
 52301       7   4,435      31,045     1,539.4      92.0      00:04:50
 52503      10   4,435      44,350     1,546.0      92.4      00:04:36
 52684       7   4,435      31,045     1,551.9      92.7      00:04:23
 52872       7   4,435      31,045     1,557.9      93.1      00:04:09
 53106      10   4,435      44,350     1,565.1      93.5      00:03:54
 53303       5   4,435      22,175     1,571.1      93.9      00:03:40
 53535       9   4,435      39,915     1,578.3      94.3      00:03:25
 53705       7   4,435      31,045     1,583.4      94.6      00:03:13
 53806       8   4,435      35,480     1,586.5      94.8      00:03:07
 53929       7   4,435      31,045     1,590.0      95.0      00:02:60
 54011       3   4,435      13,305     1,592.4      95.2      00:02:55
 54119       8   4,435      35,480     1,595.7      95.4      00:02:48
 54230       9   4,435      39,915     1,599.0      95.6      00:02:41
 54317       9   4,435      39,915     1,601.5      95.7      00:02:35
 54431       6   4,435      26,610     1,604.5      95.9      00:02:29
 54589      10   4,435      44,350     1,609.0      96.1      00:02:20
 54739      10   4,435      44,350     1,613.4      96.4      00:02:10
 54868       5   4,435      22,175     1,617.1      96.6      00:02:02
 54993       7   4,435      31,045     1,620.7      96.9      00:01:54
 55110       5   4,435      22,175     1,624.2      97.1      00:01:47
 55247       8   4,435      35,480     1,628.0      97.3      00:01:39
 55377       3   4,435      13,305     1,631.5      97.5      00:01:31
 55516       7   4,435      31,045     1,635.5      97.7      00:01:22
 55645      10   4,435      44,350     1,639.3      98.0      00:01:14
 55750       4   4,435      17,740     1,642.5      98.2      00:01:07
 55848       5   4,435      22,175     1,645.4      98.3      00:01:01
 55968       8   4,435      35,480     1,649.0      98.5      00:00:53
 56093       6   4,435      26,610     1,652.8      98.8      00:00:45
 56255      10   4,435      44,350     1,657.7      99.1      00:00:34
 56410       7   4,435      31,045     1,662.6      99.4      00:00:24
 56550       8   4,435      35,480     1,666.9      99.6      00:00:14
 56684       6   4,435      26,610     1,670.9      99.9      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 3668.293
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
