
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locations_total
> _fixR400.dta /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vacc
> inated/ca_blk_Dollar_dist_total_fixR400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Nov 2023, 20:52:13

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinate
> d/ca_Dollar_locations_total_fixR400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated
> /ca_blk_Dollar_dist_total_fixR400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   581       8   4,035      32,280        13.6       0.9      00:18:32
  1194       8   4,035      32,280        29.0       1.9      00:17:11
  1798       3   4,035      12,105        45.0       3.0      00:16:27
  2417       8   4,035      32,280        60.9       4.0      00:16:02
  3006       5   4,035      20,175        76.0       5.0      00:15:54
  3595      10   4,035      40,350        92.0       6.0      00:15:35
  4174       7   4,035      28,245       106.9       7.0      00:15:29
  4721       5   4,035      20,175       121.1       7.9      00:15:27
  5269       6   4,035      24,210       135.2       8.9      00:15:25
  5746       3   4,035      12,105       147.1       9.7      00:15:36
  6184       8   4,035      32,280       158.6      10.4      00:15:48
  6621      10   4,035      40,350       169.7      11.1      00:15:58
  7166      10   4,035      40,350       183.5      12.0      00:15:50
  7705      10   4,035      40,350       197.7      13.0      00:15:40
  8229       8   4,035      32,280       212.3      13.9      00:15:27
  8755       6   4,035      24,210       226.7      14.9      00:15:16
  9255       4   4,035      16,140       240.6      15.8      00:15:07
  9665       8   4,035      32,280       252.1      16.5      00:15:09
 10103       4   4,035      16,140       263.6      17.3      00:15:09
 10583       5   4,035      20,175       275.7      18.1      00:15:06
 11049      10   4,035      40,350       287.9      18.9      00:15:02
 11484       5   4,035      20,175       299.3      19.6      00:15:01
 11970       6   4,035      24,210       312.0      20.5      00:14:54
 12488       8   4,035      32,280       325.7      21.4      00:14:44
 13102       6   4,035      24,210       341.6      22.4      00:14:26
 13643       5   4,035      20,175       356.5      23.4      00:14:12
 14098       8   4,035      32,280       368.4      24.2      00:14:08
 14651       7   4,035      28,245       383.5      25.2      00:13:53
 15220       7   4,035      28,245       399.1      26.2      00:13:38
 15818       8   4,035      32,280       415.1      27.2      00:13:22
 16385      10   4,035      40,350       431.0      28.3      00:13:07
 16870       9   4,035      36,315       444.0      29.1      00:12:59
 17348       6   4,035      24,210       457.0      30.0      00:12:51
 17855       7   4,035      28,245       470.8      30.9      00:12:41
 18286       5   4,035      20,175       482.6      31.7      00:12:36
 18703       7   4,035      28,245       493.7      32.4      00:12:32
 19166       7   4,035      28,245       506.7      33.3      00:12:23
 19677       6   4,035      24,210       520.9      34.2      00:12:12
 20254       2   4,035       8,070       537.2      35.3      00:11:57
 20733       4   4,035      16,140       550.3      36.1      00:11:48
 21187       1   4,035       4,035       562.4      36.9      00:11:42
 21653       4   4,035      16,140       574.0      37.7      00:11:36
 22108       5   4,035      20,175       585.4      38.4      00:11:30
 22567       2   4,035       8,070       597.0      39.2      00:11:24
 23021       8   4,035      32,280       608.5      39.9      00:11:18
 23467       9   4,035      36,315       620.4      40.7      00:11:11
 23908       8   4,035      32,280       632.0      41.5      00:11:04
 24408       3   4,035      12,105       644.5      42.3      00:10:56
 24963       8   4,035      32,280       659.3      43.3      00:10:43
 25464       7   4,035      28,245       672.9      44.2      00:10:33
 25894       9   4,035      36,315       684.4      44.9      00:10:26
 26367       8   4,035      32,280       697.0      45.8      00:10:17
 26910       9   4,035      36,315       711.2      46.7      00:10:06
 27358       7   4,035      28,245       723.0      47.5      00:09:59
 27787       7   4,035      28,245       734.6      48.2      00:09:51
 28268      10   4,035      40,350       747.7      49.1      00:09:42
 28735       9   4,035      36,315       760.8      49.9      00:09:32
 29194       3   4,035      12,105       773.4      50.8      00:09:23
 29699       7   4,035      28,245       786.9      51.6      00:09:13
 30174       9   4,035      36,315       800.0      52.5      00:09:03
 30615       9   4,035      36,315       812.2      53.3      00:08:55
 31204       6   4,035      24,210       828.2      54.4      00:08:41
 31793       5   4,035      20,175       844.8      55.4      00:08:27
 32351       8   4,035      32,280       860.7      56.5      00:08:13
 32835       3   4,035      12,105       874.3      57.4      00:08:03
 33177       5   4,035      20,175       883.9      58.0      00:07:58
 33629       8   4,035      32,280       896.5      58.8      00:07:49
 34090       8   4,035      32,280       909.5      59.7      00:07:40
 34624       1   4,035       4,035       924.5      60.7      00:07:28
 35210       6   4,035      24,210       941.1      61.8      00:07:14
 35797       7   4,035      28,245       957.3      62.8      00:07:00
 36385       4   4,035      16,140       973.8      63.9      00:06:47
 36894       8   4,035      32,280       987.6      64.8      00:06:37
 37363       3   4,035      12,105       999.6      65.6      00:06:28
 37805       3   4,035      12,105     1,011.2      66.4      00:06:21
 38232      10   4,035      40,350     1,022.9      67.1      00:06:12
 38666       5   4,035      20,175     1,034.9      67.9      00:06:04
 39141       8   4,035      32,280     1,047.8      68.8      00:05:55
 39750       6   4,035      24,210     1,063.8      69.8      00:05:42
 40364       7   4,035      28,245     1,080.2      70.9      00:05:29
 40959      10   4,035      40,350     1,096.8      72.0      00:05:16
 41369       8   4,035      32,280     1,107.9      72.7      00:05:08
 41796       6   4,035      24,210     1,119.6      73.5      00:04:60
 42237      10   4,035      40,350     1,131.2      74.2      00:04:52
 42698       5   4,035      20,175     1,143.4      75.0      00:04:43
 43127       8   4,035      32,280     1,155.3      75.8      00:04:34
 43558       9   4,035      36,315     1,167.1      76.6      00:04:26
 44003      10   4,035      40,350     1,179.0      77.4      00:04:17
 44473       4   4,035      16,140     1,191.3      78.2      00:04:09
 44930       9   4,035      36,315     1,203.7      79.0      00:03:59
 45444       9   4,035      36,315     1,216.9      79.9      00:03:50
 45889      10   4,035      40,350     1,228.3      80.6      00:03:41
 46344       9   4,035      36,315     1,240.9      81.4      00:03:32
 46879      10   4,035      40,350     1,255.4      82.4      00:03:21
 47287       7   4,035      28,245     1,265.6      83.1      00:03:14
 47773       8   4,035      32,280     1,278.3      83.9      00:03:04
 48301       9   4,035      36,315     1,292.5      84.8      00:02:54
 48812       8   4,035      32,280     1,306.2      85.7      00:02:43
 49388      10   4,035      40,350     1,321.6      86.7      00:02:31
 49832       9   4,035      36,315     1,332.7      87.5      00:02:23
 50254       9   4,035      36,315     1,343.8      88.2      00:02:15
 50735       7   4,035      28,245     1,356.4      89.0      00:02:06
 51169       2   4,035       8,070     1,368.4      89.8      00:01:57
 51632       9   4,035      36,315     1,381.0      90.6      00:01:47
 52084       6   4,035      24,210     1,393.8      91.5      00:01:38
 52511      10   4,035      40,350     1,406.2      92.3      00:01:29
 52927       5   4,035      20,175     1,418.5      93.1      00:01:19
 53399       6   4,035      24,210     1,431.6      94.0      00:01:09
 53875      10   4,035      40,350     1,444.8      94.8      00:00:59
 54352       6   4,035      24,210     1,457.7      95.7      00:00:50
 54867       7   4,035      28,245     1,470.8      96.5      00:00:40
 55308       8   4,035      32,280     1,482.5      97.3      00:00:31
 55748      10   4,035      40,350     1,493.8      98.0      00:00:23
 56183       5   4,035      20,175     1,505.7      98.8      00:00:14
 56638      10   4,035      40,350     1,518.5      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1159.494
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL/M5_K10000_4q/Dollar/vaccinated/ca_
> blk_Dollar_dist_total_fixR400.csv saved

. 
. cap log close

. 
end of do-file
