
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A400.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   297       3   4,435      13,305         7.6       0.5      00:36:51
   667      10   4,435      44,350        17.3       1.0      00:31:58
  1054       6   4,435      26,610        28.1       1.7      00:29:23
  1433       8   4,435      35,480        39.2       2.3      00:27:53
  1745       9   4,435      39,915        48.2       2.9      00:28:10
  2018       8   4,435      35,480        55.7       3.3      00:29:07
  2334       7   4,435      31,045        64.7       3.9      00:29:04
  2660       8   4,435      35,480        73.9       4.4      00:28:55
  3047       9   4,435      39,915        84.9       5.1      00:28:06
  3438       8   4,435      35,480        96.8       5.8      00:27:11
  3800       8   4,435      35,480       107.3       6.4      00:26:48
  4100       6   4,435      26,610       115.5       6.9      00:27:00
  4355       3   4,435      13,305       122.4       7.3      00:27:30
  4577       8   4,435      35,480       128.9       7.7      00:28:00
  4781       6   4,435      26,610       135.0       8.1      00:28:32
  5019       3   4,435      13,305       141.8       8.5      00:28:51
  5285       6   4,435      26,610       149.3       8.9      00:28:58
  5601      10   4,435      44,350       158.0       9.4      00:28:49
  5854       4   4,435      17,740       165.0       9.9      00:28:60
  6087       6   4,435      26,610       171.8      10.3      00:29:10
  6317       6   4,435      26,610       178.2      10.7      00:29:24
  6547       9   4,435      39,915       184.6      11.0      00:29:36
  6800       8   4,435      35,480       191.8      11.5      00:29:40
  7090       6   4,435      26,610       199.9      11.9      00:29:31
  7414       6   4,435      26,610       209.2      12.5      00:29:13
  7718      10   4,435      44,350       217.9      13.0      00:28:59
  7992      10   4,435      44,350       226.3      13.5      00:28:49
  8279       9   4,435      39,915       235.0      14.0      00:28:37
  8573       2   4,435       8,870       244.0      14.6      00:28:22
  8890       5   4,435      22,175       253.5      15.2      00:28:03
  9216       8   4,435      35,480       263.5      15.7      00:27:42
  9489       9   4,435      39,915       271.7      16.2      00:27:34
  9695       9   4,435      39,915       278.2      16.6      00:27:38
  9871      10   4,435      44,350       283.4      16.9      00:27:51
 10037       5   4,435      22,175       288.1      17.2      00:28:06
 10234       2   4,435       8,870       293.3      17.5      00:28:17
 10409       9   4,435      39,915       298.3      17.8      00:28:29
 10635      10   4,435      44,350       304.6      18.2      00:28:31
 10880       6   4,435      26,610       311.7      18.6      00:28:27
 11137       9   4,435      39,915       319.1      19.1      00:28:21
 11337       5   4,435      22,175       324.8      19.4      00:28:26
 11548       8   4,435      35,480       330.9      19.8      00:28:28
 11796      10   4,435      44,350       338.2      20.2      00:28:21
 12027       6   4,435      26,610       344.9      20.6      00:28:18
 12280       8   4,435      35,480       352.2      21.0      00:28:11
 12607       8   4,435      35,480       361.7      21.6      00:27:52
 12960       6   4,435      26,610       371.5      22.2      00:27:31
 13263       7   4,435      31,045       380.4      22.7      00:27:15
 13563       4   4,435      17,740       389.6      23.3      00:26:58
 13779       5   4,435      22,175       396.0      23.7      00:26:56
 14015       9   4,435      39,915       402.6      24.1      00:26:53
 14264      10   4,435      44,350       410.1      24.5      00:26:45
 14479       3   4,435      13,305       416.7      24.9      00:26:42
 14756       7   4,435      31,045       424.8      25.4      00:26:31
 15089       9   4,435      39,915       434.7      26.0      00:26:10
 15430       8   4,435      35,480       444.9      26.6      00:25:49
 15763       6   4,435      26,610       454.8      27.2      00:25:30
 16039       7   4,435      31,045       463.3      27.7      00:25:18
 16319       7   4,435      31,045       471.8      28.2      00:25:05
 16586      10   4,435      44,350       479.8      28.7      00:24:56
 16777       8   4,435      35,480       485.6      29.0      00:24:55
 16952      10   4,435      44,350       490.7      29.3      00:24:57
 17147       5   4,435      22,175       496.3      29.7      00:24:57
 17337       7   4,435      31,045       502.2      30.0      00:24:56
 17504       8   4,435      35,480       507.5      30.3      00:24:56
 17750       8   4,435      35,480       514.6      30.8      00:24:49
 17968       9   4,435      39,915       521.1      31.1      00:24:45
 18233       7   4,435      31,045       529.1      31.6      00:24:34
 18491      10   4,435      44,350       536.4      32.1      00:24:26
 18622       9   4,435      39,915       540.4      32.3      00:24:31
 18758       9   4,435      39,915       544.7      32.5      00:24:35
 18925       7   4,435      31,045       549.7      32.8      00:24:35
 19085      10   4,435      44,350       554.6      33.1      00:24:36
 19232       5   4,435      22,175       559.2      33.4      00:24:38
 19448       9   4,435      39,915       565.7      33.8      00:24:32
 19679       6   4,435      26,610       572.9      34.2      00:24:23
 19937       4   4,435      17,740       581.0      34.7      00:24:11
 20216       6   4,435      26,610       589.6      35.2      00:23:57
 20488       8   4,435      35,480       597.7      35.7      00:23:45
 20668       5   4,435      22,175       603.2      36.0      00:23:43
 20837      10   4,435      44,350       608.3      36.3      00:23:42
 20991       6   4,435      26,610       612.9      36.6      00:23:42
 21152       5   4,435      22,175       617.4      36.9      00:23:43
 21317       9   4,435      39,915       621.6      37.1      00:23:45
 21497       9   4,435      39,915       626.9      37.5      00:23:42
 21745       8   4,435      35,480       633.6      37.9      00:23:35
 21947       7   4,435      31,045       639.4      38.2      00:23:30
 22112      10   4,435      44,350       643.8      38.5      00:23:31
 22301       7   4,435      31,045       649.1      38.8      00:23:28
 22480       5   4,435      22,175       654.1      39.1      00:23:26
 22662       7   4,435      31,045       659.3      39.4      00:23:23
 22915       8   4,435      35,480       666.0      39.8      00:23:15
 23174       7   4,435      31,045       673.7      40.3      00:23:03
 23473       8   4,435      35,480       682.2      40.8      00:22:49
 23777       9   4,435      39,915       691.0      41.3      00:22:34
 24028       6   4,435      26,610       698.2      41.7      00:22:24
 24248       3   4,435      13,305       704.3      42.1      00:22:18
 24483       9   4,435      39,915       710.9      42.5      00:22:10
 24665      10   4,435      44,350       716.5      42.8      00:22:05
 24851       8   4,435      35,480       721.8      43.1      00:22:02
 25067       9   4,435      39,915       728.1      43.5      00:21:54
 25290       9   4,435      39,915       734.7      43.9      00:21:47
 25518       6   4,435      26,610       741.5      44.3      00:21:38
 25693       4   4,435      17,740       746.4      44.6      00:21:35
 25872       9   4,435      39,915       751.9      44.9      00:21:30
 26086      10   4,435      44,350       758.2      45.3      00:21:23
 26320       5   4,435      22,175       765.1      45.7      00:21:13
 26543       6   4,435      26,610       771.3      46.1      00:21:06
 26732       8   4,435      35,480       776.7      46.4      00:21:02
 26921       8   4,435      35,480       782.3      46.7      00:20:56
 27113       8   4,435      35,480       787.9      47.1      00:20:51
 27264       2   4,435       8,870       792.2      47.3      00:20:49
 27370       5   4,435      22,175       795.4      47.5      00:20:51
 27482       7   4,435      31,045       798.7      47.7      00:20:52
 27620       7   4,435      31,045       802.8      48.0      00:20:50
 27802      10   4,435      44,350       808.3      48.3      00:20:45
 27976       3   4,435      13,305       813.5      48.6      00:20:40
 28175       5   4,435      22,175       819.4      49.0      00:20:33
 28412       5   4,435      22,175       826.6      49.4      00:20:22
 28619       9   4,435      39,915       833.1      49.8      00:20:14
 28798      10   4,435      44,350       838.6      50.1      00:20:08
 28974      10   4,435      44,350       843.9      50.4      00:20:02
 29165       9   4,435      39,915       849.6      50.8      00:19:56
 29372       5   4,435      22,175       855.7      51.1      00:19:48
 29580       6   4,435      26,610       861.8      51.5      00:19:40
 29751       8   4,435      35,480       866.9      51.8      00:19:35
 29951       8   4,435      35,480       872.9      52.2      00:19:28
 30168      10   4,435      44,350       879.5      52.6      00:19:19
 30385       7   4,435      31,045       885.9      52.9      00:19:10
 30524       6   4,435      26,610       890.3      53.2      00:19:07
 30742      10   4,435      44,350       896.8      53.6      00:18:57
 31003       9   4,435      39,915       904.7      54.1      00:18:45
 31291       6   4,435      26,610       913.4      54.6      00:18:30
 31569       9   4,435      39,915       921.9      55.1      00:18:15
 31851       7   4,435      31,045       930.8      55.6      00:18:00
 32137       8   4,435      35,480       939.7      56.2      00:17:45
 32414       7   4,435      31,045       948.5      56.7      00:17:30
 32589      10   4,435      44,350       953.8      57.0      00:17:24
 32761       9   4,435      39,915       959.0      57.3      00:17:18
 32942      10   4,435      44,350       964.6      57.6      00:17:12
 33075      10   4,435      44,350       968.7      57.9      00:17:09
 33198       8   4,435      35,480       972.4      58.1      00:17:07
 33385       9   4,435      39,915       978.2      58.5      00:16:59
 33577       6   4,435      26,610       984.2      58.8      00:16:51
 33799       5   4,435      22,175       991.0      59.2      00:16:41
 33998       8   4,435      35,480       997.1      59.6      00:16:33
 34152       7   4,435      31,045     1,002.1      59.9      00:16:28
 34352       8   4,435      35,480     1,008.3      60.3      00:16:19
 34574       5   4,435      22,175     1,015.0      60.7      00:16:09
 34822       3   4,435      13,305     1,022.9      61.1      00:15:57
 35085       6   4,435      26,610     1,030.8      61.6      00:15:44
 35367      10   4,435      44,350     1,039.6      62.1      00:15:29
 35634       5   4,435      22,175     1,047.8      62.6      00:15:16
 35871       8   4,435      35,480     1,055.0      63.0      00:15:05
 36134       9   4,435      39,915     1,063.1      63.5      00:14:52
 36368      10   4,435      44,350     1,070.3      64.0      00:14:42
 36570       7   4,435      31,045     1,076.3      64.3      00:14:34
 36707       3   4,435      13,305     1,080.3      64.6      00:14:30
 36873       6   4,435      26,610     1,085.3      64.9      00:14:24
 37023       9   4,435      39,915     1,089.6      65.1      00:14:20
 37150       3   4,435      13,305     1,093.1      65.3      00:14:17
 37296      10   4,435      44,350     1,097.1      65.6      00:14:13
 37435       7   4,435      31,045     1,101.2      65.8      00:14:09
 37570       4   4,435      17,740     1,105.1      66.0      00:14:06
 37672       4   4,435      17,740     1,107.9      66.2      00:14:05
 37822       7   4,435      31,045     1,112.3      66.5      00:13:60
 37976       3   4,435      13,305     1,116.8      66.7      00:13:55
 38146      10   4,435      44,350     1,122.1      67.1      00:13:48
 38344       6   4,435      26,610     1,128.1      67.4      00:13:39
 38532      10   4,435      44,350     1,133.9      67.8      00:13:31
 38729       8   4,435      35,480     1,139.9      68.1      00:13:23
 38934       7   4,435      31,045     1,145.9      68.5      00:13:14
 39056       8   4,435      35,480     1,149.6      68.7      00:13:11
 39192       9   4,435      39,915     1,153.4      68.9      00:13:07
 39324       6   4,435      26,610     1,157.4      69.2      00:13:03
 39491       8   4,435      35,480     1,162.1      69.4      00:12:57
 39678       9   4,435      39,915     1,167.6      69.8      00:12:49
 39817       4   4,435      17,740     1,171.7      70.0      00:12:45
 40053       4   4,435      17,740     1,178.6      70.4      00:12:34
 40296       5   4,435      22,175     1,185.6      70.9      00:12:23
 40518       7   4,435      31,045     1,192.5      71.3      00:12:12
 40742      10   4,435      44,350     1,199.2      71.7      00:12:02
 40941       9   4,435      39,915     1,205.4      72.0      00:11:53
 41099       7   4,435      31,045     1,210.1      72.3      00:11:47
 41256       4   4,435      17,740     1,214.8      72.6      00:11:41
 41432       8   4,435      35,480     1,220.1      72.9      00:11:33
 41590       6   4,435      26,610     1,224.8      73.2      00:11:27
 41768       7   4,435      31,045     1,230.1      73.5      00:11:20
 41912       7   4,435      31,045     1,234.6      73.8      00:11:14
 42062       4   4,435      17,740     1,238.7      74.0      00:11:09
 42203       7   4,435      31,045     1,242.7      74.3      00:11:04
 42338       5   4,435      22,175     1,246.5      74.5      00:10:59
 42498      10   4,435      44,350     1,251.4      74.8      00:10:53
 42629      10   4,435      44,350     1,255.1      75.0      00:10:49
 42750       9   4,435      39,915     1,258.7      75.2      00:10:44
 42887       9   4,435      39,915     1,262.8      75.5      00:10:39
 43024      10   4,435      44,350     1,267.0      75.7      00:10:34
 43152       2   4,435       8,870     1,271.0      76.0      00:10:29
 43284       4   4,435      17,740     1,275.1      76.2      00:10:24
 43417       6   4,435      26,610     1,279.2      76.4      00:10:18
 43624       6   4,435      26,610     1,285.0      76.8      00:10:09
 43867       6   4,435      26,610     1,292.2      77.2      00:09:58
 44072       8   4,435      35,480     1,298.3      77.6      00:09:48
 44225       8   4,435      35,480     1,302.8      77.8      00:09:42
 44375       5   4,435      22,175     1,306.8      78.1      00:09:37
 44552       7   4,435      31,045     1,312.2      78.4      00:09:29
 44727       6   4,435      26,610     1,317.3      78.7      00:09:21
 44891       8   4,435      35,480     1,322.3      79.0      00:09:14
 45042       5   4,435      22,175     1,326.7      79.3      00:09:08
 45253       7   4,435      31,045     1,332.6      79.6      00:08:59
 45398       5   4,435      22,175     1,336.5      79.9      00:08:54
 45480       8   4,435      35,480     1,338.9      80.0      00:08:51
 45626       9   4,435      39,915     1,342.8      80.2      00:08:46
 45791       7   4,435      31,045     1,347.5      80.5      00:08:39
 45952      10   4,435      44,350     1,352.3      80.8      00:08:32
 46124       5   4,435      22,175     1,357.5      81.1      00:08:24
 46290       5   4,435      22,175     1,362.6      81.4      00:08:16
 46494      10   4,435      44,350     1,368.5      81.8      00:08:07
 46719       7   4,435      31,045     1,375.4      82.2      00:07:56
 46900       3   4,435      13,305     1,380.8      82.5      00:07:48
 47086       9   4,435      39,915     1,385.7      82.8      00:07:40
 47266       7   4,435      31,045     1,390.6      83.1      00:07:33
 47422       5   4,435      22,175     1,395.1      83.4      00:07:26
 47541       5   4,435      22,175     1,398.5      83.6      00:07:22
 47675      10   4,435      44,350     1,402.5      83.8      00:07:16
 47818       6   4,435      26,610     1,406.5      84.1      00:07:10
 47971      10   4,435      44,350     1,411.2      84.3      00:07:03
 48131       5   4,435      22,175     1,415.8      84.6      00:06:56
 48288       9   4,435      39,915     1,420.5      84.9      00:06:49
 48525       8   4,435      35,480     1,427.6      85.3      00:06:37
 48737       9   4,435      39,915     1,433.8      85.7      00:06:27
 48905       9   4,435      39,915     1,438.7      86.0      00:06:20
 49081       6   4,435      26,610     1,443.9      86.3      00:06:12
 49242       9   4,435      39,915     1,448.8      86.6      00:06:04
 49413       8   4,435      35,480     1,453.5      86.9      00:05:57
 49606       9   4,435      39,915     1,458.8      87.2      00:05:48
 49772       8   4,435      35,480     1,463.4      87.4      00:05:41
 49920      10   4,435      44,350     1,467.6      87.7      00:05:35
 50088       4   4,435      17,740     1,472.6      88.0      00:05:27
 50264       4   4,435      17,740     1,477.5      88.3      00:05:19
 50469       8   4,435      35,480     1,483.3      88.6      00:05:10
 50631       5   4,435      22,175     1,488.1      88.9      00:05:02
 50762      10   4,435      44,350     1,492.2      89.2      00:04:56
 50936       6   4,435      26,610     1,497.6      89.5      00:04:47
 51069       6   4,435      26,610     1,501.6      89.7      00:04:41
 51226       5   4,435      22,175     1,506.0      90.0      00:04:34
 51417       9   4,435      39,915     1,511.9      90.3      00:04:25
 51612       4   4,435      17,740     1,517.9      90.7      00:04:15
 51840       7   4,435      31,045     1,525.0      91.1      00:04:03
 52085       9   4,435      39,915     1,532.5      91.6      00:03:51
 52321       7   4,435      31,045     1,540.0      92.0      00:03:38
 52568      10   4,435      44,350     1,548.0      92.5      00:03:25
 52818      10   4,435      44,350     1,556.2      93.0      00:03:11
 53040      10   4,435      44,350     1,563.1      93.4      00:02:60
 53249      10   4,435      44,350     1,569.5      93.8      00:02:49
 53484       7   4,435      31,045     1,576.7      94.2      00:02:38
 53686       9   4,435      39,915     1,582.9      94.6      00:02:27
 53815      10   4,435      44,350     1,586.7      94.8      00:02:21
 53935       5   4,435      22,175     1,590.2      95.0      00:02:16
 54075      10   4,435      44,350     1,594.3      95.3      00:02:09
 54195       6   4,435      26,610     1,598.0      95.5      00:02:04
 54321       7   4,435      31,045     1,601.6      95.7      00:01:58
 54459      10   4,435      44,350     1,605.3      95.9      00:01:52
 54625       2   4,435       8,870     1,610.0      96.2      00:01:44
 54794       6   4,435      26,610     1,614.9      96.5      00:01:36
 54931       8   4,435      35,480     1,619.0      96.7      00:01:30
 55111      10   4,435      44,350     1,624.2      97.1      00:01:21
 55309       4   4,435      17,740     1,629.7      97.4      00:01:12
 55484       7   4,435      31,045     1,634.6      97.7      00:01:04
 55665       8   4,435      35,480     1,639.9      98.0      00:00:55
 55814       7   4,435      31,045     1,644.3      98.3      00:00:48
 55998       9   4,435      39,915     1,650.0      98.6      00:00:39
 56121      10   4,435      44,350     1,653.6      98.8      00:00:33
 56233       6   4,435      26,610     1,657.0      99.0      00:00:27
 56388       7   4,435      31,045     1,661.9      99.3      00:00:19
 56579       7   4,435      31,045     1,667.7      99.7      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 2787.948
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400.csv saved

. 
. cap log close

. 
end of do-file
