
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A400_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   449       5   4,435      22,175        11.3       0.7      00:24:32
   944       9   4,435      39,915        24.6       1.5      00:22:22
  1417       9   4,435      39,915        38.5       2.3      00:21:18
  1878       2   4,435       8,870        51.7       3.1      00:20:59
  2366       9   4,435      39,915        65.4       3.9      00:20:32
  2864       9   4,435      39,915        79.8       4.8      00:20:01
  3336       9   4,435      39,915        93.5       5.6      00:19:45
  3826       8   4,435      35,480       107.9       6.4      00:19:23
  4212       9   4,435      39,915       118.6       7.1      00:19:43
  4584       6   4,435      26,610       128.9       7.7      00:20:01
  4948      10   4,435      44,350       139.6       8.3      00:20:12
  5326       4   4,435      17,740       150.3       9.0      00:20:18
  5701       9   4,435      39,915       160.5       9.6      00:20:28
  6078       5   4,435      22,175       171.3      10.2      00:20:30
  6462       7   4,435      31,045       182.1      10.9      00:20:31
  6825       8   4,435      35,480       192.3      11.5      00:20:35
  7232      10   4,435      44,350       203.5      12.2      00:20:30
  7668       7   4,435      31,045       216.4      12.9      00:20:15
  8081       7   4,435      31,045       228.8      13.7      00:20:02
  8499       7   4,435      31,045       241.6      14.4      00:19:48
  8937       5   4,435      22,175       254.8      15.2      00:19:32
  9320       9   4,435      39,915       266.4      15.9      00:19:25
  9665       8   4,435      35,480       277.0      16.5      00:19:22
 10026       7   4,435      31,045       287.6      17.2      00:19:19
 10359       6   4,435      26,610       296.6      17.7      00:19:23
 10740      10   4,435      44,350       307.6      18.4      00:19:17
 11111      10   4,435      44,350       318.1      19.0      00:19:13
 11427       8   4,435      35,480       327.3      19.5      00:19:14
 11719       5   4,435      22,175       335.7      20.0      00:19:18
 12050       6   4,435      26,610       345.4      20.6      00:19:16
 12394       8   4,435      35,480       355.3      21.2      00:19:13
 12863       6   4,435      26,610       368.6      22.0      00:18:56
 13335       8   4,435      35,480       382.3      22.8      00:18:37
 13725       9   4,435      39,915       394.3      23.5      00:18:26
 14092       6   4,435      26,610       404.8      24.2      00:18:20
 14480       6   4,435      26,610       416.5      24.9      00:18:09
 14859       9   4,435      39,915       427.6      25.5      00:18:01
 15298      10   4,435      44,350       440.8      26.3      00:17:45
 15728       8   4,435      35,480       453.4      27.1      00:17:32
 16146      10   4,435      44,350       466.4      27.9      00:17:18
 16568       7   4,435      31,045       479.2      28.6      00:17:04
 16883      10   4,435      44,350       488.3      29.2      00:17:02
 17204       5   4,435      22,175       497.8      29.7      00:16:58
 17526      10   4,435      44,350       507.9      30.3      00:16:52
 17896       8   4,435      35,480       518.7      31.0      00:16:44
 18281       5   4,435      22,175       530.3      31.7      00:16:34
 18702       7   4,435      31,045       542.7      32.4      00:16:22
 19148      10   4,435      44,350       556.3      33.2      00:16:06
 19601       8   4,435      35,480       570.2      34.0      00:15:51
 20050       8   4,435      35,480       584.4      34.9      00:15:34
 20507       7   4,435      31,045       598.0      35.7      00:15:20
 20828       7   4,435      31,045       607.7      36.3      00:15:14
 21187       1   4,435       4,435       618.1      36.9      00:15:07
 21570       4   4,435      17,740       628.8      37.5      00:14:60
 21975       8   4,435      35,480       639.9      38.2      00:14:51
 22380       8   4,435      35,480       651.0      38.9      00:14:42
 22754       8   4,435      35,480       661.4      39.5      00:14:35
 23132       8   4,435      35,480       672.2      40.1      00:14:26
 23510       5   4,435      22,175       683.0      40.8      00:14:18
 23876       8   4,435      35,480       693.7      41.4      00:14:10
 24312      10   4,435      44,350       705.8      42.1      00:13:59
 24774       4   4,435      17,740       719.3      43.0      00:13:45
 25243       3   4,435      13,305       733.1      43.8      00:13:30
 25659       9   4,435      39,915       745.0      44.5      00:13:20
 25985       6   4,435      26,610       754.8      45.1      00:13:13
 26343       7   4,435      31,045       765.4      45.7      00:13:05
 26776      10   4,435      44,350       777.7      46.4      00:12:54
 27171       6   4,435      26,610       789.3      47.1      00:12:44
 27515       7   4,435      31,045       799.3      47.7      00:12:37
 27879       9   4,435      39,915       810.3      48.4      00:12:28
 28307       6   4,435      26,610       823.1      49.1      00:12:16
 28714       8   4,435      35,480       835.6      49.9      00:12:04
 29068      10   4,435      44,350       846.4      50.5      00:11:56
 29480       6   4,435      26,610       858.7      51.3      00:11:44
 29854       7   4,435      31,045       869.8      51.9      00:11:35
 30170       9   4,435      39,915       879.1      52.5      00:11:29
 30551       5   4,435      22,175       890.8      53.2      00:11:19
 30973       9   4,435      39,915       903.5      54.0      00:11:07
 31433      10   4,435      44,350       917.4      54.8      00:10:53
 31902       9   4,435      39,915       932.0      55.7      00:10:39
 32362       9   4,435      39,915       946.4      56.5      00:10:24
 32715       5   4,435      22,175       957.2      57.2      00:10:16
 33054       6   4,435      26,610       967.7      57.8      00:10:07
 33435       8   4,435      35,480       979.3      58.5      00:09:57
 33840       5   4,435      22,175       991.8      59.2      00:09:46
 34241       7   4,435      31,045     1,004.5      60.0      00:09:35
 34724       6   4,435      26,610     1,019.3      60.9      00:09:20
 35188      10   4,435      44,350     1,033.7      61.7      00:09:07
 35656       7   4,435      31,045     1,048.0      62.6      00:08:53
 36119       8   4,435      35,480     1,062.1      63.4      00:08:40
 36580       9   4,435      39,915     1,076.2      64.3      00:08:27
 36938       7   4,435      31,045     1,086.9      64.9      00:08:18
 37311       7   4,435      31,045     1,097.3      65.5      00:08:10
 37628      10   4,435      44,350     1,106.5      66.1      00:08:03
 37976       7   4,435      31,045     1,116.5      66.7      00:07:56
 38308       7   4,435      31,045     1,126.5      67.3      00:07:48
 38622       9   4,435      39,915     1,136.2      67.9      00:07:40
 38949       4   4,435      17,740     1,146.0      68.4      00:07:33
 39291       9   4,435      39,915     1,155.9      69.0      00:07:25
 39688       5   4,435      22,175     1,167.5      69.7      00:07:15
 40144       9   4,435      39,915     1,180.9      70.5      00:07:03
 40622      10   4,435      44,350     1,195.2      71.4      00:06:50
 41076       7   4,435      31,045     1,209.1      72.2      00:06:37
 41467       8   4,435      35,480     1,220.7      72.9      00:06:27
 41869       8   4,435      35,480     1,232.8      73.6      00:06:17
 42249       6   4,435      26,610     1,243.6      74.3      00:06:08
 42660       6   4,435      26,610     1,255.7      75.0      00:05:58
 43037       3   4,435      13,305     1,267.0      75.7      00:05:48
 43393       9   4,435      39,915     1,278.0      76.3      00:05:39
 43774      10   4,435      44,350     1,289.0      77.0      00:05:30
 44138       7   4,435      31,045     1,299.7      77.6      00:05:21
 44547       7   4,435      31,045     1,311.7      78.3      00:05:10
 44948       5   4,435      22,175     1,323.6      79.0      00:05:00
 45382      10   4,435      44,350     1,335.7      79.8      00:04:50
 45760       5   4,435      22,175     1,346.3      80.4      00:04:41
 46144      10   4,435      44,350     1,357.7      81.1      00:04:31
 46528      10   4,435      44,350     1,369.2      81.8      00:04:21
 46966       7   4,435      31,045     1,382.3      82.5      00:04:10
 47342       8   4,435      35,480     1,392.6      83.2      00:04:01
 47708      10   4,435      44,350     1,403.2      83.8      00:03:53
 48066       2   4,435       8,870     1,413.6      84.4      00:03:44
 48432       7   4,435      31,045     1,424.5      85.1      00:03:35
 48825       3   4,435      13,305     1,436.1      85.8      00:03:25
 49216      10   4,435      44,350     1,447.9      86.5      00:03:15
 49695       8   4,435      35,480     1,460.9      87.2      00:03:03
 50200       7   4,435      31,045     1,475.5      88.1      00:02:50
 50602       7   4,435      31,045     1,487.0      88.8      00:02:41
 50967      10   4,435      44,350     1,498.0      89.5      00:02:31
 51339       5   4,435      22,175     1,509.1      90.1      00:02:22
 51724       6   4,435      26,610     1,520.9      90.8      00:02:12
 52082      10   4,435      44,350     1,531.9      91.5      00:02:02
 52433       9   4,435      39,915     1,543.1      92.1      00:01:53
 52768       5   4,435      22,175     1,554.0      92.8      00:01:43
 53104       9   4,435      39,915     1,564.5      93.4      00:01:34
 53488       6   4,435      26,610     1,576.3      94.1      00:01:24
 53878       4   4,435      17,740     1,588.1      94.8      00:01:14
 54196       6   4,435      26,610     1,597.5      95.4      00:01:06
 54536      10   4,435      44,350     1,607.1      96.0      00:00:58
 54939       5   4,435      22,175     1,618.8      96.7      00:00:48
 55320       2   4,435       8,870     1,629.8      97.3      00:00:39
 55678      10   4,435      44,350     1,639.8      97.9      00:00:30
 56038       9   4,435      39,915     1,650.7      98.6      00:00:21
 56426       5   4,435      22,175     1,662.6      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1447.236
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
