
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed129.dta /export/storage_covidva
> ccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_d
> ist_total_10000_5_4q_mnl_A1000_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed129.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed129.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   193       7   5,035      35,245         5.4       0.3      00:58:08
   422      10   5,035      50,350        12.3       0.6      00:51:15
   619       8   5,035      40,280        18.2       1.0      00:51:48
   818       7   5,035      35,245        24.6       1.3      00:50:51
  1024       3   5,035      15,105        30.9       1.6      00:50:34
  1222      10   5,035      50,350        37.3       2.0      00:49:58
  1397       7   5,035      35,245        43.2       2.3      00:50:14
  1593       4   5,035      20,140        49.7       2.6      00:49:42
  1787       3   5,035      15,105        56.0       2.9      00:49:30
  1976       7   5,035      35,245        62.0       3.3      00:49:34
  2185       8   5,035      40,280        68.7       3.6      00:49:00
  2374       9   5,035      45,315        74.7       3.9      00:48:60
  2588      10   5,035      50,350        81.6       4.3      00:48:27
  2789      10   5,035      50,350        88.3       4.6      00:48:00
  3010       6   5,035      30,210        95.2       5.0      00:47:32
  3197       6   5,035      30,210       101.7       5.4      00:47:19
  3388       7   5,035      35,245       108.2       5.7      00:47:05
  3548       8   5,035      40,280       113.6       6.0      00:47:20
  3751       6   5,035      30,210       120.3       6.3      00:46:59
  3921       9   5,035      45,315       125.6       6.6      00:47:14
  4063       4   5,035      20,140       130.0       6.8      00:47:47
  4171       6   5,035      30,210       133.5       7.0      00:48:40
  4322      10   5,035      50,350       138.0       7.3      00:49:06
  4448       9   5,035      45,315       142.0       7.5      00:49:43
  4574       6   5,035      30,210       146.2       7.7      00:50:09
  4708       7   5,035      35,245       150.8       7.9      00:50:26
  4858      10   5,035      50,350       155.6       8.2      00:50:37
  4998       8   5,035      40,280       160.3       8.4      00:50:51
  5113       8   5,035      40,280       163.9       8.6      00:51:24
  5291      10   5,035      50,350       169.7       8.9      00:51:11
  5437       7   5,035      35,245       174.7       9.2      00:51:15
  5582       4   5,035      20,140       178.8       9.4      00:51:33
  5666       7   5,035      35,245       181.4       9.5      00:52:19
  5817      10   5,035      50,350       186.1       9.8      00:52:22
  5972      10   5,035      50,350       191.2      10.1      00:52:19
  6112       8   5,035      40,280       195.9      10.3      00:52:24
  6250       6   5,035      30,210       200.3      10.5      00:52:31
  6374       5   5,035      25,175       204.1      10.7      00:52:50
  6499      10   5,035      50,350       208.1      11.0      00:53:02
  6622       8   5,035      40,280       211.9      11.2      00:53:19
  6750       6   5,035      30,210       216.0      11.4      00:53:28
  6859       7   5,035      35,245       219.6      11.6      00:53:47
  7008       3   5,035      15,105       224.3      11.8      00:53:45
  7194       7   5,035      35,245       230.1      12.1      00:53:25
  7349       8   5,035      40,280       235.3      12.4      00:53:16
  7474       8   5,035      40,280       239.5      12.6      00:53:23
  7641       5   5,035      25,175       244.9      12.9      00:53:09
  7796      10   5,035      50,350       250.1      13.2      00:53:00
  7947       8   5,035      40,280       255.4      13.4      00:52:49
  8105      10   5,035      50,350       260.8      13.7      00:52:35
  8257       9   5,035      45,315       266.0      14.0      00:52:26
  8413      10   5,035      50,350       271.6      14.3      00:52:11
  8566       6   5,035      30,210       276.8      14.6      00:52:00
  8712       5   5,035      25,175       281.7      14.8      00:51:55
  8858       5   5,035      25,175       286.7      15.1      00:51:48
  8980      10   5,035      50,350       290.9      15.3      00:51:50
  9117       6   5,035      30,210       295.7      15.6      00:51:46
  9251      10   5,035      50,350       300.3      15.8      00:51:42
  9361       7   5,035      35,245       304.1      16.0      00:51:50
  9455       6   5,035      30,210       307.2      16.2      00:52:03
  9548       7   5,035      35,245       310.6      16.3      00:52:14
  9661       6   5,035      30,210       314.7      16.6      00:52:16
  9767       9   5,035      45,315       318.3      16.8      00:52:23
  9883       6   5,035      30,210       322.1      17.0      00:52:28
  9986       3   5,035      15,105       325.4      17.1      00:52:39
 10097       8   5,035      40,280       328.8      17.3      00:52:47
 10199       5   5,035      25,175       331.9      17.5      00:52:60
 10305       6   5,035      30,210       335.1      17.6      00:53:09
 10406       9   5,035      45,315       338.5      17.8      00:53:17
 10532      10   5,035      50,350       342.6      18.0      00:53:17
 10656       6   5,035      30,210       346.6      18.2      00:53:17
 10806       8   5,035      40,280       351.3      18.5      00:53:09
 10910       6   5,035      30,210       354.9      18.7      00:53:14
 11034       5   5,035      25,175       358.9      18.9      00:53:13
 11136       7   5,035      35,245       362.2      19.1      00:53:20
 11238       4   5,035      20,140       365.5      19.2      00:53:26
 11314       5   5,035      25,175       368.0      19.4      00:53:41
 11410       8   5,035      40,280       371.3      19.5      00:53:48
 11511       9   5,035      45,315       374.6      19.7      00:53:53
 11627       6   5,035      30,210       378.3      19.9      00:53:54
 11739       8   5,035      40,280       381.9      20.1      00:53:56
 11854       3   5,035      15,105       385.8      20.3      00:53:54
 11980       5   5,035      25,175       389.9      20.5      00:53:50
 12073       7   5,035      35,245       393.1      20.7      00:53:55
 12152       8   5,035      40,280       395.8      20.8      00:54:06
 12230       7   5,035      35,245       398.3      21.0      00:54:18
 12390      10   5,035      50,350       403.5      21.2      00:54:02
 12583       8   5,035      40,280       409.8      21.6      00:53:36
 12776       9   5,035      45,315       415.9      21.9      00:53:11
 12993       2   5,035      10,070       422.9      22.3      00:52:38
 13201       6   5,035      30,210       429.9      22.6      00:52:07
 13381       6   5,035      30,210       435.8      22.9      00:51:46
 13539       9   5,035      45,315       441.5      23.2      00:51:27
 13638       6   5,035      30,210       444.9      23.4      00:51:29
 13763       4   5,035      20,140       449.0      23.6      00:51:25
 13878       7   5,035      35,245       452.8      23.8      00:51:23
 14010       8   5,035      40,280       457.0      24.1      00:51:18
 14133       8   5,035      40,280       461.1      24.3      00:51:13
 14246       7   5,035      35,245       465.1      24.5      00:51:09
 14372       6   5,035      30,210       469.4      24.7      00:51:02
 14493       9   5,035      45,315       473.6      24.9      00:50:56
 14614       6   5,035      30,210       477.5      25.1      00:50:53
 14749       8   5,035      40,280       481.9      25.4      00:50:45
 14861       4   5,035      20,140       485.7      25.6      00:50:43
 15032       6   5,035      30,210       491.6      25.9      00:50:22
 15204       6   5,035      30,210       497.7      26.2      00:50:01
 15395       5   5,035      25,175       504.0      26.5      00:49:38
 15579       1   5,035       5,035       510.0      26.8      00:49:17
 15751       8   5,035      40,280       515.9      27.2      00:48:58
 15906       7   5,035      35,245       521.2      27.4      00:48:43
 16066      10   5,035      50,350       527.0      27.7      00:48:25
 16267       9   5,035      45,315       533.9      28.1      00:47:59
 16428      10   5,035      50,350       539.6      28.4      00:47:42
 16555      10   5,035      50,350       543.8      28.6      00:47:37
 16674       9   5,035      45,315       547.7      28.8      00:47:33
 16800      10   5,035      50,350       551.9      29.1      00:47:27
 16891       9   5,035      45,315       554.9      29.2      00:47:30
 16981       6   5,035      30,210       558.1      29.4      00:47:31
 17059       4   5,035      20,140       560.7      29.5      00:47:36
 17158       3   5,035      15,105       563.9      29.7      00:47:37
 17257       8   5,035      40,280       567.3      29.9      00:47:37
 17341       5   5,035      25,175       570.3      30.0      00:47:38
 17426       5   5,035      25,175       573.2      30.2      00:47:41
 17516       9   5,035      45,315       576.6      30.4      00:47:40
 17621       9   5,035      45,315       580.2      30.5      00:47:38
 17715       7   5,035      35,245       583.3      30.7      00:47:38
 17854       5   5,035      25,175       587.8      30.9      00:47:29
 17966      10   5,035      50,350       591.5      31.1      00:47:25
 18073       9   5,035      45,315       595.2      31.3      00:47:21
 18251       3   5,035      15,105       601.3      31.6      00:47:01
 18460       5   5,035      25,175       607.9      32.0      00:46:38
 18552       9   5,035      45,315       611.1      32.2      00:46:38
 18625       9   5,035      45,315       613.7      32.3      00:46:42
 18711       5   5,035      25,175       616.7      32.5      00:46:42
 18806       5   5,035      25,175       619.8      32.6      00:46:42
 18882       8   5,035      40,280       622.6      32.8      00:46:44
 18991       6   5,035      30,210       626.5      33.0      00:46:39
 19102      10   5,035      50,350       630.3      33.2      00:46:34
 19204       7   5,035      35,245       633.9      33.4      00:46:30
 19373       8   5,035      40,280       639.6      33.7      00:46:12
 19522       8   5,035      40,280       644.9      33.9      00:45:57
 19662       8   5,035      40,280       649.9      34.2      00:45:45
 19834       7   5,035      35,245       655.9      34.5      00:45:26
 20005       6   5,035      30,210       662.0      34.8      00:45:06
 20165       8   5,035      40,280       667.6      35.1      00:44:50
 20332       7   5,035      35,245       673.1      35.4      00:44:34
 20485       7   5,035      35,245       678.4      35.7      00:44:20
 20599       9   5,035      45,315       682.4      35.9      00:44:13
 20722       7   5,035      35,245       686.6      36.1      00:44:06
 20818      10   5,035      50,350       689.9      36.3      00:44:04
 20913       7   5,035      35,245       693.3      36.5      00:44:01
 21002      10   5,035      50,350       696.2      36.6      00:44:01
 21149       7   5,035      35,245       700.8      36.9      00:43:51
 21267       8   5,035      40,280       704.3      37.1      00:43:47
 21382       6   5,035      30,210       707.9      37.3      00:43:43
 21486       5   5,035      25,175       711.4      37.4      00:43:39
 21601       7   5,035      35,245       714.9      37.6      00:43:35
 21709       8   5,035      40,280       718.2      37.8      00:43:32
 21825      10   5,035      50,350       721.9      38.0      00:43:27
 21944       3   5,035      15,105       725.8      38.2      00:43:21
 22040       8   5,035      40,280       728.9      38.4      00:43:19
 22176       8   5,035      40,280       732.9      38.6      00:43:12
 22268       7   5,035      35,245       735.8      38.7      00:43:11
 22390      10   5,035      50,350       739.6      38.9      00:43:05
 22532       2   5,035      10,070       744.2      39.2      00:42:55
 22660       7   5,035      35,245       748.4      39.4      00:42:46
 22851       5   5,035      25,175       754.0      39.7      00:42:30
 23028       8   5,035      40,280       759.9      40.0      00:42:12
 23196       8   5,035      40,280       765.6      40.3      00:41:56
 23371       9   5,035      45,315       771.4      40.6      00:41:39
 23534       5   5,035      25,175       776.3      40.9      00:41:27
 23705       8   5,035      40,280       781.9      41.2      00:41:11
 23854       5   5,035      25,175       787.0      41.4      00:40:58
 24031       8   5,035      40,280       792.8      41.7      00:40:42
 24189       9   5,035      45,315       797.7      42.0      00:40:30
 24339       4   5,035      20,140       802.2      42.2      00:40:20
 24485       8   5,035      40,280       807.2      42.5      00:40:07
 24629       6   5,035      30,210       812.2      42.7      00:39:55
 24787       5   5,035      25,175       817.3      43.0      00:39:42
 24943       9   5,035      45,315       822.3      43.3      00:39:30
 25128       6   5,035      30,210       828.8      43.6      00:39:10
 25292       7   5,035      35,245       834.1      43.9      00:38:56
 25462       7   5,035      35,245       839.9      44.2      00:38:41
 25585       8   5,035      40,280       843.8      44.4      00:38:34
 25684       7   5,035      35,245       847.1      44.6      00:38:30
 25803       8   5,035      40,280       851.3      44.8      00:38:22
 25924       4   5,035      20,140       855.3      45.0      00:38:15
 26053       9   5,035      45,315       859.7      45.2      00:38:05
 26187       9   5,035      45,315       864.1      45.5      00:37:56
 26357       4   5,035      20,140       869.7      45.8      00:37:41
 26509       9   5,035      45,315       874.5      46.0      00:37:30
 26631       9   5,035      45,315       878.5      46.2      00:37:23
 26763       7   5,035      35,245       882.9      46.5      00:37:13
 26925      10   5,035      50,350       888.3      46.8      00:36:60
 27056       1   5,035       5,035       892.5      47.0      00:36:51
 27183       9   5,035      45,315       896.9      47.2      00:36:42
 27319      10   5,035      50,350       901.3      47.4      00:36:33
 27443       6   5,035      30,210       905.4      47.7      00:36:25
 27555      10   5,035      50,350       909.2      47.9      00:36:18
 27658       7   5,035      35,245       912.7      48.0      00:36:13
 27772       7   5,035      35,245       916.5      48.2      00:36:06
 27890       7   5,035      35,245       920.7      48.5      00:35:58
 28031       7   5,035      35,245       925.3      48.7      00:35:48
 28163       8   5,035      40,280       929.9      48.9      00:35:38
 28266       9   5,035      45,315       933.4      49.1      00:35:32
 28413      10   5,035      50,350       938.5      49.4      00:35:20
 28572       7   5,035      35,245       944.3      49.7      00:35:04
 28695       9   5,035      45,315       948.4      49.9      00:34:56
 28785       9   5,035      45,315       951.6      50.1      00:34:53
 28856       8   5,035      40,280       954.0      50.2      00:34:52
 28965       8   5,035      40,280       957.8      50.4      00:34:45
 29067       7   5,035      35,245       961.2      50.6      00:34:40
 29199       9   5,035      45,315       965.5      50.8      00:34:31
 29319      10   5,035      50,350       969.7      51.0      00:34:23
 29441       4   5,035      20,140       973.9      51.3      00:34:14
 29564       6   5,035      30,210       977.8      51.5      00:34:06
 29684       9   5,035      45,315       981.9      51.7      00:33:58
 29772       8   5,035      40,280       984.9      51.8      00:33:55
 29862       7   5,035      35,245       988.0      52.0      00:33:51
 29962      10   5,035      50,350       991.4      52.2      00:33:46
 30080      10   5,035      50,350       995.4      52.4      00:33:38
 30177       3   5,035      15,105       998.8      52.6      00:33:32
 30285       7   5,035      35,245     1,002.5      52.8      00:33:26
 30399      10   5,035      50,350     1,006.3      53.0      00:33:19
 30516       9   5,035      45,315     1,010.5      53.2      00:33:10
 30678       8   5,035      40,280     1,016.0      53.5      00:32:56
 30877       9   5,035      45,315     1,022.9      53.8      00:32:36
 31056       7   5,035      35,245     1,028.7      54.1      00:32:20
 31209       4   5,035      20,140     1,034.1      54.4      00:32:06
 31410       6   5,035      30,210     1,041.2      54.8      00:31:46
 31618       7   5,035      35,245     1,048.4      55.2      00:31:25
 31786       4   5,035      20,140     1,054.3      55.5      00:31:10
 31918       7   5,035      35,245     1,059.1      55.7      00:30:59
 32075       8   5,035      40,280     1,064.6      56.0      00:30:45
 32248       9   5,035      45,315     1,070.8      56.4      00:30:28
 32413       9   5,035      45,315     1,076.8      56.7      00:30:13
 32536       9   5,035      45,315     1,081.0      56.9      00:30:04
 32619       7   5,035      35,245     1,083.8      57.0      00:30:01
 32709       8   5,035      40,280     1,086.9      57.2      00:29:56
 32815       6   5,035      30,210     1,090.6      57.4      00:29:50
 32902      10   5,035      50,350     1,093.7      57.6      00:29:45
 32988       5   5,035      25,175     1,096.7      57.7      00:29:41
 33065       6   5,035      30,210     1,099.4      57.9      00:29:38
 33157       5   5,035      25,175     1,102.6      58.0      00:29:33
 33259       8   5,035      40,280     1,106.2      58.2      00:29:26
 33378       9   5,035      45,315     1,110.3      58.4      00:29:18
 33490       8   5,035      40,280     1,114.2      58.6      00:29:10
 33605       7   5,035      35,245     1,118.4      58.9      00:29:01
 33721       6   5,035      30,210     1,122.3      59.1      00:28:53
 33827       9   5,035      45,315     1,126.1      59.3      00:28:46
 33931       5   5,035      25,175     1,129.7      59.5      00:28:39
 34036      10   5,035      50,350     1,133.4      59.7      00:28:33
 34179       6   5,035      30,210     1,138.7      59.9      00:28:20
 34347       9   5,035      45,315     1,144.6      60.2      00:28:04
 34550       6   5,035      30,210     1,151.6      60.6      00:27:45
 34706       9   5,035      45,315     1,157.1      60.9      00:27:31
 34862       6   5,035      30,210     1,162.7      61.2      00:27:17
 35025       9   5,035      45,315     1,168.2      61.5      00:27:04
 35205       8   5,035      40,280     1,174.6      61.8      00:26:47
 35382      10   5,035      50,350     1,180.8      62.2      00:26:31
 35570       9   5,035      45,315     1,187.3      62.5      00:26:14
 35762       8   5,035      40,280     1,193.8      62.8      00:25:57
 35938       6   5,035      30,210     1,200.0      63.2      00:25:41
 36063       1   5,035       5,035     1,204.2      63.4      00:25:32
 36221      10   5,035      50,350     1,209.8      63.7      00:25:19
 36359       5   5,035      25,175     1,214.8      63.9      00:25:07
 36533       9   5,035      45,315     1,220.6      64.2      00:24:53
 36636      10   5,035      50,350     1,224.3      64.4      00:24:46
 36746       9   5,035      45,315     1,227.7      64.6      00:24:40
 36847      10   5,035      50,350     1,231.2      64.8      00:24:34
 36941       5   5,035      25,175     1,234.4      65.0      00:24:28
 37042      10   5,035      50,350     1,237.7      65.1      00:24:22
 37180       8   5,035      40,280     1,241.9      65.4      00:24:13
 37306       9   5,035      45,315     1,245.9      65.6      00:24:05
 37427       4   5,035      20,140     1,249.8      65.8      00:23:57
 37543       8   5,035      40,280     1,253.7      66.0      00:23:49
 37664       7   5,035      35,245     1,257.5      66.2      00:23:42
 37836       9   5,035      45,315     1,263.3      66.5      00:23:28
 37988       8   5,035      40,280     1,268.4      66.8      00:23:16
 38100       8   5,035      40,280     1,272.2      67.0      00:23:08
 38228       6   5,035      30,210     1,276.6      67.2      00:22:59
 38329       9   5,035      45,315     1,280.2      67.4      00:22:52
 38458       7   5,035      35,245     1,284.8      67.6      00:22:42
 38636       9   5,035      45,315     1,290.8      67.9      00:22:27
 38810       8   5,035      40,280     1,296.7      68.3      00:22:12
 38954      10   5,035      50,350     1,301.6      68.5      00:22:01
 39047       8   5,035      40,280     1,304.8      68.7      00:21:55
 39147       7   5,035      35,245     1,308.1      68.9      00:21:49
 39263       6   5,035      30,210     1,311.8      69.0      00:21:42
 39413       8   5,035      40,280     1,316.7      69.3      00:21:31
 39546       5   5,035      25,175     1,321.2      69.5      00:21:21
 39669      10   5,035      50,350     1,325.2      69.8      00:21:12
 39791       7   5,035      35,245     1,329.3      70.0      00:21:04
 39917      10   5,035      50,350     1,333.6      70.2      00:20:55
 39998       6   5,035      30,210     1,336.2      70.3      00:20:50
 40130       9   5,035      45,315     1,340.6      70.6      00:20:41
 40265       7   5,035      35,245     1,345.0      70.8      00:20:31
 40395      10   5,035      50,350     1,349.5      71.0      00:20:21
 40600       8   5,035      40,280     1,356.6      71.4      00:20:03
 40775       5   5,035      25,175     1,362.6      71.7      00:19:49
 40938       8   5,035      40,280     1,368.4      72.0      00:19:35
 41044      10   5,035      50,350     1,372.0      72.2      00:19:28
 41162       8   5,035      40,280     1,375.9      72.4      00:19:19
 41261       6   5,035      30,210     1,379.3      72.6      00:19:13
 41387       9   5,035      45,315     1,383.4      72.8      00:19:04
 41519       5   5,035      25,175     1,388.0      73.1      00:18:54
 41645       6   5,035      30,210     1,392.3      73.3      00:18:45
 41791       9   5,035      45,315     1,397.3      73.6      00:18:33
 41913       9   5,035      45,315     1,401.7      73.8      00:18:24
 42005       8   5,035      40,280     1,404.6      73.9      00:18:18
 42108       4   5,035      20,140     1,407.8      74.1      00:18:12
 42189       7   5,035      35,245     1,410.3      74.2      00:18:08
 42303       4   5,035      20,140     1,413.9      74.4      00:18:01
 42400       8   5,035      40,280     1,417.4      74.6      00:17:54
 42533       5   5,035      25,175     1,421.8      74.8      00:17:44
 42625       9   5,035      45,315     1,424.7      75.0      00:17:39
 42740       6   5,035      30,210     1,428.6      75.2      00:17:31
 42839       7   5,035      35,245     1,432.1      75.4      00:17:24
 42932       5   5,035      25,175     1,435.1      75.5      00:17:18
 43014       8   5,035      40,280     1,438.1      75.7      00:17:13
 43111       8   5,035      40,280     1,441.6      75.9      00:17:06
 43211       7   5,035      35,245     1,445.1      76.1      00:16:58
 43308      10   5,035      50,350     1,448.4      76.2      00:16:52
 43400       5   5,035      25,175     1,451.7      76.4      00:16:45
 43509       7   5,035      35,245     1,455.2      76.6      00:16:38
 43700       5   5,035      25,175     1,461.3      76.9      00:16:23
 43874       5   5,035      25,175     1,467.3      77.2      00:16:09
 44074       1   5,035       5,035     1,474.0      77.6      00:15:52
 44185       6   5,035      30,210     1,477.7      77.8      00:15:44
 44298       7   5,035      35,245     1,481.3      78.0      00:15:37
 44419       8   5,035      40,280     1,485.1      78.2      00:15:29
 44539       7   5,035      35,245     1,489.2      78.4      00:15:20
 44638       4   5,035      20,140     1,492.5      78.6      00:15:13
 44762       9   5,035      45,315     1,496.7      78.8      00:15:04
 44905       6   5,035      30,210     1,501.6      79.0      00:14:53
 45029      10   5,035      50,350     1,505.7      79.3      00:14:44
 45229       6   5,035      30,210     1,512.2      79.6      00:14:28
 45352       4   5,035      20,140     1,515.8      79.8      00:14:21
 45467       6   5,035      30,210     1,519.6      80.0      00:14:12
 45556       6   5,035      30,210     1,522.4      80.1      00:14:07
 45672       6   5,035      30,210     1,525.9      80.3      00:13:60
 45808       7   5,035      35,245     1,530.4      80.6      00:13:50
 45950      10   5,035      50,350     1,535.1      80.8      00:13:39
 46075       4   5,035      20,140     1,539.3      81.0      00:13:30
 46191       6   5,035      30,210     1,543.5      81.2      00:13:20
 46303       9   5,035      45,315     1,547.4      81.5      00:13:12
 46420       7   5,035      35,245     1,551.1      81.6      00:13:04
 46529       4   5,035      20,140     1,554.9      81.8      00:12:56
 46698       6   5,035      30,210     1,560.7      82.1      00:12:42
 46868       8   5,035      40,280     1,566.5      82.5      00:12:28
 46992       6   5,035      30,210     1,570.2      82.7      00:12:20
 47097       1   5,035       5,035     1,573.5      82.8      00:12:14
 47183       9   5,035      45,315     1,576.1      83.0      00:12:09
 47276       6   5,035      30,210     1,579.1      83.1      00:12:03
 47399       7   5,035      35,245     1,583.2      83.3      00:11:54
 47476      10   5,035      50,350     1,585.5      83.5      00:11:49
 47564      10   5,035      50,350     1,588.4      83.6      00:11:43
 47676       7   5,035      35,245     1,592.3      83.8      00:11:35
 47787       6   5,035      30,210     1,595.8      84.0      00:11:27
 47877       7   5,035      35,245     1,598.8      84.2      00:11:21
 47978      10   5,035      50,350     1,602.4      84.3      00:11:13
 48138       4   5,035      20,140     1,607.5      84.6      00:11:01
 48275       6   5,035      30,210     1,612.3      84.9      00:10:51
 48405       5   5,035      25,175     1,616.6      85.1      00:10:41
 48510       9   5,035      45,315     1,620.2      85.3      00:10:33
 48604       9   5,035      45,315     1,623.3      85.4      00:10:27
 48755       5   5,035      25,175     1,628.4      85.7      00:10:15
 48942       9   5,035      45,315     1,634.6      86.0      00:10:00
 49131       5   5,035      25,175     1,641.1      86.4      00:09:45
 49300       5   5,035      25,175     1,646.7      86.7      00:09:32
 49401       6   5,035      30,210     1,649.8      86.8      00:09:25
 49514      10   5,035      50,350     1,653.4      87.0      00:09:17
 49663       9   5,035      45,315     1,657.9      87.3      00:09:07
 49828       8   5,035      40,280     1,663.2      87.5      00:08:55
 50013       8   5,035      40,280     1,669.3      87.9      00:08:40
 50197       6   5,035      30,210     1,675.4      88.2      00:08:26
 50356       9   5,035      45,315     1,680.2      88.4      00:08:15
 50489       9   5,035      45,315     1,684.7      88.7      00:08:05
 50629      10   5,035      50,350     1,689.3      88.9      00:07:55
 50794       6   5,035      30,210     1,695.1      89.2      00:07:41
 50928       7   5,035      35,245     1,699.8      89.5      00:07:30
 51102       7   5,035      35,245     1,705.7      89.8      00:07:17
 51288      10   5,035      50,350     1,712.0      90.1      00:07:02
 51560       5   5,035      25,175     1,721.3      90.6      00:06:40
 51788       9   5,035      45,315     1,729.5      91.0      00:06:21
 51934       8   5,035      40,280     1,734.4      91.3      00:06:10
 52060       8   5,035      40,280     1,739.0      91.5      00:05:60
 52199       5   5,035      25,175     1,744.1      91.8      00:05:48
 52412      10   5,035      50,350     1,751.7      92.2      00:05:31
 52610       8   5,035      40,280     1,759.1      92.6      00:05:14
 52776       6   5,035      30,210     1,765.2      92.9      00:04:60
 52930       7   5,035      35,245     1,770.6      93.2      00:04:48
 53063      10   5,035      50,350     1,775.4      93.4      00:04:37
 53203       6   5,035      30,210     1,780.2      93.7      00:04:26
 53365       6   5,035      30,210     1,785.8      94.0      00:04:14
 53570       5   5,035      25,175     1,793.0      94.4      00:03:57
 53702       6   5,035      30,210     1,797.5      94.6      00:03:47
 53812       6   5,035      30,210     1,801.3      94.8      00:03:39
 53940       8   5,035      40,280     1,805.5      95.0      00:03:30
 54036      10   5,035      50,350     1,808.8      95.2      00:03:22
 54145       7   5,035      35,245     1,812.4      95.4      00:03:14
 54269       9   5,035      45,315     1,816.6      95.6      00:03:05
 54402       5   5,035      25,175     1,820.7      95.8      00:02:56
 54544       9   5,035      45,315     1,825.0      96.1      00:02:46
 54673       8   5,035      40,280     1,829.5      96.3      00:02:36
 54846       4   5,035      20,140     1,835.1      96.6      00:02:24
 55044       9   5,035      45,315     1,841.7      96.9      00:02:09
 55189       7   5,035      35,245     1,846.5      97.2      00:01:58
 55344       9   5,035      45,315     1,851.3      97.4      00:01:48
 55462      10   5,035      50,350     1,855.1      97.6      00:01:39
 55576       6   5,035      30,210     1,858.6      97.8      00:01:32
 55678       4   5,035      20,140     1,862.2      98.0      00:01:24
 55782       9   5,035      45,315     1,865.6      98.2      00:01:16
 55921       6   5,035      30,210     1,870.5      98.5      00:01:05
 56078      10   5,035      50,350     1,875.8      98.7      00:00:53
 56222       4   5,035      20,140     1,880.8      99.0      00:00:42
 56353       8   5,035      40,280     1,885.5      99.2      00:00:32
 56530       8   5,035      40,280     1,891.7      99.6      00:00:18
 56709       8   5,035      40,280     1,897.9      99.9      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 4223.506
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed129.csv sa
> ved

. 
. cap log close

. 
end of do-file
