
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A300_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   261      10   4,335      43,350         6.5       0.4      00:42:10
   563       6   4,335      26,010        14.2       0.9      00:38:06
   862      10   4,335      43,350        22.1       1.4      00:36:34
  1140       6   4,335      26,010        29.8       1.8      00:35:58
  1407       9   4,335      39,015        37.5       2.3      00:35:37
  1684       7   4,335      30,345        45.5       2.8      00:35:04
  1970       9   4,335      39,015        53.2       3.3      00:34:47
  2265       8   4,335      34,680        61.4       3.8      00:34:16
  2572       9   4,335      39,015        69.7       4.3      00:33:46
  2886       9   4,335      39,015        78.7       4.8      00:33:03
  3202       6   4,335      26,010        87.7       5.4      00:32:27
  3515       8   4,335      34,680        96.8       5.9      00:31:52
  3829       6   4,335      26,010       105.7       6.5      00:31:25
  4052       9   4,335      39,015       111.7       6.8      00:31:55
  4291       9   4,335      39,015       118.0       7.2      00:32:15
  4517       7   4,335      30,345       124.2       7.6      00:32:32
  4751       8   4,335      34,680       131.1       8.0      00:32:36
  4988       8   4,335      34,680       137.7       8.4      00:32:43
  5248       2   4,335       8,670       144.9       8.9      00:32:40
  5477       4   4,335      17,340       151.2       9.2      00:32:48
  5683       9   4,335      39,015       156.6       9.6      00:33:08
  5889       4   4,335      17,340       162.2       9.9      00:33:23
  6077       5   4,335      21,675       167.7      10.3      00:33:38
  6273       6   4,335      26,010       173.1      10.6      00:33:52
  6457       9   4,335      39,015       178.0      10.9      00:34:11
  6640       8   4,335      34,680       183.0      11.2      00:34:29
  6783       5   4,335      21,675       186.9      11.4      00:34:58
  6920       6   4,335      26,010       190.8      11.7      00:35:25
  7099       7   4,335      30,345       195.7      12.0      00:35:39
  7292       7   4,335      30,345       200.9      12.3      00:35:48
  7474       8   4,335      34,680       206.2      12.6      00:35:55
  7653       9   4,335      39,015       211.3      12.9      00:36:03
  7849       7   4,335      30,345       216.9      13.3      00:36:04
  8027       9   4,335      39,015       222.3      13.6      00:36:07
  8182       6   4,335      26,010       226.9      13.9      00:36:18
  8360       6   4,335      26,010       232.2      14.2      00:36:22
  8535       8   4,335      34,680       237.5      14.5      00:36:25
  8731       9   4,335      39,015       243.1      14.9      00:36:23
  8909      10   4,335      43,350       248.4      15.2      00:36:24
  9103       4   4,335      17,340       254.1      15.5      00:36:21
  9249      10   4,335      43,350       258.5      15.8      00:36:31
  9364      10   4,335      43,350       261.9      16.0      00:36:50
  9433       9   4,335      39,015       263.9      16.1      00:37:22
  9580       8   4,335      34,680       268.4      16.4      00:37:29
  9703       5   4,335      21,675       272.2      16.6      00:37:41
  9849       5   4,335      21,675       276.4      16.9      00:37:50
 10001       3   4,335      13,005       280.6      17.2      00:37:57
 10141      10   4,335      43,350       284.2      17.4      00:38:10
 10290       5   4,335      21,675       288.1      17.6      00:38:19
 10411      10   4,335      43,350       291.6      17.8      00:38:32
 10563       7   4,335      30,345       295.8      18.1      00:38:38
 10682       8   4,335      34,680       299.1      18.3      00:38:51
 10842       9   4,335      39,015       303.6      18.6      00:38:53
 10996       8   4,335      34,680       308.0      18.8      00:38:56
 11153       3   4,335      13,005       312.3      19.1      00:38:58
 11273       7   4,335      30,345       315.6      19.3      00:39:10
 11403       5   4,335      21,675       319.4      19.5      00:39:17
 11534       5   4,335      21,675       323.1      19.8      00:39:24
 11682       7   4,335      30,345       327.3      20.0      00:39:27
 11814       5   4,335      21,675       331.1      20.2      00:39:32
 11953       6   4,335      26,010       334.9      20.5      00:39:37
 12064       6   4,335      26,010       338.2      20.7      00:39:46
 12190       8   4,335      34,680       341.9      20.9      00:39:52
 12343       5   4,335      21,675       346.1      21.2      00:39:52
 12590       7   4,335      30,345       353.0      21.6      00:39:29
 12845       9   4,335      39,015       360.0      22.0      00:39:06
 13091       8   4,335      34,680       366.9      22.4      00:38:44
 13288       9   4,335      39,015       372.5      22.8      00:38:33
 13525       8   4,335      34,680       379.8      23.2      00:38:09
 13675       3   4,335      13,005       384.2      23.5      00:38:07
 13826       8   4,335      34,680       388.3      23.7      00:38:08
 13989       6   4,335      26,010       392.9      24.0      00:38:05
 14193       9   4,335      39,015       398.8      24.4      00:37:51
 14361       9   4,335      39,015       403.9      24.7      00:37:44
 14543       5   4,335      21,675       409.1      25.0      00:37:36
 14724       6   4,335      26,010       414.2      25.3      00:37:28
 14876       3   4,335      13,005       418.6      25.6      00:37:26
 15090       9   4,335      39,015       425.0      26.0      00:37:09
 15331       7   4,335      30,345       432.1      26.4      00:36:48
 15561       6   4,335      26,010       438.6      26.8      00:36:30
 15772       6   4,335      26,010       444.8      27.2      00:36:16
 15969       5   4,335      21,675       450.7      27.6      00:36:03
 16198       7   4,335      30,345       457.6      28.0      00:35:43
 16416      10   4,335      43,350       464.2      28.4      00:35:26
 16601       7   4,335      30,345       469.4      28.7      00:35:18
 16780       4   4,335      17,340       474.7      29.0      00:35:10
 16915       8   4,335      34,680       478.5      29.3      00:35:10
 17047       9   4,335      39,015       482.4      29.5      00:35:10
 17181       4   4,335      17,340       486.2      29.7      00:35:11
 17312       9   4,335      39,015       490.1      30.0      00:35:10
 17438       5   4,335      21,675       493.9      30.2      00:35:10
 17567       8   4,335      34,680       497.9      30.4      00:35:08
 17725       3   4,335      13,005       502.4      30.7      00:35:04
 17892       5   4,335      21,675       507.2      31.0      00:34:58
 18064       6   4,335      26,010       512.2      31.3      00:34:50
 18326       7   4,335      30,345       519.9      31.8      00:34:27
 18522       9   4,335      39,015       525.2      32.1      00:34:17
 18635       7   4,335      30,345       528.7      32.3      00:34:18
 18760       7   4,335      30,345       532.4      32.6      00:34:17
 18869       8   4,335      34,680       535.6      32.7      00:34:20
 19004       6   4,335      26,010       539.8      33.0      00:34:17
 19163      10   4,335      43,350       544.5      33.3      00:34:10
 19294       9   4,335      39,015       548.4      33.5      00:34:08
 19462      10   4,335      43,350       553.4      33.8      00:34:00
 19644      10   4,335      43,350       558.9      34.2      00:33:49
 19857       9   4,335      39,015       565.4      34.6      00:33:32
 20053       5   4,335      21,675       571.5      34.9      00:33:18
 20257      10   4,335      43,350       577.4      35.3      00:33:05
 20476       8   4,335      34,680       583.9      35.7      00:32:49
 20620       6   4,335      26,010       588.2      36.0      00:32:45
 20766       7   4,335      30,345       592.4      36.2      00:32:40
 20904       7   4,335      30,345       596.6      36.5      00:32:36
 21059       6   4,335      26,010       601.0      36.7      00:32:31
 21230       5   4,335      21,675       605.4      37.0      00:32:26
 21401       7   4,335      30,345       609.9      37.3      00:32:20
 21583       6   4,335      26,010       615.1      37.6      00:32:10
 21787       6   4,335      26,010       620.4      37.9      00:32:00
 21973       9   4,335      39,015       625.7      38.3      00:31:50
 22139       6   4,335      26,010       630.0      38.5      00:31:45
 22296       7   4,335      30,345       634.3      38.8      00:31:40
 22434      10   4,335      43,350       638.0      39.0      00:31:38
 22548       6   4,335      26,010       641.2      39.2      00:31:38
 22715       3   4,335      13,005       645.7      39.5      00:31:31
 22931       7   4,335      30,345       651.4      39.8      00:31:19
 23163       9   4,335      39,015       658.2      40.2      00:31:02
 23408       7   4,335      30,345       665.2      40.7      00:30:44
 23654       6   4,335      26,010       671.7      41.1      00:30:28
 23876       8   4,335      34,680       678.2      41.5      00:30:12
 24126       9   4,335      39,015       685.1      41.9      00:29:56
 24352       3   4,335      13,005       691.0      42.2      00:29:43
 24529      10   4,335      43,350       696.2      42.6      00:29:33
 24723       9   4,335      39,015       702.0      42.9      00:29:21
 24935       7   4,335      30,345       707.8      43.3      00:29:09
 25161       9   4,335      39,015       714.4      43.7      00:28:53
 25399       2   4,335       8,670       721.3      44.1      00:28:37
 25583       9   4,335      39,015       726.4      44.4      00:28:27
 25749       9   4,335      39,015       731.4      44.7      00:28:19
 25928       7   4,335      30,345       736.5      45.0      00:28:10
 26075       8   4,335      34,680       740.8      45.3      00:28:04
 26201       4   4,335      17,340       744.4      45.5      00:28:01
 26412       9   4,335      39,015       750.3      45.9      00:27:49
 26622       8   4,335      34,680       756.1      46.2      00:27:37
 26797       7   4,335      30,345       761.1      46.5      00:27:28
 26982       6   4,335      26,010       766.5      46.9      00:27:18
 27142       8   4,335      34,680       771.0      47.1      00:27:11
 27274       8   4,335      34,680       774.7      47.4      00:27:07
 27409       9   4,335      39,015       778.6      47.6      00:27:03
 27582       8   4,335      34,680       783.6      47.9      00:26:54
 27783       9   4,335      39,015       789.5      48.3      00:26:42
 27983      10   4,335      43,350       795.4      48.6      00:26:29
 28192       9   4,335      39,015       801.4      49.0      00:26:16
 28399       6   4,335      26,010       807.6      49.4      00:26:03
 28607       8   4,335      34,680       814.0      49.8      00:25:49
 28728       5   4,335      21,675       817.6      50.0      00:25:45
 28855       8   4,335      34,680       821.4      50.2      00:25:41
 29011      10   4,335      43,350       826.0      50.5      00:25:34
 29180       7   4,335      30,345       830.8      50.8      00:25:25
 29340       7   4,335      30,345       835.5      51.1      00:25:18
 29511       6   4,335      26,010       840.4      51.4      00:25:09
 29671       8   4,335      34,680       845.0      51.7      00:25:02
 29799       6   4,335      26,010       848.8      51.9      00:24:57
 29944       6   4,335      26,010       853.0      52.1      00:24:51
 30091       9   4,335      39,015       857.3      52.4      00:24:44
 30209       5   4,335      21,675       860.8      52.6      00:24:40
 30379       6   4,335      26,010       865.7      52.9      00:24:32
 30514       7   4,335      30,345       870.0      53.2      00:24:25
 30703       7   4,335      30,345       875.4      53.5      00:24:14
 30926       9   4,335      39,015       882.1      53.9      00:23:60
 31141       9   4,335      39,015       888.3      54.3      00:23:46
 31356       9   4,335      39,015       894.7      54.7      00:23:32
 31568       6   4,335      26,010       901.1      55.1      00:23:18
 31777       8   4,335      34,680       907.5      55.5      00:23:04
 32014       4   4,335      17,340       914.8      55.9      00:22:47
 32243       5   4,335      21,675       921.8      56.4      00:22:31
 32417       8   4,335      34,680       927.2      56.7      00:22:21
 32552       7   4,335      30,345       931.2      56.9      00:22:16
 32668       9   4,335      39,015       934.6      57.1      00:22:12
 32786      10   4,335      43,350       938.2      57.4      00:22:07
 32922       7   4,335      30,345       942.2      57.6      00:22:01
 33045       6   4,335      26,010       946.0      57.8      00:21:56
 33194       6   4,335      26,010       950.4      58.1      00:21:49
 33356       5   4,335      21,675       955.2      58.4      00:21:40
 33506       8   4,335      34,680       959.8      58.7      00:21:33
 33677      10   4,335      43,350       965.0      59.0      00:21:22
 33833       9   4,335      39,015       969.7      59.3      00:21:14
 34018       4   4,335      17,340       975.2      59.6      00:21:03
 34177       8   4,335      34,680       980.3      59.9      00:20:54
 34433       4   4,335      17,340       987.9      60.4      00:20:36
 34668      10   4,335      43,350       995.0      60.8      00:20:20
 34907       6   4,335      26,010     1,002.4      61.3      00:20:04
 35137       9   4,335      39,015     1,009.2      61.7      00:19:49
 35360       8   4,335      34,680     1,015.9      62.1      00:19:35
 35574       6   4,335      26,010     1,022.4      62.5      00:19:21
 35808       5   4,335      21,675     1,029.2      62.9      00:19:06
 36042      10   4,335      43,350     1,036.2      63.3      00:18:51
 36256       7   4,335      30,345     1,042.7      63.7      00:18:38
 36487       4   4,335      17,340     1,049.5      64.2      00:18:23
 36637       5   4,335      21,675     1,054.1      64.4      00:18:16
 36778       4   4,335      17,340     1,057.9      64.7      00:18:10
 36958       4   4,335      17,340     1,063.2      65.0      00:18:00
 37143      10   4,335      43,350     1,068.3      65.3      00:17:51
 37296      10   4,335      43,350     1,072.4      65.6      00:17:44
 37455       9   4,335      39,015     1,076.9      65.8      00:17:37
 37601       4   4,335      17,340     1,081.1      66.1      00:17:30
 37773      10   4,335      43,350     1,085.8      66.4      00:17:21
 37932       6   4,335      26,010     1,090.4      66.7      00:17:13
 38114       6   4,335      26,010     1,095.8      67.0      00:17:03
 38283       7   4,335      30,345     1,100.8      67.3      00:16:54
 38462       6   4,335      26,010     1,106.3      67.6      00:16:43
 38700       8   4,335      34,680     1,113.3      68.1      00:16:28
 38928       6   4,335      26,010     1,119.9      68.5      00:16:15
 39030       9   4,335      39,015     1,122.9      68.7      00:16:11
 39111      10   4,335      43,350     1,125.2      68.8      00:16:09
 39256       8   4,335      34,680     1,129.2      69.0      00:16:03
 39400       6   4,335      26,010     1,133.3      69.3      00:15:56
 39565       5   4,335      21,675     1,138.1      69.6      00:15:47
 39746       6   4,335      26,010     1,143.2      69.9      00:15:38
 39940      10   4,335      43,350     1,148.8      70.2      00:15:27
 40176      10   4,335      43,350     1,155.6      70.6      00:15:13
 40408       7   4,335      30,345     1,162.3      71.1      00:14:59
 40634       5   4,335      21,675     1,169.0      71.5      00:14:45
 40853       5   4,335      21,675     1,175.4      71.9      00:14:32
 41016      10   4,335      43,350     1,180.4      72.2      00:14:23
 41128       9   4,335      39,015     1,183.6      72.4      00:14:18
 41294       9   4,335      39,015     1,188.5      72.7      00:14:09
 41439       7   4,335      30,345     1,192.8      72.9      00:14:02
 41591       7   4,335      30,345     1,197.2      73.2      00:13:54
 41743       7   4,335      30,345     1,201.7      73.5      00:13:46
 41928       9   4,335      39,015     1,207.3      73.8      00:13:35
 42070       5   4,335      21,675     1,211.0      74.0      00:13:29
 42232      10   4,335      43,350     1,215.5      74.3      00:13:21
 42401       9   4,335      39,015     1,220.4      74.6      00:13:12
 42547       4   4,335      17,340     1,224.5      74.9      00:13:05
 42679       9   4,335      39,015     1,228.3      75.1      00:12:58
 42819       9   4,335      39,015     1,232.4      75.3      00:12:51
 42934       7   4,335      30,345     1,235.7      75.5      00:12:46
 43059       6   4,335      26,010     1,239.5      75.8      00:12:40
 43204       6   4,335      26,010     1,244.0      76.1      00:12:32
 43364      10   4,335      43,350     1,248.7      76.3      00:12:23
 43545       4   4,335      17,340     1,253.8      76.7      00:12:13
 43798      10   4,335      43,350     1,261.1      77.1      00:11:58
 44048       9   4,335      39,015     1,268.3      77.5      00:11:43
 44250       8   4,335      34,680     1,274.1      77.9      00:11:32
 44400       6   4,335      26,010     1,278.1      78.1      00:11:25
 44556       6   4,335      26,010     1,282.7      78.4      00:11:16
 44757       5   4,335      21,675     1,288.5      78.8      00:11:05
 44940       6   4,335      26,010     1,293.9      79.1      00:10:54
 45128       6   4,335      26,010     1,299.1      79.4      00:10:44
 45336       5   4,335      21,675     1,304.6      79.8      00:10:34
 45470       6   4,335      26,010     1,308.4      80.0      00:10:27
 45616       9   4,335      39,015     1,312.3      80.2      00:10:20
 45776       5   4,335      21,675     1,316.7      80.5      00:10:12
 45919       5   4,335      21,675     1,320.8      80.7      00:10:05
 46046       7   4,335      30,345     1,324.5      81.0      00:09:58
 46192      10   4,335      43,350     1,328.9      81.2      00:09:50
 46351       6   4,335      26,010     1,333.6      81.5      00:09:42
 46486       6   4,335      26,010     1,337.4      81.8      00:09:35
 46673       8   4,335      34,680     1,343.0      82.1      00:09:24
 46889       4   4,335      17,340     1,349.3      82.5      00:09:11
 47123       1   4,335       4,335     1,355.4      82.9      00:08:59
 47322       5   4,335      21,675     1,360.9      83.2      00:08:49
 47524       6   4,335      26,010     1,366.4      83.5      00:08:38
 47680       8   4,335      34,680     1,371.0      83.8      00:08:29
 47802       7   4,335      30,345     1,374.4      84.0      00:08:23
 47978      10   4,335      43,350     1,379.6      84.3      00:08:13
 48188       7   4,335      30,345     1,385.5      84.7      00:08:02
 48469       8   4,335      34,680     1,393.8      85.2      00:07:45
 48840       9   4,335      39,015     1,404.4      85.9      00:07:23
 49109      10   4,335      43,350     1,412.2      86.3      00:07:07
 49397      10   4,335      43,350     1,420.3      86.8      00:06:51
 49692       6   4,335      26,010     1,428.2      87.3      00:06:35
 49953       8   4,335      34,680     1,435.6      87.8      00:06:20
 50234       9   4,335      39,015     1,443.5      88.2      00:06:05
 50502       9   4,335      39,015     1,450.9      88.7      00:05:50
 50769      10   4,335      43,350     1,458.7      89.2      00:05:35
 51015       6   4,335      26,010     1,466.2      89.6      00:05:20
 51289       5   4,335      21,675     1,474.0      90.1      00:05:05
 51569       9   4,335      39,015     1,482.3      90.6      00:04:49
 51827       9   4,335      39,015     1,490.2      91.1      00:04:33
 51957       8   4,335      34,680     1,494.0      91.3      00:04:26
 52245       7   4,335      30,345     1,502.9      91.9      00:04:09
 52628       5   4,335      21,675     1,515.1      92.6      00:03:45
 52998      10   4,335      43,350     1,526.5      93.3      00:03:23
 53415       8   4,335      34,680     1,539.0      94.1      00:02:59
 53800       8   4,335      34,680     1,550.5      94.8      00:02:37
 54134       5   4,335      21,675     1,560.1      95.4      00:02:19
 54428       9   4,335      39,015     1,568.3      95.9      00:02:04
 54799       6   4,335      26,010     1,578.6      96.5      00:01:44
 55155       6   4,335      26,010     1,588.8      97.1      00:01:26
 55473       6   4,335      26,010     1,597.5      97.7      00:01:09
 55771      10   4,335      43,350     1,605.9      98.2      00:00:54
 56093       6   4,335      26,010     1,615.5      98.8      00:00:37
 56420       8   4,335      34,680     1,625.4      99.4      00:00:19

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 2954.507
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
