
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A600_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   312      10   4,635      46,350         8.2       0.5      00:35:27
   671       6   4,635      27,810        18.1       1.0      00:32:01
  1031       6   4,635      27,810        28.4       1.6      00:30:21
  1383       6   4,635      27,810        39.1       2.2      00:29:13
  1741       6   4,635      27,810        50.1       2.9      00:28:21
  2122       5   4,635      23,175        61.2       3.5      00:27:39
  2474       5   4,635      23,175        71.5       4.1      00:27:26
  2831       7   4,635      32,445        82.4       4.7      00:27:02
  3175       6   4,635      27,810        92.7       5.3      00:26:52
  3517       7   4,635      32,445       103.3       5.9      00:26:36
  3877      10   4,635      46,350       114.2       6.5      00:26:18
  4156       8   4,635      37,080       122.2       7.0      00:26:41
  4451       1   4,635       4,635       130.6       7.5      00:26:54
  4730       8   4,635      37,080       139.4       8.0      00:27:00
  4974       6   4,635      27,810       146.6       8.4      00:27:23
  5212      10   4,635      46,350       153.8       8.8      00:27:44
  5441       6   4,635      27,810       160.7       9.2      00:28:05
  5683       8   4,635      37,080       167.2       9.6      00:28:27
  5942       7   4,635      32,445       174.9      10.0      00:28:35
  6233       8   4,635      37,080       183.7      10.5      00:28:29
  6508       6   4,635      27,810       191.6      10.9      00:28:31
  6776      10   4,635      46,350       199.4      11.4      00:28:34
  7094       9   4,635      41,715       208.9      11.9      00:28:21
  7456       8   4,635      37,080       219.7      12.6      00:27:55
  7818       7   4,635      32,445       230.7      13.2      00:27:29
  8151       6   4,635      27,810       241.4      13.8      00:27:08
  8474       7   4,635      32,445       251.7      14.4      00:26:51
  8821       9   4,635      41,715       262.5      15.0      00:26:30
  9175      10   4,635      46,350       273.9      15.6      00:26:06
  9467       4   4,635      18,540       283.0      16.2      00:25:58
  9775       9   4,635      41,715       293.1      16.7      00:25:44
 10072       3   4,635      13,905       301.9      17.3      00:25:38
 10368       6   4,635      27,810       310.3      17.7      00:25:34
 10630       9   4,635      41,715       318.0      18.2      00:25:34
 10968       5   4,635      23,175       328.3      18.8      00:25:19
 11264       2   4,635       9,270       337.0      19.3      00:25:12
 11523       5   4,635      23,175       345.0      19.7      00:25:09
 11809       9   4,635      41,715       353.6      20.2      00:25:04
 12056      10   4,635      46,350       361.2      20.6      00:25:03
 12321      10   4,635      46,350       369.2      21.1      00:24:59
 12672       6   4,635      27,810       379.8      21.7      00:24:42
 13014       4   4,635      18,540       389.7      22.3      00:24:29
 13363       5   4,635      23,175       400.4      22.9      00:24:12
 13639      10   4,635      46,350       409.5      23.4      00:24:03
 13898       8   4,635      37,080       417.2      23.8      00:24:00
 14169       7   4,635      32,445       425.4      24.3      00:23:55
 14453       6   4,635      27,810       434.4      24.8      00:23:46
 14738       9   4,635      41,715       443.1      25.3      00:23:39
 15078       8   4,635      37,080       453.8      25.9      00:23:22
 15487       6   4,635      27,810       466.5      26.7      00:22:58
 15910       6   4,635      27,810       479.7      27.4      00:22:33
 16292       9   4,635      41,715       492.1      28.1      00:22:12
 16639       5   4,635      23,175       502.8      28.7      00:21:57
 16923       3   4,635      13,905       511.6      29.2      00:21:50
 17181       9   4,635      41,715       519.5      29.7      00:21:45
 17422       7   4,635      32,445       527.3      30.1      00:21:41
 17639       8   4,635      37,080       534.4      30.5      00:21:39
 17969       5   4,635      23,175       544.3      31.1      00:21:27
 18279       6   4,635      27,810       554.1      31.7      00:21:16
 18555       7   4,635      32,445       562.3      32.1      00:21:10
 18786       7   4,635      32,445       569.8      32.6      00:21:06
 19084      10   4,635      46,350       579.4      33.1      00:20:55
 19403       9   4,635      41,715       589.5      33.7      00:20:42
 19772       7   4,635      32,445       601.6      34.4      00:20:24
 20147       5   4,635      23,175       613.8      35.1      00:20:05
 20527       8   4,635      37,080       625.6      35.7      00:19:48
 20777       7   4,635      32,445       633.5      36.2      00:19:43
 21032       4   4,635      18,540       641.5      36.7      00:19:37
 21342      10   4,635      46,350       650.0      37.1      00:19:30
 21603       8   4,635      37,080       658.0      37.6      00:19:24
 21886       6   4,635      27,810       666.1      38.1      00:19:18
 22176       7   4,635      32,445       674.4      38.5      00:19:11
 22441       9   4,635      41,715       682.1      39.0      00:19:05
 22696       3   4,635      13,905       689.7      39.4      00:18:60
 22982       9   4,635      41,715       697.8      39.9      00:18:53
 23273       7   4,635      32,445       707.0      40.4      00:18:43
 23567       5   4,635      23,175       715.4      40.9      00:18:36
 23856      10   4,635      46,350       724.4      41.4      00:18:27
 24174       5   4,635      23,175       733.7      41.9      00:18:17
 24558       6   4,635      27,810       745.0      42.6      00:18:01
 24956      10   4,635      46,350       757.1      43.3      00:17:44
 25331       4   4,635      18,540       768.8      43.9      00:17:29
 25685       8   4,635      37,080       779.5      44.5      00:17:15
 25965       5   4,635      23,175       788.3      45.0      00:17:07
 26214       7   4,635      32,445       796.1      45.5      00:17:01
 26501       6   4,635      27,810       804.6      46.0      00:16:53
 26795      10   4,635      46,350       813.4      46.5      00:16:44
 27062       1   4,635       4,635       821.6      46.9      00:16:36
 27254       9   4,635      41,715       827.3      47.3      00:16:35
 27443       3   4,635      13,905       833.1      47.6      00:16:33
 27633       4   4,635      18,540       839.0      47.9      00:16:30
 27867       7   4,635      32,445       846.4      48.4      00:16:24
 28161       7   4,635      32,445       855.6      48.9      00:16:14
 28463       7   4,635      32,445       865.2      49.4      00:16:03
 28752      10   4,635      46,350       874.5      50.0      00:15:53
 29004       6   4,635      27,810       882.5      50.4      00:15:46
 29292       7   4,635      32,445       891.3      50.9      00:15:36
 29626       7   4,635      32,445       901.7      51.5      00:15:24
 29905       4   4,635      18,540       910.4      52.0      00:15:15
 30168       8   4,635      37,080       918.7      52.5      00:15:07
 30488       7   4,635      32,445       928.9      53.1      00:14:55
 30838       8   4,635      37,080       940.1      53.7      00:14:41
 31219       6   4,635      27,810       951.9      54.4      00:14:25
 31587       8   4,635      37,080       963.7      55.1      00:14:10
 31950       8   4,635      37,080       975.6      55.7      00:13:55
 32295       9   4,635      41,715       986.8      56.4      00:13:41
 32566       9   4,635      41,715       995.6      56.9      00:13:32
 32762       6   4,635      27,810     1,001.9      57.2      00:13:28
 32988       8   4,635      37,080     1,009.2      57.7      00:13:22
 33253       4   4,635      18,540     1,017.6      58.1      00:13:13
 33541       6   4,635      27,810     1,026.9      58.7      00:13:03
 33833       5   4,635      23,175     1,036.4      59.2      00:12:53
 34140       4   4,635      18,540     1,046.4      59.8      00:12:41
 34475       9   4,635      41,715     1,057.2      60.4      00:12:29
 34790       5   4,635      23,175     1,067.5      61.0      00:12:17
 35140       8   4,635      37,080     1,078.6      61.6      00:12:03
 35546      10   4,635      46,350     1,091.9      62.4      00:11:47
 35961       8   4,635      37,080     1,105.0      63.1      00:11:30
 36335       5   4,635      23,175     1,117.1      63.8      00:11:16
 36676       2   4,635       9,270     1,127.9      64.4      00:11:03
 36981       8   4,635      37,080     1,137.2      65.0      00:10:53
 37299      10   4,635      46,350     1,146.5      65.5      00:10:44
 37586       8   4,635      37,080     1,155.1      66.0      00:10:35
 37862       6   4,635      27,810     1,163.3      66.5      00:10:27
 38118       8   4,635      37,080     1,171.4      66.9      00:10:19
 38383       9   4,635      41,715     1,179.8      67.4      00:10:10
 38720       6   4,635      27,810     1,190.5      68.0      00:09:58
 39079      10   4,635      46,350     1,201.7      68.7      00:09:45
 39351       8   4,635      37,080     1,210.0      69.1      00:09:37
 39676       5   4,635      23,175     1,219.8      69.7      00:09:26
 40070       8   4,635      37,080     1,231.9      70.4      00:09:12
 40500       7   4,635      32,445     1,245.3      71.2      00:08:56
 40890       7   4,635      32,445     1,257.6      71.9      00:08:42
 41210       8   4,635      37,080     1,267.7      72.4      00:08:31
 41518       8   4,635      37,080     1,277.4      73.0      00:08:21
 41812       8   4,635      37,080     1,286.6      73.5      00:08:11
 42071       2   4,635       9,270     1,294.5      74.0      00:08:03
 42394       6   4,635      27,810     1,304.1      74.5      00:07:53
 42710       9   4,635      41,715     1,313.9      75.1      00:07:42
 43016       5   4,635      23,175     1,323.4      75.6      00:07:32
 43285      10   4,635      46,350     1,332.2      76.1      00:07:23
 43543       8   4,635      37,080     1,340.3      76.6      00:07:15
 43843      10   4,635      46,350     1,349.3      77.1      00:07:06
 44168       9   4,635      41,715     1,359.2      77.7      00:06:55
 44467       7   4,635      32,445     1,368.3      78.2      00:06:45
 44813      10   4,635      46,350     1,379.0      78.8      00:06:34
 45135       7   4,635      32,445     1,389.0      79.4      00:06:23
 45450      10   4,635      46,350     1,398.0      79.9      00:06:13
 45769       5   4,635      23,175     1,407.3      80.4      00:06:04
 46065       5   4,635      23,175     1,416.5      80.9      00:05:54
 46372       8   4,635      37,080     1,426.2      81.5      00:05:44
 46726       9   4,635      41,715     1,437.3      82.1      00:05:31
 47071       7   4,635      32,445     1,447.5      82.7      00:05:20
 47382       6   4,635      27,810     1,456.6      83.2      00:05:11
 47708      10   4,635      46,350     1,466.5      83.8      00:05:00
 48025       7   4,635      32,445     1,476.2      84.3      00:04:50
 48328      10   4,635      46,350     1,485.5      84.9      00:04:40
 48678       5   4,635      23,175     1,496.3      85.5      00:04:28
 48995       6   4,635      27,810     1,506.1      86.1      00:04:18
 49316      10   4,635      46,350     1,516.1      86.6      00:04:07
 49641      10   4,635      46,350     1,525.3      87.2      00:03:58
 49935       8   4,635      37,080     1,533.9      87.6      00:03:49
 50245      10   4,635      46,350     1,543.4      88.2      00:03:39
 50539       9   4,635      41,715     1,552.0      88.7      00:03:30
 50866       8   4,635      37,080     1,562.2      89.3      00:03:19
 51178       7   4,635      32,445     1,572.1      89.8      00:03:08
 51558      10   4,635      46,350     1,584.0      90.5      00:02:55
 51925      10   4,635      46,350     1,595.9      91.2      00:02:43
 52251       8   4,635      37,080     1,606.7      91.8      00:02:31
 52653       5   4,635      23,175     1,620.2      92.6      00:02:17
 53059       8   4,635      37,080     1,633.7      93.3      00:02:02
 53494       7   4,635      32,445     1,647.6      94.1      00:01:47
 53859       8   4,635      37,080     1,659.2      94.8      00:01:35
 54134      10   4,635      46,350     1,667.6      95.3      00:01:26
 54391       8   4,635      37,080     1,675.6      95.7      00:01:18
 54753       5   4,635      23,175     1,686.2      96.3      00:01:07
 55087       7   4,635      32,445     1,696.3      96.9      00:00:56
 55364       4   4,635      18,540     1,704.4      97.4      00:00:48
 55655       6   4,635      27,810     1,713.0      97.9      00:00:39
 55892       6   4,635      27,810     1,720.5      98.3      00:00:31
 56195      10   4,635      46,350     1,730.1      98.9      00:00:21
 56520       6   4,635      27,810     1,740.6      99.5      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,750.1        Number of regions         = 56,821    
Computed distances (M)  = 1,750.13       Total run time (seconds)  = 1841.205
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
