
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_1_4q_mnl_flexthresh2_3_15.dta /export/storage_covidvaccin
> e/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_t
> otal_10000_1_4q_mnl_flexthresh2_3_15.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 09:25:22

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_1_4q_mnl_flexthresh2_3_15.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_1_4q_mnl_flexthresh2_3_15.dta /export/storage_covidvaccin
> e/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_t
> otal_10000_1_4q_mnl_flexthresh2_3_15.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
. use "`baselocs'", clear

. 
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 09:25:22

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_1_4q_mnl_flexthresh2_3_15.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. ds
latitude   longitude  blkid

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   491       5   4,035      20,175        11.3       0.7      00:22:14
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   514       8   4,035      32,280        11.9       0.8      00:21:10
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   519       8   4,035      32,280        12.1       0.8      00:20:56
  1012       6   4,035      24,210        24.2       1.6      00:20:40
  1076       9   4,035      36,315        26.0       1.7      00:19:14
  1060       5   4,035      20,175        25.5       1.7      00:19:35
  1508       4   4,035      16,140        37.4       2.5      00:19:51
  1588       6   4,035      24,210        39.6       2.6      00:18:46
  1581       8   4,035      32,280        39.4       2.6      00:18:52
  2018       8   4,035      32,280        50.5       3.3      00:19:27
  2121       8   4,035      32,280        53.2       3.5      00:18:26
  2135       9   4,035      36,315        53.6       3.5      00:18:19
  2514       9   4,035      36,315        63.2       4.1      00:19:16
  2699       7   4,035      28,245        68.1       4.5      00:17:50
  2691       5   4,035      20,175        67.8       4.5      00:17:55
  3024       6   4,035      24,210        76.5       5.0      00:18:57
  3213       7   4,035      28,245        81.7       5.4      00:17:40
  3188       7   4,035      28,245        81.0       5.3      00:17:50
  3517       7   4,035      28,245        89.9       5.9      00:18:37
  3704       7   4,035      28,245        94.9       6.2      00:17:34
  3698       8   4,035      32,280        94.8       6.2      00:17:37
  3981      10   4,035      40,350       101.9       6.7      00:18:37
  4125       3   4,035      12,105       105.6       6.9      00:17:55
  4152       4   4,035      16,140       106.3       7.0      00:17:48
  4344       6   4,035      24,210       111.0       7.3      00:19:06
  4503       8   4,035      32,280       115.2       7.6      00:18:22
  4565       9   4,035      36,315       116.8       7.7      00:18:05
  4670       4   4,035      16,140       119.7       7.9      00:19:34
  4868       7   4,035      28,245       124.9       8.2      00:18:41
  4923       8   4,035      32,280       126.3       8.3      00:18:27
  5023       8   4,035      32,280       128.9       8.5      00:19:51
  5303       6   4,035      24,210       136.1       8.9      00:18:42
  5238       8   4,035      32,280       134.5       8.8      00:18:57
  5389       8   4,035      32,280       138.6       9.1      00:20:00
  5645       7   4,035      28,245       144.6       9.5      00:19:05
  5593       6   4,035      24,210       143.4       9.4      00:19:16
  5715      10   4,035      40,350       146.4       9.6      00:20:24
  6013      10   4,035      40,350       154.1      10.1      00:19:16
  5943       8   4,035      32,280       152.3      10.0      00:19:32
  6054       8   4,035      32,280       155.3      10.2      00:20:35
  6423       4   4,035      16,140       164.6      10.8      00:19:17
  6332       4   4,035      16,140       162.4      10.7      00:19:35
  6440       4   4,035      16,140       165.1      10.8      00:20:36
  6770       5   4,035      20,175       173.5      11.4      00:19:29
  6667       6   4,035      24,210       170.8      11.2      00:19:49
  6805       8   4,035      32,280       174.4      11.4      00:20:40
  7153       1   4,035       4,035       183.2      12.0      00:19:32
  6998      10   4,035      40,350       179.3      11.8      00:20:01
  7211       9   4,035      36,315       184.7      12.1      00:20:34
  7616       5   4,035      20,175       195.5      12.8      00:19:16
  7420       6   4,035      24,210       190.3      12.5      00:19:52
  7683       9   4,035      36,315       197.2      12.9      00:20:12
  8059       9   4,035      36,315       207.6      13.6      00:19:02
  7833      10   4,035      40,350       201.2      13.2      00:19:44
  8157       9   4,035      36,315       210.3      13.8      00:19:48
  8477       5   4,035      20,175       219.2      14.4      00:18:52
  8237       7   4,035      28,245       212.6      14.0      00:19:33
  8636       6   4,035      24,210       223.6      14.7      00:19:24
  8895       8   4,035      32,280       230.6      15.1      00:18:42
  8638       8   4,035      32,280       223.6      14.7      00:19:24
  9125       8   4,035      32,280       237.0      15.6      00:19:02
  9286      10   4,035      40,350       241.5      15.8      00:18:36
  9055      10   4,035      40,350       235.0      15.4      00:19:13
  9424       8   4,035      32,280       245.2      16.1      00:19:09
  9616       8   4,035      32,280       250.7      16.5      00:18:38
  9401       7   4,035      28,245       244.5      16.1      00:19:12
  9800       7   4,035      28,245       255.8      16.8      00:19:01
  9999      10   4,035      40,350       261.0      17.1      00:18:34
  9707       6   4,035      24,210       253.2      16.6      00:19:15
 10162      10   4,035      40,350       264.9      17.4      00:19:02
 10371       6   4,035      24,210       270.2      17.7      00:18:35
 10032       9   4,035      36,315       261.8      17.2      00:19:18
 10758       7   4,035      28,245       280.2      18.4      00:18:31
 10500       8   4,035      32,280       273.7      18.0      00:19:03
 10399       5   4,035      20,175       270.9      17.8      00:19:17
 10889      10   4,035      40,350       283.7      18.6      00:18:58
 11150       8   4,035      32,280       290.4      19.1      00:18:25
 10809       6   4,035      24,210       281.5      18.5      00:19:09
 11457       6   4,035      24,210       298.6      19.6      00:18:29
 11238      10   4,035      40,350       292.8      19.2      00:18:57
 11221       7   4,035      28,245       292.4      19.2      00:18:58
 11526       3   4,035      12,105       300.4      19.7      00:19:02
 11774       6   4,035      24,210       306.8      20.1      00:18:32
 11567       7   4,035      28,245       301.4      19.8      00:18:57
 11909       3   4,035      12,105       310.5      20.4      00:18:55
 12112       7   4,035      28,245       315.9      20.7      00:18:30
 11915       7   4,035      28,245       310.6      20.4      00:18:54
 12305       6   4,035      24,210       321.0      21.1      00:18:46
 12490      10   4,035      40,350       325.8      21.4      00:18:24
 12227       7   4,035      28,245       319.0      20.9      00:18:54
 12770       3   4,035      12,105       333.0      21.9      00:18:30
 12961       6   4,035      24,210       337.8      22.2      00:18:10
 12639       7   4,035      28,245       329.8      21.6      00:18:44
 13224       6   4,035      24,210       344.9      22.6      00:18:15
 13417      10   4,035      40,350       350.0      23.0      00:17:54
 13108       9   4,035      36,315       341.8      22.4      00:18:28
 13634       4   4,035      16,140       356.3      23.4      00:18:02
 13762       3   4,035      12,105       359.6      23.6      00:17:50
 13532       6   4,035      24,210       353.5      23.2      00:18:14
 14023       1   4,035       4,035       366.3      24.0      00:17:55
 14105       4   4,035      16,140       368.6      24.2      00:17:47
 13833       6   4,035      24,210       361.5      23.7      00:18:15
 14414      10   4,035      40,350       377.1      24.8      00:17:46
 14508       7   4,035      28,245       379.7      24.9      00:17:36
 14240       7   4,035      28,245       372.3      24.4      00:18:04
 14804       7   4,035      28,245       387.6      25.4      00:17:37
 14923       9   4,035      36,315       390.7      25.6      00:17:25
 14633       8   4,035      32,280       383.0      25.1      00:17:54
 15288       5   4,035      20,175       400.8      26.3      00:17:18
 15381       4   4,035      16,140       403.4      26.5      00:17:09
 15084       8   4,035      32,280       395.2      25.9      00:17:38
 15812       6   4,035      24,210       414.9      27.2      00:16:57
 15864       6   4,035      24,210       416.3      27.3      00:16:52
 15582       5   4,035      20,175       408.6      26.8      00:17:18
 16322       9   4,035      36,315       429.2      28.2      00:16:36
 16343       7   4,035      28,245       429.7      28.2      00:16:34
 16055       6   4,035      24,210       421.8      27.7      00:17:00
 16734      10   4,035      40,350       440.4      28.9      00:16:25
 16752      10   4,035      40,350       440.8      28.9      00:16:24
 16514      10   4,035      40,350       434.6      28.5      00:16:44
 17105       6   4,035      24,210       450.3      29.6      00:16:18
 17101       7   4,035      28,245       450.2      29.6      00:16:19
 16904       7   4,035      28,245       444.8      29.2      00:16:36
 17440      10   4,035      40,350       459.5      30.2      00:16:14
 17464      10   4,035      40,350       460.2      30.2      00:16:12
 17232       7   4,035      28,245       453.7      29.8      00:16:32
 17803       9   4,035      36,315       469.4      30.8      00:16:07
 17847       7   4,035      28,245       470.6      30.9      00:16:03
 17528       8   4,035      32,280       462.2      30.3      00:16:29
 18211      10   4,035      40,350       480.7      31.5      00:15:56
 18254       8   4,035      32,280       481.8      31.6      00:15:53
 17859       6   4,035      24,210       470.9      30.9      00:16:25
 18643       7   4,035      28,245       492.0      32.3      00:15:45
 18720      10   4,035      40,350       494.2      32.4      00:15:39
 18206       6   4,035      24,210       480.5      31.5      00:16:18
 19111      10   4,035      40,350       505.1      33.2      00:15:29
 19232       7   4,035      28,245       508.5      33.4      00:15:20
 18617       6   4,035      24,210       491.2      32.2      00:16:08
 19585      10   4,035      40,350       518.3      34.0      00:15:13
 19734       9   4,035      36,315       522.6      34.3      00:15:01
 19095       7   4,035      28,245       504.7      33.1      00:15:50
 20065       7   4,035      28,245       532.0      34.9      00:14:56
 19587       6   4,035      24,210       518.4      34.0      00:15:32
 20247      10   4,035      40,350       537.0      35.2      00:14:43
 20559       9   4,035      36,315       545.5      35.8      00:14:40
 20102       8   4,035      32,280       533.2      35.0      00:15:11
 20692      10   4,035      40,350       549.2      36.0      00:14:31
 20904       6   4,035      24,210       555.1      36.4      00:14:34
 21082       7   4,035      28,245       559.7      36.7      00:14:22
 20562       9   4,035      36,315       545.6      35.8      00:14:58
 21241      10   4,035      40,350       563.6      37.0      00:14:30
 20869       9   4,035      36,315       554.1      36.4      00:14:54
 21505       9   4,035      36,315       570.3      37.4      00:14:14
 21603       8   4,035      32,280       572.8      37.6      00:14:24
 21948      10   4,035      40,350       581.5      38.2      00:14:04
 21223       7   4,035      28,245       563.2      37.0      00:14:48
 21977       8   4,035      32,280       582.2      38.2      00:14:18
 21607       7   4,035      28,245       572.9      37.6      00:14:41
 22378       9   4,035      36,315       592.2      38.9      00:13:55
 22398       7   4,035      28,245       592.7      38.9      00:14:09
 22040       7   4,035      28,245       583.9      38.3      00:14:30
 22804       9   4,035      36,315       603.0      39.6      00:13:46
 22836       8   4,035      32,280       603.6      39.6      00:13:59
 22477       6   4,035      24,210       594.7      39.0      00:14:20
 23227       8   4,035      32,280       614.1      40.3      00:13:36
 23267      10   4,035      40,350       615.3      40.4      00:13:48
 22926       6   4,035      24,210       606.0      39.8      00:14:09
 23661       7   4,035      28,245       625.2      41.0      00:13:26
 23706       7   4,035      28,245       626.5      41.1      00:13:37
 23330       8   4,035      32,280       617.0      40.5      00:13:59
 24069       7   4,035      28,245       636.2      41.8      00:13:16
 24128       8   4,035      32,280       637.6      41.8      00:13:27
 23721       5   4,035      20,175       626.8      41.1      00:13:51
 24584       4   4,035      16,140       649.4      42.6      00:13:02
 24602       6   4,035      24,210       649.9      42.7      00:13:14
 24096       7   4,035      28,245       636.9      41.8      00:13:42
 25095       6   4,035      24,210       663.0      43.5      00:12:47
 25036       8   4,035      32,280       661.3      43.4      00:13:03
 24600       6   4,035      24,210       649.8      42.7      00:13:28
 25575       9   4,035      36,315       675.9      44.4      00:12:34
 25476       8   4,035      32,280       673.3      44.2      00:12:51
 25061       5   4,035      20,175       662.0      43.5      00:13:15
 25985       6   4,035      24,210       686.7      45.1      00:12:24
 25807       6   4,035      24,210       682.0      44.8      00:12:46
 25502       9   4,035      36,315       673.9      44.2      00:13:03
 26383       4   4,035      16,140       697.4      45.8      00:12:15
 26119       8   4,035      32,280       690.5      45.3      00:12:41
 25838       4   4,035      16,140       682.9      44.8      00:12:57
 26824       8   4,035      32,280       708.8      46.5      00:12:05
 26510       5   4,035      20,175       700.6      46.0      00:12:33
 26171      10   4,035      40,350       691.7      45.4      00:12:51
 27178       9   4,035      36,315       718.3      47.1      00:11:58
 26913       8   4,035      32,280       711.2      46.7      00:12:23
 26585       8   4,035      32,280       702.6      46.1      00:12:41
 27464       8   4,035      32,280       725.8      47.6      00:11:55
 27247       8   4,035      32,280       720.1      47.3      00:12:17
 27006       9   4,035      36,315       713.8      46.8      00:12:30
 27855       4   4,035      16,140       736.5      48.3      00:11:46
 27540       4   4,035      16,140       727.9      47.8      00:12:13
 27395       7   4,035      28,245       724.0      47.5      00:12:21
 28296       5   4,035      20,175       748.5      49.1      00:11:35
 27903       8   4,035      32,280       737.9      48.4      00:12:05
 27819       9   4,035      36,315       735.5      48.3      00:12:10
 28715       5   4,035      20,175       760.2      49.9      00:11:24
 28338       9   4,035      36,315       749.7      49.2      00:11:53
 28211       5   4,035      20,175       746.2      49.0      00:11:60
 29033       6   4,035      24,210       769.1      50.5      00:11:18
 28717       7   4,035      28,245       760.3      49.9      00:11:44
 28656       8   4,035      32,280       758.7      49.8      00:11:47
 29432      10   4,035      40,350       779.9      51.2      00:11:08
 28967       5   4,035      20,175       767.3      50.4      00:11:41
 28996       8   4,035      32,280       768.1      50.4      00:11:39
 29882       6   4,035      24,210       792.0      52.0      00:10:57
 29355      10   4,035      40,350       777.7      51.0      00:11:31
 29415       8   4,035      32,280       779.4      51.2      00:11:28
 30250       4   4,035      16,140       802.0      52.6      00:10:49
 29741       6   4,035      24,210       788.1      51.7      00:11:22
 29790       2   4,035       8,070       789.5      51.8      00:11:20
 30599      10   4,035      40,350       811.7      53.3      00:10:41
 30070       6   4,035      24,210       797.1      52.3      00:11:15
 30091       3   4,035      12,105       797.7      52.4      00:11:14
 31112       8   4,035      32,280       825.6      54.2      00:10:26
 30465       9   4,035      36,315       808.0      53.0      00:11:05
 30452       9   4,035      36,315       807.6      53.0      00:11:06
 31629       7   4,035      28,245       840.1      55.1      00:10:11
 30965       7   4,035      28,245       821.8      53.9      00:10:50
 30927      10   4,035      40,350       820.8      53.9      00:10:52
 32148       5   4,035      20,175       854.8      56.1      00:09:55
 31486       5   4,035      20,175       836.2      54.9      00:10:34
 32604       7   4,035      28,245       867.8      57.0      00:09:43
 31402       8   4,035      32,280       833.7      54.7      00:10:38
 31967       7   4,035      28,245       849.8      55.8      00:10:19
 31877      10   4,035      40,350       847.2      55.6      00:10:24
 32902       8   4,035      32,280       876.1      57.5      00:09:37
 32448       5   4,035      20,175       863.5      56.7      00:10:05
 32348       9   4,035      36,315       860.6      56.5      00:10:09
 33195       8   4,035      32,280       884.3      58.0      00:09:32
 32774       7   4,035      28,245       872.6      57.3      00:09:58
 32681      10   4,035      40,350       869.9      57.1      00:10:02
 33652       7   4,035      28,245       897.2      58.9      00:09:19
 33127       9   4,035      36,315       882.5      57.9      00:09:49
 32977       7   4,035      28,245       878.2      57.6      00:09:56
 34112       7   4,035      28,245       910.1      59.7      00:09:07
 33557       8   4,035      32,280       894.5      58.7      00:09:37
 34577       6   4,035      24,210       923.2      60.6      00:08:54
 33278       8   4,035      32,280       886.6      58.2      00:09:50
 33982       9   4,035      36,315       906.5      59.5      00:09:26
 33637       7   4,035      28,245       896.8      58.9      00:09:41
 35049       5   4,035      20,175       936.5      61.5      00:08:41
 34438       6   4,035      24,210       919.4      60.3      00:09:13
 35514      10   4,035      40,350       949.6      62.3      00:08:28
 33987       9   4,035      36,315       906.6      59.5      00:09:32
 34932       7   4,035      28,245       933.3      61.3      00:08:58
 34387       7   4,035      28,245       918.0      60.3      00:09:22
 35991      10   4,035      40,350       962.8      63.2      00:08:16
 35444       6   4,035      24,210       947.7      62.2      00:08:43
 34858       5   4,035      20,175       931.2      61.1      00:09:08
 36462      10   4,035      40,350       975.9      64.1      00:08:03
 35957       9   4,035      36,315       961.8      63.1      00:08:29
 35317       8   4,035      32,280       944.1      62.0      00:08:55
 36802       9   4,035      36,315       985.0      64.7      00:07:56
 36453       5   4,035      20,175       975.7      64.0      00:08:15
 35790       8   4,035      32,280       957.2      62.8      00:08:41
 37118       6   4,035      24,210       993.6      65.2      00:07:50
 36827       7   4,035      28,245       985.8      64.7      00:08:06
 36269       4   4,035      16,140       970.5      63.7      00:08:28
 37511       7   4,035      28,245     1,003.5      65.9      00:07:42
 37197       8   4,035      32,280       995.5      65.3      00:07:58
 36687       2   4,035       8,070       982.1      64.5      00:08:17
 37881       8   4,035      32,280     1,013.2      66.5      00:07:34
 37570      10   4,035      40,350     1,005.1      66.0      00:07:50
 37039       7   4,035      28,245       991.4      65.1      00:08:09
 38228       5   4,035      20,175     1,022.8      67.1      00:07:26
 37948      10   4,035      40,350     1,015.1      66.6      00:07:41
 37399       6   4,035      24,210     1,000.6      65.7      00:08:02
 38513      10   4,035      40,350     1,030.8      67.7      00:07:21
 38326       7   4,035      28,245     1,025.4      67.3      00:07:32
 37759       7   4,035      28,245     1,009.9      66.3      00:07:54
 38861       9   4,035      36,315     1,040.2      68.3      00:07:13
 38696       9   4,035      36,315     1,035.7      68.0      00:07:23
 38058      10   4,035      40,350     1,018.0      66.8      00:07:47
 39227       5   4,035      20,175     1,050.0      68.9      00:07:05
 39056      10   4,035      40,350     1,045.6      68.6      00:07:15
 38344       7   4,035      28,245     1,026.0      67.3      00:07:41
 39608       9   4,035      36,315     1,060.2      69.6      00:06:56
 39370      10   4,035      40,350     1,053.9      69.2      00:07:08
 38628       9   4,035      36,315     1,033.9      67.9      00:07:35
 40043      10   4,035      40,350     1,071.7      70.3      00:06:45
 39754       8   4,035      32,280     1,063.9      69.8      00:06:60
 38913       9   4,035      36,315     1,041.6      68.4      00:07:29
 40569      10   4,035      40,350     1,086.0      71.3      00:06:31
 40272      10   4,035      40,350     1,077.8      70.7      00:06:46
 39197       5   4,035      20,175     1,049.3      68.9      00:07:24
 41033       9   4,035      36,315     1,098.9      72.1      00:06:19
 40821      10   4,035      40,350     1,092.9      71.7      00:06:31
 39543      10   4,035      40,350     1,058.4      69.5      00:07:16
 41359       8   4,035      32,280     1,107.7      72.7      00:06:12
 41226       6   4,035      24,210     1,104.1      72.5      00:06:20
 39948       7   4,035      28,245     1,069.2      70.2      00:07:06
 41793      10   4,035      40,350     1,119.5      73.5      00:06:01
 41681       8   4,035      32,280     1,116.5      73.3      00:06:09
 40431       9   4,035      36,315     1,082.1      71.0      00:06:53
 42153       8   4,035      32,280     1,129.1      74.1      00:05:53
 42106       3   4,035      12,105     1,127.9      74.0      00:05:58
 40909       7   4,035      28,245     1,095.3      71.9      00:06:39
 42489       6   4,035      24,210     1,138.0      74.7      00:05:46
 42533       7   4,035      28,245     1,139.2      74.8      00:05:48
 41211       9   4,035      36,315     1,103.6      72.4      00:06:32
 42823       8   4,035      32,280     1,146.8      75.3      00:05:39
 42919      10   4,035      40,350     1,149.4      75.4      00:05:39
 41579       5   4,035      20,175     1,113.6      73.1      00:06:23
 43139       6   4,035      24,210     1,155.6      75.8      00:05:32
 43250       6   4,035      24,210     1,158.8      76.1      00:05:31
 41925       9   4,035      36,315     1,123.3      73.7      00:06:15
 43454       9   4,035      36,315     1,164.5      76.4      00:05:24
 43618       7   4,035      28,245     1,168.7      76.7      00:05:22
 42254      10   4,035      40,350     1,131.6      74.3      00:06:08
 43780       3   4,035      12,105     1,172.9      77.0      00:05:17
 43992       7   4,035      28,245     1,178.7      77.4      00:05:13
 42575       7   4,035      28,245     1,140.2      74.8      00:06:00
 44094       7   4,035      28,245     1,181.4      77.5      00:05:10
 44444       6   4,035      24,210     1,190.5      78.1      00:05:03
 42915       5   4,035      20,175     1,149.3      75.4      00:05:52
 44368      10   4,035      40,350     1,188.6      78.0      00:05:05
 44885      10   4,035      40,350     1,202.5      78.9      00:04:51
 43233       8   4,035      32,280     1,158.4      76.0      00:05:44
 44721       7   4,035      28,245     1,198.1      78.6      00:04:57
 45355      10   4,035      40,350     1,214.6      79.7      00:04:40
 43555       5   4,035      20,175     1,167.1      76.6      00:05:36
 45076       9   4,035      36,315     1,207.6      79.3      00:04:48
 45775       6   4,035      24,210     1,225.3      80.4      00:04:31
 43864       7   4,035      28,245     1,175.2      77.1      00:05:30
 45450      10   4,035      40,350     1,217.1      79.9      00:04:40
 46174       6   4,035      24,210     1,236.1      81.1      00:04:21
 44170       6   4,035      24,210     1,183.3      77.7      00:05:22
 45778       6   4,035      24,210     1,225.4      80.4      00:04:33
 46547       9   4,035      36,315     1,246.3      81.8      00:04:12
 44453       7   4,035      28,245     1,190.8      78.2      00:05:16
 46113       7   4,035      28,245     1,234.4      81.0      00:04:25
 46951       6   4,035      24,210     1,257.4      82.5      00:04:02
 44827       5   4,035      20,175     1,200.9      78.8      00:05:07
 46443       5   4,035      20,175     1,243.4      81.6      00:04:17
 47253       6   4,035      24,210     1,264.7      83.0      00:03:56
 45204       3   4,035      12,105     1,210.9      79.5      00:04:57
 46832       8   4,035      32,280     1,254.2      82.3      00:04:07
 47625       7   4,035      28,245     1,274.3      83.6      00:03:47
 45549       6   4,035      24,210     1,219.6      80.0      00:04:50
 47151       8   4,035      32,280     1,262.2      82.8      00:04:01
 47990       7   4,035      28,245     1,284.2      84.3      00:03:38
 45902       8   4,035      32,280     1,228.7      80.6      00:04:41
 47523       4   4,035      16,140     1,271.6      83.5      00:03:52
 48322       5   4,035      20,175     1,293.0      84.9      00:03:31
 46248       7   4,035      28,245     1,238.2      81.3      00:04:32
 47828       7   4,035      28,245     1,279.7      84.0      00:03:45
 48650       9   4,035      36,315     1,301.9      85.5      00:03:23
 46570       8   4,035      32,280     1,246.9      81.8      00:04:24
 48103      10   4,035      40,350     1,287.2      84.5      00:03:39
 48994       7   4,035      28,245     1,311.1      86.1      00:03:15
 46978       9   4,035      36,315     1,257.9      82.6      00:04:14
 48413       8   4,035      32,280     1,295.6      85.0      00:03:32
 49370       9   4,035      36,315     1,321.2      86.7      00:03:06
 47306       8   4,035      32,280     1,266.0      83.1      00:04:07
 48742       4   4,035      16,140     1,304.4      85.6      00:03:24
 49706       7   4,035      28,245     1,329.5      87.3      00:02:58
 47649       9   4,035      36,315     1,275.0      83.7      00:03:58
 49090       6   4,035      24,210     1,313.6      86.2      00:03:15
 50003       9   4,035      36,315     1,337.3      87.8      00:02:52
 48017      10   4,035      40,350     1,284.9      84.3      00:03:49
 49426       4   4,035      16,140     1,322.5      86.8      00:03:07
 50312       7   4,035      28,245     1,345.2      88.3      00:02:45
 48323      10   4,035      40,350     1,293.1      84.9      00:03:41
 49737       7   4,035      28,245     1,330.3      87.3      00:03:00
 50712       7   4,035      28,245     1,355.8      89.0      00:02:35
 48729      10   4,035      40,350     1,304.1      85.6      00:03:31
 50055       8   4,035      32,280     1,338.6      87.9      00:02:53
 51096       3   4,035      12,105     1,366.6      89.7      00:02:25
 49082       7   4,035      28,245     1,313.4      86.2      00:03:22
 50400       5   4,035      20,175     1,347.3      88.4      00:02:45
 51467       5   4,035      20,175     1,376.5      90.3      00:02:16
 49417       7   4,035      28,245     1,322.3      86.8      00:03:14
 50744       8   4,035      32,280     1,356.6      89.0      00:02:37
 51826       5   4,035      20,175     1,386.6      91.0      00:02:07
 49797       5   4,035      20,175     1,331.8      87.4      00:03:05
 51074       4   4,035      16,140     1,366.0      89.7      00:02:28
 52206       6   4,035      24,210     1,397.5      91.7      00:01:57
 50174       3   4,035      12,105     1,341.8      88.1      00:02:55
 51430       5   4,035      20,175     1,375.5      90.3      00:02:19
 52591       7   4,035      28,245     1,408.6      92.5      00:01:46
 50601       3   4,035      12,105     1,352.8      88.8      00:02:44
 51788       9   4,035      36,315     1,385.5      90.9      00:02:10
 52978       6   4,035      24,210     1,419.8      93.2      00:01:36
 51032       8   4,035      32,280     1,364.8      89.6      00:02:33
 52156       6   4,035      24,210     1,395.9      91.6      00:01:60
 53389       7   4,035      28,245     1,431.4      93.9      00:01:25
 51458       8   4,035      32,280     1,376.2      90.3      00:02:22
 52522       8   4,035      32,280     1,406.6      92.3      00:01:50
 53852       9   4,035      36,315     1,444.2      94.8      00:01:13
 51872       6   4,035      24,210     1,387.9      91.1      00:02:10
 52915       8   4,035      32,280     1,418.2      93.1      00:01:39
 54238       7   4,035      28,245     1,454.6      95.5      00:01:04
 52279       7   4,035      28,245     1,399.5      91.9      00:01:59
 53342       8   4,035      32,280     1,430.1      93.9      00:01:28
 54663       8   4,035      32,280     1,465.5      96.2      00:00:54
 52684       7   4,035      28,245     1,411.4      92.6      00:01:47
 53832       8   4,035      32,280     1,443.7      94.8      00:01:15
 55102       6   4,035      24,210     1,477.1      97.0      00:00:43
 53081       7   4,035      28,245     1,422.8      93.4      00:01:36
 54226      10   4,035      40,350     1,454.3      95.5      00:01:05
 55508      10   4,035      40,350     1,487.6      97.6      00:00:33
 53563       8   4,035      32,280     1,436.3      94.3      00:01:23
 54670      10   4,035      40,350     1,465.7      96.2      00:00:54
 55873       8   4,035      32,280     1,497.2      98.3      00:00:24
 53987       6   4,035      24,210     1,447.8      95.0      00:01:12
 55086       5   4,035      20,175     1,476.7      96.9      00:00:44
 56292       6   4,035      24,210     1,508.8      99.0      00:00:14
 54389       8   4,035      32,280     1,458.7      95.7      00:01:02
 55483      10   4,035      40,350     1,486.9      97.6      00:00:34
 56721       9   4,035      36,315     1,520.9      99.8      00:00:03
 54848       6   4,035      24,210     1,470.4      96.5      00:00:51
 55854       5   4,035      20,175     1,496.7      98.2      00:00:25

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1408.944
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 55287      10   4,035      40,350     1,482.0      97.3      00:00:40
 56223      10   4,035      40,350     1,506.9      98.9      00:00:16
 55690      10   4,035      40,350     1,492.3      97.9      00:00:30
 56613       9   4,035      36,315     1,517.9      99.6      00:00:05
 56064       5   4,035      20,175     1,502.5      98.6      00:00:20

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1433.719
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 56485      10   4,035      40,350     1,514.4      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1454.083
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv
    not found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv saved

. 
. cap log close

. 
end of do-file
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv not
    found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv saved

. 
. cap log close

. 
end of do-file
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv
    not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15.csv saved

. 
. cap log close

. 
end of do-file
