
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A200_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   355       9   4,235      38,115         8.6       0.5      00:31:04
   735       8   4,235      33,880        18.2       1.1      00:28:58
  1102       4   4,235      16,940        27.9       1.7      00:28:10
  1467       9   4,235      38,115        38.2       2.4      00:27:18
  1829       7   4,235      29,645        48.0       3.0      00:26:57
  2189       7   4,235      29,645        57.7       3.6      00:26:44
  2577       5   4,235      21,175        68.1       4.3      00:26:16
  2955       6   4,235      25,410        78.5       4.9      00:25:52
  3307       9   4,235      38,115        88.6       5.5      00:25:37
  3687       9   4,235      38,115        99.2       6.2      00:25:14
  4034       8   4,235      33,880       108.4       6.8      00:25:16
  4357       3   4,235      12,705       116.8       7.3      00:25:25
  4606       7   4,235      29,645       123.7       7.7      00:25:52
  4887       7   4,235      29,645       131.6       8.2      00:26:04
  5183       6   4,235      25,410       139.7       8.7      00:26:10
  5415       3   4,235      12,705       146.2       9.1      00:26:33
  5690       9   4,235      38,115       153.0       9.6      00:26:50
  6014       8   4,235      33,880       161.8      10.1      00:26:42
  6318       7   4,235      29,645       170.0      10.6      00:26:40
  6593       7   4,235      29,645       177.4      11.1      00:26:46
  6866       6   4,235      25,410       184.7      11.6      00:26:51
  7261       4   4,235      16,940       195.1      12.2      00:26:26
  7635       9   4,235      38,115       205.7      12.9      00:26:01
  7984       6   4,235      25,410       215.7      13.5      00:25:42
  8358       9   4,235      38,115       226.6      14.2      00:25:17
  8712       8   4,235      33,880       236.7      14.8      00:24:59
  9019       8   4,235      33,880       245.6      15.4      00:24:50
  9309       7   4,235      29,645       254.1      15.9      00:24:45
  9596       6   4,235      25,410       262.5      16.4      00:24:39
  9843       4   4,235      16,940       269.7      16.9      00:24:41
 10148       9   4,235      38,115       277.7      17.4      00:24:38
 10505       4   4,235      16,940       287.4      18.0      00:24:23
 10904       7   4,235      29,645       298.1      18.6      00:24:03
 11238      10   4,235      42,350       307.3      19.2      00:23:52
 11532       6   4,235      25,410       315.4      19.7      00:23:47
 11880       5   4,235      21,175       325.0      20.3      00:23:34
 12142       9   4,235      38,115       332.5      20.8      00:23:32
 12399       5   4,235      21,175       339.4      21.2      00:23:33
 12748       5   4,235      21,175       349.0      21.8      00:23:19
 13107       8   4,235      33,880       358.7      22.4      00:23:06
 13454       9   4,235      38,115       368.5      23.0      00:22:51
 13779       6   4,235      25,410       377.9      23.6      00:22:40
 14121       6   4,235      25,410       387.2      24.2      00:22:28
 14503       3   4,235      12,705       398.4      24.9      00:22:08
 14889       6   4,235      25,410       409.1      25.6      00:21:51
 15349       5   4,235      21,175       422.4      26.4      00:21:23
 15747       8   4,235      33,880       433.5      27.1      00:21:06
 16095       5   4,235      21,175       443.9      27.8      00:20:51
 16437       6   4,235      25,410       453.9      28.4      00:20:38
 16698       9   4,235      38,115       461.2      28.8      00:20:36
 16945       9   4,235      38,115       468.1      29.3      00:20:34
 17181       9   4,235      38,115       474.7      29.7      00:20:34
 17421       5   4,235      21,175       481.7      30.1      00:20:32
 17732      10   4,235      42,350       490.9      30.7      00:20:21
 18080       8   4,235      33,880       500.6      31.3      00:20:09
 18397       7   4,235      29,645       509.6      31.9      00:19:59
 18680       5   4,235      21,175       517.5      32.4      00:19:53
 18939      10   4,235      42,350       525.1      32.8      00:19:49
 19196      10   4,235      42,350       532.7      33.3      00:19:43
 19509      10   4,235      42,350       541.8      33.9      00:19:33
 19896       5   4,235      21,175       553.2      34.6      00:19:15
 20346       6   4,235      25,410       566.3      35.4      00:18:53
 20668       9   4,235      38,115       575.7      36.0      00:18:42
 20971       7   4,235      29,645       584.5      36.6      00:18:33
 21310       4   4,235      16,940       593.2      37.1      00:18:24
 21600       7   4,235      29,645       601.1      37.6      00:18:18
 21927       4   4,235      16,940       609.7      38.1      00:18:09
 22278       8   4,235      33,880       618.9      38.7      00:17:59
 22589       7   4,235      29,645       627.3      39.2      00:17:51
 22853       9   4,235      38,115       634.0      39.6      00:17:47
 23138       6   4,235      25,410       642.0      40.2      00:17:40
 23433      10   4,235      42,350       650.4      40.7      00:17:32
 23801       9   4,235      38,115       660.3      41.3      00:17:20
 24170       5   4,235      21,175       670.3      41.9      00:17:07
 24610       7   4,235      29,645       682.3      42.7      00:16:49
 25033       4   4,235      16,940       694.0      43.4      00:16:33
 25431      10   4,235      42,350       705.3      44.1      00:16:17
 25740      10   4,235      42,350       713.8      44.6      00:16:09
 25976       6   4,235      25,410       720.6      45.1      00:16:05
 26258       8   4,235      33,880       728.7      45.6      00:15:57
 26634       8   4,235      33,880       738.7      46.2      00:15:45
 27000       7   4,235      29,645       749.0      46.8      00:15:32
 27331       5   4,235      21,175       758.1      47.4      00:15:22
 27666       8   4,235      33,880       767.6      48.0      00:15:12
 28026      10   4,235      42,350       777.9      48.6      00:14:59
 28429       7   4,235      29,645       789.5      49.4      00:14:43
 28748       8   4,235      33,880       798.9      50.0      00:14:33
 29046       7   4,235      29,645       807.6      50.5      00:14:24
 29339       7   4,235      29,645       815.7      51.0      00:14:16
 29653       9   4,235      38,115       824.7      51.6      00:14:07
 29907       6   4,235      25,410       831.9      52.0      00:14:01
 30206       5   4,235      21,175       840.6      52.6      00:13:52
 30579       6   4,235      25,410       851.4      53.2      00:13:38
 30973       9   4,235      38,115       862.7      54.0      00:13:24
 31383       6   4,235      25,410       874.5      54.7      00:13:09
 31824       6   4,235      25,410       887.5      55.5      00:12:51
 32282      10   4,235      42,350       901.3      56.4      00:12:32
 32642       8   4,235      33,880       911.9      57.0      00:12:20
 32939       8   4,235      33,880       920.6      57.6      00:12:11
 33218       6   4,235      25,410       928.8      58.1      00:12:03
 33580       7   4,235      29,645       939.5      58.7      00:11:50
 33871       9   4,235      38,115       948.1      59.3      00:11:42
 34158       6   4,235      25,410       956.6      59.8      00:11:33
 34497      10   4,235      42,350       966.7      60.4      00:11:22
 34863       3   4,235      12,705       977.5      61.1      00:11:09
 35244       9   4,235      38,115       988.7      61.8      00:10:56
 35623       7   4,235      29,645       999.8      62.5      00:10:43
 36032       7   4,235      29,645     1,011.7      63.3      00:10:28
 36465       9   4,235      38,115     1,024.4      64.1      00:10:13
 36796      10   4,235      42,350     1,033.7      64.6      00:10:03
 37101       8   4,235      33,880     1,042.4      65.2      00:09:54
 37420      10   4,235      42,350     1,050.8      65.7      00:09:46
 37742      10   4,235      42,350     1,059.5      66.3      00:09:37
 38058      10   4,235      42,350     1,068.5      66.8      00:09:27
 38322       5   4,235      21,175     1,076.1      67.3      00:09:20
 38554       6   4,235      25,410     1,083.0      67.7      00:09:14
 38967       7   4,235      29,645     1,094.8      68.5      00:08:60
 39285       9   4,235      38,115     1,103.6      69.0      00:08:51
 39629       7   4,235      29,645     1,113.3      69.6      00:08:40
 39984       6   4,235      25,410     1,123.2      70.2      00:08:29
 40427       9   4,235      38,115     1,135.6      71.0      00:08:15
 40832       6   4,235      25,410     1,147.4      71.8      00:08:01
 41130       7   4,235      29,645     1,156.1      72.3      00:07:52
 41426       9   4,235      38,115     1,164.4      72.8      00:07:44
 41745       8   4,235      33,880     1,173.6      73.4      00:07:34
 42072       8   4,235      33,880     1,182.9      74.0      00:07:24
 42365      10   4,235      42,350     1,190.7      74.5      00:07:16
 42578       3   4,235      12,705     1,196.8      74.8      00:07:11
 42856       9   4,235      38,115     1,204.6      75.3      00:07:03
 43179       4   4,235      16,940     1,214.1      75.9      00:06:53
 43482       8   4,235      33,880     1,223.0      76.5      00:06:44
 43781       4   4,235      16,940     1,231.1      77.0      00:06:35
 44007       6   4,235      25,410     1,237.6      77.4      00:06:29
 44222       8   4,235      33,880     1,243.6      77.8      00:06:24
 44498      10   4,235      42,350     1,251.1      78.2      00:06:16
 44856       6   4,235      25,410     1,261.3      78.9      00:06:05
 45270       9   4,235      38,115     1,272.7      79.6      00:05:52
 45616       8   4,235      33,880     1,281.9      80.2      00:05:42
 45924       9   4,235      38,115     1,290.1      80.7      00:05:33
 46281       8   4,235      33,880     1,300.6      81.3      00:05:22
 46652       6   4,235      25,410     1,311.1      82.0      00:05:10
 47049       2   4,235       8,470     1,322.0      82.7      00:04:58
 47348      10   4,235      42,350     1,330.0      83.2      00:04:50
 47701       9   4,235      38,115     1,339.7      83.8      00:04:39
 48030       9   4,235      38,115     1,349.0      84.4      00:04:29
 48275       9   4,235      38,115     1,355.7      84.8      00:04:23
 48573       6   4,235      25,410     1,364.3      85.3      00:04:13
 48867       7   4,235      29,645     1,372.4      85.8      00:04:05
 49165      10   4,235      42,350     1,381.0      86.4      00:03:56
 49475       7   4,235      29,645     1,389.5      86.9      00:03:47
 49876       5   4,235      21,175     1,399.9      87.5      00:03:35
 50236      10   4,235      42,350     1,410.0      88.2      00:03:24
 50547      10   4,235      42,350     1,418.3      88.7      00:03:15
 50816       6   4,235      25,410     1,426.0      89.2      00:03:07
 51083       4   4,235      16,940     1,433.9      89.7      00:02:59
 51402       7   4,235      29,645     1,442.8      90.2      00:02:49
 51665       4   4,235      16,940     1,450.6      90.7      00:02:41
 51986      10   4,235      42,350     1,459.9      91.3      00:02:31
 52318       9   4,235      38,115     1,470.0      91.9      00:02:20
 52772       5   4,235      21,175     1,484.1      92.8      00:02:04
 53242       6   4,235      25,410     1,498.1      93.7      00:01:49
 53708      10   4,235      42,350     1,511.7      94.5      00:01:34
 54081       7   4,235      29,645     1,522.3      95.2      00:01:22
 54362       6   4,235      25,410     1,530.2      95.7      00:01:14
 54653       6   4,235      25,410     1,537.9      96.2      00:01:06
 55031       6   4,235      25,410     1,548.3      96.8      00:00:55
 55353       6   4,235      25,410     1,557.0      97.4      00:00:45
 55634       6   4,235      25,410     1,564.5      97.8      00:00:37
 55901       8   4,235      33,880     1,572.3      98.3      00:00:29
 56184       9   4,235      38,115     1,580.4      98.8      00:00:20
 56520       6   4,235      25,410     1,590.4      99.5      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1728.717
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
