
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A900_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   313       2   4,935       9,870         8.7       0.5      00:35:24
   641       9   4,935      44,415        18.4       1.0      00:33:31
   980       8   4,935      39,480        28.6       1.5      00:32:07
  1278       4   4,935      19,740        38.2       2.1      00:31:52
  1582       7   4,935      34,545        48.2       2.6      00:31:26
  1886       7   4,935      34,545        57.7       3.1      00:31:21
  2202       8   4,935      39,480        67.7       3.6      00:30:60
  2530       7   4,935      34,545        77.8       4.2      00:30:40
  2836      10   4,935      49,350        87.9       4.7      00:30:21
  3136       9   4,935      44,415        97.4       5.2      00:30:17
  3434       9   4,935      44,415       107.4       5.8      00:30:01
  3748       9   4,935      44,415       117.5       6.3      00:29:45
  4003       8   4,935      39,480       125.3       6.7      00:30:06
  4219       6   4,935      29,610       132.1       7.1      00:30:37
  4453       2   4,935       9,870       139.1       7.5      00:31:02
  4669       9   4,935      44,415       146.3       7.9      00:31:21
  4888      10   4,935      49,350       153.4       8.2      00:31:39
  5086       5   4,935      24,675       159.6       8.6      00:32:05
  5300       6   4,935      29,610       166.4       8.9      00:32:21
  5519       8   4,935      39,480       173.1       9.3      00:32:36
  5762       9   4,935      44,415       180.5       9.7      00:32:42
  6021      10   4,935      49,350       188.8      10.1      00:32:36
  6292       6   4,935      29,610       197.4      10.6      00:32:26
  6576       4   4,935      19,740       206.1      11.1      00:32:14
  6852       6   4,935      29,610       214.8      11.5      00:32:03
  7146       6   4,935      29,610       223.9      12.0      00:31:48
  7457       3   4,935      14,805       233.9      12.6      00:31:25
  7766       4   4,935      19,740       243.8      13.1      00:31:04
  8063       9   4,935      44,415       254.1      13.6      00:30:41
  8360       5   4,935      24,675       264.1      14.2      00:30:20
  8654      10   4,935      49,350       274.0      14.7      00:30:02
  8961      10   4,935      49,350       284.4      15.3      00:29:41
  9243       8   4,935      39,480       293.9      15.8      00:29:27
  9508       9   4,935      44,415       302.8      16.2      00:29:16
  9759       9   4,935      44,415       311.5      16.7      00:29:08
 10026       7   4,935      34,545       320.0      17.2      00:29:00
 10291       7   4,935      34,545       327.9      17.6      00:28:57
 10538      10   4,935      49,350       335.9      18.0      00:28:52
 10845       7   4,935      34,545       345.4      18.5      00:28:38
 11147       8   4,935      39,480       355.2      19.1      00:28:24
 11361       8   4,935      39,480       362.0      19.4      00:28:25
 11574       8   4,935      39,480       368.8      19.8      00:28:27
 11832       6   4,935      29,610       377.3      20.2      00:28:19
 12078       7   4,935      34,545       385.3      20.7      00:28:13
 12335       7   4,935      34,545       393.4      21.1      00:28:06
 12663       9   4,935      44,415       404.1      21.7      00:27:46
 13005       6   4,935      29,610       414.6      22.3      00:27:27
 13338       9   4,935      44,415       425.5      22.8      00:27:07
 13632       7   4,935      34,545       435.8      23.4      00:26:50
 13891       7   4,935      34,545       444.0      23.8      00:26:43
 14171       9   4,935      44,415       453.0      24.3      00:26:32
 14468      10   4,935      49,350       463.0      24.8      00:26:17
 14762      10   4,935      49,350       472.6      25.4      00:26:04
 15086       7   4,935      34,545       483.4      25.9      00:25:46
 15426      10   4,935      49,350       494.8      26.6      00:25:25
 15777       8   4,935      39,480       506.3      27.2      00:25:05
 16117       7   4,935      34,545       518.0      27.8      00:24:44
 16475       8   4,935      39,480       530.3      28.5      00:24:22
 16767       9   4,935      44,415       539.8      29.0      00:24:11
 17043       7   4,935      34,545       548.9      29.5      00:24:01
 17305       4   4,935      19,740       557.4      29.9      00:23:53
 17558       8   4,935      39,480       566.3      30.4      00:23:44
 17835       8   4,935      39,480       575.1      30.9      00:23:35
 18150       7   4,935      34,545       585.7      31.4      00:23:20
 18486       5   4,935      24,675       596.4      32.0      00:23:04
 18747       6   4,935      29,610       605.4      32.5      00:22:55
 19037       7   4,935      34,545       615.3      33.0      00:22:43
 19340       7   4,935      34,545       625.6      33.6      00:22:29
 19712      10   4,935      49,350       638.4      34.3      00:22:07
 20075       5   4,935      24,675       651.1      34.9      00:21:47
 20475       6   4,935      29,610       664.3      35.7      00:21:25
 20744       6   4,935      29,610       673.4      36.1      00:21:15
 21030       5   4,935      24,675       683.0      36.7      00:21:05
 21367       7   4,935      34,545       693.0      37.2      00:20:53
 21706       3   4,935      14,805       703.7      37.8      00:20:39
 22019       5   4,935      24,675       713.4      38.3      00:20:28
 22374       7   4,935      34,545       724.2      38.9      00:20:14
 22693       7   4,935      34,545       734.3      39.4      00:20:02
 23023       8   4,935      39,480       744.3      39.9      00:19:50
 23348       4   4,935      19,740       755.1      40.5      00:19:37
 23677       8   4,935      39,480       765.2      41.1      00:19:25
 24006       8   4,935      39,480       776.0      41.6      00:19:12
 24367       9   4,935      44,415       787.0      42.2      00:18:58
 24754       7   4,935      34,545       799.9      42.9      00:18:39
 25156       9   4,935      44,415       813.0      43.6      00:18:21
 25440       5   4,935      24,675       822.2      44.1      00:18:11
 25681      10   4,935      49,350       829.8      44.5      00:18:06
 25882       4   4,935      19,740       836.7      44.9      00:18:02
 26099       7   4,935      34,545       843.8      45.3      00:17:58
 26346       7   4,935      34,545       851.8      45.7      00:17:51
 26616       3   4,935      14,805       860.3      46.2      00:17:43
 26877       6   4,935      29,610       868.7      46.6      00:17:36
 27124      10   4,935      49,350       876.7      47.0      00:17:29
 27331       5   4,935      24,675       883.4      47.4      00:17:25
 27538       9   4,935      44,415       890.3      47.8      00:17:21
 27743       6   4,935      29,610       897.0      48.1      00:17:17
 27992      10   4,935      49,350       905.4      48.6      00:17:09
 28283       7   4,935      34,545       915.0      49.1      00:16:58
 28559       9   4,935      44,415       924.6      49.6      00:16:47
 28774       6   4,935      29,610       931.9      50.0      00:16:42
 28976       7   4,935      34,545       938.7      50.4      00:16:37
 29200       9   4,935      44,415       946.1      50.8      00:16:31
 29450       5   4,935      24,675       954.5      51.2      00:16:23
 29711       8   4,935      39,480       962.8      51.7      00:16:15
 29909       6   4,935      29,610       969.5      52.0      00:16:10
 30082       6   4,935      29,610       975.3      52.3      00:16:07
 30257       7   4,935      34,545       981.2      52.7      00:16:04
 30482      10   4,935      49,350       988.9      53.1      00:15:57
 30740       6   4,935      29,610       997.4      53.5      00:15:48
 31024       8   4,935      39,480     1,006.9      54.0      00:15:38
 31306       6   4,935      29,610     1,016.5      54.5      00:15:27
 31581       7   4,935      34,545     1,025.9      55.1      00:15:16
 31851      10   4,935      49,350     1,035.2      55.6      00:15:06
 32121       7   4,935      34,545     1,044.6      56.1      00:14:56
 32393       9   4,935      44,415     1,054.2      56.6      00:14:45
 32622       7   4,935      34,545     1,061.9      57.0      00:14:37
 32799      10   4,935      49,350     1,068.0      57.3      00:14:33
 32987       5   4,935      24,675     1,074.5      57.7      00:14:28
 33181       9   4,935      44,415     1,081.1      58.0      00:14:23
 33413       8   4,935      39,480     1,089.0      58.4      00:14:15
 33678       8   4,935      39,480     1,098.2      58.9      00:14:05
 33947       8   4,935      39,480     1,107.4      59.4      00:13:55
 34231      10   4,935      49,350     1,117.4      60.0      00:13:43
 34601       3   4,935      14,805     1,129.9      60.6      00:13:27
 34975       8   4,935      39,480     1,143.0      61.3      00:13:10
 35343       6   4,935      29,610     1,155.6      62.0      00:12:53
 35715       7   4,935      34,545     1,168.1      62.7      00:12:38
 36104       1   4,935       4,935     1,181.3      63.4      00:12:21
 36487       7   4,935      34,545     1,194.5      64.1      00:12:04
 36822       9   4,935      44,415     1,205.5      64.7      00:11:51
 37103       5   4,935      24,675     1,214.7      65.2      00:11:41
 37399       6   4,935      29,610     1,223.8      65.7      00:11:31
 37678       8   4,935      39,480     1,232.8      66.2      00:11:22
 37947       9   4,935      44,415     1,241.4      66.6      00:11:13
 38218      10   4,935      49,350     1,250.5      67.1      00:11:03
 38465       9   4,935      44,415     1,259.0      67.6      00:10:54
 38789       9   4,935      44,415     1,269.9      68.1      00:10:42
 39088       6   4,935      29,610     1,279.8      68.7      00:10:31
 39371       8   4,935      39,480     1,289.0      69.2      00:10:21
 39693       4   4,935      19,740     1,299.3      69.7      00:10:09
 40046       5   4,935      24,675     1,310.9      70.3      00:09:56
 40425       7   4,935      34,545     1,323.3      71.0      00:09:41
 40796       8   4,935      39,480     1,335.9      71.7      00:09:26
 41128       6   4,935      29,610     1,347.1      72.3      00:09:13
 41457       6   4,935      29,610     1,357.9      72.9      00:09:01
 41779      10   4,935      49,350     1,368.8      73.5      00:08:49
 42073       7   4,935      34,545     1,378.4      74.0      00:08:38
 42390       9   4,935      44,415     1,388.4      74.5      00:08:27
 42669       9   4,935      44,415     1,397.5      75.0      00:08:18
 42961       5   4,935      24,675     1,407.2      75.5      00:08:07
 43233       8   4,935      39,480     1,416.7      76.0      00:07:57
 43526       7   4,935      34,545     1,426.6      76.6      00:07:46
 43806       6   4,935      29,610     1,435.3      77.0      00:07:37
 44087       9   4,935      44,415     1,444.7      77.5      00:07:27
 44365       8   4,935      39,480     1,453.7      78.0      00:07:18
 44691       9   4,935      44,415     1,464.3      78.6      00:07:06
 45037       8   4,935      39,480     1,475.7      79.2      00:06:53
 45401       9   4,935      44,415     1,486.9      79.8      00:06:41
 45653      10   4,935      49,350     1,494.8      80.2      00:06:33
 45951       6   4,935      29,610     1,504.3      80.7      00:06:23
 46266       9   4,935      44,415     1,515.1      81.3      00:06:11
 46597      10   4,935      49,350     1,526.0      81.9      00:05:59
 46942      10   4,935      49,350     1,537.6      82.5      00:05:46
 47162       6   4,935      29,610     1,544.0      82.9      00:05:40
 47341      10   4,935      49,350     1,549.6      83.2      00:05:35
 47494      10   4,935      49,350     1,554.4      83.4      00:05:31
 47670       6   4,935      29,610     1,560.1      83.7      00:05:25
 47875       6   4,935      29,610     1,566.6      84.1      00:05:19
 48056       4   4,935      19,740     1,572.7      84.4      00:05:13
 48262      10   4,935      49,350     1,579.4      84.8      00:05:06
 48473       5   4,935      24,675     1,586.4      85.1      00:04:59
 48692      10   4,935      49,350     1,593.7      85.5      00:04:52
 48920       6   4,935      29,610     1,601.0      85.9      00:04:44
 49144      10   4,935      49,350     1,608.4      86.3      00:04:36
 49358       5   4,935      24,675     1,615.5      86.7      00:04:29
 49605       7   4,935      34,545     1,623.1      87.1      00:04:21
 49843       6   4,935      29,610     1,630.3      87.5      00:04:14
 50060       6   4,935      29,610     1,637.4      87.9      00:04:06
 50284       9   4,935      44,415     1,644.5      88.3      00:03:59
 50523      10   4,935      49,350     1,651.9      88.7      00:03:51
 50753       9   4,935      44,415     1,659.6      89.1      00:03:43
 50973      10   4,935      49,350     1,667.1      89.5      00:03:35
 51193       4   4,935      19,740     1,674.4      89.9      00:03:27
 51428      10   4,935      49,350     1,682.2      90.3      00:03:19
 51666       8   4,935      39,480     1,690.4      90.7      00:03:10
 51884       8   4,935      39,480     1,697.9      91.1      00:03:02
 52098       9   4,935      44,415     1,705.2      91.5      00:02:54
 52312       7   4,935      34,545     1,712.8      91.9      00:02:46
 52604       6   4,935      29,610     1,723.2      92.5      00:02:34
 52904       4   4,935      19,740     1,734.0      93.1      00:02:22
 53216      10   4,935      49,350     1,744.8      93.6      00:02:10
 53535       7   4,935      34,545     1,755.6      94.2      00:01:58
 53799      10   4,935      49,350     1,764.6      94.7      00:01:48
 54008       9   4,935      44,415     1,771.4      95.1      00:01:41
 54226      10   4,935      49,350     1,778.6      95.5      00:01:33
 54431       2   4,935       9,870     1,785.2      95.8      00:01:26
 54676      10   4,935      49,350     1,792.8      96.2      00:01:18
 54971       7   4,935      34,545     1,802.4      96.7      00:01:07
 55223       6   4,935      29,610     1,810.4      97.2      00:00:58
 55484      10   4,935      49,350     1,818.6      97.6      00:00:49
 55697       9   4,935      44,415     1,825.4      98.0      00:00:42
 55886       8   4,935      39,480     1,831.7      98.3      00:00:35
 56115       6   4,935      29,610     1,839.3      98.7      00:00:27
 56348       4   4,935      19,740     1,847.2      99.1      00:00:18
 56620       8   4,935      39,480     1,856.7      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 2067.435
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
