
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A900_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   316       6   4,935      29,610         9.1       0.5      00:34:05
   625      10   4,935      49,350        18.0       1.0      00:34:09
   910      10   4,935      49,350        26.6       1.4      00:34:33
  1205       9   4,935      44,415        36.0       1.9      00:33:50
  1492       6   4,935      29,610        45.5       2.4      00:33:20
  1788       8   4,935      39,480        54.9       3.0      00:32:57
  2095       6   4,935      29,610        64.5       3.5      00:32:35
  2385       8   4,935      39,480        73.6       4.0      00:32:26
  2687       8   4,935      39,480        83.1       4.5      00:32:10
  2979      10   4,935      49,350        92.3       5.0      00:32:01
  3251       8   4,935      39,480       101.5       5.5      00:31:51
  3543       8   4,935      39,480       111.1       6.0      00:31:34
  3832       7   4,935      34,545       120.4       6.5      00:31:23
  4051       9   4,935      44,415       127.1       6.8      00:31:55
  4264       2   4,935       9,870       133.5       7.2      00:32:26
  4464      10   4,935      49,350       139.7       7.5      00:32:57
  4655       9   4,935      44,415       146.1       7.8      00:33:22
  4863       8   4,935      39,480       152.7       8.2      00:33:39
  5072       5   4,935      24,675       159.4       8.6      00:33:54
  5281       7   4,935      34,545       166.0       8.9      00:34:09
  5465       6   4,935      29,610       171.8       9.2      00:34:31
  5684       4   4,935      19,740       178.3       9.6      00:34:43
  5849      10   4,935      49,350       183.4       9.8      00:35:10
  6039       6   4,935      29,610       189.7      10.2      00:35:20
  6255       8   4,935      39,480       196.5      10.6      00:35:25
  6460      10   4,935      49,350       202.8      10.9      00:35:32
  6651       4   4,935      19,740       208.7      11.2      00:35:45
  6857       6   4,935      29,610       215.1      11.6      00:35:49
  7089       8   4,935      39,480       222.4      11.9      00:35:43
  7355       6   4,935      29,610       230.9      12.4      00:35:25
  7609       9   4,935      44,415       239.1      12.8      00:35:10
  7865       5   4,935      24,675       247.5      13.3      00:34:53
  8106       8   4,935      39,480       255.7      13.7      00:34:39
  8347       9   4,935      44,415       263.9      14.2      00:34:25
  8558       9   4,935      44,415       271.1      14.6      00:34:20
  8791       8   4,935      39,480       278.8      15.0      00:34:10
  8995       6   4,935      29,610       285.6      15.3      00:34:07
  9213      10   4,935      49,350       293.1      15.7      00:33:60
  9414       6   4,935      29,610       299.8      16.1      00:33:58
  9602       7   4,935      34,545       306.4      16.5      00:33:57
  9806       7   4,935      34,545       313.3      16.8      00:33:53
 10005       7   4,935      34,545       319.6      17.2      00:33:53
 10198       8   4,935      39,480       325.3      17.5      00:33:58
 10386      10   4,935      49,350       331.1      17.8      00:34:00
 10596      10   4,935      49,350       337.7      18.1      00:33:57
 10814       5   4,935      24,675       344.6      18.5      00:33:52
 11050      10   4,935      49,350       352.3      18.9      00:33:40
 11259       8   4,935      39,480       359.0      19.3      00:33:36
 11448       6   4,935      29,610       365.1      19.6      00:33:35
 11652       9   4,935      44,415       371.6      20.0      00:33:31
 11850       4   4,935      19,740       378.0      20.3      00:33:28
 12049       7   4,935      34,545       384.5      20.6      00:33:24
 12241       8   4,935      39,480       390.8      21.0      00:33:22
 12500       9   4,935      44,415       399.1      21.4      00:33:06
 12786      10   4,935      49,350       408.0      21.9      00:32:46
 13082       7   4,935      34,545       417.4      22.4      00:32:24
 13371       4   4,935      19,740       426.8      22.9      00:32:03
 13609       6   4,935      29,610       435.2      23.4      00:31:47
 13799       4   4,935      19,740       441.2      23.7      00:31:46
 13972       9   4,935      44,415       446.7      24.0      00:31:46
 14207       9   4,935      44,415       454.5      24.4      00:31:35
 14431       8   4,935      39,480       462.0      24.8      00:31:24
 14667       6   4,935      29,610       469.8      25.2      00:31:13
 14891       5   4,935      24,675       477.0      25.6      00:31:04
 15148       9   4,935      44,415       485.8      26.1      00:30:47
 15417       6   4,935      29,610       494.7      26.6      00:30:29
 15703       4   4,935      19,740       503.9      27.1      00:30:11
 15985       8   4,935      39,480       513.6      27.6      00:29:50
 16255      10   4,935      49,350       522.9      28.1      00:29:32
 16505       9   4,935      44,415       531.5      28.5      00:29:18
 16740       6   4,935      29,610       539.1      28.9      00:29:08
 16935       9   4,935      44,415       545.4      29.3      00:29:03
 17121       3   4,935      14,805       551.5      29.6      00:28:60
 17312       9   4,935      44,415       557.9      30.0      00:28:55
 17490       6   4,935      29,610       564.2      30.3      00:28:50
 17668       5   4,935      24,675       570.2      30.6      00:28:47
 17901       6   4,935      29,610       577.6      31.0      00:28:37
 18161      10   4,935      49,350       586.4      31.5      00:28:22
 18458       8   4,935      39,480       595.8      32.0      00:28:04
 18616       6   4,935      29,610       601.2      32.3      00:28:03
 18798       6   4,935      29,610       607.3      32.6      00:27:58
 18998      10   4,935      49,350       614.3      33.0      00:27:50
 19199       6   4,935      29,610       621.1      33.4      00:27:43
 19459       7   4,935      34,545       629.8      33.8      00:27:28
 19732       5   4,935      24,675       639.4      34.3      00:27:10
 20002       8   4,935      39,480       648.8      34.8      00:26:53
 20296      10   4,935      49,350       658.6      35.4      00:26:34
 20525       6   4,935      29,610       666.3      35.8      00:26:24
 20701       9   4,935      44,415       672.3      36.1      00:26:19
 20867       6   4,935      29,610       677.9      36.4      00:26:17
 21039      10   4,935      49,350       683.4      36.7      00:26:14
 21252       7   4,935      34,545       689.9      37.0      00:26:07
 21448       9   4,935      44,415       696.0      37.4      00:26:02
 21645       8   4,935      39,480       702.1      37.7      00:25:57
 21846      10   4,935      49,350       708.3      38.0      00:25:52
 22029      10   4,935      49,350       714.1      38.3      00:25:47
 22242      10   4,935      49,350       720.4      38.7      00:25:41
 22453       8   4,935      39,480       726.9      39.0      00:25:34
 22641      10   4,935      49,350       733.0      39.4      00:25:29
 22915       8   4,935      39,480       741.1      39.8      00:25:17
 23179       9   4,935      44,415       749.8      40.3      00:25:02
 23451       4   4,935      19,740       758.4      40.7      00:24:48
 23721       4   4,935      19,740       766.9      41.2      00:24:35
 24008      10   4,935      49,350       776.3      41.7      00:24:19
 24282       7   4,935      34,545       784.7      42.1      00:24:05
 24553       6   4,935      29,610       793.4      42.6      00:23:51
 24833       5   4,935      24,675       802.6      43.1      00:23:36
 25103       5   4,935      24,675       811.4      43.6      00:23:22
 25373      10   4,935      49,350       820.2      44.0      00:23:08
 25623       9   4,935      44,415       828.1      44.5      00:22:57
 25806       4   4,935      19,740       834.5      44.8      00:22:50
 26005       6   4,935      29,610       841.0      45.2      00:22:43
 26184       7   4,935      34,545       846.9      45.5      00:22:38
 26434       6   4,935      29,610       854.9      45.9      00:22:27
 26686      10   4,935      49,350       862.8      46.3      00:22:15
 26921       8   4,935      39,480       870.5      46.7      00:22:05
 27141       5   4,935      24,675       877.7      47.1      00:21:56
 27342       6   4,935      29,610       884.2      47.5      00:21:49
 27526       5   4,935      24,675       890.2      47.8      00:21:43
 27760       5   4,935      24,675       897.9      48.2      00:21:32
 28033       7   4,935      34,545       907.0      48.7      00:21:17
 28320       9   4,935      44,415       916.7      49.2      00:21:01
 28593      10   4,935      49,350       926.2      49.7      00:20:46
 28788       9   4,935      44,415       932.8      50.1      00:20:39
 28965       8   4,935      39,480       938.8      50.4      00:20:33
 29184       9   4,935      44,415       945.9      50.8      00:20:24
 29415       8   4,935      39,480       953.7      51.2      00:20:13
 29671       8   4,935      39,480       961.9      51.7      00:20:01
 29849       4   4,935      19,740       968.0      52.0      00:19:55
 30021       4   4,935      19,740       973.7      52.3      00:19:49
 30202       6   4,935      29,610       979.8      52.6      00:19:43
 30419       9   4,935      44,415       987.1      53.0      00:19:33
 30637       6   4,935      29,610       994.5      53.4      00:19:23
 30923       8   4,935      39,480     1,004.1      53.9      00:19:08
 31190       7   4,935      34,545     1,013.0      54.4      00:18:54
 31461       8   4,935      39,480     1,022.3      54.9      00:18:40
 31747       6   4,935      29,610     1,032.0      55.4      00:18:25
 32029       9   4,935      44,415     1,041.9      56.0      00:18:09
 32306      10   4,935      49,350     1,051.6      56.5      00:17:54
 32536       9   4,935      44,415     1,059.5      56.9      00:17:43
 32694       7   4,935      34,545     1,064.8      57.2      00:17:38
 32879       7   4,935      34,545     1,071.1      57.5      00:17:31
 33066       9   4,935      44,415     1,077.6      57.9      00:17:24
 33271       7   4,935      34,545     1,084.6      58.2      00:17:15
 33497       7   4,935      34,545     1,092.3      58.7      00:17:04
 33726       6   4,935      29,610     1,100.2      59.1      00:16:54
 33961       8   4,935      39,480     1,108.3      59.5      00:16:42
 34192       6   4,935      29,610     1,116.5      60.0      00:16:31
 34475       4   4,935      19,740     1,126.2      60.5      00:16:16
 34764       5   4,935      24,675     1,136.1      61.0      00:16:01
 35059       7   4,935      34,545     1,146.2      61.6      00:15:46
 35345       9   4,935      44,415     1,156.0      62.1      00:15:31
 35638       6   4,935      29,610     1,166.1      62.6      00:15:16
 35930       7   4,935      34,545     1,175.9      63.1      00:15:01
 36223       5   4,935      24,675     1,185.9      63.7      00:14:46
 36513       8   4,935      39,480     1,195.6      64.2      00:14:32
 36689       5   4,935      24,675     1,201.5      64.5      00:14:25
 36874       8   4,935      39,480     1,207.7      64.9      00:14:18
 37080       3   4,935      14,805     1,214.4      65.2      00:14:10
 37287       5   4,935      24,675     1,220.6      65.5      00:14:03
 37487       9   4,935      44,415     1,226.9      65.9      00:13:56
 37704       9   4,935      44,415     1,233.8      66.3      00:13:47
 37899       5   4,935      24,675     1,240.2      66.6      00:13:39
 38101       5   4,935      24,675     1,247.0      67.0      00:13:31
 38323       9   4,935      44,415     1,254.6      67.4      00:13:21
 38551       8   4,935      39,480     1,262.4      67.8      00:13:11
 38851       7   4,935      34,545     1,272.3      68.3      00:12:56
 39061       8   4,935      39,480     1,279.3      68.7      00:12:47
 39229      10   4,935      49,350     1,284.6      69.0      00:12:42
 39432       6   4,935      29,610     1,291.1      69.3      00:12:34
 39633       6   4,935      29,610     1,297.8      69.7      00:12:25
 39866      10   4,935      49,350     1,305.3      70.1      00:12:15
 40141       7   4,935      34,545     1,314.3      70.6      00:12:03
 40408       7   4,935      34,545     1,323.2      71.1      00:11:50
 40684       5   4,935      24,675     1,332.5      71.6      00:11:37
 40921       5   4,935      24,675     1,340.6      72.0      00:11:26
 41094       5   4,935      24,675     1,346.3      72.3      00:11:20
 41283       8   4,935      39,480     1,352.6      72.6      00:11:12
 41490       7   4,935      34,545     1,359.5      73.0      00:11:03
 41682       5   4,935      24,675     1,365.9      73.4      00:10:55
 41878      10   4,935      49,350     1,372.6      73.7      00:10:47
 42040       5   4,935      24,675     1,377.7      74.0      00:10:41
 42198       5   4,935      24,675     1,382.6      74.3      00:10:36
 42344       6   4,935      29,610     1,387.2      74.5      00:10:31
 42478       7   4,935      34,545     1,391.9      74.7      00:10:26
 42630       6   4,935      29,610     1,396.6      75.0      00:10:21
 42807      10   4,935      49,350     1,402.5      75.3      00:10:14
 42993       9   4,935      44,415     1,408.8      75.7      00:10:06
 43178       7   4,935      34,545     1,415.3      76.0      00:09:58
 43353      10   4,935      49,350     1,421.2      76.3      00:09:51
 43566       7   4,935      34,545     1,428.1      76.7      00:09:42
 43840       6   4,935      29,610     1,437.0      77.2      00:09:29
 44097       7   4,935      34,545     1,445.3      77.6      00:09:18
 44251       7   4,935      34,545     1,450.5      77.9      00:09:12
 44429       4   4,935      19,740     1,456.0      78.2      00:09:05
 44653       7   4,935      34,545     1,463.4      78.6      00:08:55
 44861       5   4,935      24,675     1,470.4      79.0      00:08:46
 45080      10   4,935      49,350     1,477.5      79.3      00:08:37
 45323      10   4,935      49,350     1,484.7      79.7      00:08:27
 45508       8   4,935      39,480     1,490.7      80.1      00:08:20
 45723       9   4,935      44,415     1,497.3      80.4      00:08:11
 45953      10   4,935      49,350     1,504.8      80.8      00:08:01
 46184       7   4,935      34,545     1,512.6      81.2      00:07:50
 46407      10   4,935      49,350     1,519.9      81.6      00:07:40
 46606       5   4,935      24,675     1,526.7      82.0      00:07:32
 46867       7   4,935      34,545     1,535.4      82.5      00:07:19
 47076       7   4,935      34,545     1,541.7      82.8      00:07:11
 47263       9   4,935      44,415     1,547.3      83.1      00:07:04
 47417       8   4,935      39,480     1,552.2      83.4      00:06:58
 47612      10   4,935      49,350     1,558.4      83.7      00:06:50
 47807       5   4,935      24,675     1,564.8      84.0      00:06:42
 47997       8   4,935      39,480     1,571.1      84.4      00:06:34
 48196       9   4,935      44,415     1,577.5      84.7      00:06:25
 48403       7   4,935      34,545     1,584.4      85.1      00:06:16
 48629      10   4,935      49,350     1,591.9      85.5      00:06:06
 48858       4   4,935      19,740     1,599.4      85.9      00:05:56
 49021      10   4,935      49,350     1,604.7      86.2      00:05:49
 49209       6   4,935      29,610     1,611.2      86.5      00:05:40
 49396       8   4,935      39,480     1,616.8      86.8      00:05:33
 49617      10   4,935      49,350     1,623.6      87.2      00:05:24
 49832       6   4,935      29,610     1,630.2      87.5      00:05:15
 50027       8   4,935      39,480     1,636.7      87.9      00:05:07
 50232       8   4,935      39,480     1,643.1      88.2      00:04:58
 50461       8   4,935      39,480     1,650.3      88.6      00:04:48
 50675       7   4,935      34,545     1,657.3      89.0      00:04:39
 50871       9   4,935      44,415     1,664.0      89.4      00:04:30
 51075       6   4,935      29,610     1,671.1      89.7      00:04:20
 51299       8   4,935      39,480     1,678.3      90.1      00:04:10
 51511       6   4,935      29,610     1,685.5      90.5      00:04:01
 51733       8   4,935      39,480     1,693.2      90.9      00:03:50
 51935       6   4,935      29,610     1,700.0      91.3      00:03:41
 52203       9   4,935      44,415     1,709.6      91.8      00:03:28
 52461       7   4,935      34,545     1,718.7      92.3      00:03:15
 52723      10   4,935      49,350     1,728.2      92.8      00:03:02
 52967       6   4,935      29,610     1,736.7      93.3      00:02:50
 53244       6   4,935      29,610     1,746.3      93.8      00:02:37
 53543       7   4,935      34,545     1,756.5      94.3      00:02:23
 53789       4   4,935      19,740     1,764.7      94.8      00:02:12
 53993       7   4,935      34,545     1,771.5      95.1      00:02:03
 54197       6   4,935      29,610     1,778.2      95.5      00:01:54
 54427       7   4,935      34,545     1,785.3      95.9      00:01:44
 54695       6   4,935      29,610     1,793.9      96.3      00:01:32
 54951      10   4,935      49,350     1,802.2      96.8      00:01:21
 55212       7   4,935      34,545     1,810.5      97.2      00:01:10
 55459       5   4,935      24,675     1,818.2      97.6      00:00:59
 55699       9   4,935      44,415     1,825.9      98.1      00:00:49
 55872       6   4,935      29,610     1,831.7      98.4      00:00:41
 56099       5   4,935      24,675     1,839.3      98.8      00:00:31
 56311       8   4,935      39,480     1,846.5      99.2      00:00:21
 56534       7   4,935      34,545     1,854.2      99.6      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 2519.631
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
