
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_Do
> llar_locations_total_fixR200.dta /export/storage_covidvaccine/Result/MaxVaxHP
> IDistBLP/M5_K8000_4q_capcoef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR2
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  30 Oct 2023, 17:56:53

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capc
> oef/Dollar/vaccinated/ca_Dollar_locations_total_fixR200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capco
> ef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
   902       5   4,035      20,175        21.3       1.4      00:23:29
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   380       8   4,035      32,280         8.8       0.6      00:28:54
  1336      10   4,035      40,350        32.8       2.2      00:22:44
   793       7   4,035      28,245        19.0       1.2      00:26:30
  1772       7   4,035      28,245        44.4       2.9      00:22:16
  1212       5   4,035      20,175        29.5       1.9      00:25:23
  2214       6   4,035      24,210        55.7       3.7      00:22:00
  1615       8   4,035      32,280        40.3       2.6      00:24:35
  2652       6   4,035      24,210        66.8       4.4      00:21:49
  2023       4   4,035      16,140        50.6       3.3      00:24:17
  3096       9   4,035      36,315        78.4       5.1      00:21:33
  2432      10   4,035      40,350        61.2       4.0      00:23:55
  3519       9   4,035      36,315        90.0       5.9      00:21:16
  2828       5   4,035      20,175        71.6       4.7      00:23:41
  3945      10   4,035      40,350       101.1       6.6      00:21:09
  3213       7   4,035      28,245        81.7       5.4      00:23:34
  4327       4   4,035      16,140       110.5       7.3      00:21:20
  3585       3   4,035      12,105        91.8       6.0      00:23:26
  4694       7   4,035      28,245       120.3       7.9      00:21:25
  3968      10   4,035      40,350       101.6       6.7      00:23:22
  5057       4   4,035      16,140       129.8       8.5      00:21:30
  4327       4   4,035      16,140       110.5       7.3      00:23:28
  5407       3   4,035      12,105       139.1       9.1      00:21:36
  4675       9   4,035      36,315       119.8       7.9      00:23:29
  5651       9   4,035      36,315       144.8       9.5      00:22:15
  5031      10   4,035      40,350       129.1       8.5      00:23:26
  5900      10   4,035      40,350       151.1       9.9      00:22:45
  5390      10   4,035      40,350       138.6       9.1      00:23:21
  6131       8   4,035      32,280       157.2      10.3      00:23:12
  5686       9   4,035      36,315       145.7       9.6      00:23:42
  6366       7   4,035      28,245       163.2      10.7      00:23:40
  5944       6   4,035      24,210       152.3      10.0      00:24:03
  6604       3   4,035      12,105       169.3      11.1      00:24:02
  6211       7   4,035      28,245       159.3      10.5      00:24:19
  6902       5   4,035      20,175       176.9      11.6      00:24:08
  6476       9   4,035      36,315       166.0      10.9      00:24:35
  7256       5   4,035      20,175       185.8      12.2      00:24:02
  6761       7   4,035      28,245       173.2      11.4      00:24:45
  7605       5   4,035      20,175       195.2      12.8      00:23:51
  7103       9   4,035      36,315       182.1      12.0      00:24:37
  7953       6   4,035      24,210       204.7      13.4      00:23:40
  7472       8   4,035      32,280       191.7      12.6      00:24:23
  8302       4   4,035      16,140       214.3      14.1      00:23:27
  7840       3   4,035      12,105       201.4      13.2      00:24:07
  8664       9   4,035      36,315       224.3      14.7      00:23:12
  8198       7   4,035      28,245       211.5      13.9      00:23:50
  9017       8   4,035      32,280       234.0      15.4      00:23:00
  8552       7   4,035      28,245       221.3      14.5      00:23:35
  9311       8   4,035      32,280       242.2      15.9      00:22:58
  8915       7   4,035      28,245       231.2      15.2      00:23:20
  9574      10   4,035      40,350       249.5      16.4      00:23:01
  9249       8   4,035      32,280       240.4      15.8      00:23:10
  9875       4   4,035      16,140       257.7      16.9      00:22:58
  9512      10   4,035      40,350       247.7      16.3      00:23:14
 10143       7   4,035      28,245       264.4      17.4      00:23:03
  9797       6   4,035      24,210       255.7      16.8      00:23:11
 10449       5   4,035      20,175       272.3      17.9      00:23:01
 10081       8   4,035      32,280       263.1      17.3      00:23:12
 10745       6   4,035      24,210       279.9      18.4      00:22:60
 10402       7   4,035      28,245       271.0      17.8      00:23:10
 11044       4   4,035      16,140       287.7      18.9      00:22:57
 10732       6   4,035      24,210       279.6      18.4      00:23:02
 11333       8   4,035      32,280       295.2      19.4      00:22:55
 11059       9   4,035      36,315       288.1      18.9      00:22:55
 11610       3   4,035      12,105       302.5      19.9      00:22:55
 11364       8   4,035      32,280       296.1      19.4      00:22:51
 11941       4   4,035      16,140       311.3      20.4      00:22:45
 11673       7   4,035      28,245       304.2      20.0      00:22:46
 12286       8   4,035      32,280       320.5      21.0      00:22:34
 12029       7   4,035      28,245       313.6      20.6      00:22:33
 12689       8   4,035      32,280       331.1      21.7      00:22:15
 12350      10   4,035      40,350       322.1      21.1      00:22:26
 13069       5   4,035      20,175       340.8      22.4      00:22:01
 12729       9   4,035      36,315       332.1      21.8      00:22:10
 13434       8   4,035      32,280       350.5      23.0      00:21:47
 13091       9   4,035      36,315       341.3      22.4      00:21:59
 13688      10   4,035      40,350       357.7      23.5      00:21:46
 13440      10   4,035      40,350       350.7      23.0      00:21:47
 13940       9   4,035      36,315       364.3      23.9      00:21:47
 13697       8   4,035      32,280       358.0      23.5      00:21:45
 14249       9   4,035      36,315       372.5      24.5      00:21:40
 13945       8   4,035      32,280       364.4      23.9      00:21:47
 14580       6   4,035      24,210       381.6      25.0      00:21:29
 14273       7   4,035      28,245       373.2      24.5      00:21:37
 14919      10   4,035      40,350       390.6      25.6      00:21:18
 14588       9   4,035      36,315       381.8      25.1      00:21:29
 15290       6   4,035      24,210       400.8      26.3      00:21:03
 14942      10   4,035      40,350       391.2      25.7      00:21:16
 15689       6   4,035      24,210       411.4      27.0      00:20:45
 15330       9   4,035      36,315       401.9      26.4      00:20:58
 16071       9   4,035      36,315       422.2      27.7      00:20:28
 15706       8   4,035      32,280       411.9      27.0      00:20:44
 16462       5   4,035      20,175       433.2      28.4      00:20:10
 16074      10   4,035      40,350       422.3      27.7      00:20:28
 16757       7   4,035      28,245       441.0      28.9      00:20:05
 16449      10   4,035      40,350       432.8      28.4      00:20:12
 17019       5   4,035      20,175       448.0      29.4      00:20:02
 16743       7   4,035      28,245       440.6      28.9      00:20:07
 17324       8   4,035      32,280       456.2      29.9      00:19:55
 17021       8   4,035      32,280       448.1      29.4      00:20:02
 17590       7   4,035      28,245       463.9      30.4      00:19:50
 17320      10   4,035      40,350       456.1      29.9      00:19:56
 17930       8   4,035      32,280       472.9      31.0      00:19:40
 17616       8   4,035      32,280       464.6      30.5      00:19:48
 18175       6   4,035      24,210       479.6      31.5      00:19:37
 18000       8   4,035      32,280       474.7      31.2      00:19:33
 18486       5   4,035      20,175       487.6      32.0      00:19:31
 18242       6   4,035      24,210       481.5      31.6      00:19:31
 18748       7   4,035      28,245       495.0      32.5      00:19:26
 18533       8   4,035      32,280       488.9      32.1      00:19:26
 19069       2   4,035       8,070       503.9      33.1      00:19:15
 18807       5   4,035      20,175       496.6      32.6      00:19:21
 19389       8   4,035      32,280       512.7      33.7      00:19:05
 19109       5   4,035      20,175       505.0      33.1      00:19:12
 19800       6   4,035      24,210       524.5      34.4      00:18:46
 19427       8   4,035      32,280       513.9      33.7      00:19:02
 20202       9   4,035      36,315       535.9      35.2      00:18:28
 19808       7   4,035      28,245       524.7      34.4      00:18:46
 20568       9   4,035      36,315       545.8      35.8      00:18:15
 20187      10   4,035      40,350       535.4      35.1      00:18:30
 20823       7   4,035      28,245       552.8      36.3      00:18:11
 20548       7   4,035      28,245       545.2      35.8      00:18:17
 21111       8   4,035      32,280       560.5      36.8      00:18:04
 20820       9   4,035      36,315       552.7      36.3      00:18:11
 21400      10   4,035      40,350       567.5      37.2      00:18:00
 21127       5   4,035      20,175       560.8      36.8      00:18:04
 21697       8   4,035      32,280       575.2      37.8      00:17:54
 21424       8   4,035      32,280       568.1      37.3      00:17:59
 21983       6   4,035      24,210       582.4      38.2      00:17:49
 21703       8   4,035      32,280       575.3      37.8      00:17:53
 22264       3   4,035      12,105       589.4      38.7      00:17:44
 21991       7   4,035      28,245       582.6      38.2      00:17:48
 22548       9   4,035      36,315       596.6      39.2      00:17:38
 22280       2   4,035       8,070       589.7      38.7      00:17:43
 22841       9   4,035      36,315       603.8      39.6      00:17:33
 22563       4   4,035      16,140       597.0      39.2      00:17:38
 23123       6   4,035      24,210       611.3      40.1      00:17:26
 22854       7   4,035      28,245       604.1      39.6      00:17:32
 23460       6   4,035      24,210       620.3      40.7      00:17:16
 23122      10   4,035      40,350       611.3      40.1      00:17:27
 23803       7   4,035      28,245       629.1      41.3      00:17:05
 23437       7   4,035      28,245       619.8      40.7      00:17:17
 24138       5   4,035      20,175       637.9      41.9      00:16:55
 23782      10   4,035      40,350       628.5      41.3      00:17:07
 24572       9   4,035      36,315       649.0      42.6      00:16:39
 24092      10   4,035      40,350       636.8      41.8      00:16:58
 24993       8   4,035      32,280       660.1      43.3      00:16:23
 24495       6   4,035      24,210       646.9      42.5      00:16:45
 25397       7   4,035      28,245       671.1      44.0      00:16:07
 24874       7   4,035      28,245       657.1      43.1      00:16:31
 25730       8   4,035      32,280       679.8      44.6      00:15:57
 25267       6   4,035      24,210       667.6      43.8      00:16:16
 26020       6   4,035      24,210       687.7      45.1      00:15:50
 25640       5   4,035      20,175       677.3      44.5      00:16:04
 26371       5   4,035      20,175       697.2      45.8      00:15:38
 25872       9   4,035      36,315       683.8      44.9      00:15:60
 26775       7   4,035      28,245       707.5      46.4      00:15:24
 26198       7   4,035      28,245       692.5      45.5      00:15:50
 27129       5   4,035      20,175       716.9      47.1      00:15:13
 26544       8   4,035      32,280       701.5      46.0      00:15:39
 27375       8   4,035      32,280       723.5      47.5      00:15:08
 26879       9   4,035      36,315       710.3      46.6      00:15:29
 27643       2   4,035       8,070       730.7      48.0      00:15:02
 27186      10   4,035      40,350       718.5      47.2      00:15:20
 27903       8   4,035      32,280       737.9      48.4      00:14:56
 27442       7   4,035      28,245       725.2      47.6      00:15:15
 28267       6   4,035      24,210       747.6      49.1      00:14:44
 27722       6   4,035      24,210       732.8      48.1      00:15:08
 28624       5   4,035      20,175       757.8      49.7      00:14:31
 28023      10   4,035      40,350       741.1      48.6      00:14:59
 28886       9   4,035      36,315       765.0      50.2      00:14:24
 28374       8   4,035      32,280       750.7      49.3      00:14:47
 29218      10   4,035      40,350       774.0      50.8      00:14:14
 28705      10   4,035      40,350       760.0      49.9      00:14:36
 29583       6   4,035      24,210       783.8      51.4      00:14:01
 28959       9   4,035      36,315       767.1      50.3      00:14:29
 29896       6   4,035      24,210       792.4      52.0      00:13:52
 29286       7   4,035      28,245       775.8      50.9      00:14:19
 30210       6   4,035      24,210       801.0      52.6      00:13:42
 29624       6   4,035      24,210       784.9      51.5      00:14:08
 30517       6   4,035      24,210       809.5      53.1      00:13:33
 29937       8   4,035      32,280       793.5      52.1      00:13:59
 30893       2   4,035       8,070       819.8      53.8      00:13:20
 30238       8   4,035      32,280       801.8      52.6      00:13:50
 31293      10   4,035      40,350       830.7      54.5      00:13:05
 30523       7   4,035      28,245       809.7      53.1      00:13:41
 31679       7   4,035      28,245       841.5      55.2      00:12:51
 30846       9   4,035      36,315       818.6      53.7      00:13:31
 32053       8   4,035      32,280       852.2      55.9      00:12:38
 31222       7   4,035      28,245       828.7      54.4      00:13:18
 32447      10   4,035      40,350       863.5      56.7      00:12:23
 31596       8   4,035      32,280       839.2      55.1      00:13:04
 32765      10   4,035      40,350       872.3      57.3      00:12:13
 31965      10   4,035      40,350       849.7      55.8      00:12:51
 33057       8   4,035      32,280       880.5      57.8      00:12:04
 32333      10   4,035      40,350       860.1      56.5      00:12:37
 33354      10   4,035      40,350       888.8      58.3      00:11:55
 32645       7   4,035      28,245       868.9      57.0      00:12:27
 33698      10   4,035      40,350       898.5      59.0      00:11:44
 32889       6   4,035      24,210       875.7      57.5      00:12:21
 34061       9   4,035      36,315       908.6      59.6      00:11:32
 33112       8   4,035      32,280       882.0      57.9      00:12:16
 34428       4   4,035      16,140       919.0      60.3      00:11:19
 33391       8   4,035      32,280       889.7      58.4      00:12:08
 34838       7   4,035      28,245       930.7      61.1      00:11:04
 33690       8   4,035      32,280       898.2      59.0      00:11:58
 35236       7   4,035      28,245       941.8      61.8      00:10:50
 33979       5   4,035      20,175       906.3      59.5      00:11:50
 35641      10   4,035      40,350       953.1      62.6      00:10:36
 34271       6   4,035      24,210       914.7      60.0      00:11:40
 36050       9   4,035      36,315       964.4      63.3      00:10:21
 34629       7   4,035      28,245       924.6      60.7      00:11:28
 36451       9   4,035      36,315       975.7      64.0      00:10:08
 34976       5   4,035      20,175       934.6      61.3      00:11:16
 36781       5   4,035      20,175       984.4      64.6      00:09:58
 35323       9   4,035      36,315       944.2      62.0      00:11:04
 37040       4   4,035      16,140       991.4      65.1      00:09:51
 35646       5   4,035      20,175       953.2      62.6      00:10:53
 37315       4   4,035      16,140       998.4      65.5      00:09:45
 35983       6   4,035      24,210       962.5      63.2      00:10:42
 37578       8   4,035      32,280     1,005.3      66.0      00:09:38
 36309       8   4,035      32,280       971.7      63.8      00:10:32
 37844       6   4,035      24,210     1,012.2      66.4      00:09:32
 36615       9   4,035      36,315       980.1      64.3      00:10:22
 38105       5   4,035      20,175     1,019.4      66.9      00:09:25
 36865       6   4,035      24,210       986.7      64.8      00:10:16
 38365       9   4,035      36,315     1,026.5      67.4      00:09:18
 37131      10   4,035      40,350       993.9      65.2      00:10:09
 38670       6   4,035      24,210     1,035.0      67.9      00:09:09
 37401       7   4,035      28,245     1,000.7      65.7      00:10:02
 39014      10   4,035      40,350     1,044.4      68.6      00:08:58
 37652       3   4,035      12,105     1,007.3      66.1      00:09:56
 39285       9   4,035      36,315     1,051.5      69.0      00:08:51
 37900       9   4,035      36,315     1,013.8      66.5      00:09:49
 39591       9   4,035      36,315     1,059.7      69.6      00:08:42
 38150       6   4,035      24,210     1,020.6      67.0      00:09:43
 39913      10   4,035      40,350     1,068.2      70.1      00:08:32
 38405       8   4,035      32,280     1,027.7      67.5      00:09:35
 40329       6   4,035      24,210     1,079.3      70.8      00:08:19
 38715      10   4,035      40,350     1,036.2      68.0      00:09:25
 40730       6   4,035      24,210     1,090.4      71.6      00:08:06
 39048       4   4,035      16,140     1,045.4      68.6      00:09:15
 41076       7   4,035      28,245     1,100.0      72.2      00:07:54
 39322       5   4,035      20,175     1,052.5      69.1      00:09:07
 41346       9   4,035      36,315     1,107.3      72.7      00:07:47
 39620       8   4,035      32,280     1,060.5      69.6      00:08:58
 41638       9   4,035      36,315     1,115.3      73.2      00:07:38
 39937       5   4,035      20,175     1,068.9      70.2      00:08:48
 41934       6   4,035      24,210     1,123.5      73.7      00:07:29
 40332       4   4,035      16,140     1,079.3      70.8      00:08:35
 42214       9   4,035      36,315     1,130.6      74.2      00:07:22
 40712       8   4,035      32,280     1,089.9      71.5      00:08:22
 42530       7   4,035      28,245     1,139.1      74.8      00:07:13
 41033       9   4,035      36,315     1,098.9      72.1      00:08:12
 42820       5   4,035      20,175     1,146.7      75.3      00:07:05
 41262       8   4,035      32,280     1,105.1      72.5      00:08:06
 43101       9   4,035      36,315     1,154.5      75.8      00:06:56
 41541       5   4,035      20,175     1,112.6      73.0      00:07:57
 43390       7   4,035      28,245     1,162.7      76.3      00:06:47
 41801       9   4,035      36,315     1,119.8      73.5      00:07:50
 43681       9   4,035      36,315     1,170.3      76.8      00:06:39
 42039       6   4,035      24,210     1,126.2      73.9      00:07:43
 43947       6   4,035      24,210     1,177.5      77.3      00:06:32
 42349       4   4,035      16,140     1,134.0      74.4      00:07:34
 44224       9   4,035      36,315     1,184.9      77.8      00:06:24
 42615       7   4,035      28,245     1,141.3      74.9      00:07:26
 44492       6   4,035      24,210     1,191.8      78.2      00:06:16
 42866      10   4,035      40,350     1,148.1      75.4      00:07:19
 44790       5   4,035      20,175     1,199.9      78.8      00:06:08
 43092      10   4,035      40,350     1,154.3      75.8      00:07:13
 45070       9   4,035      36,315     1,207.5      79.3      00:05:59
 43313       8   4,035      32,280     1,160.5      76.2      00:07:06
 45411       6   4,035      24,210     1,216.0      79.8      00:05:50
 43571       7   4,035      28,245     1,167.5      76.6      00:06:59
 45697       8   4,035      32,280     1,223.3      80.3      00:05:42
 43947       6   4,035      24,210     1,177.5      77.3      00:06:46
 45989       8   4,035      32,280     1,231.0      80.8      00:05:33
 44220       7   4,035      28,245     1,184.8      77.8      00:06:38
 46276       7   4,035      28,245     1,239.1      81.3      00:05:24
 44451       7   4,035      28,245     1,190.7      78.2      00:06:32
 46571      10   4,035      40,350     1,247.0      81.8      00:05:16
 44715       6   4,035      24,210     1,197.9      78.6      00:06:24
 46908       2   4,035       8,070     1,256.2      82.5      00:05:05
 44988       6   4,035      24,210     1,205.3      79.1      00:06:16
 47135       3   4,035      12,105     1,261.8      82.8      00:04:59
 45299       7   4,035      28,245     1,213.3      79.6      00:06:06
 47387       8   4,035      32,280     1,268.2      83.2      00:04:52
 45580       6   4,035      24,210     1,220.4      80.1      00:05:58
 47669       8   4,035      32,280     1,275.5      83.7      00:04:44
 45858       8   4,035      32,280     1,227.5      80.6      00:05:50
 47996       6   4,035      24,210     1,284.3      84.3      00:04:34
 46143      10   4,035      40,350     1,235.2      81.1      00:05:41
 48335       7   4,035      28,245     1,293.4      84.9      00:04:24
 46425       9   4,035      36,315     1,243.0      81.6      00:05:32
 48697       6   4,035      24,210     1,303.2      85.5      00:04:12
 46740       8   4,035      32,280     1,251.6      82.1      00:05:22
 49090       6   4,035      24,210     1,313.6      86.2      00:04:00
 47019       8   4,035      32,280     1,258.9      82.6      00:05:14
 49469       7   4,035      28,245     1,323.7      86.9      00:03:48
 47251       7   4,035      28,245     1,264.7      83.0      00:05:08
 49775       6   4,035      24,210     1,331.2      87.4      00:03:40
 47547       7   4,035      28,245     1,272.2      83.5      00:04:59
 50047       8   4,035      32,280     1,338.4      87.8      00:03:32
 47856       5   4,035      20,175     1,280.4      84.0      00:04:49
 50300       8   4,035      32,280     1,345.0      88.3      00:03:25
 48195       5   4,035      20,175     1,289.5      84.6      00:04:38
 50569      10   4,035      40,350     1,352.0      88.7      00:03:17
 48509       5   4,035      20,175     1,298.1      85.2      00:04:28
 50828      10   4,035      40,350     1,359.0      89.2      00:03:09
 48840       7   4,035      28,245     1,306.9      85.8      00:04:17
 51090       4   4,035      16,140     1,366.4      89.7      00:03:01
 49221       5   4,035      20,175     1,317.4      86.5      00:04:05
 51378       5   4,035      20,175     1,374.0      90.2      00:02:52
 49527       5   4,035      20,175     1,325.1      87.0      00:03:56
 51656       7   4,035      28,245     1,381.8      90.7      00:02:43
 49804       7   4,035      28,245     1,332.0      87.4      00:03:48
 51943       7   4,035      28,245     1,389.8      91.2      00:02:34
 50050       8   4,035      32,280     1,338.5      87.9      00:03:40
 52207       5   4,035      20,175     1,397.5      91.7      00:02:26
 50340       4   4,035      16,140     1,345.9      88.3      00:03:32
 52533       7   4,035      28,245     1,406.9      92.3      00:02:15
 50622       5   4,035      20,175     1,353.4      88.8      00:03:23
 52888      10   4,035      40,350     1,417.4      93.0      00:02:02
 50906       8   4,035      32,280     1,361.1      89.3      00:03:14
 53242       6   4,035      24,210     1,427.3      93.7      00:01:51
 51197       4   4,035      16,140     1,369.1      89.9      00:03:04
 53609       7   4,035      28,245     1,437.6      94.4      00:01:39
 51489       9   4,035      36,315     1,377.1      90.4      00:02:55
 53886      10   4,035      40,350     1,445.1      94.9      00:01:30
 51779      10   4,035      40,350     1,385.3      90.9      00:02:45
 54172       8   4,035      32,280     1,452.9      95.4      00:01:21
 52078       9   4,035      36,315     1,393.6      91.5      00:02:35
 54467       6   4,035      24,210     1,460.5      95.9      00:01:13
 52387       9   4,035      36,315     1,402.6      92.1      00:02:24
 54790       6   4,035      24,210     1,468.9      96.4      00:01:03
 52740      10   4,035      40,350     1,413.1      92.7      00:02:12
 55101       7   4,035      28,245     1,477.1      96.9      00:00:54
 53089       8   4,035      32,280     1,423.0      93.4      00:01:60
 55379       9   4,035      36,315     1,484.2      97.4      00:00:45
 53449       6   4,035      24,210     1,433.0      94.1      00:01:48
 55677       7   4,035      28,245     1,491.9      97.9      00:00:37
 53780      10   4,035      40,350     1,442.3      94.7      00:01:37
 55953       7   4,035      28,245     1,499.5      98.4      00:00:28
 54054       3   4,035      12,105     1,449.6      95.1      00:01:28
 56220       5   4,035      20,175     1,506.8      98.9      00:00:19
 54347      10   4,035      40,350     1,457.6      95.7      00:01:19
 56479       8   4,035      32,280     1,514.2      99.4      00:00:11
 54672       4   4,035      16,140     1,465.7      96.2      00:01:09
 54981       9   4,035      36,315     1,474.0      96.7      00:00:59

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1769.589
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 55264       7   4,035      28,245     1,481.4      97.2      00:00:50
 55556       1   4,035       4,035     1,488.7      97.7      00:00:42
 55854       5   4,035      20,175     1,496.7      98.2      00:00:32
 56127       9   4,035      36,315     1,504.2      98.7      00:00:23
 56368       8   4,035      32,280     1,510.9      99.2      00:00:15
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/
    > Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR200.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR200.csv saved

. 
. cap log close

. 
end of do-file
 56652       8   4,035      32,280     1,518.9      99.7      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1824.802
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR200.csv saved

. 
. cap log close

. 
end of do-file
