
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed457.dta /export/storage_covidva
> ccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_d
> ist_total_10000_5_4q_mnl_A1000_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed457.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed457.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   290       8   5,035      40,280         8.2       0.4      00:38:18
   609       6   5,035      30,210        17.8       0.9      00:35:18
   931       6   5,035      30,210        27.6       1.4      00:34:05
  1225       7   5,035      35,245        37.2       2.0      00:33:27
  1513       8   5,035      40,280        46.9       2.5      00:33:01
  1818      10   5,035      50,350        56.7       3.0      00:32:35
  2121       8   5,035      40,280        66.4       3.5      00:32:18
  2463      10   5,035      50,350        77.3       4.1      00:31:30
  2774       9   5,035      45,315        87.5       4.6      00:31:09
  3083       9   5,035      45,315        97.3       5.1      00:30:58
  3411       4   5,035      20,140       108.7       5.7      00:30:19
  3729       7   5,035      35,245       119.3       6.3      00:29:57
  3990       5   5,035      25,175       127.5       6.7      00:30:13
  4248       7   5,035      35,245       135.6       7.1      00:30:27
  4503       8   5,035      40,280       143.7       7.6      00:30:38
  4734       8   5,035      40,280       151.6       8.0      00:30:51
  4992       5   5,035      25,175       159.9       8.4      00:30:55
  5238       8   5,035      40,280       167.8       8.8      00:31:03
  5471       7   5,035      35,245       175.4       9.2      00:31:13
  5740      10   5,035      50,350       183.4       9.6      00:31:18
  5998       6   5,035      30,210       191.8      10.1      00:31:16
  6248       7   5,035      35,245       200.0      10.5      00:31:15
  6510       8   5,035      40,280       208.2      11.0      00:31:14
  6781       9   5,035      45,315       216.8      11.4      00:31:09
  7080      10   5,035      50,350       226.4      11.9      00:30:53
  7418       9   5,035      45,315       237.4      12.5      00:30:26
  7708       7   5,035      35,245       246.8      13.0      00:30:14
  8030      10   5,035      50,350       258.0      13.6      00:29:47
  8361       2   5,035      10,070       269.5      14.2      00:29:19
  8714       8   5,035      40,280       281.5      14.8      00:28:50
  9046       6   5,035      30,210       293.0      15.4      00:28:25
  9303       3   5,035      15,105       301.9      15.9      00:28:18
  9538      10   5,035      50,350       310.0      16.3      00:28:17
  9776      10   5,035      50,350       318.4      16.7      00:28:14
 10034       9   5,035      45,315       326.7      17.2      00:28:10
 10320       7   5,035      35,245       335.4      17.6      00:28:04
 10598       6   5,035      30,210       344.5      18.1      00:27:56
 10886       9   5,035      45,315       353.8      18.6      00:27:45
 11154       6   5,035      30,210       362.6      19.1      00:27:39
 11409       9   5,035      45,315       371.0      19.5      00:27:34
 11668       9   5,035      45,315       379.4      20.0      00:27:28
 11923       9   5,035      45,315       387.8      20.4      00:27:22
 12190       8   5,035      40,280       396.9      20.9      00:27:13
 12479       9   5,035      45,315       406.1      21.4      00:27:03
 12792       7   5,035      35,245       416.2      21.9      00:26:49
 13112       6   5,035      30,210       426.6      22.4      00:26:33
 13454       9   5,035      45,315       438.2      23.0      00:26:13
 13691       2   5,035      10,070       446.5      23.5      00:26:07
 13936       9   5,035      45,315       454.4      23.9      00:26:03
 14223      10   5,035      50,350       464.0      24.4      00:25:52
 14458       5   5,035      25,175       472.0      24.8      00:25:47
 14700       6   5,035      30,210       480.1      25.3      00:25:42
 15004       9   5,035      45,315       490.4      25.8      00:25:28
 15396       8   5,035      40,280       503.9      26.5      00:25:01
 15765       9   5,035      45,315       516.1      27.1      00:24:39
 16141       9   5,035      45,315       529.4      27.8      00:24:14
 16501       2   5,035      10,070       541.9      28.5      00:23:53
 16744       5   5,035      25,175       549.8      28.9      00:23:48
 16971       5   5,035      25,175       557.5      29.3      00:23:45
 17237       6   5,035      30,210       566.3      29.8      00:23:37
 17476      10   5,035      50,350       574.7      30.2      00:23:31
 17710       4   5,035      20,140       582.8      30.7      00:23:25
 18009      10   5,035      50,350       592.7      31.2      00:23:14
 18382       4   5,035      20,140       605.4      31.8      00:22:53
 18655       8   5,035      40,280       614.4      32.3      00:22:44
 18928       7   5,035      35,245       623.8      32.8      00:22:34
 19217       8   5,035      40,280       634.0      33.3      00:22:22
 19574       4   5,035      20,140       646.4      34.0      00:22:03
 19946       7   5,035      35,245       659.6      34.7      00:21:41
 20334       8   5,035      40,280       672.9      35.4      00:21:20
 20643       9   5,035      45,315       683.6      36.0      00:21:07
 20924      10   5,035      50,350       693.4      36.5      00:20:57
 21241      10   5,035      50,350       703.3      37.0      00:20:46
 21530       8   5,035      40,280       712.5      37.5      00:20:37
 21828       4   5,035      20,140       721.6      38.0      00:20:28
 22108       5   5,035      25,175       730.5      38.4      00:20:20
 22422       4   5,035      20,140       740.3      38.9      00:20:10
 22717       6   5,035      30,210       749.9      39.4      00:19:60
 22989       7   5,035      35,245       758.3      39.9      00:19:53
 23238       8   5,035      40,280       766.7      40.3      00:19:46
 23496       6   5,035      30,210       775.0      40.8      00:19:39
 23762       7   5,035      35,245       783.6      41.2      00:19:32
 24014       6   5,035      30,210       792.0      41.7      00:19:25
 24341       5   5,035      25,175       802.2      42.2      00:19:13
 24660       7   5,035      35,245       812.9      42.8      00:19:00
 24979       6   5,035      30,210       823.3      43.3      00:18:48
 25307       6   5,035      30,210       834.4      43.9      00:18:34
 25648       8   5,035      40,280       845.4      44.5      00:18:21
 25877      10   5,035      50,350       853.5      44.9      00:18:15
 26099       7   5,035      35,245       860.9      45.3      00:18:10
 26406       4   5,035      20,140       871.0      45.8      00:17:58
 26759       7   5,035      35,245       882.3      46.4      00:17:45
 27079       7   5,035      35,245       893.0      47.0      00:17:32
 27345      10   5,035      50,350       901.8      47.4      00:17:24
 27554       7   5,035      35,245       908.8      47.8      00:17:19
 27823       9   5,035      45,315       917.9      48.3      00:17:10
 28134       6   5,035      30,210       928.6      48.8      00:16:58
 28466       8   5,035      40,280       939.9      49.4      00:16:44
 28727      10   5,035      50,350       949.1      49.9      00:16:35
 28950       6   5,035      30,210       956.8      50.3      00:16:29
 29204       9   5,035      45,315       965.4      50.8      00:16:21
 29545      10   5,035      50,350       977.0      51.4      00:16:07
 29836       9   5,035      45,315       986.7      51.9      00:15:56
 30062       7   5,035      35,245       994.4      52.3      00:15:50
 30312       7   5,035      35,245     1,003.0      52.8      00:15:42
 30590       8   5,035      40,280     1,012.6      53.3      00:15:32
 30924       7   5,035      35,245     1,024.1      53.9      00:15:18
 31275       9   5,035      45,315     1,036.0      54.5      00:15:04
 31606       5   5,035      25,175     1,047.5      55.1      00:14:50
 31900       7   5,035      35,245     1,058.0      55.6      00:14:38
 32223       9   5,035      45,315     1,069.4      56.3      00:14:25
 32531       7   5,035      35,245     1,080.4      56.8      00:14:12
 32740       8   5,035      40,280     1,087.5      57.2      00:14:07
 32995      10   5,035      50,350     1,096.5      57.7      00:13:58
 33231       6   5,035      30,210     1,104.7      58.1      00:13:51
 33500       6   5,035      30,210     1,114.0      58.6      00:13:41
 33801       7   5,035      35,245     1,124.7      59.2      00:13:29
 34115       4   5,035      20,140     1,135.7      59.7      00:13:17
 34446       9   5,035      45,315     1,147.5      60.4      00:13:03
 34821       8   5,035      40,280     1,160.7      61.1      00:12:47
 35204       7   5,035      35,245     1,174.1      61.8      00:12:31
 35610       6   5,035      30,210     1,188.2      62.5      00:12:13
 36016      10   5,035      50,350     1,202.3      63.2      00:11:56
 36415       9   5,035      45,315     1,216.2      64.0      00:11:40
 36712       3   5,035      15,105     1,226.3      64.5      00:11:29
 37013       4   5,035      20,140     1,236.3      65.0      00:11:19
 37330       6   5,035      30,210     1,246.3      65.6      00:11:09
 37597       5   5,035      25,175     1,255.1      66.0      00:11:00
 37882       5   5,035      25,175     1,264.4      66.5      00:10:51
 38151       6   5,035      30,210     1,273.5      67.0      00:10:42
 38423       8   5,035      40,280     1,283.0      67.5      00:10:32
 38736       8   5,035      40,280     1,293.8      68.1      00:10:21
 39083       5   5,035      25,175     1,305.6      68.7      00:10:08
 39373       7   5,035      35,245     1,315.2      69.2      00:09:58
 39711      10   5,035      50,350     1,326.2      69.8      00:09:46
 40076       8   5,035      40,280     1,338.4      70.4      00:09:33
 40460       6   5,035      30,210     1,351.4      71.1      00:09:18
 40841       7   5,035      35,245     1,364.5      71.8      00:09:04
 41159       6   5,035      30,210     1,375.4      72.3      00:08:52
 41469       6   5,035      30,210     1,385.9      72.9      00:08:41
 41792       3   5,035      15,105     1,396.9      73.5      00:08:30
 42044      10   5,035      50,350     1,405.5      73.9      00:08:22
 42308       8   5,035      40,280     1,413.7      74.4      00:08:14
 42534       8   5,035      40,280     1,421.5      74.8      00:08:07
 42818       6   5,035      30,210     1,430.8      75.3      00:07:58
 43107       9   5,035      45,315     1,440.9      75.8      00:07:47
 43398       3   5,035      15,105     1,451.1      76.3      00:07:37
 43716       6   5,035      30,210     1,461.4      76.9      00:07:26
 43998       8   5,035      40,280     1,471.0      77.4      00:07:16
 44287       7   5,035      35,245     1,480.6      77.9      00:07:07
 44618       9   5,035      45,315     1,491.5      78.5      00:06:55
 44918       9   5,035      45,315     1,501.7      79.0      00:06:45
 45283       9   5,035      45,315     1,513.5      79.6      00:06:33
 45595       3   5,035      15,105     1,523.3      80.1      00:06:23
 45926       7   5,035      35,245     1,533.9      80.7      00:06:12
 46214       9   5,035      45,315     1,543.9      81.2      00:06:02
 46533       9   5,035      45,315     1,554.6      81.8      00:05:51
 46893       7   5,035      35,245     1,567.0      82.4      00:05:38
 47193       8   5,035      40,280     1,576.2      82.9      00:05:28
 47478       9   5,035      45,315     1,585.3      83.4      00:05:19
 47716       6   5,035      30,210     1,593.2      83.8      00:05:12
 47991       6   5,035      30,210     1,602.4      84.3      00:05:03
 48272       5   5,035      25,175     1,611.7      84.8      00:04:53
 48553       9   5,035      45,315     1,621.3      85.3      00:04:44
 48888       9   5,035      45,315     1,632.5      85.9      00:04:32
 49171       9   5,035      45,315     1,642.1      86.4      00:04:22
 49478       7   5,035      35,245     1,652.0      86.9      00:04:12
 49776       7   5,035      35,245     1,661.2      87.4      00:04:03
 50048       7   5,035      35,245     1,670.1      87.8      00:03:54
 50350      10   5,035      50,350     1,679.8      88.4      00:03:44
 50648       7   5,035      35,245     1,689.7      88.9      00:03:34
 50928       6   5,035      30,210     1,699.3      89.4      00:03:25
 51229       7   5,035      35,245     1,709.5      89.9      00:03:14
 51525       9   5,035      45,315     1,719.6      90.4      00:03:04
 51822       5   5,035      25,175     1,730.2      91.0      00:02:53
 52145       9   5,035      45,315     1,741.4      91.6      00:02:42
 52481      10   5,035      50,350     1,753.6      92.2      00:02:29
 52860       7   5,035      35,245     1,767.6      93.0      00:02:15
 53261       9   5,035      45,315     1,781.7      93.7      00:02:00
 53662       8   5,035      40,280     1,795.7      94.5      00:01:46
 53957       8   5,035      40,280     1,805.6      95.0      00:01:36
 54231       7   5,035      35,245     1,814.8      95.5      00:01:27
 54538       5   5,035      25,175     1,824.5      96.0      00:01:17
 54827       4   5,035      20,140     1,834.1      96.5      00:01:07
 55100       4   5,035      20,140     1,843.1      96.9      00:00:58
 55398       9   5,035      45,315     1,852.7      97.4      00:00:49
 55685       8   5,035      40,280     1,861.9      97.9      00:00:40
 55939       8   5,035      40,280     1,870.6      98.4      00:00:31
 56225      10   5,035      50,350     1,880.4      98.9      00:00:21
 56520       6   5,035      30,210     1,890.9      99.5      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 1919.079
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed457
    > .csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed457.csv sa
> ved

. 
. cap log close

. 
end of do-file
