
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A700_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   232       7   4,735      33,145         6.3       0.4      00:47:13
   480       4   4,735      18,940        13.1       0.7      00:45:11
   687       8   4,735      37,880        19.1       1.1      00:46:24
   911       8   4,735      37,880        25.6       1.4      00:46:03
  1063       5   4,735      23,675        30.3       1.7      00:48:30
  1253       7   4,735      33,145        36.1       2.0      00:48:37
  1445       7   4,735      33,145        42.2       2.4      00:48:21
  1638       6   4,735      28,410        48.2       2.7      00:48:16
  1833      10   4,735      47,350        54.0       3.0      00:48:16
  2032       8   4,735      37,880        59.9       3.4      00:48:13
  2259       9   4,735      42,615        66.9       3.7      00:47:17
  2470       2   4,735       9,470        73.1       4.1      00:46:60
  2686       7   4,735      33,145        79.7       4.5      00:46:32
  2860       6   4,735      28,410        85.2       4.8      00:46:42
  3079      10   4,735      47,350        91.6       5.1      00:46:22
  3292       9   4,735      42,615        98.8       5.5      00:45:42
  3507       2   4,735       9,470       105.4       5.9      00:45:17
  3715       6   4,735      28,410       112.0       6.3      00:44:59
  3906      10   4,735      47,350       117.7       6.6      00:44:60
  4069       8   4,735      37,880       122.5       6.9      00:45:24
  4206       5   4,735      23,675       126.6       7.1      00:46:01
  4334       5   4,735      23,675       130.1       7.3      00:46:48
  4461       9   4,735      42,615       134.0       7.5      00:47:25
  4565       6   4,735      28,410       137.2       7.7      00:48:14
  4671       9   4,735      42,615       140.7       7.9      00:48:55
  4802       8   4,735      37,880       144.7       8.1      00:49:21
  4921       9   4,735      42,615       148.3       8.3      00:49:53
  5025       5   4,735      23,675       151.6       8.5      00:50:32
  5138       8   4,735      37,880       154.9       8.7      00:51:06
  5263       7   4,735      33,145       158.7       8.9      00:51:29
  5398       8   4,735      37,880       163.2       9.1      00:51:37
  5524       5   4,735      23,675       166.5       9.3      00:52:07
  5639       6   4,735      28,410       169.8       9.5      00:52:35
  5734       8   4,735      37,880       172.5       9.7      00:53:13
  5842       6   4,735      28,410       175.8       9.8      00:53:40
  5969       6   4,735      28,410       179.7      10.1      00:53:51
  6073      10   4,735      47,350       183.1      10.2      00:54:15
  6201       8   4,735      37,880       186.9      10.5      00:54:28
  6331      10   4,735      47,350       190.6      10.7      00:54:40
  6463       8   4,735      37,880       194.7      10.9      00:54:46
  6582       8   4,735      37,880       198.2      11.1      00:55:00
  6715       9   4,735      42,615       202.0      11.3      00:55:09
  6865       6   4,735      28,410       206.7      11.6      00:55:03
  6990       8   4,735      37,880       210.5      11.8      00:55:10
  7160      10   4,735      47,350       215.3      12.1      00:54:59
  7324       6   4,735      28,410       220.5      12.3      00:54:43
  7510       8   4,735      37,880       226.2      12.7      00:54:17
  7686      10   4,735      47,350       231.6      13.0      00:53:57
  7860       8   4,735      37,880       237.3      13.3      00:53:34
  8001       6   4,735      28,410       241.9      13.5      00:53:27
  8171       9   4,735      42,615       247.5      13.9      00:53:05
  8362       8   4,735      37,880       253.6      14.2      00:52:37
  8517       3   4,735      14,205       258.7      14.5      00:52:24
  8670       9   4,735      42,615       263.5      14.8      00:52:15
  8835       7   4,735      33,145       268.9      15.0      00:51:58
  9008      10   4,735      47,350       274.5      15.4      00:51:39
  9189       8   4,735      37,880       280.4      15.7      00:51:15
  9302       4   4,735      18,940       284.1      15.9      00:51:21
  9418       8   4,735      37,880       287.8      16.1      00:51:26
  9545       8   4,735      37,880       292.0      16.3      00:51:24
  9658       9   4,735      42,615       295.9      16.6      00:51:27
  9772       8   4,735      37,880       299.5      16.8      00:51:31
  9895       8   4,735      37,880       303.3      17.0      00:51:34
 10018       9   4,735      42,615       307.0      17.2      00:51:38
 10142       5   4,735      23,675       310.5      17.4      00:51:44
 10287       8   4,735      37,880       314.6      17.6      00:51:41
 10410       4   4,735      18,940       318.5      17.8      00:51:42
 10562       9   4,735      42,615       323.1      18.1      00:51:34
 10723       6   4,735      28,410       328.0      18.4      00:51:22
 10876       5   4,735      23,675       332.7      18.6      00:51:13
 11000       4   4,735      18,940       336.6      18.8      00:51:12
 11122       7   4,735      33,145       340.2      19.0      00:51:14
 11242       9   4,735      42,615       343.8      19.2      00:51:16
 11378       7   4,735      33,145       348.1      19.5      00:51:12
 11488       8   4,735      37,880       351.6      19.7      00:51:14
 11623       8   4,735      37,880       355.6      19.9      00:51:11
 11753       7   4,735      33,145       359.6      20.1      00:51:09
 11884       7   4,735      33,145       363.8      20.4      00:51:04
 12026      10   4,735      47,350       368.2      20.6      00:50:56
 12167       8   4,735      37,880       372.7      20.9      00:50:48
 12336       7   4,735      33,145       377.8      21.1      00:50:33
 12558       5   4,735      23,675       384.7      21.5      00:50:01
 12800       6   4,735      28,410       391.8      21.9      00:49:27
 13014       3   4,735      14,205       398.4      22.3      00:48:59
 13225       5   4,735      23,675       405.0      22.7      00:48:32
 13445       6   4,735      28,410       412.1      23.1      00:48:00
 13588       6   4,735      28,410       416.9      23.3      00:47:50
 13676       9   4,735      42,615       419.7      23.5      00:47:58
 13815       8   4,735      37,880       423.8      23.7      00:47:54
 13930       8   4,735      37,880       427.4      23.9      00:47:54
 14087       6   4,735      28,410       432.1      24.2      00:47:44
 14227       5   4,735      23,675       436.7      24.4      00:47:35
 14361       9   4,735      42,615       441.1      24.7      00:47:28
 14506       8   4,735      37,880       445.7      24.9      00:47:20
 14666      10   4,735      47,350       450.7      25.2      00:47:07
 14817       6   4,735      28,410       455.4      25.5      00:46:58
 15039       4   4,735      18,940       462.6      25.9      00:46:28
 15267       7   4,735      33,145       469.9      26.3      00:45:57
 15504       5   4,735      23,675       477.4      26.7      00:45:26
 15714       5   4,735      23,675       483.8      27.1      00:45:03
 15914       8   4,735      37,880       490.5      27.5      00:44:40
 16120       9   4,735      42,615       497.4      27.8      00:44:14
 16309       6   4,735      28,410       503.5      28.2      00:43:56
 16456       8   4,735      37,880       508.4      28.5      00:43:45
 16612       6   4,735      28,410       513.1      28.7      00:43:37
 16745       9   4,735      42,615       517.4      29.0      00:43:30
 16873       8   4,735      37,880       521.3      29.2      00:43:27
 16992       7   4,735      33,145       525.2      29.4      00:43:24
 17110       6   4,735      28,410       528.8      29.6      00:43:23
 17221       9   4,735      42,615       532.3      29.8      00:43:22
 17317       6   4,735      28,410       535.5      30.0      00:43:24
 17445       9   4,735      42,615       539.7      30.2      00:43:18
 17573       4   4,735      18,940       544.1      30.5      00:43:11
 17721       9   4,735      42,615       548.7      30.7      00:43:02
 17874       9   4,735      42,615       553.4      31.0      00:42:53
 18040       8   4,735      37,880       558.6      31.3      00:42:40
 18298       8   4,735      37,880       567.0      31.7      00:42:07
 18512       4   4,735      18,940       573.3      32.1      00:41:47
 18643       7   4,735      33,145       577.7      32.3      00:41:40
 18751       6   4,735      28,410       581.2      32.5      00:41:39
 18874       6   4,735      28,410       585.2      32.8      00:41:34
 18986       6   4,735      28,410       589.0      33.0      00:41:31
 19112       7   4,735      33,145       593.0      33.2      00:41:25
 19235       6   4,735      28,410       597.1      33.4      00:41:20
 19431       8   4,735      37,880       603.4      33.8      00:41:00
 19648       9   4,735      42,615       610.6      34.2      00:40:36
 19874       7   4,735      33,145       618.1      34.6      00:40:10
 20077       7   4,735      33,145       625.1      35.0      00:39:47
 20275       5   4,735      23,675       631.3      35.3      00:39:30
 20476       8   4,735      37,880       637.7      35.7      00:39:11
 20593       8   4,735      37,880       641.6      35.9      00:39:07
 20704       5   4,735      23,675       645.1      36.1      00:39:05
 20814      10   4,735      47,350       648.6      36.3      00:39:03
 20936      10   4,735      47,350       652.7      36.5      00:38:57
 21112       9   4,735      42,615       658.0      36.8      00:38:45
 21253       9   4,735      42,615       662.0      37.1      00:38:40
 21404      10   4,735      47,350       666.3      37.3      00:38:32
 21535       1   4,735       4,735       670.6      37.5      00:38:26
 21683       4   4,735      18,940       674.7      37.8      00:38:20
 21822       8   4,735      37,880       678.8      38.0      00:38:14
 21984       9   4,735      42,615       683.8      38.3      00:38:03
 22151       6   4,735      28,410       688.5      38.5      00:37:54
 22269       7   4,735      33,145       692.0      38.7      00:37:51
 22406       5   4,735      23,675       696.0      39.0      00:37:45
 22547       6   4,735      28,410       700.3      39.2      00:37:38
 22698       6   4,735      28,410       705.0      39.5      00:37:29
 22904       7   4,735      33,145       710.7      39.8      00:37:14
 23093       5   4,735      23,675       716.7      40.1      00:36:58
 23274       9   4,735      42,615       722.5      40.4      00:36:43
 23453       6   4,735      28,410       727.8      40.7      00:36:31
 23670      10   4,735      47,350       734.2      41.1      00:36:13
 23882       6   4,735      28,410       741.0      41.5      00:35:53
 24086       3   4,735      14,205       747.2      41.8      00:35:37
 24326       5   4,735      23,675       754.0      42.2      00:35:17
 24536       7   4,735      33,145       760.7      42.6      00:34:58
 24725       7   4,735      33,145       766.8      42.9      00:34:43
 24901       2   4,735       9,470       772.0      43.2      00:34:31
 25078       9   4,735      42,615       777.8      43.5      00:34:17
 25241       9   4,735      42,615       782.9      43.8      00:34:06
 25412       6   4,735      28,410       788.2      44.1      00:33:54
 25571       6   4,735      28,410       793.0      44.4      00:33:45
 25685       5   4,735      23,675       796.6      44.6      00:33:41
 25816      10   4,735      47,350       801.0      44.8      00:33:33
 25944       5   4,735      23,675       804.9      45.1      00:33:28
 26079      10   4,735      47,350       809.3      45.3      00:33:20
 26255       7   4,735      33,145       814.9      45.6      00:33:07
 26443       9   4,735      42,615       820.5      45.9      00:32:54
 26613       8   4,735      37,880       825.6      46.2      00:32:43
 26787      10   4,735      47,350       831.1      46.5      00:32:31
 26945       5   4,735      23,675       836.0      46.8      00:32:20
 27092       6   4,735      28,410       840.5      47.0      00:32:12
 27229       9   4,735      42,615       844.8      47.3      00:32:05
 27372       7   4,735      33,145       849.2      47.5      00:31:57
 27504       8   4,735      37,880       853.5      47.8      00:31:50
 27644       6   4,735      28,410       857.9      48.0      00:31:42
 27768       3   4,735      14,205       861.8      48.2      00:31:36
 27908       7   4,735      33,145       866.4      48.5      00:31:27
 28107       6   4,735      28,410       872.8      48.9      00:31:11
 28334       8   4,735      37,880       880.0      49.3      00:30:51
 28550       7   4,735      33,145       887.3      49.7      00:30:32
 28712      10   4,735      47,350       892.5      50.0      00:30:20
 28823       6   4,735      28,410       896.1      50.2      00:30:16
 28936       7   4,735      33,145       899.8      50.4      00:30:11
 29063      10   4,735      47,350       903.9      50.6      00:30:04
 29230       2   4,735       9,470       908.9      50.9      00:29:54
 29384       7   4,735      33,145       914.0      51.2      00:29:42
 29590       4   4,735      18,940       920.4      51.5      00:29:27
 29759       8   4,735      37,880       925.9      51.8      00:29:15
 29901       9   4,735      42,615       930.4      52.1      00:29:06
 30040       9   4,735      42,615       934.8      52.3      00:28:58
 30159       8   4,735      37,880       938.7      52.5      00:28:52
 30289       5   4,735      23,675       942.8      52.8      00:28:45
 30415       9   4,735      42,615       946.9      53.0      00:28:38
 30548       7   4,735      33,145       951.3      53.2      00:28:30
 30749      10   4,735      47,350       957.8      53.6      00:28:14
 30915      10   4,735      47,350       963.1      53.9      00:28:02
 31118       6   4,735      28,410       969.5      54.3      00:27:47
 31326       9   4,735      42,615       976.3      54.6      00:27:30
 31512       8   4,735      37,880       982.5      55.0      00:27:15
 31694       6   4,735      28,410       988.5      55.3      00:27:01
 31931       8   4,735      37,880       996.4      55.8      00:26:40
 32155       8   4,735      37,880     1,003.8      56.2      00:26:21
 32327       6   4,735      28,410     1,009.7      56.5      00:26:08
 32494       7   4,735      33,145     1,015.2      56.8      00:25:56
 32594       9   4,735      42,615     1,018.5      57.0      00:25:52
 32680       5   4,735      23,675     1,021.2      57.2      00:25:50
 32789       7   4,735      33,145     1,024.9      57.4      00:25:44
 32908      10   4,735      47,350     1,028.7      57.6      00:25:38
 33037      10   4,735      47,350     1,033.0      57.8      00:25:30
 33165       7   4,735      33,145     1,037.2      58.1      00:25:23
 33338       7   4,735      33,145     1,042.8      58.4      00:25:11
 33489       8   4,735      37,880     1,047.7      58.6      00:25:01
 33612       7   4,735      33,145     1,052.0      58.9      00:24:53
 33745       9   4,735      42,615     1,056.3      59.1      00:24:45
 33884       9   4,735      42,615     1,060.9      59.4      00:24:36
 34024       7   4,735      33,145     1,065.4      59.6      00:24:28
 34172       7   4,735      33,145     1,070.6      59.9      00:24:17
 34354       5   4,735      23,675     1,076.6      60.3      00:24:03
 34580      10   4,735      47,350     1,083.9      60.7      00:23:45
 34797       7   4,735      33,145     1,091.2      61.1      00:23:27
 35014       8   4,735      37,880     1,098.3      61.5      00:23:10
 35235       4   4,735      18,940     1,105.6      61.9      00:22:53
 35468       8   4,735      37,880     1,113.3      62.3      00:22:34
 35683       8   4,735      37,880     1,120.2      62.7      00:22:18
 35898       9   4,735      42,615     1,127.2      63.1      00:22:01
 36120       6   4,735      28,410     1,134.5      63.5      00:21:44
 36341       5   4,735      23,675     1,141.7      63.9      00:21:27
 36522      10   4,735      47,350     1,147.5      64.2      00:21:15
 36641       8   4,735      37,880     1,151.5      64.4      00:21:08
 36788       3   4,735      14,205     1,155.9      64.7      00:20:60
 36951       9   4,735      42,615     1,161.1      65.0      00:20:49
 37117      10   4,735      47,350     1,166.2      65.3      00:20:39
 37257      10   4,735      47,350     1,170.3      65.5      00:20:32
 37387       6   4,735      28,410     1,174.2      65.7      00:20:25
 37508       8   4,735      37,880     1,177.8      65.9      00:20:19
 37620       6   4,735      28,410     1,181.4      66.1      00:20:13
 37779      10   4,735      47,350     1,186.2      66.4      00:20:04
 37956      10   4,735      47,350     1,191.8      66.7      00:19:52
 38165       4   4,735      18,940     1,198.6      67.1      00:19:37
 38376       8   4,735      37,880     1,205.5      67.5      00:19:21
 38603      10   4,735      47,350     1,212.8      67.9      00:19:05
 38909       9   4,735      42,615     1,222.6      68.4      00:18:40
 39124       6   4,735      28,410     1,229.5      68.8      00:18:25
 39326       7   4,735      33,145     1,235.7      69.2      00:18:12
 39583       9   4,735      42,615     1,243.7      69.6      00:17:53
 39836       9   4,735      42,615     1,251.6      70.1      00:17:36
 40177       4   4,735      18,940     1,262.3      70.7      00:17:10
 40498       9   4,735      42,615     1,272.5      71.2      00:16:46
 40828       9   4,735      42,615     1,283.1      71.8      00:16:21
 41072       9   4,735      42,615     1,291.1      72.3      00:16:03
 41317       8   4,735      37,880     1,298.9      72.7      00:15:46
 41579       7   4,735      33,145     1,307.3      73.2      00:15:27
 41830       9   4,735      42,615     1,315.3      73.6      00:15:10
 42069       6   4,735      28,410     1,322.8      74.0      00:14:54
 42315       6   4,735      28,410     1,330.1      74.4      00:14:39
 42566       6   4,735      28,410     1,338.1      74.9      00:14:21
 42839       7   4,735      33,145     1,346.7      75.4      00:14:02
 43111       8   4,735      37,880     1,355.7      75.9      00:13:43
 43359       7   4,735      33,145     1,363.8      76.3      00:13:26
 43623       5   4,735      23,675     1,371.9      76.8      00:13:09
 43883       5   4,735      23,675     1,380.2      77.2      00:12:51
 44142      10   4,735      47,350     1,388.1      77.7      00:12:35
 44368       5   4,735      23,675     1,395.0      78.1      00:12:21
 44673       8   4,735      37,880     1,404.8      78.6      00:12:00
 44973       9   4,735      42,615     1,414.3      79.2      00:11:40
 45315       5   4,735      23,675     1,424.4      79.7      00:11:19
 45597       9   4,735      42,615     1,432.9      80.2      00:11:02
 45913       8   4,735      37,880     1,442.4      80.7      00:10:42
 46224       5   4,735      23,675     1,452.6      81.3      00:10:21
 46549       9   4,735      42,615     1,463.0      81.9      00:09:59
 46887       3   4,735      14,205     1,473.8      82.5      00:09:37
 47181       9   4,735      42,615     1,482.1      83.0      00:09:21
 47459       9   4,735      42,615     1,490.6      83.4      00:09:04
 47733       4   4,735      18,940     1,499.1      83.9      00:08:47
 48003       3   4,735      14,205     1,507.6      84.4      00:08:31
 48270       6   4,735      28,410     1,516.0      84.9      00:08:14
 48591       5   4,735      23,675     1,526.2      85.4      00:07:54
 48907       7   4,735      33,145     1,536.1      86.0      00:07:35
 49236       6   4,735      28,410     1,546.6      86.6      00:07:15
 49535       1   4,735       4,735     1,555.5      87.1      00:06:58
 49809      10   4,735      47,350     1,563.5      87.5      00:06:42
 50084       7   4,735      33,145     1,572.1      88.0      00:06:26
 50381       5   4,735      23,675     1,580.8      88.5      00:06:10
 50655       5   4,735      23,675     1,589.5      89.0      00:05:53
 50953       6   4,735      28,410     1,599.4      89.5      00:05:35
 51277       5   4,735      23,675     1,609.6      90.1      00:05:16
 51552       4   4,735      18,940     1,618.5      90.6      00:04:59
 51842       5   4,735      23,675     1,628.2      91.1      00:04:41
 52195       5   4,735      23,675     1,640.0      91.8      00:04:19
 52563       7   4,735      33,145     1,652.6      92.5      00:03:56
 52932       5   4,735      23,675     1,665.1      93.2      00:03:33
 53300      10   4,735      47,350     1,677.3      93.9      00:03:11
 53657       6   4,735      28,410     1,689.0      94.5      00:02:50
 53946       4   4,735      18,940     1,698.1      95.0      00:02:34
 54224       8   4,735      37,880     1,706.9      95.5      00:02:18
 54550       5   4,735      23,675     1,716.5      96.1      00:02:01
 54884       7   4,735      33,145     1,727.0      96.7      00:01:43
 55183       9   4,735      42,615     1,736.2      97.2      00:01:27
 55477       7   4,735      33,145     1,745.1      97.7      00:01:11
 55775       9   4,735      42,615     1,754.2      98.2      00:00:56
 56083       9   4,735      42,615     1,764.2      98.7      00:00:38
 56386       5   4,735      23,675     1,774.2      99.3      00:00:21
 56716       6   4,735      28,410     1,785.0      99.9      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 3048.308
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
