
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A100_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   243       4   4,135      16,540         5.8       0.4      00:44:58
   479       6   4,135      24,810        11.4       0.7      00:45:13
   718       8   4,135      33,080        17.5       1.1      00:44:15
   963       5   4,135      20,675        23.7       1.5      00:43:23
  1173       8   4,135      33,080        29.4       1.9      00:43:36
  1387      10   4,135      41,350        35.2       2.3      00:43:28
  1602       8   4,135      33,080        41.1       2.6      00:43:18
  1845       6   4,135      24,810        47.5       3.0      00:42:37
  2075      10   4,135      41,350        53.4       3.4      00:42:28
  2302       8   4,135      33,080        59.6       3.8      00:42:09
  2554       4   4,135      16,540        66.0       4.2      00:41:38
  2797       9   4,135      37,215        72.8       4.7      00:41:01
  3032       7   4,135      28,945        78.8       5.0      00:40:53
  3261       8   4,135      33,080        85.4       5.5      00:40:27
  3481       6   4,135      24,810        91.4       5.9      00:40:18
  3677       7   4,135      28,945        96.8       6.2      00:40:28
  3887       9   4,135      37,215       102.3       6.6      00:40:30
  4029       8   4,135      33,080       105.9       6.8      00:41:22
  4170       9   4,135      37,215       109.6       7.0      00:42:05
  4286       9   4,135      37,215       112.4       7.2      00:43:07
  4436       3   4,135      12,405       116.3       7.5      00:43:38
  4616       9   4,135      37,215       121.3       7.8      00:43:40
  4790       6   4,135      24,810       126.0       8.1      00:43:47
  4970       5   4,135      20,675       130.8       8.4      00:43:52
  5151       6   4,135      24,810       135.7       8.7      00:43:55
  5340      10   4,135      41,350       140.8       9.0      00:43:52
  5489       6   4,135      24,810       144.5       9.3      00:44:15
  5607       6   4,135      24,810       147.4       9.4      00:44:53
  5755       9   4,135      37,215       151.3       9.7      00:45:10
  5903      10   4,135      41,350       155.2       9.9      00:45:27
  6084       8   4,135      33,080       160.2      10.3      00:45:20
  6264       7   4,135      28,945       164.9      10.6      00:45:19
  6447       7   4,135      28,945       169.6      10.9      00:45:17
  6608       9   4,135      37,215       173.7      11.1      00:45:24
  6795      10   4,135      41,350       178.6      11.4      00:45:17
  6955       4   4,135      16,540       182.8      11.7      00:45:22
  7139       6   4,135      24,810       187.5      12.0      00:45:18
  7343       8   4,135      33,080       193.1      12.4      00:45:00
  7526       9   4,135      37,215       198.0      12.7      00:44:52
  7705       5   4,135      20,675       202.8      13.0      00:44:47
  7905       8   4,135      33,080       208.5      13.4      00:44:27
  8086       9   4,135      37,215       213.7      13.7      00:44:16
  8267       8   4,135      33,080       218.7      14.0      00:44:07
  8448       7   4,135      28,945       224.0      14.4      00:43:54
  8618       6   4,135      24,810       228.8      14.7      00:43:48
  8783       8   4,135      33,080       233.3      15.0      00:43:45
  8942      10   4,135      41,350       237.9      15.2      00:43:42
  9125       8   4,135      33,080       243.0      15.6      00:43:31
  9264       8   4,135      33,080       247.0      15.8      00:43:35
  9362       8   4,135      33,080       249.7      16.0      00:43:54
  9447       5   4,135      20,675       252.1      16.2      00:44:17
  9588       9   4,135      37,215       256.2      16.4      00:44:17
  9736       7   4,135      28,945       260.5      16.7      00:44:14
  9870      10   4,135      41,350       264.2      16.9      00:44:20
 10004       9   4,135      37,215       267.7      17.2      00:44:26
 10138       8   4,135      33,080       271.0      17.4      00:44:35
 10299       8   4,135      33,080       275.1      17.6      00:44:34
 10422       5   4,135      20,675       278.5      17.8      00:44:41
 10578       6   4,135      24,810       282.5      18.1      00:44:39
 10756       5   4,135      20,675       287.2      18.4      00:44:30
 10917       5   4,135      20,675       291.6      18.7      00:44:24
 11096       6   4,135      24,810       296.4      19.0      00:44:15
 11243       9   4,135      37,215       300.3      19.2      00:44:14
 11352       9   4,135      37,215       303.3      19.4      00:44:23
 11469       8   4,135      33,080       306.5      19.6      00:44:30
 11608       8   4,135      33,080       310.1      19.9      00:44:31
 11755       7   4,135      28,945       314.1      20.1      00:44:29
 11902       7   4,135      28,945       318.1      20.4      00:44:26
 12059       7   4,135      28,945       322.5      20.7      00:44:19
 12225       7   4,135      28,945       327.0      21.0      00:44:10
 12435       9   4,135      37,215       332.5      21.3      00:43:52
 12628       5   4,135      20,675       337.8      21.6      00:43:36
 12847      10   4,135      41,350       343.5      22.0      00:43:17
 13039      10   4,135      41,350       348.6      22.3      00:43:02
 13270       3   4,135      12,405       354.8      22.7      00:42:38
 13500       2   4,135       8,270       361.5      23.2      00:42:10
 13649       9   4,135      37,215       365.7      23.4      00:42:05
 13778      10   4,135      41,350       369.2      23.7      00:42:07
 13917       9   4,135      37,215       372.9      23.9      00:42:06
 14064       6   4,135      24,810       376.8      24.2      00:42:02
 14229       8   4,135      33,080       381.4      24.4      00:41:54
 14390      10   4,135      41,350       386.0      24.7      00:41:45
 14572       7   4,135      28,945       391.0      25.1      00:41:32
 14759       8   4,135      33,080       396.1      25.4      00:41:19
 14986       7   4,135      28,945       402.5      25.8      00:40:55
 15226       5   4,135      20,675       409.2      26.2      00:40:28
 15441       5   4,135      20,675       415.1      26.6      00:40:10
 15660       6   4,135      24,810       421.0      27.0      00:39:50
 15870       5   4,135      20,675       427.0      27.4      00:39:31
 16102       6   4,135      24,810       433.8      27.8      00:39:06
 16267       9   4,135      37,215       438.5      28.1      00:38:57
 16432       8   4,135      33,080       443.3      28.4      00:38:47
 16559       6   4,135      24,810       446.7      28.6      00:38:47
 16710      10   4,135      41,350       450.8      28.9      00:38:42
 16868       8   4,135      33,080       455.1      29.2      00:38:36
 16991       7   4,135      28,945       458.6      29.4      00:38:35
 17110       6   4,135      24,810       461.8      29.6      00:38:36
 17228       5   4,135      20,675       465.1      29.8      00:38:37
 17372       8   4,135      33,080       469.2      30.1      00:38:31
 17491      10   4,135      41,350       472.8      30.3      00:38:29
 17622       9   4,135      37,215       476.5      30.5      00:38:26
 17772       6   4,135      24,810       480.4      30.8      00:38:22
 17948       8   4,135      33,080       485.3      31.1      00:38:11
 18126       5   4,135      20,675       490.3      31.4      00:37:58
 18322       8   4,135      33,080       495.8      31.8      00:37:43
 18506       9   4,135      37,215       500.5      32.1      00:37:33
 18611       9   4,135      37,215       503.6      32.3      00:37:34
 18748       9   4,135      37,215       507.5      32.5      00:37:29
 18865       7   4,135      28,945       510.7      32.7      00:37:29
 19002       6   4,135      24,810       514.8      33.0      00:37:23
 19157      10   4,135      41,350       519.2      33.3      00:37:14
 19304       7   4,135      28,945       523.4      33.5      00:37:08
 19528       9   4,135      37,215       529.8      34.0      00:36:46
 19733       7   4,135      28,945       535.8      34.3      00:36:28
 19963       5   4,135      20,675       542.4      34.8      00:36:06
 20162      10   4,135      41,350       548.2      35.1      00:35:50
 20352      10   4,135      41,350       553.3      35.5      00:35:37
 20505       9   4,135      37,215       557.7      35.7      00:35:29
 20634       7   4,135      28,945       561.4      36.0      00:35:26
 20742      10   4,135      41,350       564.4      36.2      00:35:26
 20855       6   4,135      24,810       567.6      36.4      00:35:24
 20964       4   4,135      16,540       570.7      36.6      00:35:24
 21121       7   4,135      28,945       574.8      36.8      00:35:17
 21250      10   4,135      41,350       578.0      37.0      00:35:16
 21364       8   4,135      33,080       580.9      37.2      00:35:16
 21494       6   4,135      24,810       584.4      37.5      00:35:12
 21648       8   4,135      33,080       588.4      37.7      00:35:06
 21803       9   4,135      37,215       592.3      38.0      00:35:00
 21927       6   4,135      24,810       595.6      38.2      00:34:57
 22029      10   4,135      41,350       598.3      38.3      00:34:58
 22183       3   4,135      12,405       602.1      38.6      00:34:53
 22353       6   4,135      24,810       606.5      38.9      00:34:44
 22513       8   4,135      33,080       610.7      39.1      00:34:36
 22673       9   4,135      37,215       615.0      39.4      00:34:28
 22889       8   4,135      33,080       620.2      39.8      00:34:14
 23074       7   4,135      28,945       625.4      40.1      00:34:01
 23260       6   4,135      24,810       630.6      40.4      00:33:48
 23463       6   4,135      24,810       635.8      40.7      00:33:35
 23675       5   4,135      20,675       641.3      41.1      00:33:20
 23876       8   4,135      33,080       647.0      41.5      00:33:04
 24076       4   4,135      16,540       652.3      41.8      00:32:50
 24311       4   4,135      16,540       658.2      42.2      00:32:34
 24501       7   4,135      28,945       663.4      42.5      00:32:21
 24679       8   4,135      33,080       668.5      42.8      00:32:09
 24865      10   4,135      41,350       673.4      43.2      00:31:57
 25051       5   4,135      20,675       678.4      43.5      00:31:45
 25208       1   4,135       4,135       682.8      43.8      00:31:37
 25400      10   4,135      41,350       688.0      44.1      00:31:24
 25570       5   4,135      20,675       692.5      44.4      00:31:14
 25713       8   4,135      33,080       696.5      44.6      00:31:07
 25869       9   4,135      37,215       700.9      44.9      00:30:58
 26029       7   4,135      28,945       705.3      45.2      00:30:50
 26166       9   4,135      37,215       709.1      45.4      00:30:44
 26344       4   4,135      16,540       714.0      45.8      00:30:33
 26538       8   4,135      33,080       719.0      46.1      00:30:21
 26717       5   4,135      20,675       723.7      46.4      00:30:10
 26896      10   4,135      41,350       728.6      46.7      00:29:59
 27066      10   4,135      41,350       733.3      47.0      00:29:49
 27203      10   4,135      41,350       737.0      47.2      00:29:43
 27332       6   4,135      24,810       740.6      47.5      00:29:38
 27445       8   4,135      33,080       743.7      47.7      00:29:35
 27561       8   4,135      33,080       746.9      47.9      00:29:31
 27724       5   4,135      20,675       751.4      48.2      00:29:21
 27878       5   4,135      20,675       755.8      48.4      00:29:12
 28069      10   4,135      41,350       761.1      48.8      00:28:59
 28288       5   4,135      20,675       767.2      49.2      00:28:42
 28501      10   4,135      41,350       773.4      49.6      00:28:26
 28680       8   4,135      33,080       778.4      49.9      00:28:14
 28793       8   4,135      33,080       781.7      50.1      00:28:10
 28906       9   4,135      37,215       784.9      50.3      00:28:06
 29025       8   4,135      33,080       788.2      50.5      00:28:02
 29164       9   4,135      37,215       792.0      50.8      00:27:55
 29356      10   4,135      41,350       797.4      51.1      00:27:42
 29529       6   4,135      24,810       802.1      51.4      00:27:31
 29684       9   4,135      37,215       806.4      51.7      00:27:23
 29796       9   4,135      37,215       809.6      51.9      00:27:18
 29934       8   4,135      33,080       813.4      52.1      00:27:12
 30055       9   4,135      37,215       816.8      52.4      00:27:07
 30154       9   4,135      37,215       819.6      52.5      00:27:04
 30303       7   4,135      28,945       823.7      52.8      00:26:56
 30454       5   4,135      20,675       828.1      53.1      00:26:47
 30586       7   4,135      28,945       831.9      53.3      00:26:40
 30780      10   4,135      41,350       837.3      53.7      00:26:26
 30964       9   4,135      37,215       842.4      54.0      00:26:14
 31146       7   4,135      28,945       847.5      54.3      00:26:02
 31359       9   4,135      37,215       853.5      54.7      00:25:46
 31576       4   4,135      16,540       859.8      55.1      00:25:30
 31782       4   4,135      16,540       865.7      55.5      00:25:14
 31964       7   4,135      28,945       871.1      55.8      00:25:01
 32180      10   4,135      41,350       877.4      56.2      00:24:45
 32362       8   4,135      33,080       882.8      56.6      00:24:31
 32505       9   4,135      37,215       886.9      56.8      00:24:24
 32620       5   4,135      20,675       890.1      57.0      00:24:19
 32721       6   4,135      24,810       893.0      57.2      00:24:15
 32855      10   4,135      41,350       896.8      57.5      00:24:08
 32966      10   4,135      41,350       900.1      57.7      00:24:03
 33086       9   4,135      37,215       903.6      57.9      00:23:57
 33235       9   4,135      37,215       907.7      58.2      00:23:49
 33380      10   4,135      41,350       911.9      58.4      00:23:40
 33504       8   4,135      33,080       915.4      58.7      00:23:34
 33642      10   4,135      41,350       919.5      58.9      00:23:26
 33754       9   4,135      37,215       922.7      59.1      00:23:21
 33896       7   4,135      28,945       926.7      59.4      00:23:13
 34043      10   4,135      41,350       931.0      59.7      00:23:04
 34173       9   4,135      37,215       934.9      59.9      00:22:57
 34375       6   4,135      24,810       940.7      60.3      00:22:42
 34607       6   4,135      24,810       947.4      60.7      00:22:24
 34826       6   4,135      24,810       953.8      61.1      00:22:08
 35070       6   4,135      24,810       960.7      61.6      00:21:49
 35309       9   4,135      37,215       967.6      62.0      00:21:31
 35532       6   4,135      24,810       974.0      62.4      00:21:15
 35739      10   4,135      41,350       979.8      62.8      00:21:01
 35924       7   4,135      28,945       985.1      63.1      00:20:48
 36136       4   4,135      16,540       991.2      63.5      00:20:33
 36365       7   4,135      28,945       997.8      64.0      00:20:17
 36531       7   4,135      28,945     1,002.3      64.2      00:20:07
 36614       9   4,135      37,215     1,004.8      64.4      00:20:04
 36765       3   4,135      12,405     1,008.7      64.7      00:19:56
 36879       6   4,135      24,810     1,012.0      64.9      00:19:51
 37022       5   4,135      20,675     1,015.8      65.1      00:19:44
 37130       8   4,135      33,080     1,018.7      65.3      00:19:39
 37264       9   4,135      37,215     1,022.2      65.5      00:19:33
 37382       7   4,135      28,945     1,025.3      65.7      00:19:28
 37498       7   4,135      28,945     1,028.3      65.9      00:19:23
 37608       6   4,135      24,810     1,031.4      66.1      00:19:18
 37732       8   4,135      33,080     1,034.6      66.3      00:19:13
 37856       8   4,135      33,080     1,038.0      66.5      00:19:06
 37994       6   4,135      24,810     1,041.8      66.8      00:18:59
 38117      10   4,135      41,350     1,045.3      67.0      00:18:53
 38244       6   4,135      24,810     1,048.9      67.2      00:18:46
 38348       6   4,135      24,810     1,051.9      67.4      00:18:41
 38484       8   4,135      33,080     1,055.9      67.7      00:18:33
 38683       6   4,135      24,810     1,061.4      68.0      00:18:19
 38901       8   4,135      33,080     1,067.5      68.4      00:18:04
 39033       6   4,135      24,810     1,071.2      68.7      00:17:57
 39173       7   4,135      28,945     1,074.9      68.9      00:17:50
 39314       8   4,135      33,080     1,078.8      69.1      00:17:42
 39480       6   4,135      24,810     1,083.2      69.4      00:17:32
 39624       3   4,135      12,405     1,087.2      69.7      00:17:24
 39740      10   4,135      41,350     1,090.3      69.9      00:17:19
 39916       9   4,135      37,215     1,095.2      70.2      00:17:07
 40143       9   4,135      37,215     1,101.3      70.6      00:16:52
 40359       8   4,135      33,080     1,107.2      71.0      00:16:38
 40564       8   4,135      33,080     1,113.1      71.3      00:16:24
 40808       6   4,135      24,810     1,120.0      71.8      00:16:07
 40963       9   4,135      37,215     1,124.5      72.1      00:15:57
 41083      10   4,135      41,350     1,127.8      72.3      00:15:51
 41221       8   4,135      33,080     1,131.7      72.5      00:15:43
 41391       8   4,135      33,080     1,136.3      72.8      00:15:33
 41558       8   4,135      33,080     1,141.0      73.1      00:15:22
 41736       9   4,135      37,215     1,146.0      73.5      00:15:11
 41907       9   4,135      37,215     1,151.0      73.8      00:14:60
 42048       7   4,135      28,945     1,154.6      74.0      00:14:52
 42174       3   4,135      12,405     1,157.8      74.2      00:14:46
 42316       5   4,135      20,675     1,161.5      74.4      00:14:39
 42399       5   4,135      20,675     1,164.0      74.6      00:14:35
 42506       5   4,135      20,675     1,167.0      74.8      00:14:30
 42631       6   4,135      24,810     1,170.2      75.0      00:14:23
 42792       8   4,135      33,080     1,174.7      75.3      00:14:13
 43005       7   4,135      28,945     1,180.7      75.7      00:13:59
 43181      10   4,135      41,350     1,186.0      76.0      00:13:47
 43326       7   4,135      28,945     1,190.0      76.3      00:13:38
 43465      10   4,135      41,350     1,193.9      76.5      00:13:30
 43646       6   4,135      24,810     1,198.7      76.8      00:13:20
 43819       5   4,135      20,675     1,203.4      77.1      00:13:09
 43998       7   4,135      28,945     1,208.4      77.4      00:12:58
 44145       9   4,135      37,215     1,212.4      77.7      00:12:49
 44255       8   4,135      33,080     1,215.5      77.9      00:12:43
 44348      10   4,135      41,350     1,217.8      78.1      00:12:39
 44480       6   4,135      24,810     1,221.4      78.3      00:12:32
 44662       9   4,135      37,215     1,226.4      78.6      00:12:20
 44846       7   4,135      28,945     1,231.6      78.9      00:12:09
 45031       8   4,135      33,080     1,236.7      79.3      00:11:57
 45259      10   4,135      41,350     1,242.6      79.6      00:11:43
 45423      10   4,135      41,350     1,246.8      79.9      00:11:34
 45584       6   4,135      24,810     1,251.0      80.2      00:11:25
 45768      10   4,135      41,350     1,255.8      80.5      00:11:14
 45965       9   4,135      37,215     1,261.2      80.8      00:11:02
 46143       9   4,135      37,215     1,266.2      81.2      00:10:50
 46318       5   4,135      20,675     1,271.2      81.5      00:10:39
 46468      10   4,135      41,350     1,275.2      81.7      00:10:31
 46609       6   4,135      24,810     1,279.3      82.0      00:10:22
 46798       7   4,135      28,945     1,284.6      82.3      00:10:10
 46940       8   4,135      33,080     1,288.3      82.6      00:10:02
 47056       5   4,135      20,675     1,291.2      82.8      00:09:56
 47181       9   4,135      37,215     1,294.3      83.0      00:09:50
 47300       8   4,135      33,080     1,297.5      83.2      00:09:43
 47453       5   4,135      20,675     1,301.5      83.4      00:09:35
 47598       9   4,135      37,215     1,305.4      83.7      00:09:26
 47675      10   4,135      41,350     1,307.6      83.8      00:09:23
 47791       6   4,135      24,810     1,310.7      84.0      00:09:16
 47919       9   4,135      37,215     1,314.3      84.2      00:09:09
 48062       9   4,135      37,215     1,318.2      84.5      00:09:00
 48198       8   4,135      33,080     1,321.8      84.7      00:08:52
 48371       7   4,135      28,945     1,326.8      85.0      00:08:41
 48536       4   4,135      16,540     1,331.3      85.3      00:08:31
 48701       5   4,135      20,675     1,335.8      85.6      00:08:21
 48851       8   4,135      33,080     1,339.9      85.9      00:08:12
 48981      10   4,135      41,350     1,343.4      86.1      00:08:05
 49100       9   4,135      37,215     1,346.8      86.3      00:07:57
 49208       5   4,135      20,675     1,350.0      86.5      00:07:51
 49342       3   4,135      12,405     1,353.4      86.7      00:07:43
 49476       7   4,135      28,945     1,356.8      87.0      00:07:36
 49620       8   4,135      33,080     1,360.4      87.2      00:07:28
 49757       8   4,135      33,080     1,364.0      87.4      00:07:21
 49907      10   4,135      41,350     1,368.0      87.7      00:07:12
 50063       5   4,135      20,675     1,372.3      88.0      00:07:02
 50187      10   4,135      41,350     1,375.6      88.2      00:06:55
 50344      10   4,135      41,350     1,379.5      88.4      00:06:46
 50474       8   4,135      33,080     1,383.1      88.6      00:06:39
 50598       7   4,135      28,945     1,386.6      88.9      00:06:31
 50704       8   4,135      33,080     1,389.5      89.1      00:06:25
 50859       4   4,135      16,540     1,393.9      89.3      00:06:15
 50961       8   4,135      33,080     1,397.0      89.5      00:06:08
 51088       7   4,135      28,945     1,400.5      89.8      00:06:01
 51278       8   4,135      33,080     1,405.7      90.1      00:05:49
 51485       6   4,135      24,810     1,411.5      90.5      00:05:35
 51699       6   4,135      24,810     1,417.8      90.9      00:05:21
 51888       8   4,135      33,080     1,423.2      91.2      00:05:08
 52029      10   4,135      41,350     1,427.2      91.5      00:04:60
 52168       8   4,135      33,080     1,431.5      91.7      00:04:50
 52361       9   4,135      37,215     1,437.1      92.1      00:04:37
 52571      10   4,135      41,350     1,443.4      92.5      00:04:23
 52774       6   4,135      24,810     1,449.6      92.9      00:04:08
 52969       9   4,135      37,215     1,455.2      93.3      00:03:55
 53171       7   4,135      28,945     1,461.1      93.6      00:03:42
 53384       7   4,135      28,945     1,467.1      94.0      00:03:28
 53592       5   4,135      20,675     1,473.1      94.4      00:03:15
 53746      10   4,135      41,350     1,477.5      94.7      00:03:05
 53872      10   4,135      41,350     1,480.9      94.9      00:02:58
 53981      10   4,135      41,350     1,483.9      95.1      00:02:51
 54099      10   4,135      41,350     1,487.2      95.3      00:02:44
 54232       4   4,135      16,540     1,490.8      95.6      00:02:36
 54337       7   4,135      28,945     1,493.7      95.7      00:02:29
 54462       7   4,135      28,945     1,496.8      95.9      00:02:23
 54626       5   4,135      20,675     1,501.2      96.2      00:02:13
 54759       4   4,135      16,540     1,504.8      96.4      00:02:05
 54930      10   4,135      41,350     1,509.5      96.7      00:01:54
 55129       7   4,135      28,945     1,514.8      97.1      00:01:42
 55316       5   4,135      20,675     1,519.6      97.4      00:01:31
 55435       6   4,135      24,810     1,522.8      97.6      00:01:24
 55582       6   4,135      24,810     1,526.5      97.8      00:01:16
 55721       6   4,135      24,810     1,530.5      98.1      00:01:07
 55850      10   4,135      41,350     1,534.2      98.3      00:00:59
 55978       9   4,135      37,215     1,537.7      98.6      00:00:51
 56108       7   4,135      28,945     1,541.4      98.8      00:00:43
 56234       4   4,135      16,540     1,545.0      99.0      00:00:34
 56378       8   4,135      33,080     1,549.2      99.3      00:00:25
 56518       8   4,135      33,080     1,553.2      99.5      00:00:16
 56736       7   4,135      28,945     1,559.4      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 3533.312
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
