
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A400_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   247       4   4,435      17,740         6.2       0.4      00:44:41
   501      10   4,435      44,350        12.8       0.8      00:43:13
   746       9   4,435      39,915        19.6       1.2      00:42:26
   982      10   4,435      44,350        25.9       1.5      00:42:33
  1203       9   4,435      39,915        32.3       1.9      00:42:29
  1423       5   4,435      22,175        38.8       2.3      00:42:14
  1649       9   4,435      39,915        45.4       2.7      00:41:57
  1890       4   4,435      17,740        52.1       3.1      00:41:37
  2110       8   4,435      35,480        58.4       3.5      00:41:37
  2346       5   4,435      22,175        65.0       3.9      00:41:20
  2541      10   4,435      44,350        70.4       4.2      00:41:51
  2739       7   4,435      31,045        76.3       4.6      00:41:59
  2950       8   4,435      35,480        82.2       4.9      00:42:03
  3155      10   4,435      44,350        88.3       5.3      00:42:00
  3369       8   4,435      35,480        94.8       5.7      00:41:46
  3598       5   4,435      22,175       101.4       6.1      00:41:28
  3846      10   4,435      44,350       108.6       6.5      00:40:55
  3995       7   4,435      31,045       112.6       6.7      00:41:43
  4157       5   4,435      22,175       117.1       7.0      00:42:11
  4337       8   4,435      35,480       121.9       7.3      00:42:31
  4487      10   4,435      44,350       126.3       7.5      00:43:00
  4638      10   4,435      44,350       130.8       7.8      00:43:23
  4766       8   4,435      35,480       134.5       8.0      00:43:59
  4896       9   4,435      39,915       138.2       8.3      00:44:34
  5040      10   4,435      44,350       142.4       8.5      00:44:56
  5181       8   4,435      35,480       146.4       8.7      00:45:21
  5312       5   4,435      22,175       150.1       9.0      00:45:49
  5439       5   4,435      22,175       153.9       9.2      00:46:14
  5596       9   4,435      39,915       157.8       9.4      00:46:34
  5739       6   4,435      26,610       161.8       9.7      00:46:53
  5869       5   4,435      22,175       165.4       9.9      00:47:17
  6007       8   4,435      35,480       169.5      10.1      00:47:29
  6138       9   4,435      39,915       173.3      10.4      00:47:47
  6267      10   4,435      44,350       176.9      10.6      00:48:06
  6401      10   4,435      44,350       180.5      10.8      00:48:24
  6536       8   4,435      35,480       184.3      11.0      00:48:39
  6674       9   4,435      39,915       188.2      11.2      00:48:51
  6806       8   4,435      35,480       191.9      11.5      00:49:04
  6933       9   4,435      39,915       195.6      11.7      00:49:18
  7117      10   4,435      44,350       200.7      12.0      00:49:06
  7290       5   4,435      22,175       205.4      12.3      00:49:01
  7474       8   4,435      35,480       210.9      12.6      00:48:43
  7625       7   4,435      31,045       215.3      12.9      00:48:43
  7783       7   4,435      31,045       219.9      13.1      00:48:39
  7960      10   4,435      44,350       225.4      13.5      00:48:21
  8137       7   4,435      31,045       230.7      13.8      00:48:06
  8325       3   4,435      13,305       236.4      14.1      00:47:47
  8513       7   4,435      31,045       242.2      14.5      00:47:26
  8697      10   4,435      44,350       247.7      14.8      00:47:11
  8878       5   4,435      22,175       253.2      15.1      00:46:55
  9041       7   4,435      31,045       258.0      15.4      00:46:47
  9201       7   4,435      31,045       263.0      15.7      00:46:39
  9327       7   4,435      31,045       266.8      15.9      00:46:44
  9445       9   4,435      39,915       270.4      16.2      00:46:52
  9568      10   4,435      44,350       274.2      16.4      00:46:57
  9719      10   4,435      44,350       279.0      16.7      00:46:50
  9868       7   4,435      31,045       283.3      16.9      00:46:47
 10035      10   4,435      44,350       288.0      17.2      00:46:40
 10186       7   4,435      31,045       292.0      17.4      00:46:43
 10324       9   4,435      39,915       295.8      17.7      00:46:46
 10454       8   4,435      35,480       299.6      17.9      00:46:48
 10613       2   4,435       8,870       304.0      18.2      00:46:44
 10744       6   4,435      26,610       307.7      18.4      00:46:47
 10877      10   4,435      44,350       311.6      18.6      00:46:47
 11015       3   4,435      13,305       315.6      18.9      00:46:47
 11188       7   4,435      31,045       320.6      19.2      00:46:36
 11308       6   4,435      26,610       324.0      19.4      00:46:42
 11422       8   4,435      35,480       327.4      19.6      00:46:46
 11546      10   4,435      44,350       330.8      19.8      00:46:51
 11679       5   4,435      22,175       334.7      20.0      00:46:50
 11800       6   4,435      26,610       338.3      20.2      00:46:53
 11951       5   4,435      22,175       342.6      20.5      00:46:48
 12101       4   4,435      17,740       347.1      20.7      00:46:40
 12266       5   4,435      22,175       351.8      21.0      00:46:30
 12516       6   4,435      26,610       359.2      21.5      00:45:55
 12767       9   4,435      39,915       366.1      21.9      00:45:24
 12972       5   4,435      22,175       371.8      22.2      00:45:05
 13191      10   4,435      44,350       378.3      22.6      00:44:40
 13405       6   4,435      26,610       384.6      23.0      00:44:17
 13586      10   4,435      44,350       390.4      23.3      00:43:59
 13720       2   4,435       8,870       394.3      23.6      00:43:57
 13862       8   4,435      35,480       398.4      23.8      00:43:54
 14012      10   4,435      44,350       402.6      24.1      00:43:50
 14179       9   4,435      39,915       407.6      24.4      00:43:38
 14317       9   4,435      39,915       411.8      24.6      00:43:34
 14490       7   4,435      31,045       417.0      24.9      00:43:20
 14661       9   4,435      39,915       422.0      25.2      00:43:09
 14857       8   4,435      35,480       427.7      25.6      00:42:52
 15096      10   4,435      44,350       435.0      26.0      00:42:23
 15320       7   4,435      31,045       441.7      26.4      00:41:59
 15543       9   4,435      39,915       448.2      26.8      00:41:36
 15743       5   4,435      22,175       454.1      27.1      00:41:19
 15966      10   4,435      44,350       461.0      27.5      00:40:55
 16178       7   4,435      31,045       467.6      27.9      00:40:33
 16387       7   4,435      31,045       474.0      28.3      00:40:13
 16589       5   4,435      22,175       479.9      28.7      00:39:56
 16744       7   4,435      31,045       484.6      29.0      00:39:48
 16887       9   4,435      39,915       488.7      29.2      00:39:44
 17012       9   4,435      39,915       492.6      29.4      00:39:42
 17144       6   4,435      26,610       496.3      29.7      00:39:41
 17280       4   4,435      17,740       500.4      29.9      00:39:37
 17403       7   4,435      31,045       504.2      30.1      00:39:35
 17529       8   4,435      35,480       508.3      30.4      00:39:30
 17650       4   4,435      17,740       511.9      30.6      00:39:29
 17819       8   4,435      35,480       516.7      30.9      00:39:20
 17978       6   4,435      26,610       521.4      31.2      00:39:11
 18189       7   4,435      31,045       527.9      31.5      00:38:51
 18418       5   4,435      22,175       534.4      31.9      00:38:31
 18581       5   4,435      22,175       539.1      32.2      00:38:22
 18737       9   4,435      39,915       544.0      32.5      00:38:12
 18881       8   4,435      35,480       548.3      32.8      00:38:06
 19010       7   4,435      31,045       552.4      33.0      00:38:01
 19125      10   4,435      44,350       555.9      33.2      00:38:00
 19265       6   4,435      26,610       560.1      33.5      00:37:55
 19477       7   4,435      31,045       566.6      33.9      00:37:35
 19652       7   4,435      31,045       572.1      34.2      00:37:22
 19867       6   4,435      26,610       578.8      34.6      00:37:01
 20083       2   4,435       8,870       585.7      35.0      00:36:39
 20311       6   4,435      26,610       592.3      35.4      00:36:20
 20487       7   4,435      31,045       597.6      35.7      00:36:08
 20589       7   4,435      31,045       600.8      35.9      00:36:08
 20709       6   4,435      26,610       604.4      36.1      00:36:06
 20851       9   4,435      39,915       608.7      36.4      00:35:59
 20990      10   4,435      44,350       612.9      36.6      00:35:54
 21174       8   4,435      35,480       618.0      36.9      00:35:43
 21353      10   4,435      44,350       622.7      37.2      00:35:34
 21495       6   4,435      26,610       626.9      37.5      00:35:28
 21676       3   4,435      13,305       631.8      37.8      00:35:18
 21841       6   4,435      26,610       636.4      38.0      00:35:10
 21990       2   4,435       8,870       640.6      38.3      00:35:04
 22174       4   4,435      17,740       645.5      38.6      00:34:54
 22351       7   4,435      31,045       650.5      38.9      00:34:43
 22501      10   4,435      44,350       654.7      39.1      00:34:37
 22681       6   4,435      26,610       659.8      39.4      00:34:26
 22903       5   4,435      22,175       665.6      39.8      00:34:11
 23150      10   4,435      44,350       673.0      40.2      00:33:49
 23387      10   4,435      44,350       680.0      40.6      00:33:29
 23607       8   4,435      35,480       685.8      41.0      00:33:14
 23806       6   4,435      26,610       691.9      41.3      00:32:59
 24001       8   4,435      35,480       697.4      41.7      00:32:46
 24192       8   4,435      35,480       702.7      42.0      00:32:35
 24396       7   4,435      31,045       708.3      42.3      00:32:22
 24619       5   4,435      22,175       715.0      42.7      00:32:04
 24844       4   4,435      17,740       721.6      43.1      00:31:46
 25072       7   4,435      31,045       728.3      43.5      00:31:29
 25300       9   4,435      39,915       735.0      43.9      00:31:11
 25499       8   4,435      35,480       741.0      44.3      00:30:56
 25654       8   4,435      35,480       745.2      44.5      00:30:50
 25759       7   4,435      31,045       748.5      44.7      00:30:48
 25886      10   4,435      44,350       752.3      45.0      00:30:43
 26009       7   4,435      31,045       755.9      45.2      00:30:39
 26139       8   4,435      35,480       759.7      45.4      00:30:35
 26311       9   4,435      39,915       764.8      45.7      00:30:24
 26484       5   4,435      22,175       769.6      46.0      00:30:15
 26653      10   4,435      44,350       774.4      46.3      00:30:06
 26827       9   4,435      39,915       779.5      46.6      00:29:55
 27014       8   4,435      35,480       785.1      46.9      00:29:43
 27150       9   4,435      39,915       789.1      47.2      00:29:37
 27288       6   4,435      26,610       793.0      47.4      00:29:32
 27409       9   4,435      39,915       796.5      47.6      00:29:28
 27509       6   4,435      26,610       799.6      47.8      00:29:26
 27663       8   4,435      35,480       804.1      48.0      00:29:18
 27776       9   4,435      39,915       807.5      48.3      00:29:15
 27972       5   4,435      22,175       813.4      48.6      00:29:00
 28148       3   4,435      13,305       818.7      48.9      00:28:49
 28328       9   4,435      39,915       824.1      49.2      00:28:37
 28517       9   4,435      39,915       830.0      49.6      00:28:23
 28692       3   4,435      13,305       835.3      49.9      00:28:12
 28820      10   4,435      44,350       839.3      50.2      00:28:06
 28954       9   4,435      39,915       843.3      50.4      00:27:59
 29085      10   4,435      44,350       847.2      50.6      00:27:54
 29264       6   4,435      26,610       852.4      50.9      00:27:43
 29433       9   4,435      39,915       857.7      51.3      00:27:31
 29589       7   4,435      31,045       862.1      51.5      00:27:24
 29726       4   4,435      17,740       866.2      51.8      00:27:17
 29837       6   4,435      26,610       869.5      52.0      00:27:13
 29938       2   4,435       8,870       872.5      52.1      00:27:11
 30048       7   4,435      31,045       875.9      52.3      00:27:07
 30179       7   4,435      31,045       879.8      52.6      00:27:00
 30335       5   4,435      22,175       884.4      52.9      00:26:52
 30491       9   4,435      39,915       889.4      53.1      00:26:41
 30655       6   4,435      26,610       894.2      53.4      00:26:32
 30851       8   4,435      35,480       900.3      53.8      00:26:17
 31075       5   4,435      22,175       906.7      54.2      00:26:01
 31287       7   4,435      31,045       913.3      54.6      00:25:45
 31492       7   4,435      31,045       919.7      55.0      00:25:30
 31720       9   4,435      39,915       926.6      55.4      00:25:13
 31946      10   4,435      44,350       933.8      55.8      00:24:55
 32179      10   4,435      44,350       941.0      56.2      00:24:36
 32396       7   4,435      31,045       947.9      56.6      00:24:19
 32551       8   4,435      35,480       952.6      56.9      00:24:10
 32650       7   4,435      31,045       955.6      57.1      00:24:07
 32778       5   4,435      22,175       959.6      57.3      00:24:01
 32899       9   4,435      39,915       963.2      57.6      00:23:56
 33036       9   4,435      39,915       967.6      57.8      00:23:48
 33155       5   4,435      22,175       971.2      58.0      00:23:42
 33301       8   4,435      35,480       975.6      58.3      00:23:34
 33476       9   4,435      39,915       980.9      58.6      00:23:23
 33620       5   4,435      22,175       985.5      58.9      00:23:14
 33790       8   4,435      35,480       990.8      59.2      00:23:03
 33951       8   4,435      35,480       995.8      59.5      00:22:53
 34134       5   4,435      22,175     1,001.5      59.8      00:22:40
 34340      10   4,435      44,350     1,008.0      60.2      00:22:25
 34576      10   4,435      44,350     1,015.1      60.7      00:22:08
 34807       8   4,435      35,480     1,022.4      61.1      00:21:50
 35057       9   4,435      39,915     1,030.0      61.5      00:21:32
 35300       9   4,435      39,915     1,037.6      62.0      00:21:13
 35539       8   4,435      35,480     1,044.9      62.4      00:20:56
 35785       6   4,435      26,610     1,052.3      62.9      00:20:38
 36041      10   4,435      44,350     1,060.1      63.3      00:20:19
 36256       7   4,435      31,045     1,066.8      63.7      00:20:04
 36492       8   4,435      35,480     1,073.9      64.2      00:19:48
 36631       8   4,435      35,480     1,078.3      64.4      00:19:40
 36756       7   4,435      31,045     1,081.7      64.6      00:19:35
 36883      10   4,435      44,350     1,085.6      64.9      00:19:28
 37020       9   4,435      39,915     1,089.5      65.1      00:19:22
 37194       8   4,435      35,480     1,094.3      65.4      00:19:13
 37349       8   4,435      35,480     1,098.7      65.7      00:19:04
 37506       5   4,435      22,175     1,103.1      65.9      00:18:56
 37642       9   4,435      39,915     1,107.2      66.2      00:18:49
 37807       9   4,435      39,915     1,111.9      66.4      00:18:40
 37964       5   4,435      22,175     1,116.5      66.7      00:18:31
 38130       9   4,435      39,915     1,121.6      67.0      00:18:21
 38323       9   4,435      39,915     1,127.4      67.4      00:18:09
 38488       6   4,435      26,610     1,132.6      67.7      00:17:58
 38709       9   4,435      39,915     1,139.2      68.1      00:17:43
 38929       5   4,435      22,175     1,145.8      68.5      00:17:29
 39064       8   4,435      35,480     1,149.8      68.7      00:17:22
 39211       5   4,435      22,175     1,154.0      69.0      00:17:15
 39390       8   4,435      35,480     1,159.1      69.3      00:17:04
 39559       7   4,435      31,045     1,164.2      69.6      00:16:54
 39723       7   4,435      31,045     1,168.8      69.8      00:16:45
 39901       7   4,435      31,045     1,174.2      70.2      00:16:34
 40139       9   4,435      39,915     1,181.1      70.6      00:16:19
 40363       9   4,435      39,915     1,187.7      71.0      00:16:04
 40574      10   4,435      44,350     1,194.2      71.4      00:15:51
 40823       7   4,435      31,045     1,201.7      71.8      00:15:34
 40995       9   4,435      39,915     1,207.0      72.1      00:15:23
 41144       9   4,435      39,915     1,211.4      72.4      00:15:15
 41339       9   4,435      39,915     1,217.2      72.7      00:15:03
 41547       4   4,435      17,740     1,223.5      73.1      00:14:50
 41741       6   4,435      26,610     1,229.3      73.5      00:14:37
 41838       9   4,435      39,915     1,232.2      73.6      00:14:33
 41997       6   4,435      26,610     1,237.0      73.9      00:14:24
 42203       7   4,435      31,045     1,242.7      74.3      00:14:12
 42364      10   4,435      44,350     1,247.3      74.5      00:14:03
 42517       8   4,435      35,480     1,252.0      74.8      00:13:55
 42708      10   4,435      44,350     1,257.4      75.1      00:13:43
 42851      10   4,435      44,350     1,261.8      75.4      00:13:35
 42982       6   4,435      26,610     1,265.7      75.6      00:13:28
 43096       6   4,435      26,610     1,269.3      75.8      00:13:22
 43281       5   4,435      22,175     1,275.0      76.2      00:13:10
 43475       7   4,435      31,045     1,280.8      76.5      00:12:58
 43713       9   4,435      39,915     1,287.6      76.9      00:12:44
 43942       4   4,435      17,740     1,294.5      77.4      00:12:29
 44130       8   4,435      35,480     1,299.8      77.7      00:12:19
 44315       7   4,435      31,045     1,305.3      78.0      00:12:08
 44524      10   4,435      44,350     1,311.3      78.4      00:11:55
 44745       9   4,435      39,915     1,317.8      78.8      00:11:41
 44965       8   4,435      35,480     1,324.5      79.1      00:11:27
 45223      10   4,435      44,350     1,331.8      79.6      00:11:12
 45421       7   4,435      31,045     1,337.2      79.9      00:11:01
 45594       7   4,435      31,045     1,342.0      80.2      00:10:52
 45836       8   4,435      35,480     1,348.8      80.6      00:10:38
 46047       2   4,435       8,870     1,355.1      81.0      00:10:25
 46256      10   4,435      44,350     1,361.6      81.4      00:10:11
 46441       9   4,435      39,915     1,366.9      81.7      00:10:01
 46694       9   4,435      39,915     1,374.6      82.1      00:09:45
 46974       8   4,435      35,480     1,382.6      82.6      00:09:28
 47205       9   4,435      39,915     1,389.0      83.0      00:09:15
 47393       6   4,435      26,610     1,394.3      83.3      00:09:04
 47583       4   4,435      17,740     1,399.7      83.6      00:08:54
 47763       8   4,435      35,480     1,405.0      84.0      00:08:43
 47953       9   4,435      39,915     1,410.7      84.3      00:08:32
 48199       7   4,435      31,045     1,417.7      84.7      00:08:18
 48453       8   4,435      35,480     1,425.4      85.2      00:08:02
 48733       4   4,435      17,740     1,433.7      85.7      00:07:45
 48990       3   4,435      13,305     1,441.1      86.1      00:07:30
 49260       8   4,435      35,480     1,449.3      86.6      00:07:13
 49491       3   4,435      13,305     1,455.7      87.0      00:07:00
 49643       6   4,435      26,610     1,459.7      87.2      00:06:53
 49922      10   4,435      44,350     1,467.7      87.7      00:06:37
 50243       2   4,435       8,870     1,476.9      88.3      00:06:18
 50531       4   4,435      17,740     1,485.2      88.8      00:06:01
 50830      10   4,435      44,350     1,494.2      89.3      00:05:43
 51142       6   4,435      26,610     1,503.6      89.9      00:05:24
 51462       6   4,435      26,610     1,513.2      90.4      00:05:05
 51780       8   4,435      35,480     1,523.1      91.0      00:04:45
 52116       9   4,435      39,915     1,533.6      91.6      00:04:24
 52485      10   4,435      44,350     1,545.4      92.3      00:04:01
 52908       7   4,435      31,045     1,558.9      93.2      00:03:34
 53326       9   4,435      39,915     1,571.8      93.9      00:03:09
 53730       5   4,435      22,175     1,584.2      94.7      00:02:46
 54040      10   4,435      44,350     1,593.3      95.2      00:02:28
 54360       7   4,435      31,045     1,602.7      95.8      00:02:11
 54767       7   4,435      31,045     1,614.2      96.5      00:01:49
 55140       7   4,435      31,045     1,625.0      97.1      00:01:29
 55445       5   4,435      22,175     1,633.6      97.6      00:01:13
 55758       7   4,435      31,045     1,642.6      98.2      00:00:56
 56068       4   4,435      17,740     1,652.0      98.7      00:00:39
 56396      10   4,435      44,350     1,662.1      99.3      00:00:20
 56748       6   4,435      26,610     1,672.9     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 3037.324
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
