
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A300_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   194       6   4,335      26,010         4.7       0.3      00:57:41
   412       6   4,335      26,010        10.3       0.6      00:52:37
   644       6   4,335      26,010        16.3       1.0      00:49:51
   879       3   4,335      13,005        22.5       1.4      00:47:51
  1111       7   4,335      30,345        29.0       1.8      00:46:18
  1309       7   4,335      30,345        34.6       2.1      00:46:19
  1508      10   4,335      43,350        40.4       2.5      00:46:07
  1716      10   4,335      43,350        46.4       2.8      00:45:48
  1940       7   4,335      30,345        52.3       3.2      00:45:32
  2136       7   4,335      30,345        57.8       3.5      00:45:36
  2362       7   4,335      30,345        64.0       3.9      00:45:07
  2591       7   4,335      30,345        70.3       4.3      00:44:38
  2804       2   4,335       8,670        76.4       4.7      00:44:17
  3024       6   4,335      26,010        82.4       5.0      00:44:06
  3230      10   4,335      43,350        88.5       5.4      00:43:48
  3444       7   4,335      30,345        94.9       5.8      00:43:24
  3654       5   4,335      21,675       100.7       6.2      00:43:16
  3848       9   4,335      39,015       106.3       6.5      00:43:16
  3987       5   4,335      21,675       109.8       6.7      00:44:05
  4115      10   4,335      43,350       113.4       6.9      00:44:51
  4264       2   4,335       8,670       117.3       7.2      00:45:25
  4413       8   4,335      34,680       121.3       7.4      00:45:54
  4553       8   4,335      34,680       125.3       7.7      00:46:20
  4701       9   4,335      39,015       129.7       7.9      00:46:35
  4871       6   4,335      26,010       134.4       8.2      00:46:39
  5032       5   4,335      21,675       139.0       8.5      00:46:47
  5187       8   4,335      34,680       143.3       8.8      00:46:60
  5328       6   4,335      26,010       147.2       9.0      00:47:19
  5455       7   4,335      30,345       150.8       9.2      00:47:45
  5569       7   4,335      30,345       153.6       9.4      00:48:25
  5672       9   4,335      39,015       156.3       9.6      00:49:03
  5788      10   4,335      43,350       159.5       9.8      00:49:31
  5966      10   4,335      43,350       164.5      10.1      00:49:22
  6146      10   4,335      43,350       169.6      10.4      00:49:09
  6319       2   4,335       8,670       174.2      10.7      00:49:05
  6417       6   4,335      26,010       176.9      10.8      00:49:38
  6540       7   4,335      30,345       180.3      11.0      00:49:58
  6663       3   4,335      13,005       183.6      11.2      00:50:16
  6786       8   4,335      34,680       187.0      11.4      00:50:32
  6932       1   4,335       4,335       191.1      11.7      00:50:34
  7110       7   4,335      30,345       196.0      12.0      00:50:23
  7303       4   4,335      17,340       201.2      12.3      00:50:06
  7501       9   4,335      39,015       206.8      12.6      00:49:41
  7665       9   4,335      39,015       211.6      12.9      00:49:32
  7838       9   4,335      39,015       216.5      13.2      00:49:19
  8026       9   4,335      39,015       222.3      13.6      00:48:55
  8171       9   4,335      39,015       226.6      13.9      00:48:52
  8313       5   4,335      21,675       230.8      14.1      00:48:52
  8472      10   4,335      43,350       235.6      14.4      00:48:42
  8636       7   4,335      30,345       240.4      14.7      00:48:32
  8822      10   4,335      43,350       245.8      15.0      00:48:14
  8967       5   4,335      21,675       250.1      15.3      00:48:11
  9085       7   4,335      30,345       253.6      15.5      00:48:19
  9208       5   4,335      21,675       257.3      15.7      00:48:23
  9344      10   4,335      43,350       261.2      16.0      00:48:24
  9453       6   4,335      26,010       264.5      16.2      00:48:34
  9583       7   4,335      30,345       268.5      16.4      00:48:33
  9707      10   4,335      43,350       272.3      16.6      00:48:35
  9832       6   4,335      26,010       276.0      16.9      00:48:38
  9949       6   4,335      26,010       279.2      17.1      00:48:46
 10071       3   4,335      13,005       282.5      17.3      00:48:52
 10186       7   4,335      30,345       285.4      17.4      00:49:05
 10296      10   4,335      43,350       288.3      17.6      00:49:15
 10415      10   4,335      43,350       291.7      17.8      00:49:19
 10554       3   4,335      13,005       295.6      18.1      00:49:18
 10737       8   4,335      34,680       300.6      18.4      00:49:02
 10884       5   4,335      21,675       304.8      18.6      00:48:57
 11024       7   4,335      30,345       308.7      18.9      00:48:53
 11181       5   4,335      21,675       313.2      19.1      00:48:44
 11297      10   4,335      43,350       316.3      19.3      00:48:51
 11395      10   4,335      43,350       319.2      19.5      00:48:59
 11496      10   4,335      43,350       322.2      19.7      00:49:07
 11611       6   4,335      26,010       325.2      19.9      00:49:13
 11741       9   4,335      39,015       328.8      20.1      00:49:12
 11869       7   4,335      30,345       332.6      20.3      00:49:10
 12012       6   4,335      26,010       336.6      20.6      00:49:04
 12151       4   4,335      17,340       340.7      20.8      00:48:58
 12276       5   4,335      21,675       344.2      21.0      00:48:58
 12498       6   4,335      26,010       350.5      21.4      00:48:28
 12730       2   4,335       8,670       356.9      21.8      00:47:57
 12978      10   4,335      43,350       363.6      22.2      00:47:24
 13202      10   4,335      43,350       370.2      22.6      00:46:54
 13418       8   4,335      34,680       376.4      23.0      00:46:28
 13592       8   4,335      34,680       381.8      23.3      00:46:09
 13729       8   4,335      34,680       385.6      23.6      00:46:06
 13859       1   4,335       4,335       389.3      23.8      00:46:04
 13988       8   4,335      34,680       392.9      24.0      00:46:02
 14133       8   4,335      34,680       397.0      24.3      00:45:56
 14252      10   4,335      43,350       400.6      24.5      00:45:55
 14422      10   4,335      43,350       405.6      24.8      00:45:40
 14586      10   4,335      43,350       410.3      25.1      00:45:28
 14747       7   4,335      30,345       414.9      25.4      00:45:18
 14927       9   4,335      39,015       420.1      25.7      00:45:02
 15131       4   4,335      17,340       426.2      26.1      00:44:38
 15358       7   4,335      30,345       432.9      26.5      00:44:10
 15561       6   4,335      26,010       438.6      26.8      00:43:51
 15756       6   4,335      26,010       444.3      27.2      00:43:31
 15972       9   4,335      39,015       450.8      27.6      00:43:06
 16211      10   4,335      43,350       458.0      28.0      00:42:36
 16428      10   4,335      43,350       464.6      28.4      00:42:10
 16604       8   4,335      34,680       469.5      28.7      00:41:59
 16759       4   4,335      17,340       474.0      29.0      00:41:49
 16907       9   4,335      39,015       478.3      29.2      00:41:42
 17042       9   4,335      39,015       482.3      29.5      00:41:37
 17149       7   4,335      30,345       485.2      29.7      00:41:39
 17250       7   4,335      30,345       488.2      29.8      00:41:41
 17371       8   4,335      34,680       491.9      30.1      00:41:38
 17495       9   4,335      39,015       495.8      30.3      00:41:33
 17604       6   4,335      26,010       499.0      30.5      00:41:33
 17756       7   4,335      30,345       503.2      30.8      00:41:26
 17871       8   4,335      34,680       506.5      31.0      00:41:24
 18052       8   4,335      34,680       511.8      31.3      00:41:09
 18292       7   4,335      30,345       518.9      31.7      00:40:42
 18486       6   4,335      26,010       524.1      32.0      00:40:27
 18593       8   4,335      34,680       527.3      32.2      00:40:27
 18722       7   4,335      30,345       531.3      32.5      00:40:21
 18828       7   4,335      30,345       534.3      32.7      00:40:21
 18906       6   4,335      26,010       536.7      32.8      00:40:26
 19025       6   4,335      26,010       540.4      33.0      00:40:21
 19127       6   4,335      26,010       543.4      33.2      00:40:21
 19240       6   4,335      26,010       546.8      33.4      00:40:19
 19349       8   4,335      34,680       549.9      33.6      00:40:18
 19506       9   4,335      39,015       554.8      33.9      00:40:06
 19704       7   4,335      30,345       560.8      34.3      00:39:46
 19893      10   4,335      43,350       566.5      34.6      00:39:28
 20079       9   4,335      39,015       572.4      35.0      00:39:10
 20256       4   4,335      17,340       577.3      35.3      00:38:57
 20430       7   4,335      30,345       582.5      35.6      00:38:43
 20520       7   4,335      30,345       585.1      35.8      00:38:45
 20618       6   4,335      26,010       588.1      36.0      00:38:44
 20748       6   4,335      26,010       591.9      36.2      00:38:39
 20886       6   4,335      26,010       596.1      36.4      00:38:31
 21007       6   4,335      26,010       599.5      36.7      00:38:28
 21160       1   4,335       4,335       603.7      36.9      00:38:20
 21314       1   4,335       4,335       607.5      37.1      00:38:14
 21457      10   4,335      43,350       611.7      37.4      00:38:06
 21589       7   4,335      30,345       615.3      37.6      00:38:01
 21737       2   4,335       8,670       619.1      37.8      00:37:55
 21851       8   4,335      34,680       622.3      38.0      00:37:53
 21965      10   4,335      43,350       625.5      38.2      00:37:50
 22111       9   4,335      39,015       629.3      38.5      00:37:44
 22258       8   4,335      34,680       633.2      38.7      00:37:37
 22395       9   4,335      39,015       637.0      38.9      00:37:31
 22551      10   4,335      43,350       641.3      39.2      00:37:22
 22704       6   4,335      26,010       645.6      39.5      00:37:13
 22919       5   4,335      21,675       651.1      39.8      00:36:57
 23123      10   4,335      43,350       657.0      40.2      00:36:38
 23341       7   4,335      30,345       663.4      40.6      00:36:18
 23579      10   4,335      43,350       669.6      40.9      00:35:59
 23802       9   4,335      39,015       676.1      41.3      00:35:37
 24019       7   4,335      30,345       682.2      41.7      00:35:19
 24224       6   4,335      26,010       687.8      42.1      00:35:03
 24463       8   4,335      34,680       694.3      42.4      00:34:43
 24631       8   4,335      34,680       699.3      42.8      00:34:30
 24843      10   4,335      43,350       705.3      43.1      00:34:13
 25041       7   4,335      30,345       710.9      43.5      00:33:57
 25240       8   4,335      34,680       716.7      43.8      00:33:41
 25429      10   4,335      43,350       722.2      44.2      00:33:26
 25601       6   4,335      26,010       726.8      44.4      00:33:16
 25732       8   4,335      34,680       730.8      44.7      00:33:09
 25829       6   4,335      26,010       733.7      44.9      00:33:07
 25940       6   4,335      26,010       736.8      45.0      00:33:04
 26067      10   4,335      43,350       740.5      45.3      00:32:58
 26201       4   4,335      17,340       744.4      45.5      00:32:51
 26357       4   4,335      17,340       748.8      45.8      00:32:42
 26544      10   4,335      43,350       754.0      46.1      00:32:29
 26731       8   4,335      34,680       759.2      46.4      00:32:16
 26921       8   4,335      34,680       764.7      46.7      00:32:01
 27034       7   4,335      30,345       767.9      46.9      00:31:57
 27138       9   4,335      39,015       770.9      47.1      00:31:54
 27263       5   4,335      21,675       774.4      47.3      00:31:49
 27367       7   4,335      30,345       777.4      47.5      00:31:47
 27491      10   4,335      43,350       781.0      47.7      00:31:41
 27640       7   4,335      30,345       785.3      48.0      00:31:32
 27800       6   4,335      26,010       790.0      48.3      00:31:21
 27975      10   4,335      43,350       795.1      48.6      00:31:08
 28178       7   4,335      30,345       801.0      49.0      00:30:51
 28351      10   4,335      43,350       806.2      49.3      00:30:39
 28524      10   4,335      43,350       811.6      49.6      00:30:25
 28669       9   4,335      39,015       815.8      49.9      00:30:16
 28772       8   4,335      34,680       818.9      50.1      00:30:13
 28881       7   4,335      30,345       822.1      50.3      00:30:08
 29011      10   4,335      43,350       826.0      50.5      00:30:01
 29167       2   4,335       8,670       830.4      50.8      00:29:51
 29322       5   4,335      21,675       834.9      51.0      00:29:41
 29491       7   4,335      30,345       839.9      51.3      00:29:29
 29681      10   4,335      43,350       845.3      51.7      00:29:15
 29814       7   4,335      30,345       849.3      51.9      00:29:08
 29941       8   4,335      34,680       852.9      52.1      00:29:01
 30080      10   4,335      43,350       857.0      52.4      00:28:53
 30224       6   4,335      26,010       861.3      52.7      00:28:44
 30360       8   4,335      34,680       865.2      52.9      00:28:36
 30487       7   4,335      30,345       869.2      53.1      00:28:29
 30679       2   4,335       8,670       874.7      53.5      00:28:14
 30907       7   4,335      30,345       881.5      53.9      00:27:55
 31128       7   4,335      30,345       887.9      54.3      00:27:37
 31317       4   4,335      17,340       893.6      54.6      00:27:23
 31517      10   4,335      43,350       899.6      55.0      00:27:06
 31706       5   4,335      21,675       905.3      55.3      00:26:52
 31900       8   4,335      34,680       911.3      55.7      00:26:36
 32066       7   4,335      30,345       916.3      56.0      00:26:24
 32236       8   4,335      34,680       921.6      56.3      00:26:11
 32432       8   4,335      34,680       927.7      56.7      00:25:55
 32534       7   4,335      30,345       930.6      56.9      00:25:52
 32613      10   4,335      43,350       933.0      57.0      00:25:50
 32735       7   4,335      30,345       936.7      57.3      00:25:43
 32840      10   4,335      43,350       939.7      57.5      00:25:39
 32949       6   4,335      26,010       943.1      57.7      00:25:34
 33056       8   4,335      34,680       946.3      57.9      00:25:29
 33169       8   4,335      34,680       949.7      58.1      00:25:23
 33351       4   4,335      17,340       955.1      58.4      00:25:10
 33507      10   4,335      43,350       959.8      58.7      00:24:59
 33653       7   4,335      30,345       964.3      59.0      00:24:49
 33796       6   4,335      26,010       968.6      59.2      00:24:40
 33955       7   4,335      30,345       973.4      59.5      00:24:29
 34098       9   4,335      39,015       977.8      59.8      00:24:19
 34210       7   4,335      30,345       981.3      60.0      00:24:13
 34409       8   4,335      34,680       987.2      60.4      00:23:58
 34589      10   4,335      43,350       992.6      60.7      00:23:45
 34809       9   4,335      39,015       999.4      61.1      00:23:26
 35031       7   4,335      30,345     1,006.0      61.5      00:23:09
 35256      10   4,335      43,350     1,012.8      61.9      00:22:51
 35488      10   4,335      43,350     1,019.9      62.4      00:22:32
 35704       5   4,335      21,675     1,026.2      62.7      00:22:16
 35939       5   4,335      21,675     1,033.2      63.2      00:21:57
 36187       9   4,335      39,015     1,040.6      63.6      00:21:37
 36387       5   4,335      21,675     1,046.7      64.0      00:21:23
 36545      10   4,335      43,350     1,051.3      64.3      00:21:12
 36680      10   4,335      43,350     1,055.2      64.5      00:21:05
 36811      10   4,335      43,350     1,058.9      64.7      00:20:58
 36919       4   4,335      17,340     1,062.2      64.9      00:20:52
 37033       6   4,335      26,010     1,065.3      65.1      00:20:47
 37166       9   4,335      39,015     1,068.9      65.3      00:20:40
 37294       2   4,335       8,670     1,072.3      65.6      00:20:34
 37414       9   4,335      39,015     1,075.7      65.8      00:20:28
 37535      10   4,335      43,350     1,079.2      66.0      00:20:22
 37651       9   4,335      39,015     1,082.4      66.2      00:20:16
 37759       6   4,335      26,010     1,085.4      66.4      00:20:11
 37876       8   4,335      34,680     1,088.8      66.6      00:20:05
 37994       6   4,335      26,010     1,092.2      66.8      00:19:59
 38122      10   4,335      43,350     1,096.0      67.0      00:19:51
 38271       5   4,335      21,675     1,100.4      67.3      00:19:42
 38392      10   4,335      43,350     1,104.2      67.5      00:19:34
 38521       8   4,335      34,680     1,108.0      67.7      00:19:27
 38693      10   4,335      43,350     1,113.1      68.0      00:19:15
 38865       9   4,335      39,015     1,118.0      68.4      00:19:04
 38983       6   4,335      26,010     1,121.6      68.6      00:18:57
 39091       5   4,335      21,675     1,124.6      68.8      00:18:51
 39218       6   4,335      26,010     1,128.2      69.0      00:18:45
 39361       5   4,335      21,675     1,132.2      69.2      00:18:36
 39511      10   4,335      43,350     1,136.5      69.5      00:18:27
 39633       6   4,335      26,010     1,140.0      69.7      00:18:20
 39752      10   4,335      43,350     1,143.4      69.9      00:18:14
 39938       9   4,335      39,015     1,148.7      70.2      00:18:01
 40188       6   4,335      26,010     1,155.9      70.7      00:17:43
 40413       6   4,335      26,010     1,162.5      71.1      00:17:26
 40620       7   4,335      30,345     1,168.7      71.4      00:17:11
 40807       9   4,335      39,015     1,174.1      71.8      00:16:58
 40972       7   4,335      30,345     1,179.1      72.1      00:16:47
 41104       4   4,335      17,340     1,182.9      72.3      00:16:39
 41257       6   4,335      26,010     1,187.4      72.6      00:16:29
 41397       8   4,335      34,680     1,191.4      72.8      00:16:21
 41525       6   4,335      26,010     1,195.2      73.1      00:16:13
 41668       8   4,335      34,680     1,199.4      73.3      00:16:04
 41811       8   4,335      34,680     1,203.6      73.6      00:15:55
 41946       1   4,335       4,335     1,207.7      73.8      00:15:47
 42079       4   4,335      17,340     1,211.3      74.1      00:15:40
 42209       8   4,335      34,680     1,214.8      74.3      00:15:33
 42348      10   4,335      43,350     1,218.7      74.5      00:15:24
 42465       5   4,335      21,675     1,222.2      74.7      00:15:17
 42600      10   4,335      43,350     1,226.0      75.0      00:15:10
 42736       3   4,335      13,005     1,229.9      75.2      00:15:01
 42859       2   4,335       8,670     1,233.6      75.4      00:14:54
 43033       7   4,335      30,345     1,238.7      75.7      00:14:42
 43199       5   4,335      21,675     1,243.8      76.0      00:14:30
 43391       7   4,335      30,345     1,249.6      76.4      00:14:17
 43625       8   4,335      34,680     1,256.1      76.8      00:14:01
 43894       6   4,335      26,010     1,263.9      77.3      00:13:41
 44127       9   4,335      39,015     1,270.4      77.7      00:13:26
 44270      10   4,335      43,350     1,274.7      77.9      00:13:16
 44451       6   4,335      26,010     1,279.6      78.2      00:13:05
 44662       9   4,335      39,015     1,285.8      78.6      00:12:51
 44887       7   4,335      30,345     1,292.4      79.0      00:12:35
 45097       6   4,335      26,010     1,298.3      79.4      00:12:21
 45310       1   4,335       4,335     1,303.9      79.7      00:12:08
 45438      10   4,335      43,350     1,307.5      79.9      00:12:01
 45548       8   4,335      34,680     1,310.5      80.1      00:11:55
 45720      10   4,335      43,350     1,315.2      80.4      00:11:45
 45965       9   4,335      39,015     1,322.2      80.8      00:11:28
 46202       8   4,335      34,680     1,329.2      81.3      00:11:11
 46431       5   4,335      21,675     1,335.8      81.7      00:10:56
 46662       7   4,335      30,345     1,342.6      82.1      00:10:40
 46892      10   4,335      43,350     1,349.4      82.5      00:10:24
 47118       6   4,335      26,010     1,355.2      82.9      00:10:11
 47264       6   4,335      26,010     1,359.2      83.1      00:10:03
 47397       7   4,335      30,345     1,363.0      83.3      00:09:55
 47558       6   4,335      26,010     1,367.4      83.6      00:09:45
 47732       8   4,335      34,680     1,372.5      83.9      00:09:34
 47932       9   4,335      39,015     1,378.2      84.3      00:09:21
 48114       9   4,335      39,015     1,383.4      84.6      00:09:09
 48303       6   4,335      26,010     1,389.0      84.9      00:08:57
 48535       8   4,335      34,680     1,395.7      85.3      00:08:42
 48756       6   4,335      26,010     1,402.0      85.7      00:08:27
 48886       8   4,335      34,680     1,405.7      85.9      00:08:19
 49021      10   4,335      43,350     1,409.6      86.2      00:08:11
 49129       4   4,335      17,340     1,412.9      86.4      00:08:05
 49289       9   4,335      39,015     1,417.4      86.7      00:07:55
 49451       4   4,335      17,340     1,421.8      86.9      00:07:45
 49653       7   4,335      30,345     1,427.1      87.2      00:07:34
 49813      10   4,335      43,350     1,431.5      87.5      00:07:24
 49978       8   4,335      34,680     1,436.3      87.8      00:07:13
 50123       9   4,335      39,015     1,440.4      88.1      00:07:05
 50265       8   4,335      34,680     1,444.2      88.3      00:06:57
 50428       6   4,335      26,010     1,448.7      88.6      00:06:47
 50596       7   4,335      30,345     1,453.6      88.9      00:06:36
 50769      10   4,335      43,350     1,458.7      89.2      00:06:25
 50888       6   4,335      26,010     1,462.3      89.4      00:06:18
 51028       9   4,335      39,015     1,466.6      89.7      00:06:08
 51221       3   4,335      13,005     1,471.9      90.0      00:05:56
 51404       4   4,335      17,340     1,477.4      90.3      00:05:44
 51577       4   4,335      17,340     1,482.5      90.6      00:05:33
 51795       4   4,335      17,340     1,489.2      91.0      00:05:18
 52007       8   4,335      34,680     1,495.5      91.4      00:05:04
 52212       8   4,335      34,680     1,502.0      91.8      00:04:50
 52429       5   4,335      21,675     1,508.7      92.2      00:04:35
 52625       8   4,335      34,680     1,515.0      92.6      00:04:21
 52824       5   4,335      21,675     1,521.3      93.0      00:04:07
 53043       6   4,335      26,010     1,527.9      93.4      00:03:52
 53264       8   4,335      34,680     1,534.5      93.8      00:03:38
 53487       6   4,335      26,010     1,541.2      94.2      00:03:23
 53693       7   4,335      30,345     1,547.3      94.6      00:03:10
 53808       7   4,335      30,345     1,550.7      94.8      00:03:03
 53921       9   4,335      39,015     1,553.9      95.0      00:02:56
 54062       6   4,335      26,010     1,558.0      95.2      00:02:47
 54163      10   4,335      43,350     1,560.9      95.4      00:02:41
 54257      10   4,335      43,350     1,563.7      95.6      00:02:35
 54390       5   4,335      21,675     1,567.3      95.8      00:02:28
 54562       6   4,335      26,010     1,571.9      96.1      00:02:18
 54784      10   4,335      43,350     1,578.2      96.5      00:02:04
 54984      10   4,335      43,350     1,583.9      96.8      00:01:52
 55151       8   4,335      34,680     1,588.7      97.1      00:01:41
 55323       9   4,335      39,015     1,593.3      97.4      00:01:31
 55518      10   4,335      43,350     1,598.6      97.7      00:01:20
 55694      10   4,335      43,350     1,603.7      98.0      00:01:09
 55850      10   4,335      43,350     1,608.4      98.3      00:00:59
 56009       7   4,335      30,345     1,613.0      98.6      00:00:49
 56178       7   4,335      30,345     1,618.1      98.9      00:00:38
 56311       8   4,335      34,680     1,622.0      99.2      00:00:29
 56463       6   4,335      26,010     1,626.7      99.5      00:00:19
 56762       6   4,335      26,010     1,635.6     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,635.7        Number of regions         = 56,767    
Computed distances (M)  = 1,635.69       Total run time (seconds)  = 3530.826
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
