
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data//Intermediate/blk_coords.dta /export/storage_co
> vidvaccine/Result/MaxVaxFixV/M10_K12000/Dollar/vaccinated/ca_Dollar_locations
> _total.dta /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K12000/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv 2000 30 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  28 Sep 2023, 13:46:34

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K12000/Dollar/vacc
> inated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K12000/Dollar/vacci
> nated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 30

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   439       3   4,035      12,105        10.1       0.7      00:24:59
   955      10   4,035      40,350        22.7       1.5      00:22:00
  1467       9   4,035      36,315        36.4       2.4      00:20:28
  1971       6   4,035      24,210        49.4       3.2      00:19:55
  2458       7   4,035      28,245        61.9       4.1      00:19:42
  2992      10   4,035      40,350        75.6       5.0      00:19:10
  3481       9   4,035      36,315        89.1       5.8      00:18:48
  3935      10   4,035      40,350       100.8       6.6      00:18:49
  4302       4   4,035      16,140       109.9       7.2      00:19:18
  4693       9   4,035      36,315       120.3       7.9      00:19:27
  5038      10   4,035      40,350       129.3       8.5      00:19:47
  5416       9   4,035      36,315       139.3       9.1      00:19:53
  6027       9   4,035      36,315       154.5      10.1      00:19:13
  6526       6   4,035      24,210       167.3      11.0      00:18:56
  7085      10   4,035      40,350       181.6      11.9      00:18:29
  7673       5   4,035      20,175       197.0      12.9      00:17:58
  8197       6   4,035      24,210       211.5      13.9      00:17:36
  8725       9   4,035      36,315       225.9      14.8      00:17:15
  9279      10   4,035      40,350       241.3      15.8      00:16:51
  9777       8   4,035      32,280       255.2      16.7      00:16:35
 10179       5   4,035      20,175       265.3      17.4      00:16:37
 10558       7   4,035      28,245       275.1      18.1      00:16:39
 10860       5   4,035      20,175       282.9      18.6      00:16:50
 11155       6   4,035      24,210       290.6      19.1      00:16:59
 11529       5   4,035      20,175       300.5      19.7      00:16:59
 11899       9   4,035      36,315       310.2      20.4      00:16:58
 12287       7   4,035      28,245       320.5      21.0      00:16:54
 12750       3   4,035      12,105       332.6      21.8      00:16:44
 13175       8   4,035      32,280       343.6      22.6      00:16:37
 13580       5   4,035      20,175       354.7      23.3      00:16:30
 13893       6   4,035      24,210       363.1      23.8      00:16:32
 14247       7   4,035      28,245       372.5      24.4      00:16:30
 14681      10   4,035      40,350       384.3      25.2      00:16:20
 15125      10   4,035      40,350       396.4      26.0      00:16:08
 15512      10   4,035      40,350       406.8      26.7      00:16:02
 15902      10   4,035      40,350       417.4      27.4      00:15:55
 16314       9   4,035      36,315       429.0      28.2      00:15:45
 16655       6   4,035      24,210       438.1      28.8      00:15:42
 17003       5   4,035      20,175       447.6      29.4      00:15:38
 17460       6   4,035      24,210       460.1      30.2      00:15:26
 17848       5   4,035      20,175       470.6      30.9      00:15:18
 18233       5   4,035      20,175       481.2      31.6      00:15:11
 18693      10   4,035      40,350       493.4      32.4      00:14:59
 19141       7   4,035      28,245       505.9      33.2      00:14:46
 19662       7   4,035      28,245       520.5      34.2      00:14:28
 20199      10   4,035      40,350       535.7      35.2      00:14:09
 20709       7   4,035      28,245       549.6      36.1      00:13:54
 21214      10   4,035      40,350       563.0      37.0      00:13:40
 21642       9   4,035      36,315       573.7      37.7      00:13:32
 22018      10   4,035      40,350       583.3      38.3      00:13:27
 22428       9   4,035      36,315       593.5      39.0      00:13:20
 22830       7   4,035      28,245       603.5      39.6      00:13:14
 23190       7   4,035      28,245       613.1      40.2      00:13:08
 23549       8   4,035      32,280       622.3      40.8      00:13:03
 23949       7   4,035      28,245       633.0      41.5      00:12:55
 24382       5   4,035      20,175       643.8      42.3      00:12:46
 24794       4   4,035      16,140       655.0      43.0      00:12:37
 25256       5   4,035      20,175       667.3      43.8      00:12:25
 25668       7   4,035      28,245       678.1      44.5      00:12:17
 25922      10   4,035      40,350       685.2      45.0      00:12:15
 26295       2   4,035       8,070       695.2      45.6      00:12:08
 26675       7   4,035      28,245       704.8      46.3      00:12:01
 27017       3   4,035      12,105       714.1      46.9      00:11:55
 27537      10   4,035      40,350       727.9      47.8      00:11:41
 28031       6   4,035      24,210       741.3      48.7      00:11:27
 28536       6   4,035      24,210       755.3      49.6      00:11:12
 29066       7   4,035      28,245       770.0      50.5      00:10:57
 29587       9   4,035      36,315       784.0      51.5      00:10:43
 29947      10   4,035      40,350       793.7      52.1      00:10:35
 30295      10   4,035      40,350       803.3      52.7      00:10:29
 30655       7   4,035      28,245       813.3      53.4      00:10:21
 30981       9   4,035      36,315       822.2      54.0      00:10:15
 31367       6   4,035      24,210       832.8      54.7      00:10:07
 31797       9   4,035      36,315       844.9      55.5      00:09:55
 32114       8   4,035      32,280       853.9      56.0      00:09:49
 32477       5   4,035      20,175       864.4      56.7      00:09:41
 32967       6   4,035      24,210       877.9      57.6      00:09:27
 33399       5   4,035      20,175       889.9      58.4      00:09:16
 33898       7   4,035      28,245       904.1      59.3      00:09:02
 34437      10   4,035      40,350       919.4      60.3      00:08:47
 34874       9   4,035      36,315       931.7      61.2      00:08:35
 35421       6   4,035      24,210       947.0      62.2      00:08:20
 35994      10   4,035      40,350       962.9      63.2      00:08:04
 36437       6   4,035      24,210       975.2      64.0      00:07:53
 36866       8   4,035      32,280       986.8      64.8      00:07:43
 37289       3   4,035      12,105       997.8      65.5      00:07:34
 37593       9   4,035      36,315     1,005.7      66.0      00:07:29
 37943       7   4,035      28,245     1,014.9      66.6      00:07:22
 38324       7   4,035      28,245     1,025.4      67.3      00:07:13
 38593       8   4,035      32,280     1,032.9      67.8      00:07:08
 38946       4   4,035      16,140     1,042.5      68.4      00:07:01
 39301       5   4,035      20,175     1,051.9      69.0      00:06:53
 39638       7   4,035      28,245     1,061.0      69.6      00:06:46
 40062       7   4,035      28,245     1,072.2      70.4      00:06:36
 40500       7   4,035      28,245     1,084.1      71.2      00:06:26
 40886       8   4,035      32,280     1,094.7      71.8      00:06:17
 41350       6   4,035      24,210     1,107.5      72.7      00:06:05
 41906       7   4,035      28,245     1,122.7      73.7      00:05:50
 42237      10   4,035      40,350     1,131.2      74.2      00:05:44
 42512       6   4,035      24,210     1,138.6      74.7      00:05:39
 42865       9   4,035      36,315     1,148.0      75.4      00:05:31
 43171       4   4,035      16,140     1,156.6      75.9      00:05:24
 43462       7   4,035      28,245     1,164.7      76.4      00:05:18
 43852       7   4,035      28,245     1,174.9      77.1      00:05:09
 44193      10   4,035      40,350     1,184.0      77.7      00:05:02
 44667       6   4,035      24,210     1,196.6      78.5      00:04:50
 45150       2   4,035       8,070     1,209.6      79.4      00:04:38
 45483       8   4,035      32,280     1,217.9      79.9      00:04:31
 45772      10   4,035      40,350     1,225.3      80.4      00:04:26
 46079       2   4,035       8,070     1,233.5      81.0      00:04:19
 46389       2   4,035       8,070     1,242.1      81.5      00:04:12
 46770       8   4,035      32,280     1,252.4      82.2      00:04:03
 47275       4   4,035      16,140     1,265.3      83.0      00:03:51
 47653       8   4,035      32,280     1,275.1      83.7      00:03:43
 47994       8   4,035      32,280     1,284.3      84.3      00:03:35
 48333       8   4,035      32,280     1,293.4      84.9      00:03:27
 48659      10   4,035      40,350     1,302.2      85.5      00:03:19
 49023       8   4,035      32,280     1,311.8      86.1      00:03:11
 49388      10   4,035      40,350     1,321.6      86.7      00:03:02
 49868       6   4,035      24,210     1,333.6      87.5      00:02:51
 50364       7   4,035      28,245     1,346.5      88.4      00:02:39
 50760      10   4,035      40,350     1,357.2      89.1      00:02:30
 51105       4   4,035      16,140     1,366.8      89.7      00:02:21
 51519       9   4,035      36,315     1,377.9      90.4      00:02:11
 51917       4   4,035      16,140     1,389.1      91.2      00:02:01
 52278       5   4,035      20,175     1,399.5      91.9      00:01:52
 52643       9   4,035      36,315     1,410.1      92.6      00:01:42
 53034       8   4,035      32,280     1,421.5      93.3      00:01:32
 53421       7   4,035      28,245     1,432.2      94.0      00:01:22
 53809       6   4,035      24,210     1,443.1      94.7      00:01:13
 54161       4   4,035      16,140     1,452.5      95.3      00:01:04
 54515       7   4,035      28,245     1,461.7      95.9      00:00:56
 54856       8   4,035      32,280     1,470.6      96.5      00:00:48
 55277       6   4,035      24,210     1,481.7      97.3      00:00:38
 55700       5   4,035      20,175     1,492.6      98.0      00:00:28
 56099       6   4,035      24,210     1,503.4      98.7      00:00:18
 56464       7   4,035      28,245     1,513.8      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1385.012
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  11,327,730

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K12000/Dollar/vaccinat
    > ed/ca_blk_Dollar_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K12000/Dollar/vaccinate
> d/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
