
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A100.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   356       4   4,135      16,540         8.5       0.5      00:30:30
   442       7   4,135      28,945        10.5       0.7      00:49:15
   670      10   4,135      41,350        16.3       1.0      00:47:34
  1092       4   4,135      16,540        27.2       1.7      00:37:41
  1509      10   4,135      41,350        38.6       2.5      00:32:54
  1931       9   4,135      37,215        49.6       3.2      00:30:29
  2341       7   4,135      28,945        60.5       3.9      00:28:58
  2765       8   4,135      33,080        71.8       4.6      00:27:40
  3186      10   4,135      41,350        83.2       5.3      00:26:41
  3583       2   4,135       8,270        94.1       6.0      00:26:00
  3954      10   4,135      41,350       103.9       6.7      00:25:44
  4280       9   4,135      37,215       112.3       7.2      00:25:50
  4595       6   4,135      24,810       120.7       7.7      00:25:53
  4905      10   4,135      41,350       129.1       8.3      00:25:55
  5233       9   4,135      37,215       137.9       8.8      00:25:50
  5537       3   4,135      12,405       145.7       9.3      00:25:56
  5822       3   4,135      12,405       153.0       9.8      00:26:06
  6159       3   4,135      12,405       162.1      10.4      00:25:55
  6474      10   4,135      41,350       170.3      10.9      00:25:53
  6789      10   4,135      41,350       178.5      11.4      00:25:51
  7150       9   4,135      37,215       187.8      12.0      00:25:37
  7518      10   4,135      41,350       197.8      12.7      00:25:18
  7898       7   4,135      28,945       208.3      13.4      00:24:55
  8264       8   4,135      33,080       218.7      14.0      00:24:35
  8611       8   4,135      33,080       228.6      14.7      00:24:19
  8973       8   4,135      33,080       238.7      15.3      00:24:02
  9269       9   4,135      37,215       247.2      15.8      00:23:57
  9523       9   4,135      37,215       254.3      16.3      00:24:00
  9799       3   4,135      12,405       262.3      16.8      00:23:58
 10092       4   4,135      16,540       270.0      17.3      00:23:56
 10302       5   4,135      20,675       275.1      17.6      00:24:10
 10472       6   4,135      24,810       279.9      17.9      00:24:27
 10645      10   4,135      41,350       284.3      18.2      00:24:45
 10824       5   4,135      20,675       289.0      18.5      00:24:59
 11011      10   4,135      41,350       294.2      18.9      00:25:10
 11204       8   4,135      33,080       299.3      19.2      00:25:20
 11371       7   4,135      28,945       303.8      19.5      00:25:34
 11539       4   4,135      16,540       308.3      19.8      00:25:47
 11736       6   4,135      24,810       313.5      20.1      00:25:54
 11929       6   4,135      24,810       318.8      20.4      00:26:01
 12136       8   4,135      33,080       324.6      20.8      00:26:04
 12359       8   4,135      33,080       330.5      21.2      00:26:06
 12640       9   4,135      37,215       338.1      21.7      00:25:58
 12923       6   4,135      24,810       345.4      22.1      00:25:51
 13190       8   4,135      33,080       352.7      22.6      00:25:44
 13450      10   4,135      41,350       360.0      23.1      00:25:37
 13624       9   4,135      37,215       365.1      23.4      00:25:42
 13783       6   4,135      24,810       369.3      23.7      00:25:51
 13960      10   4,135      41,350       374.0      24.0      00:25:58
 14186       6   4,135      24,810       380.2      24.4      00:25:55
 14387       5   4,135      20,675       385.9      24.7      00:25:56
 14598       7   4,135      28,945       391.7      25.1      00:25:55
 14777       8   4,135      33,080       396.7      25.4      00:25:58
 15016       5   4,135      20,675       403.3      25.8      00:25:53
 15305       8   4,135      33,080       411.4      26.4      00:25:40
 15571      10   4,135      41,350       418.6      26.8      00:25:31
 15806       8   4,135      33,080       425.2      27.3      00:25:25
 16055       9   4,135      37,215       432.5      27.7      00:25:16
 16324       9   4,135      37,215       440.1      28.2      00:25:05
 16540       8   4,135      33,080       446.2      28.6      00:25:02
 16721      10   4,135      41,350       451.1      28.9      00:25:03
 16916       9   4,135      37,215       456.5      29.3      00:25:03
 17098       8   4,135      33,080       461.5      29.6      00:25:04
 17274       7   4,135      28,945       466.4      29.9      00:25:05
 17456       9   4,135      37,215       471.7      30.2      00:25:04
 17629       8   4,135      33,080       476.7      30.6      00:25:04
 17843       5   4,135      20,675       482.4      30.9      00:25:01
 18042      10   4,135      41,350       487.9      31.3      00:24:58
 18302       5   4,135      20,675       495.2      31.7      00:24:48
 18525       9   4,135      37,215       501.1      32.1      00:24:43
 18688       5   4,135      20,675       505.8      32.4      00:24:44
 18853       4   4,135      16,540       510.4      32.7      00:24:45
 19042      10   4,135      41,350       515.9      33.1      00:24:41
 19254       3   4,135      12,405       521.9      33.5      00:24:36
 19515       7   4,135      28,945       529.5      33.9      00:24:24
 19826       6   4,135      24,810       538.4      34.5      00:24:06
 20122       8   4,135      33,080       547.1      35.1      00:23:49
 20440       6   4,135      24,810       555.9      35.6      00:23:32
 20664       6   4,135      24,810       562.2      36.0      00:23:25
 20880       5   4,135      20,675       568.4      36.4      00:23:19
 21125       8   4,135      33,080       574.9      36.8      00:23:11
 21379      10   4,135      41,350       581.3      37.3      00:23:04
 21652       7   4,135      28,945       588.5      37.7      00:22:54
 21896      10   4,135      41,350       594.8      38.1      00:22:47
 22171       6   4,135      24,810       601.8      38.6      00:22:37
 22445       5   4,135      20,675       608.8      39.0      00:22:27
 22703       8   4,135      33,080       615.8      39.5      00:22:17
 22974      10   4,135      41,350       622.6      39.9      00:22:08
 23231       7   4,135      28,945       629.8      40.4      00:21:58
 23491       8   4,135      33,080       636.4      40.8      00:21:49
 23743       5   4,135      20,675       643.2      41.2      00:21:40
 24005       3   4,135      12,405       650.3      41.7      00:21:30
 24288       8   4,135      33,080       657.6      42.1      00:21:19
 24599      10   4,135      41,350       666.2      42.7      00:21:04
 24944       5   4,135      20,675       675.4      43.3      00:20:48
 25262       5   4,135      20,675       684.3      43.9      00:20:32
 25535      10   4,135      41,350       691.8      44.3      00:20:21
 25728      10   4,135      41,350       697.0      44.7      00:20:17
 25967       6   4,135      24,810       703.6      45.1      00:20:08
 26209       8   4,135      33,080       710.3      45.5      00:19:60
 26499      10   4,135      41,350       718.0      46.0      00:19:48
 26784       8   4,135      33,080       725.6      46.5      00:19:36
 27066      10   4,135      41,350       733.3      47.0      00:19:25
 27284       5   4,135      20,675       739.3      47.4      00:19:18
 27496       7   4,135      28,945       745.1      47.8      00:19:12
 27765       9   4,135      37,215       752.5      48.2      00:19:01
 28061       8   4,135      33,080       760.8      48.8      00:18:47
 28379       6   4,135      24,810       769.8      49.3      00:18:32
 28667       5   4,135      20,675       778.1      49.9      00:18:18
 28845       2   4,135       8,270       783.2      50.2      00:18:14
 29078      10   4,135      41,350       789.7      50.6      00:18:06
 29352      10   4,135      41,350       797.3      51.1      00:17:54
 29641      10   4,135      41,350       805.1      51.6      00:17:43
 29885       5   4,135      20,675       812.0      52.0      00:17:33
 30114       9   4,135      37,215       818.4      52.5      00:17:25
 30374       8   4,135      33,080       825.7      52.9      00:17:15
 30618       7   4,135      28,945       832.7      53.4      00:17:05
 30952       9   4,135      37,215       842.1      54.0      00:16:49
 31287       7   4,135      28,945       851.5      54.6      00:16:33
 31601       6   4,135      24,810       860.5      55.2      00:16:18
 31925      10   4,135      41,350       870.0      55.8      00:16:02
 32255       9   4,135      37,215       879.6      56.4      00:15:46
 32533       5   4,135      20,675       887.6      56.9      00:15:34
 32734       5   4,135      20,675       893.4      57.3      00:15:28
 32962       6   4,135      24,810       900.0      57.7      00:15:19
 33189       7   4,135      28,945       906.4      58.1      00:15:11
 33460       1   4,135       4,135       914.1      58.6      00:14:60
 33727       9   4,135      37,215       921.9      59.1      00:14:48
 34005       7   4,135      28,945       929.9      59.6      00:14:37
 34293       5   4,135      20,675       938.5      60.1      00:14:23
 34634       7   4,135      28,945       948.1      60.8      00:14:08
 34973       6   4,135      24,810       958.0      61.4      00:13:52
 35308       5   4,135      20,675       967.6      62.0      00:13:37
 35647       4   4,135      16,540       977.3      62.6      00:13:21
 35975      10   4,135      41,350       986.6      63.2      00:13:07
 36308       8   4,135      33,080       996.2      63.8      00:12:52
 36594       8   4,135      33,080     1,004.2      64.4      00:12:40
 36832       4   4,135      16,540     1,010.6      64.8      00:12:32
 37072      10   4,135      41,350     1,017.3      65.2      00:12:24
 37334      10   4,135      41,350     1,023.9      65.6      00:12:15
 37588       4   4,135      16,540     1,030.9      66.1      00:12:06
 37832       8   4,135      33,080     1,037.3      66.5      00:11:57
 38064      10   4,135      41,350     1,043.9      66.9      00:11:49
 38296       8   4,135      33,080     1,050.4      67.3      00:11:41
 38538       5   4,135      20,675     1,057.4      67.8      00:11:31
 38877      10   4,135      41,350     1,066.8      68.4      00:11:17
 39099       8   4,135      33,080     1,073.0      68.8      00:11:09
 39355       6   4,135      24,810     1,079.9      69.2      00:10:60
 39628       4   4,135      16,540     1,087.3      69.7      00:10:50
 39913       6   4,135      24,810     1,095.1      70.2      00:10:39
 40269       9   4,135      37,215     1,104.7      70.8      00:10:24
 40611       9   4,135      37,215     1,114.5      71.4      00:10:09
 40940       8   4,135      33,080     1,123.8      72.0      00:09:56
 41151      10   4,135      41,350     1,129.7      72.4      00:09:48
 41393      10   4,135      41,350     1,136.4      72.8      00:09:40
 41671       9   4,135      37,215     1,144.2      73.3      00:09:29
 41908       5   4,135      20,675     1,151.0      73.8      00:09:20
 42137      10   4,135      41,350     1,156.9      74.1      00:09:12
 42380      10   4,135      41,350     1,163.5      74.6      00:09:03
 42603       7   4,135      28,945     1,169.5      75.0      00:08:56
 42839       7   4,135      28,945     1,176.1      75.4      00:08:47
 43062      10   4,135      41,350     1,182.4      75.8      00:08:39
 43293       9   4,135      37,215     1,189.1      76.2      00:08:30
 43530       7   4,135      28,945     1,195.6      76.6      00:08:21
 43874       5   4,135      20,675     1,205.0      77.2      00:08:08
 44162      10   4,135      41,350     1,212.9      77.7      00:07:56
 44420       7   4,135      28,945     1,219.7      78.2      00:07:47
 44700       3   4,135      12,405     1,227.4      78.7      00:07:37
 44973       9   4,135      37,215     1,235.1      79.2      00:07:26
 45285       3   4,135      12,405     1,243.2      79.7      00:07:15
 45517      10   4,135      41,350     1,249.3      80.1      00:07:07
 45769       7   4,135      28,945     1,255.8      80.5      00:06:58
 46019       6   4,135      24,810     1,262.7      80.9      00:06:49
 46270       3   4,135      12,405     1,269.9      81.4      00:06:39
 46511       9   4,135      37,215     1,276.5      81.8      00:06:30
 46826       9   4,135      37,215     1,285.3      82.4      00:06:17
 47063       8   4,135      33,080     1,291.4      82.8      00:06:09
 47303      10   4,135      41,350     1,297.6      83.2      00:06:01
 47546       8   4,135      33,080     1,304.0      83.6      00:05:53
 47777      10   4,135      41,350     1,310.3      84.0      00:05:44
 48000       6   4,135      24,810     1,316.5      84.4      00:05:36
 48219       8   4,135      33,080     1,322.4      84.8      00:05:28
 48463       5   4,135      20,675     1,329.3      85.2      00:05:19
 48730       8   4,135      33,080     1,336.6      85.7      00:05:09
 48972       3   4,135      12,405     1,343.1      86.1      00:04:60
 49183       8   4,135      33,080     1,349.3      86.5      00:04:51
 49404      10   4,135      41,350     1,355.0      86.8      00:04:44
 49636       7   4,135      28,945     1,360.8      87.2      00:04:36
 49863       9   4,135      37,215     1,366.7      87.6      00:04:28
 50107       8   4,135      33,080     1,373.5      88.0      00:04:19
 50351       5   4,135      20,675     1,379.7      88.4      00:04:11
 50583       8   4,135      33,080     1,386.2      88.8      00:04:02
 50811       7   4,135      28,945     1,392.5      89.3      00:03:53
 51035       5   4,135      20,675     1,399.2      89.7      00:03:44
 51300       7   4,135      28,945     1,406.3      90.1      00:03:34
 51523       9   4,135      37,215     1,412.6      90.5      00:03:25
 51772       9   4,135      37,215     1,419.9      91.0      00:03:15
 52040       9   4,135      37,215     1,427.5      91.5      00:03:04
 52347       6   4,135      24,810     1,436.6      92.1      00:02:52
 52651       8   4,135      33,080     1,445.9      92.7      00:02:38
 52962       6   4,135      24,810     1,455.0      93.3      00:02:26
 53285       8   4,135      33,080     1,464.3      93.9      00:02:13
 53609       8   4,135      33,080     1,473.6      94.4      00:01:60
 53872      10   4,135      41,350     1,480.9      94.9      00:01:50
 54105       9   4,135      37,215     1,487.3      95.3      00:01:41
 54347       3   4,135      12,405     1,494.0      95.8      00:01:32
 54644       3   4,135      12,405     1,501.7      96.2      00:01:21
 54931       8   4,135      33,080     1,509.5      96.7      00:01:10
 55198      10   4,135      41,350     1,516.7      97.2      00:01:00
 55458       8   4,135      33,080     1,523.4      97.6      00:00:51
 55695       9   4,135      37,215     1,529.8      98.0      00:00:42
 55935       5   4,135      20,675     1,536.5      98.5      00:00:33
 56172       2   4,135       8,270     1,543.2      98.9      00:00:24
 56419       7   4,135      28,945     1,550.4      99.4      00:00:14
 56757       9   4,135      37,215     1,560.0     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 2163.498
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A100.csv saved

. 
. cap log close

. 
end of do-file
