
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A500.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   308       7   4,535      31,745         8.1       0.5      00:35:15
   634       3   4,535      13,605        16.8       1.0      00:33:38
   947       6   4,535      27,210        25.5       1.5      00:33:07
  1224       6   4,535      27,210        33.7       2.0      00:33:13
  1443      10   4,535      45,350        40.3       2.4      00:34:34
  1716      10   4,535      45,350        48.5       2.8      00:34:21
  1994       9   4,535      40,815        56.3       3.3      00:34:22
  2248       3   4,535      13,605        63.7       3.7      00:34:31
  2481       2   4,535       9,070        70.3       4.1      00:35:04
  2733       4   4,535      18,140        77.8       4.5      00:35:02
  2972       6   4,535      27,210        84.6       4.9      00:35:18
  3183       6   4,535      27,210        91.1       5.3      00:35:37
  3418       8   4,535      36,280        98.4       5.8      00:35:33
  3668      10   4,535      45,350       105.8       6.2      00:35:28
  3894       6   4,535      27,210       112.4       6.6      00:35:38
  4071       7   4,535      31,745       117.4       6.9      00:36:17
  4281       3   4,535      13,605       123.1       7.2      00:36:37
  4475       9   4,535      40,815       128.7       7.5      00:36:57
  4634       8   4,535      36,280       133.6       7.8      00:37:28
  4806       9   4,535      40,815       138.7       8.1      00:37:52
  5016       5   4,535      22,675       144.8       8.5      00:37:56
  5219       4   4,535      18,140       150.8       8.8      00:38:01
  5414       9   4,535      40,815       156.7       9.2      00:38:08
  5594       6   4,535      27,210       161.3       9.4      00:38:32
  5738       9   4,535      40,815       165.4       9.7      00:39:03
  5962       7   4,535      31,745       171.9      10.0      00:38:54
  6162       7   4,535      31,745       177.8      10.4      00:38:55
  6347       7   4,535      31,745       183.0      10.7      00:39:06
  6519       2   4,535       9,070       188.0      11.0      00:39:18
  6699       9   4,535      40,815       193.1      11.3      00:39:27
  6882       7   4,535      31,745       198.5      11.6      00:39:31
  7098      10   4,535      45,350       204.7      12.0      00:39:23
  7364       6   4,535      27,210       212.4      12.4      00:38:56
  7621       4   4,535      18,140       220.0      12.9      00:38:32
  7827       8   4,535      36,280       226.2      13.2      00:38:25
  8033       5   4,535      22,675       232.7      13.6      00:38:14
  8256       6   4,535      27,210       239.5      14.0      00:38:00
  8465       5   4,535      22,675       246.2      14.4      00:37:48
  8713       8   4,535      36,280       253.7      14.8      00:37:27
  8937       8   4,535      36,280       260.8      15.2      00:37:12
  9175       7   4,535      31,745       268.1      15.7      00:36:54
  9338       9   4,535      40,815       273.1      16.0      00:36:59
  9463       9   4,535      40,815       277.0      16.2      00:37:14
  9595      10   4,535      45,350       281.3      16.4      00:37:24
  9703       5   4,535      22,675       284.8      16.6      00:37:42
  9818       6   4,535      27,210       288.3      16.8      00:37:58
  9969       8   4,535      36,280       292.6      17.1      00:38:06
 10153       8   4,535      36,280       297.6      17.4      00:38:07
 10322       8   4,535      36,280       302.4      17.7      00:38:11
 10440       8   4,535      36,280       306.0      17.9      00:38:24
 10639       9   4,535      40,815       311.6      18.2      00:38:19
 10821       8   4,535      36,280       316.9      18.5      00:38:15
 11005       3   4,535      13,605       322.5      18.8      00:38:10
 11190      10   4,535      45,350       327.9      19.2      00:38:06
 11353       6   4,535      27,210       332.7      19.4      00:38:07
 11539       4   4,535      18,140       338.1      19.8      00:38:02
 11770       5   4,535      22,675       345.0      20.2      00:37:45
 11971       6   4,535      27,210       350.9      20.5      00:37:36
 12131       4   4,535      18,140       355.9      20.8      00:37:35
 12338      10   4,535      45,350       361.9      21.2      00:37:24
 12636       8   4,535      36,280       370.7      21.7      00:36:53
 12921       5   4,535      22,675       378.7      22.1      00:36:28
 13224       5   4,535      22,675       387.8      22.7      00:35:57
 13500       2   4,535       9,070       396.5      23.2      00:35:29
 13638       6   4,535      27,210       400.7      23.4      00:35:32
 13778      10   4,535      45,350       404.9      23.7      00:35:36
 13898       2   4,535       9,070       408.4      23.9      00:35:45
 14032       6   4,535      27,210       412.2      24.1      00:35:50
 14227       5   4,535      22,675       418.2      24.4      00:35:40
 14417       6   4,535      27,210       424.1      24.8      00:35:31
 14623       9   4,535      40,815       430.4      25.2      00:35:20
 14824      10   4,535      45,350       436.4      25.5      00:35:10
 15068       6   4,535      27,210       443.9      25.9      00:34:51
 15319       8   4,535      36,280       451.6      26.4      00:34:30
 15572       6   4,535      27,210       459.2      26.8      00:34:12
 15816      10   4,535      45,350       466.7      27.3      00:33:53
 16051       8   4,535      36,280       474.1      27.7      00:33:35
 16268       9   4,535      40,815       480.9      28.1      00:33:22
 16505       9   4,535      40,815       488.4      28.5      00:33:04
 16695       8   4,535      36,280       494.0      28.9      00:32:58
 16845       8   4,535      36,280       498.5      29.1      00:32:57
 16943       9   4,535      40,815       501.5      29.3      00:33:04
 17071       6   4,535      27,210       505.3      29.5      00:33:07
 17190       7   4,535      31,745       508.9      29.7      00:33:11
 17308       8   4,535      36,280       512.6      30.0      00:33:14
 17461       9   4,535      40,815       517.5      30.2      00:33:10
 17615       9   4,535      40,815       522.4      30.5      00:33:06
 17773       9   4,535      40,815       526.9      30.8      00:33:05
 17981       9   4,535      40,815       533.2      31.2      00:32:52
 18237       4   4,535      18,140       541.2      31.6      00:32:32
 18463       6   4,535      27,210       547.6      32.0      00:32:20
 18607       8   4,535      36,280       552.1      32.3      00:32:18
 18693       5   4,535      22,675       554.9      32.4      00:32:24
 18792       6   4,535      27,210       557.9      32.6      00:32:30
 18944       9   4,535      40,815       562.7      32.9      00:32:25
 19126       8   4,535      36,280       568.5      33.2      00:32:16
 19372      10   4,535      45,350       576.1      33.7      00:31:57
 19629       9   4,535      40,815       584.2      34.1      00:31:37
 19880       6   4,535      27,210       592.2      34.6      00:31:16
 20141       7   4,535      31,745       600.6      35.1      00:30:55
 20424      10   4,535      45,350       609.2      35.6      00:30:33
 20599       9   4,535      40,815       614.7      35.9      00:30:25
 20805       4   4,535      18,140       621.0      36.3      00:30:14
 20949       8   4,535      36,280       625.5      36.6      00:30:11
 21160       1   4,535       4,535       631.5      36.9      00:30:02
 21352       6   4,535      27,210       636.7      37.2      00:29:56
 21506       9   4,535      40,815       641.4      37.5      00:29:52
 21659       7   4,535      31,745       645.7      37.7      00:29:49
 21834       7   4,535      31,745       650.5      38.0      00:29:44
 21999       4   4,535      18,140       655.3      38.3      00:29:39
 22201      10   4,535      45,350       660.9      38.6      00:29:31
 22364       2   4,535       9,070       665.4      38.9      00:29:27
 22512      10   4,535      45,350       669.8      39.1      00:29:24
 22721       8   4,535      36,280       675.7      39.5      00:29:14
 22996       5   4,535      22,675       683.5      39.9      00:28:56
 23198      10   4,535      45,350       689.6      40.3      00:28:45
 23414       9   4,535      40,815       696.1      40.7      00:28:33
 23629       6   4,535      27,210       701.9      41.0      00:28:23
 23804      10   4,535      45,350       707.4      41.3      00:28:15
 24074       8   4,535      36,280       715.4      41.8      00:27:56
 24362       6   4,535      27,210       723.2      42.3      00:27:39
 24637       7   4,535      31,745       731.7      42.8      00:27:19
 24931       6   4,535      27,210       740.3      43.3      00:26:59
 25178       7   4,535      31,745       748.0      43.7      00:26:43
 25416       7   4,535      31,745       755.1      44.1      00:26:28
 25626      10   4,535      45,350       761.1      44.5      00:26:18
 25772       6   4,535      27,210       765.8      44.8      00:26:13
 25956       8   4,535      36,280       771.3      45.1      00:26:05
 26130       4   4,535      18,140       776.5      45.4      00:25:58
 26346       8   4,535      36,280       783.1      45.8      00:25:46
 26542       5   4,535      22,675       788.7      46.1      00:25:38
 26732       8   4,535      36,280       794.2      46.4      00:25:29
 26916       5   4,535      22,675       799.8      46.7      00:25:21
 27099       9   4,535      40,815       805.2      47.1      00:25:13
 27257       9   4,535      40,815       809.9      47.3      00:25:07
 27439       9   4,535      40,815       815.4      47.7      00:24:59
 27643       9   4,535      40,815       821.6      48.0      00:24:48
 27868       4   4,535      18,140       828.6      48.4      00:24:35
 28137       6   4,535      27,210       836.8      48.9      00:24:17
 28335      10   4,535      45,350       842.9      49.3      00:24:07
 28549       8   4,535      36,280       849.8      49.7      00:23:54
 28703       9   4,535      40,815       854.5      49.9      00:23:49
 28819      10   4,535      45,350       858.1      50.1      00:23:46
 28985       6   4,535      27,210       863.3      50.4      00:23:39
 29161       5   4,535      22,675       868.6      50.8      00:23:31
 29380       6   4,535      27,210       875.3      51.2      00:23:19
 29569       5   4,535      22,675       880.9      51.5      00:23:10
 29742       7   4,535      31,745       886.2      51.8      00:23:02
 29894       7   4,535      31,745       890.8      52.1      00:22:57
 30024       8   4,535      36,280       894.9      52.3      00:22:53
 30163       5   4,535      22,675       899.2      52.5      00:22:48
 30359       4   4,535      18,140       905.1      52.9      00:22:38
 30549       9   4,535      40,815       911.1      53.2      00:22:28
 30796       7   4,535      31,745       918.8      53.7      00:22:13
 31040      10   4,535      45,350       926.2      54.1      00:21:58
 31266       6   4,535      27,210       933.2      54.5      00:21:45
 31481       4   4,535      18,140       940.1      54.9      00:21:32
 31690      10   4,535      45,350       946.6      55.3      00:21:21
 31904       7   4,535      31,745       953.5      55.7      00:21:08
 32111       5   4,535      22,675       960.0      56.1      00:20:56
 32324       6   4,535      27,210       967.0      56.5      00:20:43
 32492       8   4,535      36,280       972.3      56.8      00:20:35
 32603       8   4,535      36,280       975.7      57.0      00:20:33
 32717       8   4,535      36,280       979.3      57.2      00:20:30
 32856       8   4,535      36,280       983.6      57.5      00:20:25
 32978       8   4,535      36,280       987.5      57.7      00:20:21
 33099       7   4,535      31,745       991.4      57.9      00:20:17
 33248       5   4,535      22,675       996.0      58.2      00:20:11
 33426       8   4,535      36,280     1,001.5      58.5      00:20:02
 33587      10   4,535      45,350     1,006.7      58.8      00:19:54
 33764       7   4,535      31,745     1,012.3      59.2      00:19:45
 33928      10   4,535      45,350     1,017.4      59.5      00:19:37
 34088       6   4,535      27,210     1,022.6      59.8      00:19:29
 34197       4   4,535      18,140     1,026.2      60.0      00:19:26
 34415       6   4,535      27,210     1,033.0      60.4      00:19:13
 34625       8   4,535      36,280     1,039.5      60.8      00:19:01
 34815       8   4,535      36,280     1,045.7      61.1      00:18:50
 35041       9   4,535      40,815     1,052.7      61.5      00:18:37
 35246       5   4,535      22,675     1,059.2      61.9      00:18:26
 35451       5   4,535      22,675     1,065.8      62.3      00:18:14
 35667       7   4,535      31,745     1,072.4      62.7      00:18:02
 35859       6   4,535      27,210     1,078.4      63.0      00:17:52
 36055       6   4,535      27,210     1,084.4      63.4      00:17:41
 36284       7   4,535      31,745     1,091.8      63.8      00:17:27
 36522      10   4,535      45,350     1,099.0      64.2      00:17:14
 36658       5   4,535      22,675     1,103.2      64.5      00:17:08
 36823       9   4,535      40,815     1,108.1      64.8      00:17:01
 36984       7   4,535      31,745     1,113.0      65.0      00:16:54
 37151       7   4,535      31,745     1,117.8      65.3      00:16:47
 37292       4   4,535      18,140     1,121.8      65.6      00:16:42
 37415       8   4,535      36,280     1,125.4      65.8      00:16:38
 37521       8   4,535      36,280     1,128.5      65.9      00:16:35
 37656       7   4,535      31,745     1,132.5      66.2      00:16:30
 37805       9   4,535      40,815     1,136.9      66.4      00:16:23
 37977       7   4,535      31,745     1,142.0      66.7      00:16:15
 38142       8   4,535      36,280     1,147.3      67.0      00:16:07
 38244       6   4,535      27,210     1,150.4      67.2      00:16:04
 38394      10   4,535      45,350     1,155.2      67.5      00:15:56
 38592       6   4,535      27,210     1,161.3      67.9      00:15:46
 38810       8   4,535      36,280     1,167.9      68.3      00:15:33
 38992       6   4,535      27,210     1,173.6      68.6      00:15:24
 39148       5   4,535      22,675     1,178.2      68.9      00:15:17
 39317       7   4,535      31,745     1,183.2      69.1      00:15:09
 39528       8   4,535      36,280     1,189.5      69.5      00:14:58
 39705       9   4,535      40,815     1,194.7      69.8      00:14:49
 39877       6   4,535      27,210     1,199.9      70.1      00:14:41
 40113       9   4,535      40,815     1,207.0      70.5      00:14:28
 40346       9   4,535      40,815     1,213.9      70.9      00:14:15
 40589       6   4,535      27,210     1,221.6      71.4      00:14:00
 40802       7   4,535      31,745     1,228.2      71.8      00:13:49
 40969      10   4,535      45,350     1,233.5      72.1      00:13:40
 41058       7   4,535      31,745     1,236.1      72.2      00:13:38
 41148       6   4,535      27,210     1,238.8      72.4      00:13:35
 41265       8   4,535      36,280     1,242.5      72.6      00:13:30
 41424       7   4,535      31,745     1,247.3      72.9      00:13:22
 41560       9   4,535      40,815     1,251.5      73.1      00:13:16
 41736       9   4,535      40,815     1,256.9      73.5      00:13:07
 41929       8   4,535      36,280     1,263.0      73.8      00:12:56
 42101       8   4,535      36,280     1,267.8      74.1      00:12:49
 42279       5   4,535      22,675     1,272.8      74.4      00:12:40
 42399       5   4,535      22,675     1,276.6      74.6      00:12:35
 42527       8   4,535      36,280     1,280.5      74.8      00:12:29
 42656       6   4,535      27,210     1,284.2      75.0      00:12:24
 42782       6   4,535      27,210     1,288.0      75.3      00:12:18
 42916       6   4,535      27,210     1,292.2      75.5      00:12:12
 43064       9   4,535      40,815     1,296.9      75.8      00:12:04
 43181      10   4,535      45,350     1,300.7      76.0      00:11:59
 43297       8   4,535      36,280     1,304.2      76.2      00:11:54
 43420       7   4,535      31,745     1,308.1      76.4      00:11:48
 43622       7   4,535      31,745     1,314.0      76.8      00:11:38
 43850       6   4,535      27,210     1,320.8      77.2      00:11:25
 44083       7   4,535      31,745     1,327.8      77.6      00:11:12
 44235       9   4,535      40,815     1,332.4      77.9      00:11:05
 44408      10   4,535      45,350     1,337.3      78.2      00:10:56
 44571       7   4,535      31,745     1,342.4      78.4      00:10:48
 44782       7   4,535      31,745     1,348.7      78.8      00:10:36
 44966       5   4,535      22,675     1,354.4      79.1      00:10:27
 45167       4   4,535      18,140     1,360.2      79.5      00:10:16
 45347       8   4,535      36,280     1,365.1      79.8      00:10:08
 45454       9   4,535      40,815     1,368.3      80.0      00:10:03
 45552       8   4,535      36,280     1,371.1      80.1      00:09:60
 45709       7   4,535      31,745     1,375.5      80.4      00:09:53
 45901       4   4,535      18,140     1,381.1      80.7      00:09:43
 46055       6   4,535      27,210     1,385.9      81.0      00:09:35
 46217       8   4,535      36,280     1,391.1      81.3      00:09:26
 46343       9   4,535      40,815     1,394.9      81.5      00:09:20
 46481       6   4,535      27,210     1,398.9      81.8      00:09:13
 46643      10   4,535      45,350     1,404.0      82.0      00:09:04
 46857      10   4,535      45,350     1,410.6      82.4      00:08:52
 47018       8   4,535      36,280     1,415.0      82.7      00:08:45
 47148       4   4,535      18,140     1,418.6      82.9      00:08:39
 47314       5   4,535      22,675     1,423.5      83.2      00:08:31
 47449      10   4,535      45,350     1,427.3      83.4      00:08:25
 47564      10   4,535      45,350     1,430.7      83.6      00:08:20
 47685       5   4,535      22,675     1,434.4      83.8      00:08:14
 47823       8   4,535      36,280     1,438.4      84.1      00:08:07
 47968       8   4,535      36,280     1,442.9      84.3      00:07:60
 48158       8   4,535      36,280     1,448.5      84.7      00:07:49
 48301       8   4,535      36,280     1,453.0      84.9      00:07:42
 48454       8   4,535      36,280     1,457.6      85.2      00:07:34
 48612       7   4,535      31,745     1,462.4      85.5      00:07:26
 48746       5   4,535      22,675     1,466.4      85.7      00:07:19
 48872       5   4,535      22,675     1,470.1      85.9      00:07:13
 48994       9   4,535      40,815     1,473.7      86.1      00:07:07
 49120       9   4,535      40,815     1,477.8      86.4      00:06:60
 49252       9   4,535      40,815     1,481.8      86.6      00:06:53
 49411       6   4,535      27,210     1,486.2      86.9      00:06:46
 49586       8   4,535      36,280     1,491.1      87.1      00:06:37
 49754       5   4,535      22,675     1,495.9      87.4      00:06:29
 49927       6   4,535      27,210     1,501.0      87.7      00:06:19
 50082      10   4,535      45,350     1,505.6      88.0      00:06:11
 50197       6   4,535      27,210     1,509.0      88.2      00:06:06
 50334       8   4,535      36,280     1,512.7      88.4      00:05:59
 50469       8   4,535      36,280     1,516.7      88.6      00:05:53
 50597       7   4,535      31,745     1,520.7      88.9      00:05:46
 50724       6   4,535      27,210     1,524.6      89.1      00:05:39
 50834       8   4,535      36,280     1,528.0      89.3      00:05:33
 50955       3   4,535      13,605     1,531.9      89.5      00:05:26
 51117       2   4,535       9,070     1,536.8      89.8      00:05:18
 51318       7   4,535      31,745     1,542.8      90.2      00:05:07
 51485       6   4,535      27,210     1,548.0      90.5      00:04:57
 51648       6   4,535      27,210     1,553.3      90.8      00:04:48
 51827       9   4,535      40,815     1,558.9      91.1      00:04:37
 52039       8   4,535      36,280     1,565.6      91.5      00:04:25
 52302       8   4,535      36,280     1,574.1      92.0      00:04:09
 52546       6   4,535      27,210     1,582.2      92.5      00:03:54
 52791       6   4,535      27,210     1,590.3      92.9      00:03:39
 53064       4   4,535      18,140     1,599.1      93.4      00:03:23
 53300      10   4,535      45,350     1,606.5      93.9      00:03:09
 53548       9   4,535      40,815     1,614.3      94.3      00:02:55
 53735       5   4,535      22,675     1,620.1      94.7      00:02:44
 53870       3   4,535      13,605     1,624.1      94.9      00:02:37
 53981      10   4,535      45,350     1,627.5      95.1      00:02:31
 54113       8   4,535      36,280     1,631.5      95.3      00:02:24
 54229       5   4,535      22,675     1,635.0      95.5      00:02:18
 54340       7   4,535      31,745     1,638.3      95.7      00:02:12
 54475       5   4,535      22,675     1,641.9      96.0      00:02:06
 54623      10   4,535      45,350     1,646.3      96.2      00:01:58
 54789       5   4,535      22,675     1,651.2      96.5      00:01:49
 54948       8   4,535      36,280     1,656.0      96.8      00:01:40
 55090      10   4,535      45,350     1,660.2      97.0      00:01:33
 55218       9   4,535      40,815     1,664.0      97.2      00:01:26
 55384       8   4,535      36,280     1,668.5      97.5      00:01:18
 55561       4   4,535      18,140     1,673.6      97.8      00:01:09
 55739       7   4,535      31,745     1,679.1      98.1      00:00:58
 55944       7   4,535      31,745     1,685.4      98.5      00:00:47
 56145       7   4,535      31,745     1,691.6      98.9      00:00:36
 56323       8   4,535      36,280     1,697.3      99.2      00:00:25
 56518       8   4,535      36,280     1,703.4      99.5      00:00:14
 56734       6   4,535      27,210     1,710.2      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 3123.199
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
