
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A100_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   332       6   4,135      24,810         7.9       0.5      00:32:51
   689       6   4,135      24,810        16.6       1.1      00:31:02
  1075      10   4,135      41,350        26.6       1.7      00:28:53
  1446       6   4,135      24,810        36.7       2.4      00:27:43
  1825       8   4,135      33,080        46.8       3.0      00:27:01
  2186      10   4,135      41,350        56.3       3.6      00:26:45
  2577       5   4,135      20,675        66.5       4.3      00:26:15
  2963       8   4,135      33,080        76.8       4.9      00:25:47
  3314       2   4,135       8,270        86.6       5.5      00:25:34
  3653       8   4,135      33,080        95.8       6.1      00:25:30
  4000       8   4,135      33,080       104.9       6.7      00:25:28
  4289      10   4,135      41,350       112.3       7.2      00:25:49
  4579       6   4,135      24,810       120.0       7.7      00:26:02
  4862      10   4,135      41,350       127.8       8.2      00:26:12
  5156       9   4,135      37,215       135.6       8.7      00:26:19
  5417       6   4,135      24,810       142.8       9.1      00:26:31
  5679       9   4,135      37,215       149.1       9.5      00:26:53
  5952       9   4,135      37,215       156.3      10.0      00:27:00
  6240      10   4,135      41,350       164.1      10.5      00:27:00
  6557       5   4,135      20,675       172.2      11.0      00:26:55
  6830       7   4,135      28,945       179.4      11.5      00:26:60
  7163       9   4,135      37,215       188.0      12.0      00:26:50
  7525      10   4,135      41,350       197.8      12.7      00:26:28
  7894       9   4,135      37,215       208.0      13.3      00:26:04
  8245       8   4,135      33,080       218.0      14.0      00:25:43
  8591       8   4,135      33,080       227.8      14.6      00:25:24
  8938       6   4,135      24,810       237.6      15.2      00:25:06
  9254      10   4,135      41,350       246.6      15.8      00:24:55
  9516       8   4,135      33,080       254.0      16.3      00:24:55
  9814       6   4,135      24,810       262.5      16.8      00:24:46
 10117       1   4,135       4,135       270.4      17.3      00:24:42
 10407       1   4,135       4,135       277.8      17.8      00:24:41
 10722       7   4,135      28,945       286.3      18.3      00:24:32
 11056       5   4,135      20,675       295.2      18.9      00:24:21
 11333       8   4,135      33,080       302.6      19.4      00:24:18
 11623       6   4,135      24,810       310.3      19.9      00:24:14
 11936       7   4,135      28,945       318.8      20.4      00:24:04
 12230       5   4,135      20,675       327.0      20.9      00:23:57
 12596       5   4,135      20,675       336.7      21.6      00:23:41
 12986       5   4,135      20,675       346.8      22.2      00:23:23
 13362       7   4,135      28,945       357.2      22.9      00:23:05
 13663       7   4,135      28,945       365.9      23.4      00:22:54
 13967       9   4,135      37,215       374.0      24.0      00:22:47
 14294       7   4,135      28,945       383.0      24.5      00:22:36
 14619      10   4,135      41,350       392.1      25.1      00:22:24
 14957       7   4,135      28,945       401.4      25.7      00:22:12
 15341       8   4,135      33,080       412.2      26.4      00:21:52
 15724       7   4,135      28,945       422.6      27.1      00:21:35
 16098       7   4,135      28,945       433.5      27.8      00:21:17
 16473       9   4,135      37,215       444.2      28.5      00:20:59
 16787       6   4,135      24,810       452.8      29.0      00:20:51
 17048       9   4,135      37,215       460.0      29.5      00:20:47
 17344       9   4,135      37,215       468.2      30.0      00:20:39
 17628       6   4,135      24,810       476.4      30.5      00:20:32
 17971      10   4,135      41,350       485.7      31.1      00:20:20
 18316       9   4,135      37,215       495.4      31.7      00:20:07
 18644       8   4,135      33,080       504.3      32.3      00:19:57
 18932       6   4,135      24,810       512.5      32.8      00:19:49
 19215       6   4,135      24,810       520.6      33.3      00:19:41
 19586       6   4,135      24,810       531.2      34.0      00:19:25
 19992       3   4,135      12,405       543.0      34.8      00:19:06
 20411       9   4,135      37,215       554.8      35.5      00:18:46
 20728       3   4,135      12,405       563.8      36.1      00:18:36
 21044      10   4,135      41,350       572.6      36.7      00:18:27
 21423       6   4,135      24,810       582.2      37.3      00:18:15
 21789      10   4,135      41,350       591.6      37.9      00:18:03
 22165       8   4,135      33,080       601.3      38.5      00:17:51
 22551       6   4,135      24,810       611.5      39.2      00:17:38
 22918       9   4,135      37,215       620.8      39.8      00:17:27
 23273       7   4,135      28,945       630.7      40.4      00:17:14
 23678      10   4,135      41,350       641.2      41.1      00:17:00
 24060       9   4,135      37,215       651.7      41.7      00:16:47
 24531       6   4,135      24,810       664.0      42.5      00:16:28
 24977       9   4,135      37,215       676.1      43.3      00:16:10
 25444       6   4,135      24,810       689.0      44.1      00:15:51
 25824      10   4,135      41,350       699.5      44.8      00:15:38
 26179       8   4,135      33,080       709.1      45.4      00:15:27
 26598       4   4,135      16,540       720.4      46.1      00:15:12
 27028       8   4,135      33,080       732.1      46.9      00:14:56
 27327       5   4,135      20,675       740.1      47.4      00:14:49
 27653       8   4,135      33,080       749.1      48.0      00:14:40
 28073       7   4,135      28,945       760.8      48.7      00:14:24
 28523       9   4,135      37,215       773.6      49.5      00:14:06
 28856       6   4,135      24,810       783.1      50.2      00:13:56
 29181       7   4,135      28,945       792.3      50.7      00:13:46
 29450       5   4,135      20,675       799.7      51.2      00:13:40
 29740       5   4,135      20,675       807.6      51.7      00:13:33
 29981       8   4,135      33,080       814.3      52.2      00:13:29
 30220       8   4,135      33,080       821.1      52.6      00:13:24
 30493       8   4,135      33,080       828.8      53.1      00:13:17
 30786       9   4,135      37,215       837.1      53.6      00:13:09
 31123       5   4,135      20,675       846.4      54.2      00:12:58
 31435       7   4,135      28,945       855.4      54.8      00:12:49
 31769       7   4,135      28,945       865.0      55.4      00:12:38
 32093       5   4,135      20,675       874.5      56.0      00:12:27
 32409       7   4,135      28,945       883.8      56.6      00:12:17
 32658       9   4,135      37,215       890.8      57.1      00:12:11
 32880       8   4,135      33,080       897.1      57.5      00:12:07
 33119       6   4,135      24,810       904.1      57.9      00:12:01
 33401       8   4,135      33,080       912.0      58.4      00:11:53
 33668       6   4,135      24,810       919.9      58.9      00:11:45
 33946       6   4,135      24,810       927.8      59.4      00:11:38
 34198       6   4,135      24,810       935.3      59.9      00:11:31
 34527       7   4,135      28,945       944.7      60.5      00:11:20
 34866       7   4,135      28,945       954.5      61.1      00:11:09
 35202       8   4,135      33,080       964.2      61.8      00:10:57
 35512       9   4,135      37,215       973.1      62.3      00:10:48
 35828       6   4,135      24,810       981.9      62.9      00:10:38
 36159       8   4,135      33,080       991.5      63.5      00:10:27
 36476       8   4,135      33,080     1,000.6      64.1      00:10:17
 36744       3   4,135      12,405     1,007.9      64.6      00:10:10
 37003       9   4,135      37,215     1,015.0      65.0      00:10:04
 37270       5   4,135      20,675     1,022.0      65.5      00:09:57
 37523       4   4,135      16,540     1,028.7      65.9      00:09:51
 37777       4   4,135      16,540     1,035.5      66.3      00:09:45
 38029       9   4,135      37,215     1,042.4      66.8      00:09:38
 38276       7   4,135      28,945     1,049.4      67.2      00:09:32
 38511       6   4,135      24,810     1,056.3      67.7      00:09:25
 38847       7   4,135      28,945     1,065.6      68.2      00:09:14
 39138       6   4,135      24,810     1,073.7      68.8      00:09:06
 39437       8   4,135      33,080     1,081.7      69.3      00:08:57
 39764       8   4,135      33,080     1,090.6      69.8      00:08:47
 40159       7   4,135      28,945     1,101.4      70.5      00:08:34
 40603       5   4,135      20,675     1,113.8      71.3      00:08:19
 41011      10   4,135      41,350     1,125.5      72.1      00:08:05
 41339       6   4,135      24,810     1,134.6      72.7      00:07:55
 41719       9   4,135      37,215     1,145.2      73.3      00:07:42
 42053       1   4,135       4,135     1,154.5      73.9      00:07:32
 42420       8   4,135      33,080     1,164.2      74.6      00:07:21
 42753       7   4,135      28,945     1,173.3      75.1      00:07:11
 43095       4   4,135      16,540     1,183.0      75.8      00:06:60
 43425      10   4,135      41,350     1,192.5      76.4      00:06:49
 43758       3   4,135      12,405     1,201.4      76.9      00:06:39
 44075      10   4,135      41,350     1,210.1      77.5      00:06:29
 44388       7   4,135      28,945     1,218.6      78.0      00:06:20
 44755       5   4,135      20,675     1,228.6      78.7      00:06:09
 45115      10   4,135      41,350     1,238.6      79.3      00:05:58
 45494      10   4,135      41,350     1,248.4      80.0      00:05:46
 45837       7   4,135      28,945     1,257.4      80.5      00:05:37
 46164       7   4,135      28,945     1,266.5      81.1      00:05:26
 46504       8   4,135      33,080     1,275.9      81.7      00:05:16
 46869       9   4,135      37,215     1,286.3      82.4      00:05:04
 47176       5   4,135      20,675     1,294.0      82.9      00:04:56
 47518       2   4,135       8,270     1,303.0      83.5      00:04:46
 47820       8   4,135      33,080     1,311.2      84.0      00:04:37
 48117       3   4,135      12,405     1,319.4      84.5      00:04:28
 48441       6   4,135      24,810     1,328.4      85.1      00:04:18
 48789       5   4,135      20,675     1,338.0      85.7      00:04:07
 49150      10   4,135      41,350     1,347.9      86.3      00:03:56
 49478       7   4,135      28,945     1,356.7      86.9      00:03:47
 49796       8   4,135      33,080     1,364.8      87.4      00:03:38
 50129       8   4,135      33,080     1,373.8      88.0      00:03:28
 50507       5   4,135      20,675     1,383.7      88.6      00:03:17
 50851       4   4,135      16,540     1,393.3      89.2      00:03:06
 51196       7   4,135      28,945     1,403.0      89.9      00:02:55
 51561       9   4,135      37,215     1,413.2      90.5      00:02:44
 51936       5   4,135      20,675     1,424.0      91.2      00:02:32
 52306       8   4,135      33,080     1,434.9      91.9      00:02:19
 52669       7   4,135      28,945     1,445.9      92.6      00:02:07
 52989       8   4,135      33,080     1,455.3      93.2      00:01:57
 53392       5   4,135      20,675     1,466.9      94.0      00:01:44
 53845       6   4,135      24,810     1,479.8      94.8      00:01:29
 54154       7   4,135      28,945     1,488.3      95.3      00:01:20
 54399      10   4,135      41,350     1,495.1      95.8      00:01:13
 54645       8   4,135      33,080     1,501.3      96.2      00:01:06
 54892       7   4,135      28,945     1,508.0      96.6      00:00:59
 55161       4   4,135      16,540     1,515.4      97.1      00:00:51
 55419      10   4,135      41,350     1,522.0      97.5      00:00:43
 55653       8   4,135      33,080     1,528.1      97.9      00:00:37
 55859       9   4,135      37,215     1,533.9      98.2      00:00:30
 56112       7   4,135      28,945     1,541.1      98.7      00:00:23
 56371       9   4,135      37,215     1,548.5      99.2      00:00:14
 56648       8   4,135      33,080     1,556.5      99.7      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1745.488
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
