
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A100_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   222       7   4,135      28,945         5.3       0.3      00:49:29
   436       9   4,135      37,215        10.4       0.7      00:50:08
   670      10   4,135      41,350        16.3       1.0      00:47:44
   899       2   4,135       8,270        21.9       1.4      00:46:56
  1125       7   4,135      28,945        28.0       1.8      00:45:42
  1344      10   4,135      41,350        34.0       2.2      00:45:02
  1555      10   4,135      41,350        39.8       2.5      00:44:50
  1773       9   4,135      37,215        45.6       2.9      00:44:28
  1991       9   4,135      37,215        51.3       3.3      00:44:21
  2217       9   4,135      37,215        57.3       3.7      00:43:51
  2435       3   4,135      12,405        62.9       4.0      00:43:47
  2654       7   4,135      28,945        68.8       4.4      00:43:32
  2874       4   4,135      16,540        74.8       4.8      00:43:12
  3109       6   4,135      24,810        80.9       5.2      00:42:47
  3320       5   4,135      20,675        86.9       5.6      00:42:31
  3517       8   4,135      33,080        92.4       5.9      00:42:30
  3744      10   4,135      41,350        98.6       6.3      00:42:09
  3905      10   4,135      41,350       102.8       6.6      00:42:40
  4057       6   4,135      24,810       106.6       6.8      00:43:18
  4230       6   4,135      24,810       111.1       7.1      00:43:38
  4366       7   4,135      28,945       114.4       7.3      00:44:23
  4520       8   4,135      33,080       118.5       7.6      00:44:45
  4684       6   4,135      24,810       123.2       7.9      00:44:52
  4869       7   4,135      28,945       128.1       8.2      00:44:51
  5053       6   4,135      24,810       133.1       8.5      00:44:49
  5219       4   4,135      16,540       137.5       8.8      00:44:59
  5349      10   4,135      41,350       141.1       9.0      00:45:25
  5490       7   4,135      28,945       144.5       9.3      00:45:53
  5611      10   4,135      41,350       147.5       9.5      00:46:27
  5766       5   4,135      20,675       151.6       9.7      00:46:38
  5937       2   4,135       8,270       156.1      10.0      00:46:38
  6098       7   4,135      28,945       160.5      10.3      00:46:41
  6243       9   4,135      37,215       164.3      10.5      00:46:53
  6357       5   4,135      20,675       167.1      10.7      00:47:24
  6506       5   4,135      20,675       171.1      11.0      00:47:31
  6629       8   4,135      33,080       174.2      11.2      00:47:54
  6782      10   4,135      41,350       178.3      11.4      00:47:59
  6931       8   4,135      33,080       182.3      11.7      00:48:03
  7064       9   4,135      37,215       185.7      11.9      00:48:17
  7252      10   4,135      41,350       190.5      12.2      00:48:07
  7419       8   4,135      33,080       195.1      12.5      00:47:58
  7599       4   4,135      16,540       200.0      12.8      00:47:46
  7772       8   4,135      33,080       204.7      13.1      00:47:38
  7945       8   4,135      33,080       209.7      13.4      00:47:24
  8098       7   4,135      28,945       214.0      13.7      00:47:20
  8284      10   4,135      41,350       219.3      14.1      00:47:03
  8465       5   4,135      20,675       224.5      14.4      00:46:46
  8624       5   4,135      20,675       228.9      14.7      00:46:41
  8772       6   4,135      24,810       233.0      14.9      00:46:41
  8906       6   4,135      24,810       236.9      15.2      00:46:43
  9092       9   4,135      37,215       242.1      15.5      00:46:26
  9225       6   4,135      24,810       245.9      15.8      00:46:29
  9342       3   4,135      12,405       249.1      16.0      00:46:39
  9451       8   4,135      33,080       252.2      16.2      00:46:50
  9609       7   4,135      28,945       256.9      16.5      00:46:40
  9751       8   4,135      33,080       261.0      16.7      00:46:37
  9904       9   4,135      37,215       265.1      17.0      00:46:34
 10027       8   4,135      33,080       268.3      17.2      00:46:42
 10152      10   4,135      41,350       271.4      17.4      00:46:52
 10291       8   4,135      33,080       274.9      17.6      00:46:56
 10402       8   4,135      33,080       277.9      17.8      00:47:05
 10562       9   4,135      37,215       282.1      18.1      00:46:58
 10745       9   4,135      37,215       287.0      18.4      00:46:45
 10914       7   4,135      28,945       291.6      18.7      00:46:34
 11097       7   4,135      28,945       296.4      19.0      00:46:21
 11237       9   4,135      37,215       300.1      19.2      00:46:20
 11352       9   4,135      37,215       303.3      19.4      00:46:26
 11474       4   4,135      16,540       306.6      19.7      00:46:30
 11618       5   4,135      20,675       310.4      19.9      00:46:28
 11747      10   4,135      41,350       313.8      20.1      00:46:30
 11866       6   4,135      24,810       317.2      20.3      00:46:32
 12014       9   4,135      37,215       321.2      20.6      00:46:28
 12145      10   4,135      41,350       324.9      20.8      00:46:26
 12268       6   4,135      24,810       328.1      21.0      00:46:29
 12484       8   4,135      33,080       333.9      21.4      00:46:05
 12716       5   4,135      20,675       340.2      21.8      00:45:36
 12957       6   4,135      24,810       346.3      22.2      00:45:09
 13186       9   4,135      37,215       352.6      22.6      00:44:41
 13397       9   4,135      37,215       358.4      23.0      00:44:19
 13566       3   4,135      12,405       363.3      23.3      00:44:05
 13718       9   4,135      37,215       367.6      23.6      00:43:57
 13848       7   4,135      28,945       371.0      23.8      00:43:57
 14013       2   4,135       8,270       375.4      24.1      00:43:49
 14184       9   4,135      37,215       380.2      24.4      00:43:37
 14310       9   4,135      37,215       383.7      24.6      00:43:35
 14463       9   4,135      37,215       388.0      24.9      00:43:27
 14600       8   4,135      33,080       391.8      25.1      00:43:24
 14758       5   4,135      20,675       396.1      25.4      00:43:16
 14916       8   4,135      33,080       400.4      25.7      00:43:07
 15131       4   4,135      16,540       406.5      26.1      00:42:43
 15363      10   4,135      41,350       413.1      26.5      00:42:16
 15573       8   4,135      33,080       418.7      26.8      00:41:57
 15769       6   4,135      24,810       424.2      27.2      00:41:40
 15954       6   4,135      24,810       429.5      27.5      00:41:24
 16179       8   4,135      33,080       436.0      27.9      00:40:58
 16387       7   4,135      28,945       441.9      28.3      00:40:38
 16524       3   4,135      12,405       445.8      28.6      00:40:33
 16689       9   4,135      37,215       450.2      28.9      00:40:24
 16863       6   4,135      24,810       455.0      29.2      00:40:13
 17025      10   4,135      41,350       459.6      29.5      00:40:03
 17181       4   4,135      16,540       463.7      29.7      00:39:57
 17297       9   4,135      37,215       467.0      29.9      00:39:56
 17401       6   4,135      24,810       470.0      30.1      00:39:58
 17507       9   4,135      37,215       473.3      30.3      00:39:57
 17626       8   4,135      33,080       476.6      30.5      00:39:56
 17751      10   4,135      41,350       479.8      30.8      00:39:55
 17908      10   4,135      41,350       484.2      31.0      00:39:47
 18090       7   4,135      28,945       489.3      31.4      00:39:32
 18315       7   4,135      28,945       495.6      31.8      00:39:10
 18523       8   4,135      33,080       501.0      32.1      00:38:54
 18673       9   4,135      37,215       505.4      32.4      00:38:45
 18825       8   4,135      33,080       509.6      32.7      00:38:38
 18961       7   4,135      28,945       513.6      32.9      00:38:31
 19105       3   4,135      12,405       517.7      33.2      00:38:24
 19227       7   4,135      28,945       521.2      33.4      00:38:21
 19423       7   4,135      28,945       526.7      33.8      00:38:04
 19609       4   4,135      16,540       532.1      34.1      00:37:49
 19796       6   4,135      24,810       537.6      34.5      00:37:33
 19981       6   4,135      24,810       542.9      34.8      00:37:18
 20169      10   4,135      41,350       548.4      35.1      00:37:02
 20393       8   4,135      33,080       554.6      35.5      00:36:42
 20523       7   4,135      28,945       558.2      35.8      00:36:38
 20606       7   4,135      28,945       560.6      35.9      00:36:41
 20722       7   4,135      28,945       563.8      36.1      00:36:39
 20836       4   4,135      16,540       567.1      36.3      00:36:37
 20962      10   4,135      41,350       570.6      36.6      00:36:33
 21132       3   4,135      12,405       575.1      36.9      00:36:23
 21253       9   4,135      37,215       578.1      37.1      00:36:23
 21394       8   4,135      33,080       581.7      37.3      00:36:18
 21520       8   4,135      33,080       585.2      37.5      00:36:14
 21655       7   4,135      28,945       588.6      37.7      00:36:10
 21815       6   4,135      24,810       592.6      38.0      00:36:03
 21953       9   4,135      37,215       596.3      38.2      00:35:58
 22091       7   4,135      28,945       599.7      38.4      00:35:54
 22223       8   4,135      33,080       603.2      38.7      00:35:50
 22371       6   4,135      24,810       606.9      38.9      00:35:44
 22509       7   4,135      28,945       610.6      39.1      00:35:38
 22653       5   4,135      20,675       614.5      39.4      00:35:32
 22832       4   4,135      16,540       618.7      39.7      00:35:23
 23023       9   4,135      37,215       623.9      40.0      00:35:08
 23216       5   4,135      20,675       629.3      40.3      00:34:53
 23426       8   4,135      33,080       634.9      40.7      00:34:37
 23629       6   4,135      24,810       640.0      41.0      00:34:24
 23778       6   4,135      24,810       644.2      41.3      00:34:15
 23974      10   4,135      41,350       649.5      41.6      00:34:01
 24189       9   4,135      37,215       655.1      42.0      00:33:45
 24402       5   4,135      20,675       660.5      42.3      00:33:29
 24610       2   4,135       8,270       666.4      42.7      00:33:12
 24825       8   4,135      33,080       672.2      43.1      00:32:55
 25031       7   4,135      28,945       677.8      43.4      00:32:40
 25238       7   4,135      28,945       683.6      43.8      00:32:23
 25463      10   4,135      41,350       689.8      44.2      00:32:05
 25632       7   4,135      28,945       694.1      44.5      00:31:56
 25741       7   4,135      28,945       697.4      44.7      00:31:52
 25874       7   4,135      28,945       701.1      44.9      00:31:46
 25974       8   4,135      33,080       703.8      45.1      00:31:45
 26081       9   4,135      37,215       706.8      45.3      00:31:43
 26232       9   4,135      37,215       711.0      45.6      00:31:34
 26418       7   4,135      28,945       715.8      45.9      00:31:22
 26617       1   4,135       4,135       721.1      46.2      00:31:09
 26799       7   4,135      28,945       726.0      46.5      00:30:57
 26977       3   4,135      12,405       731.0      46.9      00:30:44
 27099       9   4,135      37,215       734.2      47.1      00:30:40
 27235       6   4,135      24,810       737.9      47.3      00:30:34
 27366       5   4,135      20,675       741.5      47.5      00:30:28
 27498       9   4,135      37,215       745.2      47.8      00:30:22
 27674       7   4,135      28,945       750.0      48.1      00:30:10
 27866       7   4,135      28,945       755.5      48.4      00:29:56
 28057       9   4,135      37,215       760.7      48.8      00:29:43
 28243       7   4,135      28,945       765.9      49.1      00:29:29
 28397       9   4,135      37,215       770.3      49.4      00:29:20
 28581       6   4,135      24,810       775.8      49.7      00:29:05
 28719       6   4,135      24,810       779.6      50.0      00:28:58
 28827       1   4,135       4,135       782.7      50.2      00:28:55
 28955       6   4,135      24,810       786.3      50.4      00:28:49
 29084       6   4,135      24,810       789.9      50.6      00:28:42
 29271       9   4,135      37,215       794.9      50.9      00:28:30
 29436       8   4,135      33,080       799.7      51.3      00:28:19
 29588       7   4,135      28,945       803.7      51.5      00:28:11
 29731       6   4,135      24,810       807.8      51.8      00:28:03
 29850       9   4,135      37,215       811.1      52.0      00:27:58
 29979      10   4,135      41,350       814.6      52.2      00:27:52
 30106       7   4,135      28,945       818.2      52.4      00:27:46
 30243      10   4,135      41,350       822.0      52.7      00:27:38
 30410       9   4,135      37,215       826.8      53.0      00:27:27
 30568       6   4,135      24,810       831.3      53.3      00:27:17
 30796       7   4,135      28,945       837.8      53.7      00:26:58
 30993       7   4,135      28,945       843.2      54.0      00:26:45
 31225       9   4,135      37,215       849.8      54.5      00:26:26
 31439      10   4,135      41,350       856.0      54.9      00:26:09
 31681       8   4,135      33,080       862.8      55.3      00:25:50
 31869       7   4,135      28,945       868.3      55.7      00:25:35
 32068       8   4,135      33,080       874.1      56.0      00:25:20
 32280       8   4,135      33,080       880.3      56.4      00:25:04
 32474       3   4,135      12,405       886.1      56.8      00:24:49
 32604       7   4,135      28,945       889.7      57.0      00:24:43
 32742       8   4,135      33,080       893.6      57.3      00:24:35
 32856       8   4,135      33,080       896.8      57.5      00:24:30
 32968       5   4,135      20,675       900.1      57.7      00:24:25
 33078       6   4,135      24,810       903.3      57.9      00:24:20
 33247       7   4,135      28,945       908.1      58.2      00:24:09
 33413       5   4,135      20,675       912.8      58.5      00:23:58
 33573       7   4,135      28,945       917.5      58.8      00:23:47
 33699       5   4,135      20,675       921.1      59.0      00:23:41
 33860       7   4,135      28,945       925.8      59.3      00:23:30
 34002       4   4,135      16,540       929.8      59.6      00:23:22
 34140       8   4,135      33,080       934.0      59.9      00:23:13
 34281       9   4,135      37,215       938.1      60.1      00:23:04
 34406       6   4,135      24,810       941.6      60.4      00:22:58
 34621       7   4,135      28,945       947.7      60.7      00:22:42
 34812       5   4,135      20,675       953.4      61.1      00:22:28
 35030       6   4,135      24,810       959.5      61.5      00:22:12
 35231       5   4,135      20,675       965.4      61.9      00:21:57
 35422       4   4,135      16,540       970.9      62.2      00:21:44
 35627       8   4,135      33,080       976.7      62.6      00:21:29
 35848       9   4,135      37,215       982.9      63.0      00:21:13
 36082       8   4,135      33,080       989.6      63.4      00:20:56
 36314       4   4,135      16,540       996.3      63.9      00:20:38
 36542      10   4,135      41,350     1,002.7      64.3      00:20:22
 36712      10   4,135      41,350     1,007.4      64.6      00:20:12
 36868       9   4,135      37,215     1,011.7      64.8      00:20:03
 37035       5   4,135      20,675     1,016.2      65.1      00:19:53
 37200       9   4,135      37,215     1,020.4      65.4      00:19:44
 37369      10   4,135      41,350     1,024.9      65.7      00:19:34
 37531      10   4,135      41,350     1,029.3      66.0      00:19:25
 37709       7   4,135      28,945     1,033.9      66.3      00:19:15
 37887       5   4,135      20,675     1,038.9      66.6      00:19:03
 38040       9   4,135      37,215     1,043.2      66.9      00:18:54
 38225       7   4,135      28,945     1,048.4      67.2      00:18:42
 38409       8   4,135      33,080     1,053.8      67.5      00:18:30
 38630       7   4,135      28,945     1,059.9      67.9      00:18:14
 38879       9   4,135      37,215     1,066.9      68.4      00:17:57
 39035       6   4,135      24,810     1,071.2      68.7      00:17:48
 39163      10   4,135      41,350     1,074.6      68.9      00:17:41
 39277       7   4,135      28,945     1,077.7      69.1      00:17:36
 39446       6   4,135      24,810     1,082.2      69.4      00:17:26
 39595       6   4,135      24,810     1,086.4      69.6      00:17:17
 39777       6   4,135      24,810     1,091.2      69.9      00:17:07
 39963      10   4,135      41,350     1,096.5      70.3      00:16:55
 40132       9   4,135      37,215     1,101.0      70.6      00:16:45
 40316       5   4,135      20,675     1,106.0      70.9      00:16:33
 40516       5   4,135      20,675     1,111.8      71.3      00:16:20
 40739      10   4,135      41,350     1,118.0      71.7      00:16:05
 40920       8   4,135      33,080     1,123.2      72.0      00:15:53
 41030      10   4,135      41,350     1,126.4      72.2      00:15:47
 41137       9   4,135      37,215     1,129.3      72.4      00:15:42
 41252       4   4,135      16,540     1,132.5      72.6      00:15:36
 41379       5   4,135      20,675     1,135.9      72.8      00:15:30
 41507       8   4,135      33,080     1,139.6      73.0      00:15:23
 41661       5   4,135      20,675     1,143.9      73.3      00:15:13
 41798       9   4,135      37,215     1,147.8      73.6      00:15:05
 41940       9   4,135      37,215     1,151.9      73.8      00:14:57
 42061       5   4,135      20,675     1,154.9      74.0      00:14:51
 42185       6   4,135      24,810     1,158.1      74.2      00:14:45
 42312       6   4,135      24,810     1,161.4      74.4      00:14:39
 42425       7   4,135      28,945     1,164.8      74.7      00:14:32
 42555       9   4,135      37,215     1,168.3      74.9      00:14:26
 42670       9   4,135      37,215     1,171.4      75.1      00:14:20
 42817       6   4,135      24,810     1,175.5      75.3      00:14:11
 42961       8   4,135      33,080     1,179.5      75.6      00:14:03
 43088       4   4,135      16,540     1,183.2      75.8      00:13:55
 43216       9   4,135      37,215     1,186.9      76.1      00:13:47
 43333      10   4,135      41,350     1,190.2      76.3      00:13:41
 43447       6   4,135      24,810     1,193.5      76.5      00:13:34
 43635       7   4,135      28,945     1,198.4      76.8      00:13:23
 43794       9   4,135      37,215     1,202.7      77.1      00:13:14
 43964       5   4,135      20,675     1,207.5      77.4      00:13:03
 44120       7   4,135      28,945     1,211.6      77.7      00:12:54
 44221       5   4,135      20,675     1,214.5      77.8      00:12:49
 44335       9   4,135      37,215     1,217.5      78.0      00:12:43
 44469       9   4,135      37,215     1,221.2      78.3      00:12:35
 44624       4   4,135      16,540     1,225.4      78.5      00:12:26
 44763       4   4,135      16,540     1,229.2      78.8      00:12:18
 44913       8   4,135      33,080     1,233.4      79.1      00:12:09
 45051       4   4,135      16,540     1,237.1      79.3      00:12:01
 45233       6   4,135      24,810     1,242.0      79.6      00:11:50
 45385       6   4,135      24,810     1,245.7      79.8      00:11:42
 45505       6   4,135      24,810     1,248.9      80.0      00:11:36
 45675       8   4,135      33,080     1,253.3      80.3      00:11:26
 45844       9   4,135      37,215     1,257.8      80.6      00:11:16
 45956       6   4,135      24,810     1,260.9      80.8      00:11:10
 46111      10   4,135      41,350     1,265.3      81.1      00:10:60
 46206       6   4,135      24,810     1,268.0      81.3      00:10:55
 46368       7   4,135      28,945     1,272.5      81.6      00:10:45
 46523      10   4,135      41,350     1,276.8      81.8      00:10:35
 46716       9   4,135      37,215     1,282.2      82.2      00:10:22
 46898       8   4,135      33,080     1,287.3      82.5      00:10:11
 47013       7   4,135      28,945     1,290.1      82.7      00:10:05
 47122       8   4,135      33,080     1,292.9      82.9      00:09:60
 47268      10   4,135      41,350     1,296.6      83.1      00:09:52
 47398       3   4,135      12,405     1,300.1      83.3      00:09:44
 47539       9   4,135      37,215     1,303.8      83.6      00:09:37
 47678       6   4,135      24,810     1,307.7      83.8      00:09:28
 47805       6   4,135      24,810     1,311.0      84.0      00:09:21
 47928       9   4,135      37,215     1,314.6      84.3      00:09:13
 48046      10   4,135      41,350     1,317.8      84.5      00:09:07
 48191       8   4,135      33,080     1,321.6      84.7      00:08:58
 48354       7   4,135      28,945     1,326.3      85.0      00:08:48
 48535       8   4,135      33,080     1,331.3      85.3      00:08:36
 48688       6   4,135      24,810     1,335.5      85.6      00:08:27
 48822       7   4,135      28,945     1,339.1      85.8      00:08:19
 48924       5   4,135      20,675     1,341.9      86.0      00:08:13
 49039       6   4,135      24,810     1,345.0      86.2      00:08:07
 49151       6   4,135      24,810     1,348.4      86.4      00:07:60
 49287       5   4,135      20,675     1,352.0      86.7      00:07:52
 49429       9   4,135      37,215     1,355.7      86.9      00:07:44
 49567       3   4,135      12,405     1,359.2      87.1      00:07:36
 49720       7   4,135      28,945     1,363.0      87.4      00:07:27
 49865       5   4,135      20,675     1,366.8      87.6      00:07:19
 49991       9   4,135      37,215     1,370.3      87.8      00:07:11
 50124       7   4,135      28,945     1,374.0      88.1      00:07:03
 50253       8   4,135      33,080     1,377.3      88.3      00:06:56
 50406       8   4,135      33,080     1,381.2      88.5      00:06:47
 50511       8   4,135      33,080     1,384.2      88.7      00:06:41
 50641       7   4,135      28,945     1,387.7      88.9      00:06:33
 50790       8   4,135      33,080     1,392.0      89.2      00:06:23
 50897       5   4,135      20,675     1,395.1      89.4      00:06:17
 51006       3   4,135      12,405     1,398.3      89.6      00:06:10
 51178       8   4,135      33,080     1,402.9      89.9      00:05:59
 51386       9   4,135      37,215     1,408.8      90.3      00:05:45
 51594      10   4,135      41,350     1,414.7      90.7      00:05:32
 51820       7   4,135      28,945     1,421.2      91.1      00:05:16
 51983       9   4,135      37,215     1,425.8      91.4      00:05:06
 52170       7   4,135      28,945     1,431.5      91.8      00:04:52
 52322       8   4,135      33,080     1,435.9      92.0      00:04:43
 52518       5   4,135      20,675     1,441.8      92.4      00:04:29
 52722       2   4,135       8,270     1,448.0      92.8      00:04:14
 52931       7   4,135      28,945     1,454.1      93.2      00:04:00
 53157       9   4,135      37,215     1,460.7      93.6      00:03:45
 53345      10   4,135      41,350     1,466.0      94.0      00:03:33
 53539      10   4,135      41,350     1,471.7      94.3      00:03:20
 53711       7   4,135      28,945     1,476.5      94.6      00:03:09
 53824       6   4,135      24,810     1,479.6      94.8      00:03:02
 53972      10   4,135      41,350     1,483.6      95.1      00:02:53
 54113       8   4,135      33,080     1,487.6      95.3      00:02:44
 54216       7   4,135      28,945     1,490.4      95.5      00:02:38
 54373       3   4,135      12,405     1,494.6      95.8      00:02:29
 54525       6   4,135      24,810     1,498.3      96.0      00:02:20
 54646       4   4,135      16,540     1,501.7      96.2      00:02:13
 54812       6   4,135      24,810     1,506.1      96.5      00:02:03
 54962       9   4,135      37,215     1,510.3      96.8      00:01:53
 55104       8   4,135      33,080     1,514.2      97.0      00:01:44
 55242       5   4,135      20,675     1,517.8      97.3      00:01:36
 55373      10   4,135      41,350     1,521.1      97.5      00:01:29
 55525       3   4,135      12,405     1,525.0      97.7      00:01:20
 55662       7   4,135      28,945     1,528.9      98.0      00:01:11
 55793      10   4,135      41,350     1,532.5      98.2      00:01:03
 55903      10   4,135      41,350     1,535.7      98.4      00:00:56
 56018       6   4,135      24,810     1,538.8      98.6      00:00:49
 56139       8   4,135      33,080     1,542.2      98.8      00:00:41
 56272      10   4,135      41,350     1,546.0      99.1      00:00:32
 56397       8   4,135      33,080     1,549.7      99.3      00:00:24
 56547       6   4,135      24,810     1,554.0      99.6      00:00:14
 56680       8   4,135      33,080     1,557.8      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,560.2        Number of regions         = 56,767    
Computed distances (M)  = 1,560.23       Total run time (seconds)  = 3578.944
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
