
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data//Intermediate/blk_coords.dta /export/storage_co
> vidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccinated/ca_Dollar_locations_
> total.dta /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vac
> cinated/ca_blk_Dollar_dist_total.csv 2000 30 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  26 Sep 2023, 23:42:08

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vacci
> nated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 30

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   412       7   4,035      28,245         9.5       0.6      00:26:32
   968       5   4,035      20,175        23.1       1.5      00:21:43
  1467       9   4,035      36,315        36.4       2.4      00:20:28
  1987       7   4,035      28,245        49.8       3.3      00:19:45
  2468       4   4,035      16,140        62.1       4.1      00:19:38
  2995       5   4,035      20,175        75.7       5.0      00:19:09
  3502       7   4,035      28,245        89.6       5.9      00:18:41
  3988       2   4,035       8,070       102.1       6.7      00:18:35
  4369       3   4,035      12,105       111.6       7.3      00:18:60
  4694       7   4,035      28,245       120.3       7.9      00:19:27
  5064       8   4,035      32,280       130.0       8.5      00:19:40
  5465       7   4,035      28,245       140.5       9.2      00:19:43
  5937      10   4,035      40,350       152.1      10.0      00:19:33
  6488       6   4,035      24,210       166.4      10.9      00:19:03
  7047      10   4,035      40,350       180.5      11.8      00:18:37
  7588       4   4,035      16,140       194.7      12.8      00:18:13
  8113       6   4,035      24,210       209.1      13.7      00:17:50
  8562       8   4,035      32,280       221.6      14.5      00:17:39
  9084      10   4,035      40,350       235.8      15.5      00:17:18
  9553       7   4,035      28,245       248.9      16.3      00:17:06
 10005       9   4,035      36,315       261.1      17.1      00:16:57
 10391       7   4,035      28,245       270.7      17.8      00:16:59
 10795       6   4,035      24,210       281.2      18.5      00:16:58
 11182       6   4,035      24,210       291.3      19.1      00:16:56
 11556       5   4,035      20,175       301.1      19.8      00:16:56
 11900       7   4,035      28,245       310.2      20.4      00:16:58
 12223       6   4,035      24,210       318.9      20.9      00:17:01
 12625       7   4,035      28,245       329.4      21.6      00:16:56
 13055       7   4,035      28,245       340.4      22.3      00:16:49
 13466      10   4,035      40,350       351.5      23.1      00:16:41
 13817       6   4,035      24,210       361.0      23.7      00:16:39
 14207       9   4,035      36,315       371.4      24.4      00:16:34
 14528       8   4,035      32,280       380.2      25.0      00:16:34
 14945       6   4,035      24,210       391.3      25.7      00:16:25
 15382       7   4,035      28,245       403.4      26.5      00:16:13
 15840      10   4,035      40,350       415.7      27.3      00:16:01
 16285       6   4,035      24,210       428.2      28.1      00:15:48
 16667       8   4,035      32,280       438.5      28.8      00:15:42
 16933       9   4,035      36,315       445.7      29.3      00:15:45
 17381       7   4,035      28,245       457.9      30.1      00:15:32
 17816      10   4,035      40,350       469.8      30.8      00:15:21
 18220       8   4,035      32,280       480.9      31.6      00:15:12
 18681       9   4,035      36,315       493.1      32.4      00:14:60
 19198       6   4,035      24,210       507.6      33.3      00:14:42
 19636      10   4,035      40,350       519.7      34.1      00:14:30
 20157       8   4,035      32,280       534.5      35.1      00:14:12
 20691      10   4,035      40,350       549.2      36.0      00:13:55
 21201       7   4,035      28,245       562.7      36.9      00:13:41
 21636       6   4,035      24,210       573.6      37.6      00:13:33
 22063       4   4,035      16,140       584.4      38.4      00:13:24
 22438      10   4,035      40,350       593.7      39.0      00:13:20
 22861       4   4,035      16,140       604.3      39.7      00:13:12
 23267      10   4,035      40,350       615.3      40.4      00:13:03
 23691       6   4,035      24,210       626.0      41.1      00:12:55
 24097      10   4,035      40,350       636.9      41.8      00:12:47
 24589      10   4,035      40,350       649.5      42.6      00:12:35
 25028      10   4,035      40,350       661.1      43.4      00:12:24
 25494       8   4,035      32,280       673.7      44.2      00:12:13
 25862       8   4,035      32,280       683.6      44.9      00:12:06
 26243       7   4,035      28,245       693.8      45.5      00:11:59
 26633       6   4,035      24,210       703.8      46.2      00:11:52
 27022       6   4,035      24,210       714.2      46.9      00:11:43
 27526       7   4,035      28,245       727.5      47.8      00:11:30
 28084       6   4,035      24,210       742.7      48.7      00:11:14
 28630       6   4,035      24,210       758.0      49.7      00:10:57
 29175       7   4,035      28,245       772.9      50.7      00:10:42
 29738       7   4,035      28,245       788.1      51.7      00:10:26
 30076       5   4,035      20,175       797.3      52.3      00:10:20
 30436       9   4,035      36,315       807.1      53.0      00:10:13
 30857       6   4,035      24,210       818.9      53.7      00:10:03
 31318       6   4,035      24,210       831.4      54.6      00:09:52
 31764       4   4,035      16,140       843.9      55.4      00:09:41
 32197       9   4,035      36,315       856.3      56.2      00:09:30
 32573       5   4,035      20,175       866.9      56.9      00:09:21
 33076       7   4,035      28,245       881.0      57.8      00:09:08
 33609       8   4,035      32,280       895.9      58.8      00:08:53
 34147       8   4,035      32,280       911.1      59.8      00:08:38
 34666       8   4,035      32,280       925.7      60.8      00:08:24
 35200      10   4,035      40,350       940.8      61.8      00:08:10
 35709       3   4,035      12,105       954.9      62.7      00:07:57
 36239       5   4,035      20,175       969.7      63.6      00:07:43
 36737       8   4,035      32,280       983.4      64.5      00:07:31
 37183       7   4,035      28,245       995.1      65.3      00:07:21
 37586       8   4,035      32,280     1,005.5      66.0      00:07:13
 37988       3   4,035      12,105     1,016.1      66.7      00:07:05
 38332       6   4,035      24,210     1,025.6      67.3      00:06:58
 38684       9   4,035      36,315     1,035.4      68.0      00:06:51
 39064       8   4,035      32,280     1,045.8      68.6      00:06:42
 39472       7   4,035      28,245     1,056.4      69.3      00:06:34
 39914       7   4,035      28,245     1,068.2      70.1      00:06:24
 40374      10   4,035      40,350     1,080.5      70.9      00:06:14
 40731       8   4,035      32,280     1,090.4      71.6      00:06:06
 41231       7   4,035      28,245     1,104.2      72.5      00:05:54
 41794       8   4,035      32,280     1,119.6      73.5      00:05:40
 42208       6   4,035      24,210     1,130.5      74.2      00:05:31
 42551       1   4,035       4,035     1,139.6      74.8      00:05:24
 42904       5   4,035      20,175     1,149.1      75.4      00:05:17
 43219      10   4,035      40,350     1,157.9      76.0      00:05:10
 43574       8   4,035      32,280     1,167.5      76.6      00:05:02
 43885       5   4,035      20,175     1,175.8      77.2      00:04:56
 44239       8   4,035      32,280     1,185.3      77.8      00:04:49
 44754       9   4,035      36,315     1,198.9      78.7      00:04:37
 45242       9   4,035      36,315     1,211.9      79.5      00:04:25
 45607       2   4,035       8,070     1,221.1      80.1      00:04:18
 45993      10   4,035      40,350     1,231.1      80.8      00:04:10
 46362       2   4,035       8,070     1,241.3      81.5      00:04:01
 46796       5   4,035      20,175     1,253.0      82.2      00:03:51
 47323       7   4,035      28,245     1,266.5      83.1      00:03:40
 47727       5   4,035      20,175     1,277.1      83.8      00:03:31
 48181       6   4,035      24,210     1,289.2      84.6      00:03:20
 48645       9   4,035      36,315     1,301.8      85.4      00:03:09
 49101       8   4,035      32,280     1,313.9      86.2      00:02:59
 49597       6   4,035      24,210     1,326.8      87.1      00:02:48
 50166       6   4,035      24,210     1,341.5      88.1      00:02:35
 50548       8   4,035      32,280     1,351.4      88.7      00:02:27
 50940       7   4,035      28,245     1,362.1      89.4      00:02:18
 51343      10   4,035      40,350     1,373.1      90.1      00:02:08
 51737       5   4,035      20,175     1,384.1      90.8      00:01:59
 52156       6   4,035      24,210     1,395.9      91.6      00:01:49
 52580       7   4,035      28,245     1,408.3      92.4      00:01:38
 52977       7   4,035      28,245     1,419.8      93.2      00:01:29
 53350       7   4,035      28,245     1,430.3      93.9      00:01:20
 53817       5   4,035      20,175     1,443.3      94.7      00:01:09
 54181       5   4,035      20,175     1,453.1      95.4      00:01:00
 54599       9   4,035      36,315     1,463.7      96.1      00:00:51
 55004      10   4,035      40,350     1,474.6      96.8      00:00:42
 55451       8   4,035      32,280     1,486.0      97.5      00:00:32
 55854       5   4,035      20,175     1,496.7      98.2      00:00:23
 56246       7   4,035      28,245     1,507.6      98.9      00:00:14
 56573       9   4,035      36,315     1,516.8      99.6      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1311.375
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  11,327,730

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxFixV/M5_K10000/Dollar/vaccinated
> /ca_blk_Dollar_dist_total.csv saved

. 
. cap log close

. 
end of do-file
