
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A700.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A700.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A700.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A700.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   465       5   4,735      23,675        12.6       0.7      00:23:36
   935       8   4,735      37,880        26.0       1.5      00:22:36
  1397      10   4,735      47,350        40.5       2.3      00:21:38
  1893       8   4,735      37,880        55.6       3.1      00:20:49
  2392       9   4,735      42,615        70.7       4.0      00:20:17
  2897       8   4,735      37,880        86.1       4.8      00:19:48
  3393       9   4,735      42,615       101.7       5.7      00:19:22
  3876       8   4,735      37,880       116.6       6.5      00:19:09
  4218       6   4,735      28,410       126.8       7.1      00:19:42
  4550       3   4,735      14,205       136.5       7.6      00:20:12
  4868       7   4,735      33,145       146.5       8.2      00:20:34
  5210       9   4,735      42,615       157.0       8.8      00:20:48
  5525      10   4,735      47,350       166.3       9.3      00:21:10
  5829       6   4,735      28,410       175.2       9.8      00:21:31
  6138       8   4,735      37,880       184.8      10.3      00:21:43
  6431      10   4,735      47,350       193.4      10.8      00:22:01
  6727       2   4,735       9,470       202.2      11.3      00:22:16
  7043       9   4,735      42,615       211.7      11.8      00:22:22
  7441       9   4,735      42,615       223.9      12.5      00:22:09
  7845       9   4,735      42,615       236.5      13.2      00:21:54
  8238       7   4,735      33,145       249.5      14.0      00:21:37
  8650       8   4,735      37,880       262.8      14.7      00:21:19
  9057       3   4,735      14,205       275.8      15.4      00:21:03
  9347       7   4,735      33,145       285.3      16.0      00:21:06
  9620       7   4,735      33,145       294.3      16.5      00:21:10
  9934       8   4,735      37,880       304.3      17.0      00:21:10
 10229       9   4,735      42,615       312.8      17.5      00:21:15
 10550       6   4,735      28,410       322.5      18.0      00:21:14
 10891      10   4,735      47,350       332.9      18.6      00:21:09
 11226      10   4,735      47,350       343.2      19.2      00:21:05
 11484       5   4,735      23,675       351.2      19.6      00:21:10
 11759       6   4,735      28,410       359.5      20.1      00:21:13
 12026       6   4,735      28,410       367.9      20.6      00:21:16
 12323       4   4,735      18,940       377.2      21.1      00:21:14
 12740       5   4,735      23,675       390.1      21.8      00:20:56
 13147      10   4,735      47,350       402.4      22.5      00:20:42
 13549       8   4,735      37,880       415.4      23.2      00:20:25
 13820       9   4,735      42,615       423.8      23.7      00:20:25
 14156       6   4,735      28,410       434.1      24.3      00:20:18
 14488       8   4,735      37,880       444.9      24.9      00:20:09
 14845      10   4,735      47,350       456.0      25.5      00:19:59
 15274       6   4,735      28,410       469.9      26.3      00:19:40
 15700       5   4,735      23,675       483.1      27.0      00:19:23
 16101       8   4,735      37,880       496.5      27.8      00:19:06
 16508      10   4,735      47,350       509.8      28.5      00:18:50
 16840       8   4,735      37,880       520.1      29.1      00:18:43
 17153       9   4,735      42,615       529.9      29.6      00:18:37
 17462       8   4,735      37,880       540.0      30.2      00:18:31
 17785       8   4,735      37,880       550.3      30.8      00:18:24
 18144       8   4,735      37,880       561.8      31.4      00:18:13
 18524       6   4,735      28,410       573.4      32.1      00:18:02
 18991       7   4,735      33,145       588.8      32.9      00:17:41
 19462       8   4,735      37,880       604.1      33.8      00:17:20
 19906       6   4,735      28,410       618.9      34.6      00:17:01
 20336       6   4,735      28,410       632.9      35.4      00:16:45
 20643       9   4,735      42,615       642.9      36.0      00:16:39
 20914       3   4,735      14,205       651.7      36.5      00:16:35
 21266       3   4,735      14,205       662.1      37.0      00:16:28
 21592       8   4,735      37,880       671.9      37.6      00:16:21
 21943       6   4,735      28,410       682.2      38.2      00:16:14
 22346       4   4,735      18,940       694.0      38.8      00:16:03
 22718       6   4,735      28,410       705.3      39.4      00:15:53
 23097      10   4,735      47,350       716.6      40.1      00:15:43
 23477       6   4,735      28,410       728.3      40.7      00:15:32
 23896      10   4,735      47,350       741.2      41.5      00:15:19
 24351       4   4,735      18,940       754.7      42.2      00:15:05
 24811       7   4,735      33,145       769.1      43.0      00:14:49
 25272       7   4,735      33,145       783.6      43.8      00:14:33
 25689       6   4,735      28,410       796.4      44.5      00:14:20
 26000       7   4,735      33,145       806.4      45.1      00:14:13
 26360       9   4,735      42,615       817.7      45.7      00:14:04
 26765       2   4,735       9,470       829.9      46.4      00:13:52
 27139       9   4,735      42,615       841.6      47.1      00:13:42
 27450      10   4,735      47,350       851.3      47.6      00:13:35
 27803       6   4,735      28,410       862.5      48.2      00:13:26
 28260       6   4,735      28,410       877.1      49.1      00:13:10
 28703       8   4,735      37,880       891.7      49.9      00:12:55
 29025       6   4,735      28,410       902.2      50.5      00:12:47
 29402       9   4,735      42,615       914.2      51.1      00:12:36
 29802       5   4,735      23,675       926.8      51.8      00:12:24
 30132       9   4,735      42,615       937.4      52.4      00:12:16
 30497       8   4,735      37,880       949.3      53.1      00:12:05
 30929       6   4,735      28,410       963.2      53.9      00:11:52
 31391       6   4,735      28,410       978.0      54.7      00:11:37
 31842       5   4,735      23,675       992.9      55.5      00:11:22
 32273       8   4,735      37,880     1,007.4      56.3      00:11:07
 32623       6   4,735      28,410     1,018.9      57.0      00:10:58
 32914       7   4,735      33,145     1,028.4      57.5      00:10:51
 33215       6   4,735      28,410     1,038.4      58.1      00:10:43
 33590       4   4,735      18,940     1,050.7      58.8      00:10:32
 33982       9   4,735      42,615     1,063.7      59.5      00:10:20
 34375       2   4,735       9,470     1,076.9      60.2      00:10:08
 34850       9   4,735      42,615     1,092.5      61.1      00:09:53
 35335      10   4,735      47,350     1,108.5      62.0      00:09:37
 35823       9   4,735      42,615     1,124.3      62.9      00:09:22
 36299       7   4,735      33,145     1,139.9      63.8      00:09:06
 36694       2   4,735       9,470     1,152.7      64.5      00:08:55
 37025       7   4,735      33,145     1,163.0      65.0      00:08:47
 37366       9   4,735      42,615     1,173.1      65.6      00:08:40
 37702       6   4,735      28,410     1,183.4      66.2      00:08:31
 38018       3   4,735      14,205     1,193.3      66.7      00:08:24
 38292       8   4,735      37,880     1,202.2      67.2      00:08:18
 38635      10   4,735      47,350     1,213.4      67.9      00:08:08
 39043       7   4,735      33,145     1,226.6      68.6      00:07:57
 39383       2   4,735       9,470     1,237.1      69.2      00:07:48
 39784       9   4,735      42,615     1,249.5      69.9      00:07:37
 40256      10   4,735      47,350     1,264.3      70.7      00:07:24
 40752       5   4,735      23,675     1,280.3      71.6      00:07:09
 41124      10   4,735      47,350     1,292.3      72.3      00:06:59
 41495       5   4,735      23,675     1,304.2      72.9      00:06:49
 41892       9   4,735      42,615     1,317.0      73.7      00:06:37
 42256      10   4,735      47,350     1,328.0      74.3      00:06:28
 42615       7   4,735      33,145     1,339.3      74.9      00:06:19
 42976       7   4,735      33,145     1,350.6      75.5      00:06:10
 43311       5   4,735      23,675     1,361.8      76.2      00:06:00
 43630       6   4,735      28,410     1,371.8      76.7      00:05:52
 43902       4   4,735      18,940     1,380.3      77.2      00:05:46
 44189       9   4,735      42,615     1,389.3      77.7      00:05:39
 44464       7   4,735      33,145     1,397.7      78.2      00:05:33
 44847       8   4,735      37,880     1,409.9      78.9      00:05:22
 45235       8   4,735      37,880     1,421.8      79.5      00:05:12
 45513       6   4,735      28,410     1,430.2      80.0      00:05:06
 45808      10   4,735      47,350     1,438.9      80.5      00:04:59
 46160       7   4,735      33,145     1,450.2      81.1      00:04:49
 46497       8   4,735      37,880     1,460.8      81.7      00:04:40
 46881       9   4,735      42,615     1,473.3      82.4      00:04:29
 47217       5   4,735      23,675     1,482.9      82.9      00:04:22
 47517       9   4,735      42,615     1,492.1      83.5      00:04:14
 47774       9   4,735      42,615     1,500.1      83.9      00:04:08
 48025       7   4,735      33,145     1,508.1      84.3      00:04:02
 48300       7   4,735      33,145     1,516.7      84.8      00:03:55
 48666       6   4,735      28,410     1,528.3      85.5      00:03:45
 49029       9   4,735      42,615     1,539.5      86.1      00:03:35
 49362       7   4,735      33,145     1,550.2      86.7      00:03:26
 49690       5   4,735      23,675     1,559.6      87.2      00:03:18
 50009       8   4,735      37,880     1,569.5      87.8      00:03:10
 50351       9   4,735      42,615     1,579.8      88.4      00:03:01
 50722       5   4,735      23,675     1,591.3      89.0      00:02:51
 51069       7   4,735      33,145     1,602.8      89.6      00:02:41
 51423       9   4,735      42,615     1,613.8      90.3      00:02:31
 51795      10   4,735      47,350     1,626.2      91.0      00:02:20
 52149       9   4,735      42,615     1,637.8      91.6      00:02:10
 52509       6   4,735      28,410     1,650.1      92.3      00:01:60
 52831       6   4,735      28,410     1,661.3      92.9      00:01:50
 53184       5   4,735      23,675     1,672.9      93.6      00:01:40
 53637       6   4,735      28,410     1,687.9      94.4      00:01:27
 54003       9   4,735      42,615     1,699.5      95.1      00:01:17
 54329       9   4,735      42,615     1,709.9      95.6      00:01:08
 54718       7   4,735      33,145     1,721.5      96.3      00:00:58
 55123       9   4,735      42,615     1,734.0      97.0      00:00:47
 55450       8   4,735      37,880     1,743.8      97.5      00:00:38
 55711      10   4,735      47,350     1,751.9      98.0      00:00:31
 55978       4   4,735      18,940     1,760.4      98.5      00:00:24
 56326      10   4,735      47,350     1,771.6      99.1      00:00:14
 56699       6   4,735      28,410     1,784.0      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1560.237
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A700.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A700.csv saved

. 
. cap log close

. 
end of do-file
