
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A400_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   290       7   4,435      31,045         7.4       0.4      00:37:42
   600       8   4,435      35,480        15.6       0.9      00:35:31
   895       6   4,435      26,610        23.4       1.4      00:35:15
  1165       6   4,435      26,610        31.3       1.9      00:35:04
  1470       5   4,435      22,175        40.2       2.4      00:33:54
  1790       5   4,435      22,175        49.4       3.0      00:32:56
  2110       8   4,435      35,480        58.4       3.5      00:32:21
  2424       6   4,435      26,610        67.2       4.0      00:31:55
  2737       9   4,435      39,915        76.3       4.6      00:31:29
  3057       9   4,435      39,915        85.2       5.1      00:31:07
  3354       9   4,435      39,915        94.3       5.6      00:30:45
  3671       6   4,435      26,610       103.6       6.2      00:30:22
  3955       9   4,435      39,915       111.5       6.7      00:30:25
  4203       5   4,435      22,175       118.5       7.1      00:30:41
  4449       8   4,435      35,480       125.1       7.5      00:31:01
  4647      10   4,435      44,350       131.1       7.8      00:31:27
  4898       9   4,435      39,915       138.3       8.3      00:31:31
  5137       7   4,435      31,045       145.1       8.7      00:31:40
  5380       6   4,435      26,610       152.3       9.1      00:31:41
  5638       7   4,435      31,045       159.0       9.5      00:31:49
  5885       8   4,435      35,480       165.8       9.9      00:31:53
  6118      10   4,435      44,350       172.7      10.3      00:31:56
  6363       7   4,435      31,045       179.5      10.7      00:31:59
  6600       5   4,435      22,175       186.1      11.1      00:32:03
  6829       9   4,435      39,915       192.6      11.5      00:32:07
  7116       2   4,435       8,870       200.7      12.0      00:31:53
  7422       9   4,435      39,915       209.4      12.5      00:31:32
  7723       6   4,435      26,610       218.1      13.0      00:31:13
  8011      10   4,435      44,350       226.9      13.6      00:30:53
  8287       8   4,435      35,480       235.3      14.1      00:30:38
  8546       4   4,435      17,740       243.3      14.5      00:30:27
  8796       6   4,435      26,610       250.6      15.0      00:30:21
  9051       9   4,435      39,915       258.4      15.4      00:30:11
  9264       8   4,435      35,480       264.9      15.8      00:30:12
  9476       8   4,435      35,480       271.3      16.2      00:30:13
  9698       7   4,435      31,045       278.3      16.6      00:30:08
  9938       5   4,435      22,175       285.3      17.0      00:30:04
 10165      10   4,435      44,350       291.4      17.4      00:30:06
 10363       7   4,435      31,045       296.9      17.7      00:30:12
 10568       6   4,435      26,610       302.8      18.1      00:30:15
 10827      10   4,435      44,350       310.1      18.5      00:30:07
 11088      10   4,435      44,350       317.7      19.0      00:29:57
 11287       8   4,435      35,480       323.3      19.3      00:29:60
 11477      10   4,435      44,350       329.0      19.7      00:30:02
 11697       6   4,435      26,610       335.3      20.0      00:30:00
 11899       4   4,435      17,740       341.1      20.4      00:30:01
 12107       6   4,435      26,610       347.3      20.8      00:29:59
 12304       2   4,435       8,870       352.9      21.1      00:30:00
 12607       8   4,435      35,480       361.7      21.6      00:29:41
 12915       3   4,435      13,305       370.2      22.1      00:29:24
 13218       8   4,435      35,480       379.1      22.7      00:29:05
 13515       9   4,435      39,915       388.2      23.2      00:28:46
 13720       2   4,435       8,870       394.3      23.6      00:28:43
 13928       8   4,435      35,480       400.2      23.9      00:28:42
 14160       6   4,435      26,610       407.0      24.3      00:28:35
 14419       4   4,435      17,740       414.8      24.8      00:28:23
 14678       8   4,435      35,480       422.4      25.2      00:28:12
 14941       8   4,435      35,480       430.2      25.7      00:27:60
 15248       9   4,435      39,915       439.6      26.3      00:27:40
 15552       7   4,435      31,045       448.5      26.8      00:27:23
 15854      10   4,435      44,350       457.5      27.3      00:27:05
 16139       6   4,435      26,610       466.4      27.9      00:26:48
 16436       8   4,435      35,480       475.6      28.4      00:26:30
 16700       9   4,435      39,915       483.3      28.9      00:26:20
 16918       5   4,435      22,175       489.6      29.3      00:26:15
 17111       5   4,435      22,175       495.3      29.6      00:26:13
 17316       6   4,435      26,610       501.5      30.0      00:26:09
 17504       8   4,435      35,480       507.5      30.3      00:26:05
 17753       4   4,435      17,740       514.7      30.8      00:25:57
 18035       8   4,435      35,480       523.1      31.3      00:25:43
 18379       5   4,435      22,175       533.4      31.9      00:25:21
 18636       6   4,435      26,610       540.9      32.3      00:25:11
 18873       9   4,435      39,915       548.1      32.8      00:25:02
 19111       2   4,435       8,870       555.4      33.2      00:24:53
 19349       8   4,435      35,480       562.6      33.6      00:24:44
 19645       9   4,435      39,915       571.8      34.2      00:24:27
 19958      10   4,435      44,350       581.7      34.8      00:24:08
 20272       3   4,435      13,305       591.2      35.3      00:23:51
 20552       7   4,435      31,045       599.7      35.8      00:23:38
 20799       8   4,435      35,480       607.1      36.3      00:23:28
 21057       9   4,435      39,915       614.8      36.7      00:23:18
 21317       9   4,435      39,915       621.6      37.1      00:23:11
 21551       6   4,435      26,610       628.4      37.6      00:23:03
 21803       9   4,435      39,915       635.2      38.0      00:22:56
 22050       4   4,435      17,740       642.3      38.4      00:22:47
 22283       3   4,435      13,305       648.6      38.8      00:22:42
 22512      10   4,435      44,350       655.0      39.1      00:22:36
 22748       5   4,435      22,175       661.4      39.5      00:22:29
 23050       7   4,435      31,045       670.1      40.0      00:22:15
 23330       8   4,435      35,480       678.3      40.5      00:22:03
 23618       4   4,435      17,740       686.2      41.0      00:21:52
 23915       8   4,435      35,480       695.0      41.5      00:21:38
 24206       9   4,435      39,915       703.1      42.0      00:21:26
 24510       7   4,435      31,045       711.7      42.5      00:21:13
 24792       5   4,435      22,175       720.0      43.0      00:21:00
 25070       6   4,435      26,610       728.2      43.5      00:20:49
 25312       7   4,435      31,045       735.3      43.9      00:20:40
 25578       9   4,435      39,915       743.0      44.4      00:20:30
 25757       5   4,435      22,175       748.5      44.7      00:20:26
 25938       6   4,435      26,610       753.7      45.0      00:20:23
 26151       5   4,435      22,175       760.1      45.4      00:20:16
 26425       6   4,435      26,610       768.0      45.9      00:20:05
 26683       9   4,435      39,915       775.3      46.3      00:19:56
 26936       5   4,435      22,175       782.8      46.8      00:19:46
 27143       7   4,435      31,045       788.8      47.1      00:19:40
 27337       5   4,435      22,175       794.4      47.5      00:19:35
 27540       7   4,435      31,045       800.4      47.8      00:19:30
 27777       5   4,435      22,175       807.5      48.3      00:19:21
 28052       9   4,435      39,915       815.7      48.7      00:19:08
 28342       8   4,435      35,480       824.5      49.3      00:18:55
 28619       9   4,435      39,915       833.1      49.8      00:18:42
 28837       9   4,435      39,915       839.8      50.2      00:18:34
 29059      10   4,435      44,350       846.5      50.6      00:18:26
 29322       5   4,435      22,175       854.2      51.0      00:18:16
 29600       9   4,435      39,915       862.4      51.5      00:18:04
 29816       3   4,435      13,305       869.0      51.9      00:17:56
 29987       9   4,435      39,915       874.0      52.2      00:17:53
 30198       8   4,435      35,480       880.4      52.6      00:17:45
 30437       7   4,435      31,045       887.7      53.0      00:17:36
 30705       8   4,435      35,480       895.7      53.5      00:17:24
 31022       7   4,435      31,045       905.1      54.1      00:17:09
 31345       6   4,435      26,610       915.0      54.7      00:16:53
 31670       9   4,435      39,915       925.0      55.3      00:16:37
 32003       9   4,435      39,915       935.5      55.9      00:16:20
 32311       8   4,435      35,480       945.2      56.5      00:16:05
 32531       6   4,435      26,610       952.0      56.9      00:15:57
 32706       5   4,435      22,175       957.3      57.2      00:15:52
 32923      10   4,435      44,350       964.0      57.6      00:15:44
 33163       9   4,435      39,915       971.4      58.0      00:15:34
 33446       6   4,435      26,610       980.0      58.6      00:15:22
 33716       4   4,435      17,740       988.4      59.1      00:15:10
 33958       5   4,435      22,175       996.0      59.5      00:14:60
 34169       6   4,435      26,610     1,002.6      59.9      00:14:52
 34467       4   4,435      17,740     1,011.9      60.5      00:14:38
 34770       3   4,435      13,305     1,021.2      61.0      00:14:24
 35074       6   4,435      26,610     1,030.5      61.6      00:14:10
 35372       6   4,435      26,610     1,039.8      62.1      00:13:57
 35686       7   4,435      31,045     1,049.3      62.7      00:13:43
 35976       9   4,435      39,915     1,058.2      63.2      00:13:30
 36255       7   4,435      31,045     1,066.7      63.7      00:13:18
 36521      10   4,435      44,350     1,074.7      64.2      00:13:07
 36666       9   4,435      39,915     1,079.1      64.5      00:13:04
 36804       8   4,435      35,480     1,083.1      64.7      00:13:01
 36925       9   4,435      39,915     1,086.9      64.9      00:12:59
 37060       8   4,435      35,480     1,090.7      65.2      00:12:56
 37245       8   4,435      35,480     1,095.8      65.5      00:12:51
 37423       8   4,435      35,480     1,100.8      65.8      00:12:46
 37595       5   4,435      22,175     1,105.8      66.1      00:12:41
 37857       5   4,435      22,175     1,113.4      66.5      00:12:31
 38088       2   4,435       8,870     1,120.3      66.9      00:12:22
 38354       6   4,435      26,610     1,128.4      67.4      00:12:11
 38655       8   4,435      35,480     1,137.6      68.0      00:11:58
 38964       4   4,435      17,740     1,146.8      68.5      00:11:44
 39173       7   4,435      31,045     1,152.9      68.9      00:11:37
 39416       3   4,435      13,305     1,159.8      69.3      00:11:28
 39691       6   4,435      26,610     1,167.9      69.8      00:11:17
 39974       7   4,435      31,045     1,176.3      70.3      00:11:05
 40302       9   4,435      39,915     1,185.8      70.9      00:10:51
 40672      10   4,435      44,350     1,197.1      71.5      00:10:34
 40989       5   4,435      22,175     1,206.8      72.1      00:10:20
 41245       6   4,435      26,610     1,214.5      72.6      00:10:10
 41529       8   4,435      35,480     1,222.9      73.1      00:09:58
 41766       5   4,435      22,175     1,230.1      73.5      00:09:49
 42011       1   4,435       4,435     1,237.3      73.9      00:09:39
 42248       8   4,435      35,480     1,243.9      74.3      00:09:31
 42520       6   4,435      26,610     1,252.0      74.8      00:09:20
 42772       6   4,435      26,610     1,259.4      75.3      00:09:10
 42975      10   4,435      44,350     1,265.5      75.6      00:09:03
 43161       9   4,435      39,915     1,271.3      76.0      00:08:56
 43336       4   4,435      17,740     1,276.7      76.3      00:08:49
 43590       7   4,435      31,045     1,284.1      76.7      00:08:40
 43907       7   4,435      31,045     1,293.4      77.3      00:08:26
 44173       6   4,435      26,610     1,301.2      77.8      00:08:16
 44417       7   4,435      31,045     1,308.1      78.2      00:08:07
 44670       8   4,435      35,480     1,315.7      78.6      00:07:57
 44937       9   4,435      39,915     1,323.7      79.1      00:07:46
 45245      10   4,435      44,350     1,332.4      79.6      00:07:34
 45468       5   4,435      22,175     1,338.6      80.0      00:07:26
 45732       6   4,435      26,610     1,345.9      80.4      00:07:17
 46016       6   4,435      26,610     1,354.3      80.9      00:07:05
 46285       4   4,435      17,740     1,362.5      81.4      00:06:54
 46565       4   4,435      17,740     1,370.7      81.9      00:06:43
 46868       8   4,435      35,480     1,379.9      82.5      00:06:30
 47099       6   4,435      26,610     1,386.0      82.8      00:06:22
 47321       5   4,435      22,175     1,392.3      83.2      00:06:14
 47591       9   4,435      39,915     1,399.9      83.7      00:06:04
 47843       5   4,435      22,175     1,407.2      84.1      00:05:55
 48065       3   4,435      13,305     1,414.0      84.5      00:05:46
 48298       9   4,435      39,915     1,420.8      84.9      00:05:37
 48575       9   4,435      39,915     1,429.1      85.4      00:05:26
 48833      10   4,435      44,350     1,436.5      85.8      00:05:16
 49055       7   4,435      31,045     1,443.1      86.2      00:05:07
 49311       5   4,435      22,175     1,450.7      86.7      00:04:57
 49576       5   4,435      22,175     1,458.0      87.1      00:04:47
 49852       6   4,435      26,610     1,465.6      87.6      00:04:37
 50138       9   4,435      39,915     1,474.0      88.1      00:04:26
 50388       6   4,435      26,610     1,480.9      88.5      00:04:17
 50620       4   4,435      17,740     1,487.8      88.9      00:04:08
 50883       7   4,435      31,045     1,495.8      89.4      00:03:57
 51146       9   4,435      39,915     1,503.8      89.9      00:03:46
 51418      10   4,435      44,350     1,511.9      90.3      00:03:35
 51655       6   4,435      26,610     1,519.3      90.8      00:03:25
 51899       7   4,435      31,045     1,526.7      91.2      00:03:15
 52234       2   4,435       8,870     1,537.3      91.9      00:03:01
 52581      10   4,435      44,350     1,548.4      92.5      00:02:46
 52924       7   4,435      31,045     1,559.4      93.2      00:02:31
 53270       6   4,435      26,610     1,570.1      93.8      00:02:17
 53614       5   4,435      22,175     1,580.7      94.5      00:02:02
 53881       9   4,435      39,915     1,588.6      94.9      00:01:52
 54090       5   4,435      22,175     1,594.7      95.3      00:01:44
 54337       7   4,435      31,045     1,602.1      95.7      00:01:34
 54662       4   4,435      17,740     1,611.1      96.3      00:01:22
 54948       8   4,435      35,480     1,619.5      96.8      00:01:11
 55235       7   4,435      31,045     1,627.8      97.3      00:01:00
 55473       6   4,435      26,610     1,634.4      97.7      00:00:51
 55725       7   4,435      31,045     1,641.7      98.1      00:00:42
 55968       8   4,435      35,480     1,649.0      98.5      00:00:32
 56239       8   4,435      35,480     1,657.2      99.0      00:00:21
 56436       7   4,435      31,045     1,663.4      99.4      00:00:13
 56725       9   4,435      39,915     1,672.2      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 2213.052
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
