
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locatio
> ns_total_10000_1_4q_flexthresh2_3_15.dta /export/storage_covidvaccine/Result/
> MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4
> q_flexthresh2_3_15.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 13:32:29

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_1_4q_flexthresh2_3_15.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
  8125       8   4,035      32,280       209.4      13.7      00:19:53
  7966       8   4,035      32,280       205.0      13.5      00:20:24
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   466      10   4,035      40,350        10.7       0.7      00:23:32
  8490       8   4,035      32,280       219.6      14.4      00:19:49
  8368       7   4,035      28,245       216.2      14.2      00:20:11
   971       7   4,035      28,245        23.1       1.5      00:21:39
  8900       6   4,035      24,210       230.8      15.1      00:19:38
  8790       7   4,035      28,245       227.7      14.9      00:19:57
  1450       8   4,035      32,280        35.9       2.4      00:20:45
  9270      10   4,035      40,350       241.0      15.8      00:19:32
  9204      10   4,035      40,350       239.2      15.7      00:19:43
  1937       5   4,035      20,175        48.4       3.2      00:20:21
  9579       7   4,035      28,245       249.6      16.4      00:19:35
  9515       8   4,035      32,280       247.8      16.3      00:19:46
  2426       8   4,035      32,280        61.1       4.0      00:19:59
  9908       7   4,035      28,245       258.6      17.0      00:19:35
  9853       6   4,035      24,210       257.2      16.9      00:19:43
  2928       7   4,035      28,245        74.2       4.9      00:19:34
 10277       4   4,035      16,140       267.7      17.6      00:19:34
 10232       8   4,035      32,280       266.7      17.5      00:19:40
  3423       9   4,035      36,315        87.5       5.7      00:19:11
 10662       6   4,035      24,210       277.7      18.2      00:19:28
 10638       7   4,035      28,245       277.1      18.2      00:19:31
  3887       9   4,035      36,315        99.7       6.5      00:19:04
 11047       7   4,035      28,245       287.8      18.9      00:19:21
 11051       2   4,035       8,070       287.9      18.9      00:19:20
  4252       9   4,035      36,315       108.8       7.1      00:19:32
 11348       7   4,035      28,245       295.7      19.4      00:19:24
 11384       6   4,035      24,210       296.6      19.5      00:19:20
  4627       8   4,035      32,280       118.5       7.8      00:19:48
 11641       5   4,035      20,175       303.3      19.9      00:19:28
 11705       7   4,035      28,245       305.1      20.0      00:19:20
  4954       9   4,035      36,315       127.1       8.3      00:20:10
 11975       7   4,035      28,245       312.1      20.5      00:19:26
 12064       6   4,035      24,210       314.6      20.6      00:19:14
  5294       9   4,035      36,315       135.9       8.9      00:20:27
 12287       7   4,035      28,245       320.5      21.0      00:19:25
 12439       9   4,035      36,315       324.5      21.3      00:19:07
  5636       6   4,035      24,210       144.4       9.5      00:20:44
 12710       3   4,035      12,105       331.6      21.8      00:19:12
 12905      10   4,035      40,350       336.4      22.1      00:18:51
  5979       7   4,035      28,245       153.2      10.1      00:20:54
 13177      10   4,035      40,350       343.7      22.6      00:18:54
 13375      10   4,035      40,350       348.9      22.9      00:18:32
  6349       7   4,035      28,245       162.7      10.7      00:20:57
 13726       5   4,035      20,175       358.8      23.5      00:18:25
 13588      10   4,035      40,350       354.9      23.3      00:18:41
  6701       6   4,035      24,210       171.7      11.3      00:21:02
 14084       8   4,035      32,280       368.0      24.2      00:18:20
 13902       7   4,035      28,245       363.3      23.8      00:18:39
  7079       7   4,035      28,245       181.4      11.9      00:20:60
 14464       9   4,035      36,315       378.4      24.8      00:18:11
 14278       8   4,035      32,280       373.4      24.5      00:18:30
  7526       4   4,035      16,140       193.0      12.7      00:20:43
 14846       6   4,035      24,210       388.6      25.5      00:18:02
 14663       6   4,035      24,210       383.8      25.2      00:18:20
  7958       9   4,035      36,315       204.8      13.4      00:20:25
 15310       6   4,035      24,210       401.4      26.3      00:17:44
 15086       7   4,035      28,245       395.3      25.9      00:18:06
  8397       6   4,035      24,210       216.9      14.2      00:20:06
 15776       9   4,035      36,315       413.9      27.2      00:17:27
 15542       7   4,035      28,245       407.6      26.8      00:17:49
  8818       8   4,035      32,280       228.4      15.0      00:19:52
 16236       7   4,035      28,245       426.8      28.0      00:17:09
 16017       8   4,035      32,280       420.6      27.6      00:17:30
  9231       8   4,035      32,280       239.9      15.7      00:19:39
 16650       7   4,035      28,245       438.0      28.7      00:16:57
 16472       7   4,035      28,245       433.5      28.5      00:17:12
  9558       9   4,035      36,315       249.0      16.3      00:19:39
 16837       9   4,035      36,315       443.1      29.1      00:17:05
 16998       8   4,035      32,280       447.5      29.4      00:16:51
  9912       4   4,035      16,140       258.8      17.0      00:19:35
 17165       4   4,035      16,140       451.9      29.7      00:17:01
 17312       9   4,035      36,315       455.9      29.9      00:16:48
 10299      10   4,035      40,350       268.3      17.6      00:19:32
 17482      10   4,035      40,350       460.7      30.2      00:16:56
 17619       8   4,035      32,280       464.7      30.5      00:16:44
 10678       6   4,035      24,210       278.1      18.3      00:19:26
 17808       8   4,035      32,280       469.5      30.8      00:16:51
 17930       8   4,035      32,280       472.9      31.0      00:16:41
 11101       3   4,035      12,105       289.1      19.0      00:19:15
 18141       7   4,035      28,245       478.7      31.4      00:16:45
 18298       8   4,035      32,280       482.9      31.7      00:16:33
 11413      10   4,035      40,350       297.4      19.5      00:19:16
 18486       5   4,035      20,175       487.6      32.0      00:16:40
 18727       4   4,035      16,140       494.4      32.5      00:16:20
 11718       6   4,035      24,210       305.4      20.0      00:19:19
 19175       6   4,035      24,210       506.9      33.3      00:16:04
 18924       7   4,035      28,245       499.8      32.8      00:16:24
 12049      10   4,035      40,350       314.2      20.6      00:19:17
 19388       7   4,035      28,245       512.7      33.7      00:16:07
 19657       7   4,035      28,245       520.3      34.2      00:15:46
 12379       9   4,035      36,315       322.9      21.2      00:19:15
 19815       8   4,035      32,280       524.9      34.5      00:15:53
 20136       9   4,035      36,315       534.1      35.1      00:15:28
 12847       6   4,035      24,210       334.9      22.0      00:18:58
 20268       7   4,035      28,245       537.5      35.3      00:15:37
 20566      10   4,035      40,350       545.7      35.8      00:15:15
 13275       8   4,035      32,280       346.2      22.7      00:18:44
 20646       6   4,035      24,210       547.9      36.0      00:15:27
 20897       6   4,035      24,210       554.8      36.4      00:15:09
 13666       7   4,035      28,245       357.1      23.4      00:18:32
 20933       6   4,035      24,210       555.9      36.5      00:15:24
 21251       8   4,035      32,280       563.8      37.0      00:15:03
 14036      10   4,035      40,350       366.7      24.1      00:18:26
 21289       1   4,035       4,035       564.7      37.1      00:15:18
 21599       7   4,035      28,245       572.7      37.6      00:14:58
 14441       6   4,035      24,210       377.8      24.8      00:18:14
 21669       6   4,035      24,210       574.4      37.7      00:15:10
 21985       9   4,035      36,315       582.4      38.2      00:14:50
 14824       8   4,035      32,280       388.1      25.5      00:18:04
 22052       6   4,035      24,210       584.2      38.3      00:15:02
 22372       9   4,035      36,315       592.0      38.9      00:14:42
 15300       5   4,035      20,175       401.1      26.3      00:17:45
 22426       8   4,035      32,280       593.4      38.9      00:14:55
 22728       4   4,035      16,140       601.3      39.5      00:14:35
 15795       5   4,035      20,175       414.4      27.2      00:17:25
 22784       8   4,035      32,280       602.5      39.5      00:14:48
 23123       6   4,035      24,210       611.3      40.1      00:14:27
 16272       5   4,035      20,175       427.8      28.1      00:17:06
 23129       8   4,035      32,280       611.5      40.1      00:14:41
 23480       7   4,035      28,245       620.7      40.7      00:14:19
 16698       9   4,035      36,315       439.4      28.8      00:16:53
 23472       8   4,035      32,280       620.5      40.7      00:14:34
 23890       6   4,035      24,210       631.5      41.4      00:14:09
 17049       8   4,035      32,280       448.9      29.5      00:16:47
 23846       8   4,035      32,280       630.3      41.4      00:14:26
 24357       6   4,035      24,210       643.2      42.2      00:13:56
 17394       3   4,035      12,105       458.3      30.1      00:16:41
 24246      10   4,035      40,350       640.6      42.0      00:14:16
 24833       7   4,035      28,245       656.0      43.1      00:13:41
 17711       7   4,035      28,245       467.1      30.7      00:16:37
 24656       9   4,035      36,315       651.4      42.8      00:14:05
 25288       7   4,035      28,245       668.2      43.9      00:13:28
 18114       7   4,035      28,245       477.9      31.4      00:16:26
 25097       5   4,035      20,175       663.0      43.5      00:13:52
 25704       8   4,035      32,280       679.1      44.6      00:13:17
 18531       8   4,035      32,280       488.8      32.1      00:16:15
 25546       6   4,035      24,210       675.2      44.3      00:13:38
 26030       4   4,035      16,140       688.0      45.2      00:13:11
 18995       6   4,035      24,210       501.9      32.9      00:15:58
 25882       4   4,035      16,140       684.1      44.9      00:13:31
 26449       8   4,035      32,280       699.0      45.9      00:12:60
 19468       9   4,035      36,315       515.0      33.8      00:15:41
 26229       6   4,035      24,210       693.4      45.5      00:13:23
 26886       3   4,035      12,105       710.5      46.6      00:12:48
 19912       8   4,035      32,280       527.6      34.6      00:15:26
 26622       7   4,035      28,245       703.5      46.2      00:13:14
 27247       8   4,035      32,280       720.1      47.3      00:12:40
