
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A800_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   199       8   4,835      38,680         5.4       0.3      00:56:03
   413       5   4,835      24,175        11.5       0.6      00:52:35
   622       4   4,835      19,340        17.5       1.0      00:51:37
   820       2   4,835       9,670        23.7       1.3      00:50:43
  1038       9   4,835      43,515        30.1       1.6      00:49:52
  1221       5   4,835      24,175        35.8       2.0      00:50:06
  1401       9   4,835      43,515        41.6       2.3      00:50:10
  1608       5   4,835      24,175        48.2       2.6      00:49:15
  1811       7   4,835      33,845        54.4       3.0      00:48:57
  2002       5   4,835      24,175        60.2       3.3      00:48:59
  2194       5   4,835      24,175        66.3       3.6      00:48:46
  2385       8   4,835      38,680        72.1       4.0      00:48:45
  2568       5   4,835      24,175        77.7       4.3      00:48:53
  2764       5   4,835      24,175        84.0       4.6      00:48:31
  2961       7   4,835      33,845        89.9       4.9      00:48:21
  3169       6   4,835      29,010        96.7       5.3      00:47:47
  3364       8   4,835      38,680       103.2       5.7      00:47:25
  3561       5   4,835      24,175       109.5       6.0      00:47:07
  3758       7   4,835      33,845       115.8       6.3      00:46:52
  3921       9   4,835      43,515       120.6       6.6      00:47:14
  4036       8   4,835      38,680       124.0       6.8      00:48:09
  4152       7   4,835      33,845       127.6       7.0      00:48:57
  4272       2   4,835       9,670       131.0       7.2      00:49:44
  4391       5   4,835      24,175       134.5       7.4      00:50:25
  4494       7   4,835      33,845       137.9       7.6      00:51:10
  4626       7   4,835      33,845       142.2       7.8      00:51:29
  4750      10   4,835      48,350       146.1       8.0      00:51:55
  4863       8   4,835      38,680       149.6       8.2      00:52:28
  4990       8   4,835      38,680       153.6       8.4      00:52:48
  5135       8   4,835      38,680       158.1       8.7      00:52:57
  5263       7   4,835      33,845       162.0       8.9      00:53:15
  5401       6   4,835      29,010       166.7       9.1      00:53:17
  5532       7   4,835      33,845       170.2       9.3      00:53:42
  5652       7   4,835      33,845       173.8       9.5      00:54:05
  5761       9   4,835      43,515       177.1       9.7      00:54:30
  5866       2   4,835       9,670       180.2       9.9      00:55:00
  5966      10   4,835      48,350       183.4      10.1      00:55:26
  6076       2   4,835       9,670       187.0      10.2      00:55:43
  6185       8   4,835      38,680       190.3      10.4      00:56:05
  6318       6   4,835      29,010       194.3      10.7      00:56:11
  6401      10   4,835      48,350       196.8      10.8      00:56:47
  6514       7   4,835      33,845       200.3      11.0      00:57:01
  6648       6   4,835      29,010       204.3      11.2      00:57:05
  6781       6   4,835      29,010       208.4      11.4      00:57:09
  6907       9   4,835      43,515       212.4      11.6      00:57:12
  7045       2   4,835       9,670       216.5      11.9      00:57:12
  7203       7   4,835      33,845       221.2      12.1      00:57:02
  7345       8   4,835      38,680       225.8      12.4      00:56:54
  7506      10   4,835      48,350       230.9      12.7      00:56:38
  7677       4   4,835      19,340       236.2      12.9      00:56:17
  7842       7   4,835      33,845       241.6      13.2      00:55:56
  8002       6   4,835      29,010       247.1      13.5      00:55:35
  8139      10   4,835      48,350       251.6      13.8      00:55:27
  8284      10   4,835      48,350       256.4      14.1      00:55:17
  8416       3   4,835      14,505       260.8      14.3      00:55:11
  8563       9   4,835      43,515       265.7      14.6      00:54:59
  8719       6   4,835      29,010       270.7      14.8      00:54:46
  8902      10   4,835      48,350       276.8      15.2      00:54:17
  9046       3   4,835      14,505       281.5      15.4      00:54:08
  9193       7   4,835      33,845       286.4      15.7      00:53:56
  9302       4   4,835      19,340       290.1      15.9      00:54:01
  9413       9   4,835      43,515       293.7      16.1      00:54:06
  9537       9   4,835      43,515       297.9      16.3      00:54:03
  9658       9   4,835      43,515       302.1      16.6      00:53:59
  9804       6   4,835      29,010       306.9      16.8      00:53:49
  9930       6   4,835      29,010       310.8      17.0      00:53:48
 10047       7   4,835      33,845       314.4      17.2      00:53:53
 10157       7   4,835      33,845       317.5      17.4      00:54:02
 10294       9   4,835      43,515       321.5      17.6      00:54:00
 10408       4   4,835      19,340       325.1      17.8      00:54:03
 10528       6   4,835      29,010       328.9      18.0      00:54:03
 10661       6   4,835      29,010       333.0      18.3      00:53:60
 10799       5   4,835      24,175       337.2      18.5      00:53:54
 10911       7   4,835      33,845       340.8      18.7      00:53:56
 11015       3   4,835      14,505       344.1      18.9      00:54:01
 11148       4   4,835      19,340       348.2      19.1      00:53:56
 11248       3   4,835      14,505       351.3      19.3      00:54:03
 11350       9   4,835      43,515       354.6      19.4      00:54:08
 11444      10   4,835      48,350       357.6      19.6      00:54:15
 11540       9   4,835      43,515       360.5      19.8      00:54:23
 11658       5   4,835      24,175       364.3      20.0      00:54:22
 11781      10   4,835      48,350       368.1      20.2      00:54:18
 11910       7   4,835      33,845       372.2      20.4      00:54:13
 12017       7   4,835      33,845       375.6      20.6      00:54:14
 12096       9   4,835      43,515       378.3      20.7      00:54:25
 12206      10   4,835      48,350       381.8      20.9      00:54:24
 12320       6   4,835      29,010       385.2      21.1      00:54:26
 12503       7   4,835      33,845       391.1      21.4      00:54:00
 12705       9   4,835      43,515       397.4      21.8      00:53:31
 12938      10   4,835      48,350       404.3      22.2      00:52:56
 13128       6   4,835      29,010       410.5      22.5      00:52:29
 13323       6   4,835      29,010       416.6      22.8      00:52:03
 13503       8   4,835      38,680       422.8      23.2      00:51:36
 13638       6   4,835      29,010       427.3      23.4      00:51:28
 13742       5   4,835      24,175       430.5      23.6      00:51:30
 13839       9   4,835      43,515       433.6      23.8      00:51:34
 13946       6   4,835      29,010       436.9      23.9      00:51:35
 14101       7   4,835      33,845       441.7      24.2      00:51:22
 14268      10   4,835      48,350       447.3      24.5      00:51:02
 14405       9   4,835      43,515       451.8      24.8      00:50:52
 14567       2   4,835       9,670       457.0      25.1      00:50:36
 14738      10   4,835      48,350       462.5      25.3      00:50:18
 14922       8   4,835      38,680       468.4      25.7      00:49:56
 15127       4   4,835      19,340       475.2      26.1      00:49:26
 15308       6   4,835      29,010       481.2      26.4      00:49:04
 15481       9   4,835      43,515       486.7      26.7      00:48:47
 15671       7   4,835      33,845       492.7      27.0      00:48:25
 15859       8   4,835      38,680       498.9      27.3      00:48:02
 16061      10   4,835      48,350       505.9      27.7      00:47:34
 16258       8   4,835      38,680       512.4      28.1      00:47:09
 16462       7   4,835      33,845       519.3      28.5      00:46:42
 16591       9   4,835      43,515       523.2      28.7      00:46:37
 16718       9   4,835      43,515       527.4      28.9      00:46:31
 16845       8   4,835      38,680       531.4      29.1      00:46:26
 16965       8   4,835      38,680       535.4      29.3      00:46:21
 17061       8   4,835      38,680       538.5      29.5      00:46:22
 17171       8   4,835      38,680       541.9      29.7      00:46:21
 17262       7   4,835      33,845       544.9      29.9      00:46:23
 17349       8   4,835      38,680       547.9      30.0      00:46:25
 17462       9   4,835      43,515       551.7      30.2      00:46:20
 17537       8   4,835      38,680       554.4      30.4      00:46:24
 17646       8   4,835      38,680       558.0      30.6      00:46:21
 17756       7   4,835      33,845       561.2      30.8      00:46:21
 17917       6   4,835      29,010       566.4      31.0      00:46:06
 18097       8   4,835      38,680       572.4      31.4      00:45:46
 18291       9   4,835      43,515       578.7      31.7      00:45:24
 18469      10   4,835      48,350       584.0      32.0      00:45:09
 18548       6   4,835      29,010       586.6      32.2      00:45:12
 18637       6   4,835      29,010       589.7      32.3      00:45:13
 18737       9   4,835      43,515       593.1      32.5      00:45:11
 18865       7   4,835      33,845       597.2      32.7      00:45:04
 18969       6   4,835      29,010       600.8      32.9      00:45:00
 19080      10   4,835      48,350       604.5      33.1      00:44:56
 19188       6   4,835      29,010       608.1      33.3      00:44:52
 19304       7   4,835      33,845       612.0      33.5      00:44:46
 19489       6   4,835      29,010       618.2      33.9      00:44:25
 19644      10   4,835      48,350       623.4      34.2      00:44:11
 19789       8   4,835      38,680       628.4      34.4      00:43:58
 19944       8   4,835      38,680       633.7      34.7      00:43:43
 20101       6   4,835      29,010       639.1      35.0      00:43:28
 20286       5   4,835      24,175       644.9      35.4      00:43:10
 20439       6   4,835      29,010       650.0      35.6      00:42:57
 20533       9   4,835      43,515       653.1      35.8      00:42:56
 20641      10   4,835      48,350       656.7      36.0      00:42:52
 20737       5   4,835      24,175       659.8      36.2      00:42:51
 20834       8   4,835      38,680       663.0      36.3      00:42:48
 20917       6   4,835      29,010       665.9      36.5      00:42:49
 21014       5   4,835      24,175       668.8      36.7      00:42:48
 21160       1   4,835       4,835       673.3      36.9      00:42:40
 21312      10   4,835      48,350       677.5      37.1      00:42:32
 21441       9   4,835      43,515       681.6      37.4      00:42:24
 21586       6   4,835      29,010       686.1      37.6      00:42:14
 21741      10   4,835      48,350       690.6      37.9      00:42:05
 21854       6   4,835      29,010       694.2      38.1      00:42:00
 21967       2   4,835       9,670       697.7      38.2      00:41:56
 22112      10   4,835      48,350       701.9      38.5      00:41:48
 22232      10   4,835      48,350       705.6      38.7      00:41:42
 22361       6   4,835      29,010       709.4      38.9      00:41:36
 22478      10   4,835      48,350       713.1      39.1      00:41:31
 22590       6   4,835      29,010       716.5      39.3      00:41:27
 22683       9   4,835      43,515       719.4      39.4      00:41:26
 22805       9   4,835      43,515       722.6      39.6      00:41:23
 22979       8   4,835      38,680       728.2      39.9      00:41:07
 23140       5   4,835      24,175       733.4      40.2      00:40:53
 23322       5   4,835      24,175       739.2      40.5      00:40:35
 23491       8   4,835      38,680       744.1      40.8      00:40:22
 23652       9   4,835      43,515       749.1      41.1      00:40:09
 23791      10   4,835      48,350       753.7      41.3      00:39:59
 23975       6   4,835      29,010       759.5      41.6      00:39:42
 24150       6   4,835      29,010       764.7      41.9      00:39:28
 24317       4   4,835      19,340       769.8      42.2      00:39:15
 24484      10   4,835      48,350       775.1      42.5      00:39:00
 24626       7   4,835      33,845       779.8      42.7      00:38:49
 24813       8   4,835      38,680       785.6      43.1      00:38:32
 25007       4   4,835      19,340       791.7      43.4      00:38:14
 25173       9   4,835      43,515       797.3      43.7      00:37:59
 25352       7   4,835      33,845       803.0      44.0      00:37:43
 25524       7   4,835      33,845       808.6      44.3      00:37:28
 25636      10   4,835      48,350       811.8      44.5      00:37:24
 25738       7   4,835      33,845       815.3      44.7      00:37:19
 25865       8   4,835      38,680       819.5      44.9      00:37:11
 25987       9   4,835      43,515       823.3      45.1      00:37:04
 26103       5   4,835      24,175       827.1      45.3      00:36:58
 26251       8   4,835      38,680       832.0      45.6      00:36:46
 26416      10   4,835      48,350       836.9      45.9      00:36:34
 26582       7   4,835      33,845       842.1      46.2      00:36:20
 26750       9   4,835      43,515       847.4      46.4      00:36:07
 26898       8   4,835      38,680       852.1      46.7      00:35:56
 27065       9   4,835      43,515       857.3      47.0      00:35:43
 27165       8   4,835      38,680       860.6      47.2      00:35:38
 27267       5   4,835      24,175       863.8      47.3      00:35:35
 27353       6   4,835      29,010       866.6      47.5      00:35:33
 27460       6   4,835      29,010       870.0      47.7      00:35:28
 27568      10   4,835      48,350       873.6      47.9      00:35:22
 27710       7   4,835      33,845       878.2      48.1      00:35:12
 27856      10   4,835      48,350       883.0      48.4      00:34:60
 28057       9   4,835      43,515       889.5      48.8      00:34:41
 28244       4   4,835      19,340       895.6      49.1      00:34:24
 28415       7   4,835      33,845       901.3      49.4      00:34:08
 28587      10   4,835      48,350       907.3      49.7      00:33:52
 28676       5   4,835      24,175       910.1      49.9      00:33:50
 28765       6   4,835      29,010       913.1      50.1      00:33:46
 28857       7   4,835      33,845       916.2      50.2      00:33:42
 28946      10   4,835      48,350       919.1      50.4      00:33:39
 29034       9   4,835      43,515       922.0      50.5      00:33:36
 29154       3   4,835      14,505       925.9      50.8      00:33:29
 29284      10   4,835      48,350       929.9      51.0      00:33:21
 29395       7   4,835      33,845       933.7      51.2      00:33:14
 29542       5   4,835      24,175       938.3      51.4      00:33:04
 29695       8   4,835      38,680       943.3      51.7      00:32:52
 29797       9   4,835      43,515       946.7      51.9      00:32:46
 29902       7   4,835      33,845       950.0      52.1      00:32:41
 29983       9   4,835      43,515       952.7      52.2      00:32:39
 30080      10   4,835      48,350       955.8      52.4      00:32:35
 30180       8   4,835      38,680       959.2      52.6      00:32:29
 30290       5   4,835      24,175       962.8      52.8      00:32:23
 30405      10   4,835      48,350       966.6      53.0      00:32:16
 30510       6   4,835      29,010       970.2      53.2      00:32:09
 30624       7   4,835      33,845       973.9      53.4      00:32:02
 30792       8   4,835      38,680       979.5      53.7      00:31:47
 30977       9   4,835      43,515       985.4      54.0      00:31:31
 31146       7   4,835      33,845       990.9      54.3      00:31:17
 31346       6   4,835      29,010       997.6      54.7      00:30:58
 31501       5   4,835      24,175     1,002.9      55.0      00:30:44
 31673       4   4,835      19,340     1,008.6      55.3      00:30:29
 31852       6   4,835      29,010     1,014.8      55.6      00:30:12
 32027       4   4,835      19,340     1,020.7      55.9      00:29:56
 32190       9   4,835      43,515     1,026.3      56.3      00:29:42
 32340       6   4,835      29,010     1,031.5      56.5      00:29:29
 32481       9   4,835      43,515     1,036.3      56.8      00:29:18
 32586       5   4,835      24,175     1,039.7      57.0      00:29:12
 32688       5   4,835      24,175     1,043.0      57.2      00:29:07
 32776       7   4,835      33,845     1,046.1      57.3      00:29:02
 32888       9   4,835      43,515     1,049.7      57.5      00:28:55
 32980       6   4,835      29,010     1,052.9      57.7      00:28:51
 33078       6   4,835      29,010     1,056.2      57.9      00:28:45
 33187       9   4,835      43,515     1,059.8      58.1      00:28:38
 33304       8   4,835      38,680     1,063.7      58.3      00:28:30
 33434       5   4,835      24,175     1,068.0      58.5      00:28:21
 33541       9   4,835      43,515     1,071.7      58.7      00:28:14
 33684       8   4,835      38,680     1,076.5      59.0      00:28:03
 33789       7   4,835      33,845     1,080.1      59.2      00:27:56
 33929      10   4,835      48,350     1,084.8      59.5      00:27:45
 34057       6   4,835      29,010     1,089.1      59.7      00:27:35
 34167       9   4,835      43,515     1,093.0      59.9      00:27:28
 34299       6   4,835      29,010     1,097.5      60.2      00:27:17
 34501       7   4,835      33,845     1,104.3      60.5      00:26:59
 34716       8   4,835      38,680     1,111.4      60.9      00:26:39
 34896       7   4,835      33,845     1,117.6      61.3      00:26:22
 35091      10   4,835      48,350     1,123.9      61.6      00:26:06
 35263       6   4,835      29,010     1,129.9      61.9      00:25:50
 35394       6   4,835      29,010     1,134.3      62.2      00:25:41
 35538       6   4,835      29,010     1,139.1      62.4      00:25:30
 35693       8   4,835      38,680     1,144.2      62.7      00:25:17
 35863       6   4,835      29,010     1,149.8      63.0      00:25:03
 36027       6   4,835      29,010     1,155.2      63.3      00:24:50
 36174       9   4,835      43,515     1,160.2      63.6      00:24:38
 36340       5   4,835      24,175     1,165.8      63.9      00:24:24
 36514       7   4,835      33,845     1,171.5      64.2      00:24:11
 36588      10   4,835      48,350     1,173.9      64.3      00:24:08
 36693       8   4,835      38,680     1,177.3      64.5      00:24:02
 36782       8   4,835      38,680     1,180.1      64.7      00:23:57
 36893      10   4,835      48,350     1,183.9      64.9      00:23:50
 37009      10   4,835      48,350     1,187.4      65.1      00:23:43
 37080       3   4,835      14,505     1,189.7      65.2      00:23:40
 37209       7   4,835      33,845     1,193.4      65.4      00:23:33
 37329       5   4,835      24,175     1,197.1      65.6      00:23:26
 37450       8   4,835      38,680     1,200.9      65.8      00:23:18
 37554       6   4,835      29,010     1,204.3      66.0      00:23:12
 37705       6   4,835      29,010     1,208.9      66.3      00:23:01
 37853      10   4,835      48,350     1,213.7      66.5      00:22:50
 37985       8   4,835      38,680     1,217.9      66.8      00:22:41
 38100       8   4,835      38,680     1,221.7      67.0      00:22:33
 38206       7   4,835      33,845     1,225.2      67.2      00:22:26
 38361       7   4,835      33,845     1,230.4      67.4      00:22:14
 38503      10   4,835      48,350     1,235.2      67.7      00:22:03
 38717       6   4,835      29,010     1,242.3      68.1      00:21:44
 38935       6   4,835      29,010     1,249.3      68.5      00:21:26
 39073       9   4,835      43,515     1,253.8      68.7      00:21:16
 39207       9   4,835      43,515     1,257.9      69.0      00:21:07
 39335       7   4,835      33,845     1,262.1      69.2      00:20:58
 39470       6   4,835      29,010     1,266.2      69.4      00:20:49
 39595       6   4,835      29,010     1,270.4      69.6      00:20:40
 39722       8   4,835      38,680     1,274.2      69.8      00:20:32
 39855       4   4,835      19,340     1,278.6      70.1      00:20:22
 40045       8   4,835      38,680     1,284.7      70.4      00:20:07
 40207       8   4,835      38,680     1,289.8      70.7      00:19:55
 40364       5   4,835      24,175     1,294.9      71.0      00:19:43
 40549       6   4,835      29,010     1,301.0      71.3      00:19:28
 40754       8   4,835      38,680     1,307.8      71.7      00:19:11
 40932       8   4,835      38,680     1,313.8      72.0      00:18:56
 41028       9   4,835      43,515     1,317.0      72.2      00:18:50
 41142       7   4,835      33,845     1,320.6      72.4      00:18:43
 41266       6   4,835      29,010     1,324.7      72.6      00:18:34
 41393      10   4,835      48,350     1,328.7      72.8      00:18:26
 41520       7   4,835      33,845     1,332.9      73.1      00:18:17
 41634       8   4,835      38,680     1,336.7      73.3      00:18:09
 41784       7   4,835      33,845     1,341.6      73.5      00:17:58
 41935       5   4,835      24,175     1,346.7      73.8      00:17:46
 42048       7   4,835      33,845     1,350.0      74.0      00:17:39
 42153       3   4,835      14,505     1,353.2      74.2      00:17:33
 42258       6   4,835      29,010     1,356.4      74.3      00:17:27
 42362       4   4,835      19,340     1,359.7      74.5      00:17:20
 42463       8   4,835      38,680     1,363.2      74.7      00:17:13
 42588       6   4,835      29,010     1,367.0      74.9      00:17:05
 42725       7   4,835      33,845     1,371.4      75.2      00:16:56
 42859       2   4,835       9,670     1,375.8      75.4      00:16:46
 43008       9   4,835      43,515     1,380.7      75.7      00:16:34
 43118      10   4,835      48,350     1,384.6      75.9      00:16:26
 43227      10   4,835      48,350     1,388.2      76.1      00:16:19
 43337       6   4,835      29,010     1,391.8      76.3      00:16:11
 43460       6   4,835      29,010     1,395.8      76.5      00:16:02
 43659      10   4,835      48,350     1,402.0      76.8      00:15:48
 43881       7   4,835      33,845     1,409.3      77.2      00:15:29
 44083       7   4,835      33,845     1,415.7      77.6      00:15:14
 44194       5   4,835      24,175     1,419.3      77.8      00:15:06
 44319       6   4,835      29,010     1,423.1      78.0      00:14:58
 44448       6   4,835      29,010     1,427.1      78.2      00:14:49
 44595       6   4,835      29,010     1,431.9      78.5      00:14:38
 44747       9   4,835      43,515     1,436.8      78.8      00:14:27
 44885       7   4,835      33,845     1,441.3      79.0      00:14:17
 45020      10   4,835      48,350     1,445.6      79.2      00:14:08
 45190       9   4,835      43,515     1,450.8      79.5      00:13:56
 45339       5   4,835      24,175     1,455.1      79.8      00:13:46
 45462       8   4,835      38,680     1,459.1      80.0      00:13:37
 45574      10   4,835      48,350     1,462.5      80.2      00:13:30
 45720      10   4,835      48,350     1,466.8      80.4      00:13:21
 45868       6   4,835      29,010     1,471.4      80.7      00:13:10
 46002       5   4,835      24,175     1,475.9      80.9      00:13:00
 46152       6   4,835      29,010     1,480.9      81.2      00:12:49
 46287      10   4,835      48,350     1,485.4      81.4      00:12:39
 46419       5   4,835      24,175     1,489.5      81.6      00:12:30
 46569       7   4,835      33,845     1,494.5      81.9      00:12:18
 46766       7   4,835      33,845     1,500.9      82.3      00:12:03
 46906       7   4,835      33,845     1,505.5      82.5      00:11:53
 47031       7   4,835      33,845     1,509.0      82.7      00:11:45
 47154       5   4,835      24,175     1,512.6      82.9      00:11:38
 47254       9   4,835      43,515     1,515.8      83.1      00:11:31
 47366      10   4,835      48,350     1,519.3      83.3      00:11:24
 47494       8   4,835      38,680     1,523.1      83.5      00:11:16
 47601       6   4,835      29,010     1,526.5      83.7      00:11:08
 47703       9   4,835      43,515     1,529.9      83.9      00:11:01
 47820       8   4,835      38,680     1,533.5      84.1      00:10:54
 47919       9   4,835      43,515     1,536.8      84.2      00:10:47
 48046      10   4,835      48,350     1,540.9      84.5      00:10:38
 48190       3   4,835      14,505     1,545.3      84.7      00:10:28
 48316       7   4,835      33,845     1,549.6      84.9      00:10:18
 48442       7   4,835      33,845     1,553.6      85.2      00:10:09
 48580       5   4,835      24,175     1,558.1      85.4      00:09:59
 48757       6   4,835      29,010     1,563.7      85.7      00:09:46
 48894       9   4,835      43,515     1,568.1      86.0      00:09:36
 49025       7   4,835      33,845     1,572.3      86.2      00:09:27
 49137      10   4,835      48,350     1,576.2      86.4      00:09:18
 49255       8   4,835      38,680     1,579.9      86.6      00:09:10
 49356       5   4,835      24,175     1,582.9      86.8      00:09:04
 49477       9   4,835      43,515     1,586.6      87.0      00:08:56
 49586       8   4,835      38,680     1,589.7      87.1      00:08:49
 49696       8   4,835      38,680     1,593.1      87.3      00:08:42
 49832       6   4,835      29,010     1,597.2      87.5      00:08:33
 49926       9   4,835      43,515     1,600.2      87.7      00:08:27
 50041       3   4,835      14,505     1,603.9      87.9      00:08:18
 50204       4   4,835      19,340     1,609.0      88.2      00:08:07
 50332       8   4,835      38,680     1,612.7      88.4      00:07:59
 50442       5   4,835      24,175     1,616.2      88.6      00:07:51
 50589       8   4,835      38,680     1,621.0      88.9      00:07:40
 50720       7   4,835      33,845     1,625.3      89.1      00:07:30
 50856       4   4,835      19,340     1,629.8      89.3      00:07:20
 50972       5   4,835      24,175     1,633.8      89.6      00:07:11
 51178       8   4,835      38,680     1,640.4      89.9      00:06:56
 51387       9   4,835      43,515     1,647.3      90.3      00:06:40
 51617       9   4,835      43,515     1,655.0      90.7      00:06:21
 51850       9   4,835      43,515     1,662.8      91.1      00:06:03
 52129       5   4,835      24,175     1,672.4      91.7      00:05:40
 52402       7   4,835      33,845     1,681.8      92.2      00:05:19
 52657       7   4,835      33,845     1,690.9      92.7      00:04:57
 52890       7   4,835      33,845     1,699.0      93.1      00:04:39
 53112       6   4,835      29,010     1,706.4      93.5      00:04:22
 53345      10   4,835      48,350     1,714.2      94.0      00:04:04
 53575       5   4,835      24,175     1,722.0      94.4      00:03:46
 53736       7   4,835      33,845     1,727.3      94.7      00:03:35
 53820       1   4,835       4,835     1,729.9      94.8      00:03:29
 53957       7   4,835      33,845     1,734.3      95.1      00:03:19
 54105       9   4,835      43,515     1,739.1      95.3      00:03:09
 54251       9   4,835      43,515     1,743.8      95.6      00:02:58
 54355       9   4,835      43,515     1,747.1      95.8      00:02:51
 54517       7   4,835      33,845     1,751.7      96.0      00:02:41
 54690       6   4,835      29,010     1,757.4      96.3      00:02:28
 54891       6   4,835      29,010     1,763.7      96.7      00:02:14
 55060      10   4,835      48,350     1,769.1      97.0      00:02:02
 55229       5   4,835      24,175     1,774.4      97.3      00:01:50
 55391       4   4,835      19,340     1,779.1      97.5      00:01:40
 55536       3   4,835      14,505     1,783.5      97.8      00:01:30
 55652       4   4,835      19,340     1,787.4      98.0      00:01:22
 55760       3   4,835      14,505     1,790.9      98.2      00:01:14
 55878       7   4,835      33,845     1,794.8      98.4      00:01:05
 56000       7   4,835      33,845     1,798.8      98.6      00:00:56
 56125       6   4,835      29,010     1,802.8      98.8      00:00:48
 56243       8   4,835      38,680     1,806.8      99.0      00:00:39
 56389      10   4,835      48,350     1,811.8      99.3      00:00:28
 56545      10   4,835      48,350     1,817.0      99.6      00:00:16
 56678      10   4,835      48,350     1,821.4      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 4053.641
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
