
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A700.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A700.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A700.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A700.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   352       8   4,735      37,880         9.6       0.5      00:31:12
   450       4   4,735      18,940        12.2       0.7      00:48:48
   659       6   4,735      28,410        18.2       1.0      00:49:03
  1008       8   4,735      37,880        28.5       1.6      00:41:30
  1345       4   4,735      18,940        39.0       2.2      00:37:36
  1684       7   4,735      33,145        49.7       2.8      00:35:11
  2045       7   4,735      33,145        60.3       3.4      00:33:35
  2396       4   4,735      18,940        71.0       4.0      00:32:23
  2746       6   4,735      28,410        81.7       4.6      00:31:26
  3097       7   4,735      33,145        92.3       5.2      00:30:43
  3433       6   4,735      28,410       103.2       5.8      00:30:00
  3772       6   4,735      28,410       113.8       6.4      00:29:30
  4072       6   4,735      28,410       122.6       6.9      00:29:31
  4343       3   4,735      14,205       130.3       7.3      00:29:45
  4584       7   4,735      33,145       137.8       7.7      00:30:00
  4847       7   4,735      33,145       146.0       8.2      00:30:03
  5116       9   4,735      42,615       154.2       8.6      00:30:05
  5377       6   4,735      28,410       162.5       9.1      00:30:04
  5629       7   4,735      33,145       169.5       9.5      00:30:19
  5868       7   4,735      33,145       176.5       9.9      00:30:29
  6120       4   4,735      18,940       184.5      10.3      00:30:29
  6400       7   4,735      33,145       192.7      10.8      00:30:25
  6674       9   4,735      42,615       200.9      11.2      00:30:20
  6933       9   4,735      42,615       208.8      11.7      00:30:18
  7243       5   4,735      23,675       217.8      12.2      00:30:06
  7545       7   4,735      33,145       227.4      12.7      00:29:48
  7836       6   4,735      28,410       236.4      13.2      00:29:35
  8132       6   4,735      28,410       246.2      13.8      00:29:16
  8433       9   4,735      42,615       256.0      14.3      00:28:58
  8732       9   4,735      42,615       265.6      14.9      00:28:42
  9013       9   4,735      42,615       274.6      15.4      00:28:31
  9263       5   4,735      23,675       282.8      15.8      00:28:26
  9444       8   4,735      37,880       288.6      16.2      00:28:37
  9659       9   4,735      42,615       295.9      16.6      00:28:37
  9913       5   4,735      23,675       303.8      17.0      00:28:32
 10167       6   4,735      28,410       311.2      17.4      00:28:31
 10402       8   4,735      37,880       318.2      17.8      00:28:32
 10670       7   4,735      33,145       326.3      18.3      00:28:24
 10963       6   4,735      28,410       335.4      18.8      00:28:12
 11211       6   4,735      28,410       343.0      19.2      00:28:08
 11415       8   4,735      37,880       349.3      19.6      00:28:11
 11621       8   4,735      37,880       355.6      19.9      00:28:14
 11863       8   4,735      37,880       363.1      20.3      00:28:10
 12092       7   4,735      33,145       370.3      20.7      00:28:07
 12333      10   4,735      47,350       377.7      21.1      00:28:03
 12657       6   4,735      28,410       387.7      21.7      00:27:43
 12983       9   4,735      42,615       397.4      22.2      00:27:27
 13281      10   4,735      47,350       406.7      22.8      00:27:12
 13550      10   4,735      47,350       415.5      23.3      00:27:01
 13769       8   4,735      37,880       422.4      23.6      00:26:59
 13980       8   4,735      37,880       428.9      24.0      00:26:58
 14225       9   4,735      42,615       436.6      24.4      00:26:52
 14475       7   4,735      33,145       444.8      24.9      00:26:43
 14726      10   4,735      47,350       452.5      25.3      00:26:36
 15014       9   4,735      42,615       461.8      25.8      00:26:22
 15324       8   4,735      37,880       471.7      26.4      00:26:05
 15656       8   4,735      37,880       482.0      27.0      00:25:46
 15973       6   4,735      28,410       492.4      27.6      00:25:28
 16283       6   4,735      28,410       502.6      28.1      00:25:11
 16571       3   4,735      14,205       511.8      28.6      00:24:58
 16813       9   4,735      42,615       519.5      29.1      00:24:51
 17037       4   4,735      18,940       526.7      29.5      00:24:47
 17241       9   4,735      42,615       532.9      29.8      00:24:45
 17451      10   4,735      47,350       539.9      30.2      00:24:41
 17664      10   4,735      47,350       547.0      30.6      00:24:36
 17933       7   4,735      33,145       555.2      31.1      00:24:27
 18234       3   4,735      14,205       564.9      31.6      00:24:12
 18533       6   4,735      28,410       574.0      32.1      00:23:60
 18730      10   4,735      47,350       580.6      32.5      00:23:57
 18960       8   4,735      37,880       588.1      32.9      00:23:50
 19186       4   4,735      18,940       595.5      33.3      00:23:44
 19456       7   4,735      33,145       604.2      33.8      00:23:32
 19769       6   4,735      28,410       614.8      34.4      00:23:15
 20073       9   4,735      42,615       625.0      35.0      00:22:59
 20397      10   4,735      47,350       635.2      35.6      00:22:43
 20616       7   4,735      33,145       642.3      36.0      00:22:37
 20826       6   4,735      28,410       649.1      36.3      00:22:32
 21056       8   4,735      37,880       656.3      36.7      00:22:26
 21324       7   4,735      33,145       663.8      37.2      00:22:19
 21561       8   4,735      37,880       671.2      37.6      00:22:12
 21798       7   4,735      33,145       678.0      38.0      00:22:07
 22031       7   4,735      33,145       685.2      38.4      00:22:01
 22295       9   4,735      42,615       692.8      38.8      00:21:53
 22554       3   4,735      14,205       700.5      39.2      00:21:45
 22825       5   4,735      23,675       708.3      39.6      00:21:37
 23139       9   4,735      42,615       718.2      40.2      00:21:22
 23450       6   4,735      28,410       727.7      40.7      00:21:09
 23756       9   4,735      42,615       737.0      41.3      00:20:56
 24063       7   4,735      33,145       746.6      41.8      00:20:43
 24391       8   4,735      37,880       756.0      42.3      00:20:30
 24691       7   4,735      33,145       765.8      42.9      00:20:16
 25000       7   4,735      33,145       775.2      43.4      00:20:03
 25280       6   4,735      28,410       784.1      43.9      00:19:52
 25567      10   4,735      47,350       792.9      44.4      00:19:41
 25762       8   4,735      37,880       799.2      44.7      00:19:36
 25969       7   4,735      33,145       805.7      45.1      00:19:31
 26183       6   4,735      28,410       812.5      45.5      00:19:26
 26381       8   4,735      37,880       818.6      45.8      00:19:22
 26644       8   4,735      37,880       826.6      46.3      00:19:13
 26900       9   4,735      42,615       834.5      46.7      00:19:04
 27124       8   4,735      37,880       841.6      47.1      00:18:57
 27319      10   4,735      47,350       847.6      47.4      00:18:53
 27512       4   4,735      18,940       853.7      47.8      00:18:48
 27757       7   4,735      33,145       861.5      48.2      00:18:39
 27996      10   4,735      47,350       869.2      48.6      00:18:31
 28306       5   4,735      23,675       879.1      49.2      00:18:17
 28599       4   4,735      18,940       888.9      49.8      00:18:03
 28793       8   4,735      37,880       895.2      50.1      00:17:58
 28990       7   4,735      33,145       901.5      50.5      00:17:53
 29227      10   4,735      47,350       908.8      50.9      00:17:45
 29470       7   4,735      33,145       916.8      51.3      00:17:36
 29718      10   4,735      47,350       924.6      51.7      00:17:27
 29912      10   4,735      47,350       930.7      52.1      00:17:22
 30104       9   4,735      42,615       936.8      52.4      00:17:17
 30321       3   4,735      14,205       943.9      52.8      00:17:09
 30559      10   4,735      47,350       951.7      53.3      00:17:00
 30841       8   4,735      37,880       960.8      53.8      00:16:48
 31155       8   4,735      37,880       970.7      54.3      00:16:34
 31450       7   4,735      33,145       980.5      54.9      00:16:21
 31745       8   4,735      37,880       990.2      55.4      00:16:08
 32031       7   4,735      33,145       999.7      56.0      00:15:55
 32315       7   4,735      33,145     1,009.3      56.5      00:15:42
 32531       6   4,735      28,410     1,016.4      56.9      00:15:34
 32702       9   4,735      42,615     1,021.9      57.2      00:15:30
 32887       8   4,735      37,880     1,028.0      57.5      00:15:25
 33083      10   4,735      47,350     1,034.6      57.9      00:15:18
 33314       5   4,735      23,675     1,042.1      58.3      00:15:10
 33559       8   4,735      37,880     1,050.1      58.8      00:14:60
 33807       5   4,735      23,675     1,058.3      59.2      00:14:50
 34052       8   4,735      37,880     1,066.4      59.7      00:14:40
 34314       5   4,735      23,675     1,075.3      60.2      00:14:29
 34615       5   4,735      23,675     1,085.1      60.7      00:14:15
 34910       7   4,735      33,145     1,095.0      61.3      00:14:02
 35223       9   4,735      42,615     1,105.2      61.9      00:13:48
 35519       7   4,735      33,145     1,115.0      62.4      00:13:35
 35824       3   4,735      14,205     1,124.7      63.0      00:13:22
 36115       9   4,735      42,615     1,134.4      63.5      00:13:10
 36422      10   4,735      47,350     1,144.4      64.1      00:12:56
 36657       7   4,735      33,145     1,151.9      64.5      00:12:48
 36839       8   4,735      37,880     1,157.5      64.8      00:12:43
 37052       6   4,735      28,410     1,164.2      65.2      00:12:35
 37288       6   4,735      28,410     1,171.1      65.6      00:12:28
 37510       6   4,735      28,410     1,177.9      65.9      00:12:21
 37729       6   4,735      28,410     1,184.6      66.3      00:12:13
 37925       8   4,735      37,880     1,190.8      66.7      00:12:07
 38149       6   4,735      28,410     1,198.1      67.1      00:11:59
 38376       8   4,735      37,880     1,205.5      67.5      00:11:50
 38637       6   4,735      28,410     1,213.9      67.9      00:11:40
 38937       5   4,735      23,675     1,223.5      68.5      00:11:27
 39119       7   4,735      33,145     1,229.3      68.8      00:11:22
 39343       8   4,735      37,880     1,236.2      69.2      00:11:14
 39570       8   4,735      37,880     1,243.3      69.6      00:11:06
 39835       7   4,735      33,145     1,251.5      70.1      00:10:56
 40165       6   4,735      28,410     1,261.8      70.6      00:10:42
 40480       6   4,735      28,410     1,271.9      71.2      00:10:29
 40782       8   4,735      37,880     1,281.7      71.7      00:10:16
 40991       9   4,735      42,615     1,288.6      72.1      00:10:08
 41173       7   4,735      33,145     1,294.3      72.4      00:10:02
 41433       6   4,735      28,410     1,302.6      72.9      00:09:52
 41679      10   4,735      47,350     1,310.5      73.3      00:09:43
 41917       6   4,735      28,410     1,318.3      73.8      00:09:33
 42126       8   4,735      37,880     1,324.4      74.1      00:09:27
 42340       6   4,735      28,410     1,330.9      74.5      00:09:19
 42564       5   4,735      23,675     1,338.1      74.9      00:09:11
 42783       9   4,735      42,615     1,344.9      75.3      00:09:03
 42988       7   4,735      33,145     1,351.5      75.6      00:08:56
 43193       5   4,735      23,675     1,358.4      76.0      00:08:48
 43396       7   4,735      33,145     1,365.1      76.4      00:08:40
 43664       3   4,735      14,205     1,373.1      76.9      00:08:30
 43950       7   4,735      33,145     1,382.3      77.4      00:08:18
 44176       7   4,735      33,145     1,389.4      77.8      00:08:10
 44355       8   4,735      37,880     1,394.8      78.1      00:08:04
 44590       5   4,735      23,675     1,402.1      78.5      00:07:55
 44836       8   4,735      37,880     1,409.9      78.9      00:07:46
 45067       9   4,735      42,615     1,417.1      79.3      00:07:37
 45311       9   4,735      42,615     1,424.2      79.7      00:07:29
 45505       6   4,735      28,410     1,430.2      80.0      00:07:22
 45741       8   4,735      37,880     1,437.1      80.4      00:07:14
 45967      10   4,735      47,350     1,444.3      80.8      00:07:05
 46198       6   4,735      28,410     1,451.8      81.3      00:06:56
 46437      10   4,735      47,350     1,459.2      81.7      00:06:47
 46709       9   4,735      42,615     1,468.0      82.2      00:06:36
 46940       8   4,735      37,880     1,475.2      82.6      00:06:27
 47138       9   4,735      42,615     1,480.9      82.9      00:06:21
 47318       7   4,735      33,145     1,486.4      83.2      00:06:15
 47521       5   4,735      23,675     1,492.4      83.5      00:06:08
 47730       7   4,735      33,145     1,499.1      83.9      00:05:60
 47933       8   4,735      37,880     1,505.5      84.3      00:05:52
 48125       4   4,735      18,940     1,511.4      84.6      00:05:45
 48320       7   4,735      33,145     1,517.7      84.9      00:05:37
 48550       7   4,735      33,145     1,524.9      85.4      00:05:29
 48796       4   4,735      18,940     1,532.6      85.8      00:05:19
 49005       4   4,735      18,940     1,539.1      86.1      00:05:11
 49207       9   4,735      42,615     1,545.9      86.5      00:05:03
 49424       5   4,735      23,675     1,552.2      86.9      00:04:55
 49646       8   4,735      37,880     1,558.6      87.2      00:04:47
 49871       4   4,735      18,940     1,565.3      87.6      00:04:39
 50094      10   4,735      47,350     1,572.4      88.0      00:04:30
 50300      10   4,735      47,350     1,578.5      88.4      00:04:23
 50504       3   4,735      14,205     1,584.8      88.7      00:04:15
 50686       9   4,735      42,615     1,590.5      89.0      00:04:08
 50878       7   4,735      33,145     1,596.8      89.4      00:04:01
 51102       7   4,735      33,145     1,604.1      89.8      00:03:52
 51321       4   4,735      18,940     1,611.0      90.2      00:03:43
 51547       6   4,735      28,410     1,618.4      90.6      00:03:34
 51768       7   4,735      33,145     1,625.8      91.0      00:03:24
 51984       6   4,735      28,410     1,632.7      91.4      00:03:16
 52261       4   4,735      18,940     1,642.2      91.9      00:03:03
 52548       8   4,735      37,880     1,652.1      92.5      00:02:51
 52829       6   4,735      28,410     1,661.8      93.0      00:02:38
 53125       4   4,735      18,940     1,671.5      93.6      00:02:26
 53413      10   4,735      47,350     1,681.0      94.1      00:02:14
 53690       6   4,735      28,410     1,690.0      94.6      00:02:02
 53908       8   4,735      37,880     1,696.9      95.0      00:01:53
 54118       5   4,735      23,675     1,703.6      95.4      00:01:45
 54334       6   4,735      28,410     1,710.4      95.7      00:01:36
 54621       4   4,735      18,940     1,718.8      96.2      00:01:26
 54903       5   4,735      23,675     1,727.6      96.7      00:01:15
 55158       7   4,735      33,145     1,735.5      97.1      00:01:05
 55421      10   4,735      47,350     1,743.3      97.6      00:00:55
 55669       6   4,735      28,410     1,751.0      98.0      00:00:45
 55902       4   4,735      18,940     1,758.5      98.4      00:00:36
 56130       9   4,735      42,615     1,765.7      98.8      00:00:26
 56353       8   4,735      37,880     1,773.2      99.2      00:00:17
 56655       6   4,735      28,410     1,783.0      99.8      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 2266.075
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A700.csv saved

. 
. cap log close

. 
end of do-file
