
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A1000.dta /export/storage_covidvaccine/Result/MN
> L_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_
> 5_4q_mnl_A1000.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A1000.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A1000.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   295       2   5,035      10,070         8.5       0.4      00:37:06
   624       7   5,035      35,245        18.3       1.0      00:34:14
   967      10   5,035      50,350        29.0       1.5      00:32:21
  1303      10   5,035      50,350        40.0       2.1      00:31:02
  1641       5   5,035      25,175        51.3       2.7      00:30:06
  1983       6   5,035      30,210        62.2       3.3      00:29:37
  2337       3   5,035      15,105        73.5       3.9      00:29:02
  2695       7   5,035      35,245        85.0       4.5      00:28:31
  3054       7   5,035      35,245        96.7       5.1      00:28:02
  3400       8   5,035      40,280       108.6       5.7      00:27:33
  3765       6   5,035      30,210       120.8       6.4      00:27:03
  4059       9   5,035      45,315       129.9       6.8      00:27:17
  4331       5   5,035      25,175       138.2       7.3      00:27:39
  4594      10   5,035      50,350       146.9       7.7      00:27:53
  4863       8   5,035      40,280       155.8       8.2      00:28:02
  5129       8   5,035      40,280       164.4       8.7      00:28:12
  5365       7   5,035      35,245       172.4       9.1      00:28:27
  5632       9   5,035      45,315       180.3       9.5      00:28:40
  5889       4   5,035      20,140       188.4       9.9      00:28:49
  6159       3   5,035      15,105       197.3      10.4      00:28:49
  6412      10   5,035      50,350       205.3      10.8      00:28:56
  6665       6   5,035      30,210       213.3      11.2      00:29:03
  6916       6   5,035      30,210       221.5      11.7      00:29:06
  7227      10   5,035      50,350       231.1      12.2      00:28:56
  7534       4   5,035      20,140       241.4      12.7      00:28:41
  7836       6   5,035      30,210       251.4      13.2      00:28:28
  8137       7   5,035      35,245       262.0      13.8      00:28:11
  8340       8   5,035      40,280       269.0      14.2      00:28:20
  8528       7   5,035      35,245       275.5      14.5      00:28:33
  8651       6   5,035      30,210       279.6      14.7      00:29:02
  8803       9   5,035      45,315       284.8      15.0      00:29:22
  8927       6   5,035      30,210       289.1      15.2      00:29:47
  9038       3   5,035      15,105       292.8      15.4      00:30:15
  9190       4   5,035      20,140       298.2      15.7      00:30:31
  9322       9   5,035      45,315       302.7      15.9      00:30:51
  9409       5   5,035      25,175       305.7      16.1      00:31:22
  9544       9   5,035      45,315       310.5      16.3      00:31:39
  9714       6   5,035      30,210       316.5      16.7      00:31:45
  9853       7   5,035      35,245       321.1      16.9      00:32:02
  9999       7   5,035      35,245       325.9      17.2      00:32:17
 10149       4   5,035      20,140       330.3      17.4      00:32:33
 10280      10   5,035      50,350       334.4      17.6      00:32:52
 10406       9   5,035      45,315       338.5      17.8      00:33:08
 10532      10   5,035      50,350       342.6      18.0      00:33:25
 10667       8   5,035      40,280       347.0      18.3      00:33:39
 10805       4   5,035      20,140       351.3      18.5      00:33:53
 10948      10   5,035      50,350       356.1      18.7      00:34:03
 11103       5   5,035      25,175       361.1      19.0      00:34:11
 11205       7   5,035      35,245       364.5      19.2      00:34:29
 11305       7   5,035      35,245       367.7      19.4      00:34:49
 11410       8   5,035      40,280       371.3      19.5      00:35:05
 11535       3   5,035      15,105       375.3      19.8      00:35:18
 11656       6   5,035      30,210       379.3      20.0      00:35:31
 11781      10   5,035      50,350       383.4      20.2      00:35:42
 11903       9   5,035      45,315       387.4      20.4      00:35:53
 12020      10   5,035      50,350       391.3      20.6      00:36:05
 12118       7   5,035      35,245       394.7      20.8      00:36:20
 12243      10   5,035      50,350       398.7      21.0      00:36:29
 12433       7   5,035      35,245       404.8      21.3      00:36:25
 12652       4   5,035      20,140       412.1      21.7      00:36:12
 12890       8   5,035      40,280       419.5      22.1      00:35:58
 13104      10   5,035      50,350       426.6      22.5      00:35:47
 13304       4   5,035      20,140       433.2      22.8      00:35:39
 13495       4   5,035      20,140       440.0      23.2      00:35:29
 13626      10   5,035      50,350       444.6      23.4      00:35:33
 13737      10   5,035      50,350       448.2      23.6      00:35:44
 13870       6   5,035      30,210       452.5      23.8      00:35:49
 13986       6   5,035      30,210       456.3      24.0      00:35:57
 14127       9   5,035      45,315       460.9      24.3      00:36:00
 14272       8   5,035      40,280       465.9      24.5      00:36:01
 14408       6   5,035      30,210       470.5      24.8      00:36:03
 14562       5   5,035      25,175       475.8      25.0      00:36:01
 14679       7   5,035      35,245       479.6      25.2      00:36:08
 14806       8   5,035      40,280       483.9      25.5      00:36:12
 14985       5   5,035      25,175       490.0      25.8      00:36:04
 15184      10   5,035      50,350       497.0      26.2      00:35:52
 15366       5   5,035      25,175       503.1      26.5      00:35:45
 15559       6   5,035      30,210       509.3      26.8      00:35:36
 15750       7   5,035      35,245       515.9      27.2      00:35:26
 15934       4   5,035      20,140       522.3      27.5      00:35:17
 16136       8   5,035      40,280       529.4      27.9      00:35:03
 16334       6   5,035      30,210       536.2      28.2      00:34:52
 16501       8   5,035      40,280       542.0      28.5      00:34:45
 16632       9   5,035      45,315       546.2      28.7      00:34:48
 16755       4   5,035      20,140       550.4      29.0      00:34:50
 16878       7   5,035      35,245       554.5      29.2      00:34:53
 16992       7   5,035      35,245       558.4      29.4      00:34:56
 17113       9   5,035      45,315       562.4      29.6      00:34:59
 17218      10   5,035      50,350       565.9      29.8      00:35:05
 17337       7   5,035      35,245       570.2      30.0      00:35:06
 17455       8   5,035      40,280       574.3      30.2      00:35:08
 17571      10   5,035      50,350       578.5      30.4      00:35:09
 17710      10   5,035      50,350       583.1      30.7      00:35:07
 17820       5   5,035      25,175       586.6      30.9      00:35:12
 17964       7   5,035      35,245       591.4      31.1      00:35:09
 18146       9   5,035      45,315       597.8      31.5      00:34:59
 18334       5   5,035      25,175       604.1      31.8      00:34:48
 18512       4   5,035      20,140       609.6      32.1      00:34:41
 18618       8   5,035      40,280       613.4      32.3      00:34:44
 18730      10   5,035      50,350       617.3      32.5      00:34:45
 18834       9   5,035      45,315       620.8      32.7      00:34:49
 18945       4   5,035      20,140       624.8      32.9      00:34:49
 19072       4   5,035      20,140       629.2      33.1      00:34:48
 19178       7   5,035      35,245       632.9      33.3      00:34:49
 19339       6   5,035      30,210       638.4      33.6      00:34:43
 19551       8   5,035      40,280       645.9      34.0      00:34:25
 19767       6   5,035      30,210       653.6      34.4      00:34:08
 19951       9   5,035      45,315       660.1      34.7      00:33:56
 20134       7   5,035      35,245       666.5      35.1      00:33:44
 20344       9   5,035      45,315       673.6      35.5      00:33:30
 20501       8   5,035      40,280       679.0      35.7      00:33:23
 20621       5   5,035      25,175       683.2      36.0      00:33:22
 20757       7   5,035      35,245       687.8      36.2      00:33:19
 20870       9   5,035      45,315       691.7      36.4      00:33:18
 21023      10   5,035      50,350       696.8      36.7      00:33:13
 21171       6   5,035      30,210       701.5      36.9      00:33:09
 21326       7   5,035      35,245       705.9      37.2      00:33:06
 21475       9   5,035      45,315       711.0      37.4      00:33:00
 21620       6   5,035      30,210       715.5      37.7      00:32:57
 21756       5   5,035      25,175       719.6      37.9      00:32:56
 21874       5   5,035      25,175       723.6      38.1      00:32:54
 22019       6   5,035      30,210       728.2      38.3      00:32:50
 22162       7   5,035      35,245       732.4      38.6      00:32:48
 22278       6   5,035      30,210       736.2      38.7      00:32:48
 22406       5   5,035      25,175       740.1      39.0      00:32:46
 22533      10   5,035      50,350       744.2      39.2      00:32:44
 22662       7   5,035      35,245       748.5      39.4      00:32:41
 22781       3   5,035      15,105       751.9      39.6      00:32:42
 22943       8   5,035      40,280       757.1      39.9      00:32:35
 23106       8   5,035      40,280       762.6      40.1      00:32:26
 23282       9   5,035      45,315       768.6      40.5      00:32:16
 23460       8   5,035      40,280       774.1      40.7      00:32:07
 23645      10   5,035      50,350       779.9      41.1      00:31:57
 23829      10   5,035      50,350       786.2      41.4      00:31:45
 24031       8   5,035      40,280       792.8      41.7      00:31:32
 24224       6   5,035      30,210       798.9      42.1      00:31:21
 24416       7   5,035      35,245       804.8      42.4      00:31:11
 24596       6   5,035      30,210       811.0      42.7      00:30:60
 24761       6   5,035      30,210       816.5      43.0      00:30:52
 24935       7   5,035      35,245       822.0      43.3      00:30:43
 25132      10   5,035      50,350       828.9      43.6      00:30:29
 25335       5   5,035      25,175       835.6      44.0      00:30:16
 25520       6   5,035      30,210       841.9      44.3      00:30:04
 25664       9   5,035      45,315       846.4      44.5      00:29:59
 25785       7   5,035      35,245       850.7      44.8      00:29:55
 25895       8   5,035      40,280       854.4      45.0      00:29:53
 26010       7   5,035      35,245       858.2      45.2      00:29:51
 26141       8   5,035      40,280       862.5      45.4      00:29:47
 26284       8   5,035      40,280       867.5      45.7      00:29:40
 26457       5   5,035      25,175       873.0      45.9      00:29:31
 26625       6   5,035      30,210       878.3      46.2      00:29:23
 26750       9   5,035      45,315       882.5      46.4      00:29:19
 26905       8   5,035      40,280       887.6      46.7      00:29:12
 27045       9   5,035      45,315       892.3      47.0      00:29:06
 27179       7   5,035      35,245       896.7      47.2      00:29:01
 27306       2   5,035      10,070       900.9      47.4      00:28:57
 27449       9   5,035      45,315       905.6      47.7      00:28:50
 27551       9   5,035      45,315       909.1      47.8      00:28:49
 27678       6   5,035      30,210       913.4      48.1      00:28:44
 27783       9   5,035      45,315       917.0      48.3      00:28:42
 27900       9   5,035      45,315       921.0      48.5      00:28:38
 28096       4   5,035      20,140       927.7      48.8      00:28:24
 28279       7   5,035      35,245       933.9      49.2      00:28:12
 28419       9   5,035      45,315       938.7      49.4      00:28:06
 28570      10   5,035      50,350       944.2      49.7      00:27:56
 28693       5   5,035      25,175       948.3      49.9      00:27:52
 28786       7   5,035      35,245       951.6      50.1      00:27:51
 28881       7   5,035      35,245       954.9      50.3      00:27:49
 29002      10   5,035      50,350       959.1      50.5      00:27:44
 29104      10   5,035      50,350       962.5      50.7      00:27:42
 29243      10   5,035      50,350       967.0      50.9      00:27:36
 29366       9   5,035      45,315       971.3      51.1      00:27:31
 29517       8   5,035      40,280       976.3      51.4      00:27:23
 29684       9   5,035      45,315       981.9      51.7      00:27:13
 29808       4   5,035      20,140       986.2      51.9      00:27:08
 29938       2   5,035      10,070       990.5      52.1      00:27:02
 30057       8   5,035      40,280       994.6      52.4      00:26:57
 30156       6   5,035      30,210       998.1      52.5      00:26:55
 30269      10   5,035      50,350     1,001.9      52.7      00:26:51
 30372       6   5,035      30,210     1,005.3      52.9      00:26:48
 30479       8   5,035      40,280     1,009.3      53.1      00:26:43
 30631       9   5,035      45,315     1,014.4      53.4      00:26:35
 30822       6   5,035      30,210     1,021.1      53.7      00:26:21
 31029      10   5,035      50,350     1,027.8      54.1      00:26:07
 31228       6   5,035      30,210     1,034.8      54.5      00:25:53
 31416       7   5,035      35,245     1,041.4      54.8      00:25:39
 31604       7   5,035      35,245     1,047.9      55.2      00:25:26
 31763       7   5,035      35,245     1,053.5      55.5      00:25:16
 31944       9   5,035      45,315     1,060.0      55.8      00:25:03
 32143       2   5,035      10,070     1,067.0      56.2      00:24:49
 32300       7   5,035      35,245     1,072.6      56.5      00:24:39
 32465       6   5,035      30,210     1,078.7      56.8      00:24:27
 32557       6   5,035      30,210     1,081.7      56.9      00:24:26
 32644       5   5,035      25,175     1,084.6      57.1      00:24:24
 32772       6   5,035      30,210     1,089.2      57.3      00:24:17
 32873       7   5,035      35,245     1,092.6      57.5      00:24:14
 32982      10   5,035      50,350     1,096.5      57.7      00:24:09
 33102      10   5,035      50,350     1,100.8      57.9      00:24:03
 33186       8   5,035      40,280     1,103.6      58.1      00:24:02
 33298       9   5,035      45,315     1,107.5      58.3      00:23:56
 33465       9   5,035      45,315     1,113.2      58.6      00:23:46
 33591      10   5,035      50,350     1,117.9      58.8      00:23:39
 33753       8   5,035      40,280     1,123.5      59.1      00:23:28
 33908       7   5,035      35,245     1,128.9      59.4      00:23:19
 34017      10   5,035      50,350     1,132.7      59.6      00:23:14
 34137       9   5,035      45,315     1,137.1      59.9      00:23:07
 34308       7   5,035      35,245     1,143.2      60.2      00:22:55
 34518       8   5,035      40,280     1,150.5      60.6      00:22:40
 34707      10   5,035      50,350     1,157.1      60.9      00:22:27
 34875       6   5,035      30,210     1,163.1      61.2      00:22:16
 35100       7   5,035      35,245     1,170.8      61.6      00:21:59
 35295      10   5,035      50,350     1,177.8      62.0      00:21:45
 35466       6   5,035      30,210     1,183.7      62.3      00:21:34
 35669       5   5,035      25,175     1,190.6      62.7      00:21:20
 35884       6   5,035      30,210     1,198.1      63.1      00:21:04
 36080       9   5,035      45,315     1,204.9      63.4      00:20:51
 36265       5   5,035      25,175     1,211.4      63.8      00:20:38
 36513       8   5,035      40,280     1,219.9      64.2      00:20:20
 36631       8   5,035      40,280     1,224.1      64.4      00:20:14
 36773       8   5,035      40,280     1,228.6      64.7      00:20:07
 36874       8   5,035      40,280     1,232.1      64.9      00:20:02
 36987       6   5,035      30,210     1,235.8      65.0      00:19:58
 37107       6   5,035      30,210     1,239.8      65.3      00:19:52
 37258       3   5,035      15,105     1,244.5      65.5      00:19:44
 37388       4   5,035      20,140     1,248.6      65.7      00:19:38
 37525       6   5,035      30,210     1,253.0      66.0      00:19:31
 37652       5   5,035      25,175     1,257.2      66.2      00:19:25
 37788       8   5,035      40,280     1,261.6      66.4      00:19:18
 37959      10   5,035      50,350     1,267.4      66.7      00:19:07
 38161       6   5,035      30,210     1,274.4      67.1      00:18:53
 38329       9   5,035      45,315     1,280.2      67.4      00:18:43
 38502       8   5,035      40,280     1,286.3      67.7      00:18:31
 38779       7   5,035      35,245     1,295.6      68.2      00:18:11
 38984       5   5,035      25,175     1,302.7      68.6      00:17:57
 39158      10   5,035      50,350     1,308.4      68.9      00:17:47
 39340       5   5,035      25,175     1,314.5      69.2      00:17:35
 39534       9   5,035      45,315     1,320.8      69.5      00:17:23
 39714       6   5,035      30,210     1,326.6      69.8      00:17:12
 39940      10   5,035      50,350     1,334.3      70.2      00:16:57
 40163       9   5,035      45,315     1,341.7      70.6      00:16:42
 40423      10   5,035      50,350     1,350.6      71.1      00:16:24
 40698       8   5,035      40,280     1,360.0      71.6      00:16:04
 40954       7   5,035      35,245     1,368.9      72.1      00:15:46
 41130       4   5,035      20,140     1,374.8      72.4      00:15:36
 41279       6   5,035      30,210     1,379.9      72.6      00:15:27
 41502       6   5,035      30,210     1,387.5      73.0      00:15:12
 41722       9   5,035      45,315     1,395.0      73.4      00:14:57
 41925       5   5,035      25,175     1,402.1      73.8      00:14:44
 42054       7   5,035      35,245     1,406.1      74.0      00:14:38
 42235       6   5,035      30,210     1,411.8      74.3      00:14:28
 42411       6   5,035      30,210     1,417.9      74.6      00:14:17
 42583      10   5,035      50,350     1,423.4      74.9      00:14:07
 42757       7   5,035      35,245     1,429.2      75.2      00:13:56
 42933       7   5,035      35,245     1,435.2      75.5      00:13:46
 43077       6   5,035      30,210     1,440.3      75.8      00:13:37
 43173       5   5,035      25,175     1,443.7      76.0      00:13:32
 43315       6   5,035      30,210     1,448.6      76.3      00:13:24
 43463       7   5,035      35,245     1,453.7      76.5      00:13:15
 43714       3   5,035      15,105     1,461.8      76.9      00:12:59
 43995       5   5,035      25,175     1,471.3      77.4      00:12:40
 44190       8   5,035      40,280     1,477.9      77.8      00:12:28
 44351       5   5,035      25,175     1,483.0      78.1      00:12:19
 44527      10   5,035      50,350     1,488.9      78.4      00:12:09
 44690      10   5,035      50,350     1,494.3      78.7      00:11:59
 44891       8   5,035      40,280     1,501.2      79.0      00:11:46
 45080      10   5,035      50,350     1,507.4      79.3      00:11:35
 45343       6   5,035      30,210     1,515.4      79.8      00:11:20
 45508       8   5,035      40,280     1,520.9      80.1      00:11:10
 45695       7   5,035      35,245     1,526.7      80.4      00:10:60
 45867       5   5,035      25,175     1,532.2      80.7      00:10:50
 46046       7   5,035      35,245     1,538.4      81.0      00:10:39
 46228       7   5,035      35,245     1,544.8      81.3      00:10:28
 46409      10   5,035      50,350     1,550.8      81.6      00:10:17
 46546      10   5,035      50,350     1,555.5      81.9      00:10:09
 46709       9   5,035      45,315     1,561.0      82.2      00:09:59
 46885       5   5,035      25,175     1,567.1      82.5      00:09:48
 47032       6   5,035      30,210     1,571.4      82.7      00:09:41
 47181       9   5,035      45,315     1,576.0      83.0      00:09:33
 47356       7   5,035      35,245     1,581.8      83.3      00:09:23
 47524       6   5,035      30,210     1,587.1      83.5      00:09:14
 47695       9   5,035      45,315     1,592.9      83.8      00:09:04
 47890       7   5,035      35,245     1,599.3      84.2      00:08:52
 48062       9   5,035      45,315     1,605.1      84.5      00:08:42
 48235      10   5,035      50,350     1,610.8      84.8      00:08:32
 48485       6   5,035      30,210     1,619.3      85.2      00:08:16
 48772       9   5,035      45,315     1,629.0      85.7      00:07:57
 49001      10   5,035      50,350     1,636.5      86.1      00:07:44
 49237       5   5,035      25,175     1,644.6      86.6      00:07:29
 49490       7   5,035      35,245     1,652.7      87.0      00:07:14
 49772       8   5,035      40,280     1,661.4      87.4      00:06:58
 50036       6   5,035      30,210     1,670.1      87.9      00:06:42
 50320       7   5,035      35,245     1,679.1      88.4      00:06:25
 50578       4   5,035      20,140     1,687.7      88.8      00:06:10
 50855       9   5,035      45,315     1,697.2      89.3      00:05:52
 51126       6   5,035      30,210     1,706.5      89.8      00:05:35
 51411       7   5,035      35,245     1,716.2      90.3      00:05:18
 51690       5   5,035      25,175     1,726.1      90.9      00:05:00
 51981       9   5,035      45,315     1,736.1      91.4      00:04:42
 52311       6   5,035      30,210     1,748.0      92.0      00:04:21
 52624       8   5,035      40,280     1,759.6      92.6      00:03:60
 52990       7   5,035      35,245     1,772.8      93.3      00:03:37
 53376       5   5,035      25,175     1,786.1      94.0      00:03:13
 53720       9   5,035      45,315     1,798.1      94.6      00:02:52
 54003       8   5,035      40,280     1,807.6      95.1      00:02:36
 54271       9   5,035      45,315     1,816.7      95.6      00:02:20
 54618       7   5,035      35,245     1,827.6      96.2      00:02:01
 54958      10   5,035      50,350     1,838.9      96.8      00:01:42
 55253       7   5,035      35,245     1,848.5      97.3      00:01:26
 55523       3   5,035      15,105     1,856.9      97.7      00:01:12
 55797       6   5,035      30,210     1,866.1      98.2      00:00:56
 56086       7   5,035      35,245     1,876.1      98.8      00:00:39
 56375       6   5,035      30,210     1,886.2      99.3      00:00:23
 56654      10   5,035      50,350     1,896.0      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 3151.888
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A1000.csv saved

. 
. cap log close

. 
end of do-file
