
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A1000.dta /export/storage_covidvaccine/Result/MN
> L_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_
> 5_4q_mnl_A1000.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   277       8   5,035      40,280         8.0       0.4      00:39:27
   628       7   5,035      35,245        18.5       1.0      00:33:56
   920       5   5,035      25,175        27.4       1.4      00:34:13
  1204       4   5,035      20,140        36.7       1.9      00:33:53
  1578       6   5,035      30,210        49.2       2.6      00:31:21
  1908       4   5,035      20,140        59.6       3.1      00:30:54
  2211       7   5,035      35,245        69.6       3.7      00:30:43
  2534      10   5,035      50,350        79.7       4.2      00:30:30
  2866       6   5,035      30,210        90.8       4.8      00:29:55
  3144       8   5,035      40,280        99.9       5.3      00:30:06
  3428      10   5,035      50,350       109.7       5.8      00:29:59
  3709      10   5,035      50,350       118.9       6.3      00:30:01
  3989       7   5,035      35,245       127.6       6.7      00:30:08
  4259       4   5,035      20,140       136.1       7.2      00:30:17
  4526       6   5,035      30,210       144.5       7.6      00:30:25
  4743       5   5,035      25,175       152.0       8.0      00:30:43
  4974       8   5,035      40,280       159.5       8.4      00:30:58
  5197      10   5,035      50,350       166.8       8.8      00:31:14
  5398       8   5,035      40,280       173.5       9.1      00:31:34
  5613       8   5,035      40,280       179.7       9.5      00:31:58
  5820       9   5,035      45,315       186.3       9.8      00:32:15
  6078       6   5,035      30,210       194.8      10.3      00:32:09
  6330       7   5,035      35,245       202.6      10.7      00:32:10
  6528       8   5,035      40,280       209.0      11.0      00:32:25
  6739      10   5,035      50,350       215.6      11.4      00:32:36
  6950       4   5,035      20,140       222.5      11.7      00:32:44
  7210       5   5,035      25,175       230.5      12.1      00:32:39
  7476       6   5,035      30,210       239.5      12.6      00:32:24
  7687       6   5,035      30,210       246.3      13.0      00:32:30
  7977       7   5,035      35,245       256.5      13.5      00:32:06
  8291       9   5,035      45,315       267.2      14.1      00:31:38
  8583       9   5,035      45,315       277.4      14.6      00:31:16
  8878       5   5,035      25,175       287.4      15.1      00:30:55
  9175       7   5,035      35,245       297.7      15.7      00:30:33
  9405       8   5,035      40,280       305.5      16.1      00:30:30
  9631       9   5,035      45,315       313.6      16.5      00:30:24
  9792       4   5,035      20,140       319.2      16.8      00:30:36
 10043       8   5,035      40,280       327.2      17.2      00:30:30
 10288      10   5,035      50,350       334.6      17.6      00:30:28
 10557       8   5,035      40,280       343.4      18.1      00:30:17
 10818       7   5,035      35,245       351.7      18.5      00:30:08
 11063       7   5,035      35,245       359.8      18.9      00:30:01
 11240       9   5,035      45,315       365.6      19.2      00:30:08
 11390      10   5,035      50,350       370.6      19.5      00:30:19
 11572      10   5,035      50,350       376.5      19.8      00:30:25
 11762       6   5,035      30,210       382.7      20.1      00:30:27
 11985       8   5,035      40,280       390.1      20.5      00:30:23
 12203       8   5,035      40,280       397.5      20.9      00:30:18
 12466       8   5,035      40,280       405.9      21.4      00:30:07
 12788       7   5,035      35,245       416.3      21.9      00:29:45
 13109       8   5,035      40,280       426.8      22.5      00:29:24
 13373       9   5,035      45,315       435.5      22.9      00:29:12
 13636      10   5,035      50,350       444.9      23.4      00:28:57
 13842       9   5,035      45,315       451.6      23.8      00:28:55
 14122       6   5,035      30,210       460.7      24.3      00:28:42
 14435       5   5,035      25,175       471.5      24.8      00:28:20
 14746       5   5,035      25,175       481.8      25.4      00:28:01
 15000       9   5,035      45,315       490.5      25.8      00:27:50
 15253       8   5,035      40,280       499.2      26.3      00:27:39
 15529       7   5,035      35,245       508.4      26.8      00:27:25
 15787       7   5,035      35,245       517.1      27.2      00:27:14
 16022      10   5,035      50,350       525.4      27.7      00:27:05
 16291       8   5,035      40,280       534.7      28.1      00:26:52
 16543       8   5,035      40,280       543.4      28.6      00:26:41
 16699       7   5,035      35,245       548.6      28.9      00:26:44
 16863       6   5,035      30,210       554.0      29.2      00:26:47
 17000      10   5,035      50,350       558.8      29.4      00:26:52
 17107       7   5,035      35,245       562.2      29.6      00:27:01
 17214       4   5,035      20,140       565.8      29.8      00:27:11
 17350       6   5,035      30,210       570.6      30.0      00:27:14
 17500       5   5,035      25,175       576.0      30.3      00:27:15
 17649       8   5,035      40,280       581.1      30.6      00:27:18
 17809       9   5,035      45,315       586.2      30.9      00:27:20
 17979      10   5,035      50,350       591.9      31.2      00:27:19
 18224       5   5,035      25,175       600.5      31.6      00:27:07
 18493       7   5,035      35,245       609.0      32.1      00:26:55
 18628       9   5,035      45,315       613.8      32.3      00:26:57
 18757       9   5,035      45,315       618.3      32.5      00:27:01
 18893       7   5,035      35,245       622.9      32.8      00:27:03
 19010       7   5,035      35,245       627.1      33.0      00:27:07
 19125      10   5,035      50,350       631.1      33.2      00:27:12
 19260      10   5,035      50,350       635.7      33.5      00:27:15
 19511       6   5,035      30,210       644.6      33.9      00:27:01
 19764       9   5,035      45,315       653.5      34.4      00:26:46
 19971       9   5,035      45,315       660.8      34.8      00:26:38
 20178       8   5,035      40,280       668.1      35.2      00:26:29
 20421       5   5,035      25,175       676.2      35.6      00:26:18
 20572       7   5,035      35,245       681.5      35.9      00:26:17
 20737       5   5,035      25,175       687.1      36.2      00:26:15
 20899       5   5,035      25,175       692.8      36.5      00:26:12
 21092       4   5,035      20,140       699.0      36.8      00:26:07
 21249       7   5,035      35,245       703.7      37.0      00:26:08
 21402       7   5,035      35,245       708.5      37.3      00:26:08
 21555       9   5,035      45,315       713.6      37.6      00:26:07
 21740       5   5,035      25,175       719.1      37.9      00:26:04
 21906       6   5,035      30,210       724.6      38.1      00:26:01
 22091       7   5,035      35,245       730.2      38.4      00:25:58
 22267      10   5,035      50,350       735.8      38.7      00:25:55
 22413       8   5,035      40,280       740.4      39.0      00:25:54
 22570       8   5,035      40,280       745.4      39.2      00:25:53
 22721       8   5,035      40,280       750.2      39.5      00:25:52
 22952       8   5,035      40,280       757.4      39.9      00:25:43
 23173       8   5,035      40,280       764.8      40.3      00:25:33
 23421       8   5,035      40,280       773.0      40.7      00:25:20
 23717       7   5,035      35,245       782.3      41.2      00:25:04
 23953       7   5,035      35,245       790.2      41.6      00:24:52
 24241       8   5,035      40,280       799.4      42.1      00:24:37
 24500       6   5,035      30,210       807.7      42.5      00:24:24
 24683       8   5,035      40,280       814.0      42.8      00:24:18
 24939       5   5,035      25,175       822.2      43.3      00:24:06
 25172       9   5,035      45,315       830.2      43.7      00:23:54
 25422       6   5,035      30,210       838.5      44.1      00:23:41
 25608      10   5,035      50,350       844.4      44.4      00:23:36
 25713       8   5,035      40,280       848.1      44.6      00:23:37
 25849       6   5,035      30,210       852.8      44.9      00:23:36
 25997       8   5,035      40,280       857.7      45.1      00:23:33
 26180      10   5,035      50,350       863.9      45.5      00:23:27
 26363       3   5,035      15,105       869.9      45.8      00:23:21
 26550       4   5,035      20,140       876.0      46.1      00:23:15
 26742       8   5,035      40,280       882.2      46.4      00:23:08
 26937       9   5,035      45,315       888.7      46.8      00:23:00
 27141       5   5,035      25,175       895.5      47.1      00:22:52
 27323       7   5,035      35,245       901.5      47.5      00:22:46
 27524       9   5,035      45,315       908.2      47.8      00:22:38
 27729       7   5,035      35,245       915.1      48.2      00:22:29
 27947       8   5,035      40,280       922.6      48.6      00:22:18
 28178       7   5,035      35,245       930.4      49.0      00:22:07
 28396       6   5,035      30,210       937.9      49.4      00:21:56
 28590       6   5,035      30,210       944.9      49.7      00:21:47
 28727       6   5,035      30,210       949.6      50.0      00:21:44
 28869       8   5,035      40,280       954.5      50.2      00:21:41
 29047       8   5,035      40,280       960.6      50.6      00:21:34
 29226       8   5,035      40,280       966.3      50.9      00:21:28
 29371       8   5,035      40,280       971.5      51.1      00:21:24
 29524       9   5,035      45,315       976.6      51.4      00:21:20
 29701       6   5,035      30,210       982.5      51.7      00:21:13
 29850       9   5,035      45,315       987.6      52.0      00:21:09
 30029       8   5,035      40,280       993.7      52.3      00:21:02
 30186       7   5,035      35,245       999.1      52.6      00:20:57
 30315       7   5,035      35,245     1,003.4      52.8      00:20:54
 30438       7   5,035      35,245     1,007.8      53.0      00:20:51
 30608       7   5,035      35,245     1,013.6      53.4      00:20:45
 30831       6   5,035      30,210     1,021.4      53.8      00:20:33
 31080       7   5,035      35,245     1,029.6      54.2      00:20:20
 31331       6   5,035      30,210     1,038.4      54.7      00:20:06
 31529      10   5,035      50,350     1,045.3      55.0      00:19:57
 31721       6   5,035      30,210     1,052.0      55.4      00:19:48
 31936       5   5,035      25,175     1,059.7      55.8      00:19:37
 32127       7   5,035      35,245     1,066.4      56.1      00:19:28
 32328       8   5,035      40,280     1,073.7      56.5      00:19:17
 32497       8   5,035      40,280     1,079.7      56.8      00:19:10
 32640      10   5,035      50,350     1,084.5      57.1      00:19:06
 32805       5   5,035      25,175     1,090.3      57.4      00:18:59
 32973       9   5,035      45,315     1,096.2      57.7      00:18:52
 33091       7   5,035      35,245     1,100.4      57.9      00:18:49
 33230       5   5,035      25,175     1,105.1      58.2      00:18:45
 33372       8   5,035      40,280     1,110.1      58.4      00:18:40
 33511       6   5,035      30,210     1,115.0      58.7      00:18:35
 33640       5   5,035      25,175     1,119.5      58.9      00:18:31
 33788       9   5,035      45,315     1,124.7      59.2      00:18:26
 33924       7   5,035      35,245     1,129.5      59.5      00:18:21
 34054       7   5,035      35,245     1,134.1      59.7      00:18:17
 34181       7   5,035      35,245     1,138.7      59.9      00:18:13
 34356       7   5,035      35,245     1,144.9      60.3      00:18:04
 34539      10   5,035      50,350     1,151.2      60.6      00:17:56
 34726       7   5,035      35,245     1,157.8      60.9      00:17:47
 34921       9   5,035      45,315     1,164.7      61.3      00:17:37
 35134       7   5,035      35,245     1,172.1      61.7      00:17:26
 35343       6   5,035      30,210     1,179.4      62.1      00:17:15
 35560       6   5,035      30,210     1,186.9      62.5      00:17:04
 35754       5   5,035      25,175     1,193.6      62.8      00:16:55
 35973      10   5,035      50,350     1,201.2      63.2      00:16:43
 36113       3   5,035      15,105     1,206.1      63.5      00:16:38
 36315       5   5,035      25,175     1,213.2      63.9      00:16:28
 36502       9   5,035      45,315     1,219.5      64.2      00:16:19
 36612       6   5,035      30,210     1,223.4      64.4      00:16:16
 36729       8   5,035      40,280     1,227.2      64.6      00:16:13
 36848       8   5,035      40,280     1,231.2      64.8      00:16:09
 36993       2   5,035      10,070     1,236.0      65.1      00:16:04
 37118       7   5,035      35,245     1,240.2      65.3      00:16:00
 37252       6   5,035      30,210     1,244.3      65.5      00:15:56
 37380       9   5,035      45,315     1,248.4      65.7      00:15:52
 37503       7   5,035      35,245     1,252.3      65.9      00:15:49
 37644       3   5,035      15,105     1,257.0      66.2      00:15:44
 37802       6   5,035      30,210     1,262.1      66.4      00:15:37
 37961      10   5,035      50,350     1,267.4      66.7      00:15:31
 38138       9   5,035      45,315     1,273.6      67.0      00:15:22
 38261       7   5,035      35,245     1,277.8      67.3      00:15:18
 38405      10   5,035      50,350     1,283.0      67.5      00:15:11
 38568       7   5,035      35,245     1,288.6      67.8      00:15:04
 38764      10   5,035      50,350     1,295.1      68.2      00:14:54
 38941       9   5,035      45,315     1,301.2      68.5      00:14:46
 39051      10   5,035      50,350     1,305.0      68.7      00:14:42
 39163      10   5,035      50,350     1,308.5      68.9      00:14:39
 39294       9   5,035      45,315     1,312.9      69.1      00:14:34
 39411       6   5,035      30,210     1,316.6      69.3      00:14:31
 39552      10   5,035      50,350     1,321.4      69.6      00:14:25
 39695       8   5,035      40,280     1,326.1      69.8      00:14:19
 39859       6   5,035      30,210     1,331.6      70.1      00:14:12
 40064       7   5,035      35,245     1,338.4      70.4      00:14:01
 40283       4   5,035      20,140     1,345.6      70.8      00:13:50
 40482       3   5,035      15,105     1,352.6      71.2      00:13:40
 40702       3   5,035      15,105     1,360.1      71.6      00:13:28
 40903       8   5,035      40,280     1,367.0      72.0      00:13:17
 41033       6   5,035      30,210     1,371.6      72.2      00:13:12
 41168       8   5,035      40,280     1,376.1      72.4      00:13:06
 41315       8   5,035      40,280     1,381.1      72.7      00:12:60
 41482       9   5,035      45,315     1,386.8      73.0      00:12:52
 41634       8   5,035      40,280     1,392.0      73.3      00:12:45
 41770       8   5,035      40,280     1,396.6      73.5      00:12:39
 41873       8   5,035      40,280     1,400.3      73.7      00:12:35
 41983      10   5,035      50,350     1,403.9      73.9      00:12:31
 42115       7   5,035      35,245     1,408.0      74.1      00:12:26
 42241       9   5,035      45,315     1,412.0      74.3      00:12:22
 42374       8   5,035      40,280     1,416.5      74.6      00:12:16
 42530       9   5,035      45,315     1,421.7      74.8      00:12:09
 42674       6   5,035      30,210     1,426.5      75.1      00:12:02
 42802       6   5,035      30,210     1,430.7      75.3      00:11:57
 42931       9   5,035      45,315     1,435.1      75.5      00:11:51
 43080       9   5,035      45,315     1,440.5      75.8      00:11:44
 43213       9   5,035      45,315     1,445.1      76.1      00:11:37
 43323       6   5,035      30,210     1,448.9      76.3      00:11:33
 43436       6   5,035      30,210     1,452.9      76.5      00:11:28
 43580       8   5,035      40,280     1,457.5      76.7      00:11:22
 43775       8   5,035      40,280     1,463.8      77.1      00:11:12
 43989       6   5,035      30,210     1,471.1      77.4      00:11:01
 44112       4   5,035      20,140     1,475.1      77.6      00:10:56
 44202       8   5,035      40,280     1,478.2      77.8      00:10:52
 44341       8   5,035      40,280     1,482.6      78.0      00:10:46
 44462      10   5,035      50,350     1,486.7      78.3      00:10:41
 44601       7   5,035      35,245     1,491.4      78.5      00:10:35
 44780       8   5,035      40,280     1,497.3      78.8      00:10:26
 44909      10   5,035      50,350     1,501.7      79.0      00:10:20
 45059       7   5,035      35,245     1,506.6      79.3      00:10:13
 45248       4   5,035      20,140     1,512.7      79.6      00:10:03
 45400       9   5,035      45,315     1,517.4      79.9      00:09:57
 45531       7   5,035      35,245     1,521.6      80.1      00:09:51
 45687       9   5,035      45,315     1,526.4      80.3      00:09:44
 45827       9   5,035      45,315     1,531.0      80.6      00:09:38
 45965       9   5,035      45,315     1,535.7      80.8      00:09:31
 46093       6   5,035      30,210     1,540.0      81.1      00:09:25
 46230       8   5,035      40,280     1,544.9      81.3      00:09:18
 46354       6   5,035      30,210     1,549.0      81.5      00:09:12
 46462       5   5,035      25,175     1,552.6      81.7      00:09:07
 46569       7   5,035      35,245     1,556.3      81.9      00:09:02
 46764       9   5,035      45,315     1,562.9      82.3      00:08:52
 46908       5   5,035      25,175     1,567.9      82.5      00:08:45
 47052       8   5,035      40,280     1,572.1      82.8      00:08:39
 47182      10   5,035      50,350     1,576.1      83.0      00:08:33
 47303      10   5,035      50,350     1,580.1      83.2      00:08:28
 47450       8   5,035      40,280     1,584.7      83.4      00:08:21
 47585       8   5,035      40,280     1,589.1      83.6      00:08:14
 47714       6   5,035      30,210     1,593.5      83.9      00:08:08
 47821       4   5,035      20,140     1,596.9      84.1      00:08:03
 47913       9   5,035      45,315     1,600.1      84.2      00:07:59
 48022      10   5,035      50,350     1,603.7      84.4      00:07:54
 48177      10   5,035      50,350     1,608.9      84.7      00:07:46
 48337       9   5,035      45,315     1,614.4      85.0      00:07:38
 48485       6   5,035      30,210     1,619.3      85.2      00:07:30
 48629      10   5,035      50,350     1,624.2      85.5      00:07:23
 48775       5   5,035      25,175     1,629.0      85.7      00:07:15
 48901       8   5,035      40,280     1,633.2      86.0      00:07:09
 49027       8   5,035      40,280     1,637.4      86.2      00:07:03
 49144       9   5,035      45,315     1,641.6      86.4      00:06:57
 49278      10   5,035      50,350     1,646.0      86.6      00:06:50
 49411       6   5,035      30,210     1,650.1      86.9      00:06:44
 49576       5   5,035      25,175     1,655.2      87.1      00:06:36
 49708       9   5,035      45,315     1,659.3      87.3      00:06:30
 49836       6   5,035      30,210     1,663.4      87.6      00:06:24
 49971       7   5,035      35,245     1,668.0      87.8      00:06:16
 50158       8   5,035      40,280     1,674.1      88.1      00:06:07
 50343       3   5,035      15,105     1,679.7      88.4      00:05:58
 50509       5   5,035      25,175     1,685.4      88.7      00:05:48
 50696       9   5,035      45,315     1,691.6      89.0      00:05:38
 50860       7   5,035      35,245     1,697.4      89.3      00:05:29
 51020       9   5,035      45,315     1,703.2      89.6      00:05:20
 51220      10   5,035      50,350     1,709.6      90.0      00:05:09
 51449       7   5,035      35,245     1,717.5      90.4      00:04:56
 51747       9   5,035      45,315     1,728.1      91.0      00:04:38
 52066       8   5,035      40,280     1,739.2      91.5      00:04:19
 52376       8   5,035      40,280     1,750.4      92.1      00:04:01
 52662       8   5,035      40,280     1,761.0      92.7      00:03:43
 52943       5   5,035      25,175     1,771.0      93.2      00:03:27
 53233       5   5,035      25,175     1,781.3      93.8      00:03:10
 53515       7   5,035      35,245     1,791.1      94.3      00:02:53
 53751       5   5,035      25,175     1,799.2      94.7      00:02:40
 53938      10   5,035      50,350     1,805.4      95.0      00:02:31
 54116      10   5,035      50,350     1,811.5      95.4      00:02:21
 54325       3   5,035      15,105     1,818.5      95.7      00:02:10
 54572       1   5,035       5,035     1,826.0      96.1      00:01:58
 54803       8   5,035      40,280     1,833.7      96.5      00:01:45
 55015       5   5,035      25,175     1,840.7      96.9      00:01:34
 55226      10   5,035      50,350     1,847.7      97.3      00:01:23
 55412       6   5,035      30,210     1,853.4      97.6      00:01:14
 55600      10   5,035      50,350     1,859.4      97.9      00:01:04
 55788      10   5,035      50,350     1,865.9      98.2      00:00:54
 55987       6   5,035      30,210     1,872.8      98.6      00:00:43
 56190       7   5,035      35,245     1,879.7      98.9      00:00:32
 56389      10   5,035      50,350     1,886.8      99.3      00:00:21
 56644       9   5,035      45,315     1,895.6      99.8      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 3023.035
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000.csv saved

. 
. cap log close

. 
end of do-file
