
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A800_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   357      10   4,835      48,350         9.8       0.5      00:30:50
   708       6   4,835      29,010        19.9       1.1      00:30:15
  1073       5   4,835      24,175        31.0       1.7      00:28:57
  1474       6   4,835      29,010        43.8       2.4      00:27:10
  1888       6   4,835      29,010        56.6       3.1      00:26:05
  2250       4   4,835      19,340        67.8       3.7      00:25:56
  2697       5   4,835      24,175        81.5       4.5      00:25:00
  3121       9   4,835      43,515        94.8       5.2      00:24:22
  3537       3   4,835      14,505       108.4       5.9      00:23:47
  3947      10   4,835      48,350       121.2       6.6      00:23:28
  4312       6   4,835      29,010       132.0       7.2      00:23:33
  4628       7   4,835      33,845       142.0       7.8      00:23:44
  4951       9   4,835      43,515       152.3       8.3      00:23:50
  5272      10   4,835      48,350       162.1       8.9      00:23:59
  5572       9   4,835      43,515       171.2       9.4      00:24:12
  5889       5   4,835      24,175       180.6       9.9      00:24:19
  6245       9   4,835      43,515       192.0      10.5      00:24:09
  6575       7   4,835      33,845       201.9      11.1      00:24:09
  6895      10   4,835      48,350       211.8      11.6      00:24:10
  7293       9   4,835      43,515       223.8      12.3      00:23:53
  7706       6   4,835      29,010       237.0      13.0      00:23:30
  8086       6   4,835      29,010       249.6      13.7      00:23:11
  8439       4   4,835      19,340       261.4      14.3      00:22:58
  8794       8   4,835      38,680       272.9      15.0      00:22:47
  9134       7   4,835      33,845       284.3      15.6      00:22:38
  9418       7   4,835      33,845       293.6      16.1      00:22:38
  9729       7   4,835      33,845       304.2      16.7      00:22:32
 10066       6   4,835      29,010       314.7      17.2      00:22:26
 10405       8   4,835      38,680       324.8      17.8      00:22:22
 10731       9   4,835      43,515       335.0      18.3      00:22:17
 11056       5   4,835      24,175       345.1      18.9      00:22:12
 11375       9   4,835      43,515       355.2      19.5      00:22:07
 11695       5   4,835      24,175       365.2      20.0      00:22:01
 12023       8   4,835      38,680       375.6      20.6      00:21:54
 12348       7   4,835      33,845       385.9      21.1      00:21:48
 12794       8   4,835      38,680       399.7      21.9      00:21:26
 13220       4   4,835      19,340       413.2      22.6      00:21:07
 13610      10   4,835      48,350       426.2      23.3      00:20:50
 13935       9   4,835      43,515       436.3      23.9      00:20:44
 14324       5   4,835      24,175       448.9      24.6      00:20:29
 14691       6   4,835      29,010       460.8      25.2      00:20:16
 15052       4   4,835      19,340       472.5      25.9      00:20:04
 15465       5   4,835      24,175       485.9      26.6      00:19:47
 15937      10   4,835      48,350       501.3      27.5      00:19:24
 16380       6   4,835      29,010       516.2      28.3      00:19:03
 16741       9   4,835      43,515       527.9      28.9      00:18:52
 17059       7   4,835      33,845       538.2      29.5      00:18:46
 17363       6   4,835      29,010       548.1      30.0      00:18:40
 17661       7   4,835      33,845       558.2      30.6      00:18:34
 18006       9   4,835      43,515       569.1      31.2      00:18:26
 18363      10   4,835      48,350       580.8      31.8      00:18:15
 18704      10   4,835      48,350       591.7      32.4      00:18:06
 19061       8   4,835      38,680       603.6      33.1      00:17:55
 19462       8   4,835      38,680       616.9      33.8      00:17:40
 19910       8   4,835      38,680       632.1      34.6      00:17:20
 20380       5   4,835      24,175       647.6      35.5      00:17:00
 20724       8   4,835      38,680       659.1      36.1      00:16:50
 21054       3   4,835      14,505       669.8      36.7      00:16:42
 21418      10   4,835      48,350       680.6      37.3      00:16:34
 21777       8   4,835      38,680       691.4      37.9      00:16:26
 22116       4   4,835      19,340       701.7      38.4      00:16:19
 22438      10   4,835      48,350       711.4      39.0      00:16:12
 22758       5   4,835      24,175       721.2      39.5      00:16:06
 23102       6   4,835      29,010       731.8      40.1      00:15:58
 23447       9   4,835      43,515       742.9      40.7      00:15:49
 23827       6   4,835      29,010       754.7      41.3      00:15:38
 24192       4   4,835      19,340       765.8      41.9      00:15:29
 24652       8   4,835      38,680       780.3      42.7      00:15:12
 25095       6   4,835      29,010       794.4      43.5      00:14:57
 25530       9   4,835      43,515       808.5      44.3      00:14:42
 25844       6   4,835      29,010       818.5      44.8      00:14:35
 26145       6   4,835      29,010       828.2      45.4      00:14:28
 26573       7   4,835      33,845       841.5      46.1      00:14:15
 26996       9   4,835      43,515       855.0      46.8      00:14:01
 27338       8   4,835      38,680       865.8      47.4      00:13:53
 27661       5   4,835      24,175       876.2      48.0      00:13:45
 28086      10   4,835      48,350       890.0      48.8      00:13:31
 28555       8   4,835      38,680       905.7      49.6      00:13:13
 28909       8   4,835      38,680       917.5      50.3      00:13:03
 29244      10   4,835      48,350       928.2      50.8      00:12:55
 29639       7   4,835      33,845       941.1      51.5      00:12:43
 29939       7   4,835      33,845       950.8      52.1      00:12:36
 30221       5   4,835      24,175       960.2      52.6      00:12:29
 30522       9   4,835      43,515       970.2      53.1      00:12:22
 30913       9   4,835      43,515       983.1      53.8      00:12:10
 31348      10   4,835      48,350       997.3      54.6      00:11:55
 31780       5   4,835      24,175     1,011.8      55.4      00:11:41
 32225       9   4,835      43,515     1,027.1      56.3      00:11:25
 32624       7   4,835      33,845     1,040.5      57.0      00:11:13
 32934       7   4,835      33,845     1,050.8      57.6      00:11:05
 33256      10   4,835      48,350     1,061.6      58.1      00:10:56
 33645      10   4,835      48,350     1,074.9      58.9      00:10:44
 34003       5   4,835      24,175     1,086.8      59.5      00:10:33
 34347       8   4,835      38,680     1,098.7      60.2      00:10:23
 34771       5   4,835      24,175     1,112.9      61.0      00:10:09
 35168       7   4,835      33,845     1,126.2      61.7      00:09:57
 35582       8   4,835      38,680     1,140.1      62.5      00:09:44
 36034       7   4,835      33,845     1,155.1      63.3      00:09:30
 36494      10   4,835      48,350     1,170.5      64.1      00:09:15
 36843       7   4,835      33,845     1,181.7      64.7      00:09:06
 37192       7   4,835      33,845     1,192.6      65.3      00:08:57
 37513       7   4,835      33,845     1,202.5      65.9      00:08:49
 37834       5   4,835      24,175     1,212.6      66.4      00:08:42
 38143       5   4,835      24,175     1,222.7      67.0      00:08:34
 38455       5   4,835      24,175     1,233.2      67.5      00:08:25
 38897       9   4,835      43,515     1,247.6      68.3      00:08:12
 39256      10   4,835      48,350     1,259.1      69.0      00:08:02
 39638       7   4,835      33,845     1,271.4      69.6      00:07:52
 40035       4   4,835      19,340     1,284.0      70.3      00:07:41
 40492       8   4,835      38,680     1,298.7      71.1      00:07:27
 40936       7   4,835      33,845     1,313.3      71.9      00:07:14
 41219       7   4,835      33,845     1,322.8      72.5      00:07:06
 41561       5   4,835      24,175     1,333.9      73.1      00:06:57
 41865       6   4,835      29,010     1,343.8      73.6      00:06:49
 42161       7   4,835      33,845     1,353.2      74.1      00:06:42
 42471       6   4,835      29,010     1,363.1      74.7      00:06:34
 42815       6   4,835      29,010     1,373.9      75.3      00:06:25
 43136       5   4,835      24,175     1,384.7      75.8      00:06:16
 43454       9   4,835      43,515     1,395.4      76.4      00:06:07
 43794       9   4,835      43,515     1,405.9      77.0      00:05:59
 44093      10   4,835      48,350     1,415.6      77.5      00:05:51
 44410       9   4,835      43,515     1,425.4      78.1      00:05:43
 44755       5   4,835      24,175     1,436.6      78.7      00:05:34
 45095       4   4,835      19,340     1,447.6      79.3      00:05:24
 45485       9   4,835      43,515     1,459.5      79.9      00:05:14
 45828       7   4,835      33,845     1,469.9      80.5      00:05:05
 46150       7   4,835      33,845     1,480.4      81.1      00:04:57
 46450      10   4,835      48,350     1,490.2      81.6      00:04:49
 46846       9   4,835      43,515     1,503.3      82.3      00:04:37
 47093       6   4,835      29,010     1,510.7      82.7      00:04:31
 47366       5   4,835      24,175     1,519.0      83.2      00:04:25
 47686       5   4,835      24,175     1,529.0      83.8      00:04:16
 47999       9   4,835      43,515     1,539.1      84.3      00:04:08
 48329       3   4,835      14,505     1,549.7      84.9      00:03:59
 48691       6   4,835      29,010     1,561.3      85.5      00:03:49
 49054       9   4,835      43,515     1,572.8      86.2      00:03:39
 49389       3   4,835      14,505     1,583.7      86.7      00:03:30
 49734       8   4,835      38,680     1,594.0      87.3      00:03:21
 50062       8   4,835      38,680     1,604.2      87.9      00:03:12
 50419       2   4,835       9,670     1,615.0      88.5      00:03:03
 50747       9   4,835      43,515     1,625.7      89.0      00:02:54
 51066       9   4,835      43,515     1,636.5      89.6      00:02:44
 51434       6   4,835      29,010     1,648.3      90.3      00:02:34
 51795      10   4,835      48,350     1,660.5      91.0      00:02:23
 52159       6   4,835      29,010     1,672.8      91.6      00:02:13
 52515       9   4,835      43,515     1,685.2      92.3      00:02:02
 52839       5   4,835      24,175     1,696.6      92.9      00:01:52
 53191       5   4,835      24,175     1,708.5      93.6      00:01:42
 53643       8   4,835      38,680     1,723.7      94.4      00:01:28
 53994       9   4,835      43,515     1,735.1      95.0      00:01:18
 54324       9   4,835      43,515     1,745.8      95.6      00:01:09
 54713       5   4,835      24,175     1,757.6      96.3      00:00:59
 55103       6   4,835      29,010     1,770.0      97.0      00:00:48
 55442       9   4,835      43,515     1,780.4      97.5      00:00:39
 55757       8   4,835      38,680     1,790.3      98.1      00:00:31
 56096      10   4,835      48,350     1,801.4      98.7      00:00:21
 56459      10   4,835      48,350     1,813.7      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1586.582
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
