
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A500_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   339       5   4,535      22,675         8.8       0.5      00:32:16
   703       4   4,535      18,140        18.5       1.1      00:30:28
  1060       5   4,535      22,675        28.7       1.7      00:29:22
  1399       7   4,535      31,745        38.8       2.3      00:28:49
  1754       9   4,535      40,815        49.4       2.9      00:28:07
  2102       8   4,535      36,280        59.3       3.5      00:27:55
  2431       3   4,535      13,605        68.8       4.0      00:27:55
  2794       9   4,535      40,815        79.5       4.6      00:27:26
  3163       7   4,535      31,745        90.3       5.3      00:26:59
  3510       8   4,535      36,280       100.9       5.9      00:26:39
  3882       6   4,535      27,210       111.9       6.5      00:26:15
  4196       3   4,535      13,605       120.8       7.1      00:26:23
  4450       3   4,535      13,605       127.8       7.5      00:26:54
  4683       8   4,535      36,280       134.9       7.9      00:27:19
  4958       6   4,535      27,210       143.0       8.4      00:27:28
  5226       4   4,535      18,140       150.9       8.8      00:27:38
  5479       8   4,535      36,280       158.1       9.2      00:27:53
  5722       6   4,535      27,210       164.8       9.6      00:28:13
  5960       3   4,535      13,605       171.6      10.0      00:28:28
  6198       5   4,535      22,675       178.6      10.4      00:28:40
  6444       9   4,535      40,815       185.7      10.8      00:28:49
  6715       6   4,535      27,210       193.3      11.3      00:28:51
  6997       8   4,535      36,280       201.5      11.8      00:28:47
  7367      10   4,535      45,350       212.3      12.4      00:28:18
  7705      10   4,535      45,350       222.2      13.0      00:27:59
  8059       9   4,535      40,815       233.3      13.6      00:27:30
  8423       6   4,535      27,210       244.7      14.3      00:27:02
  8772      10   4,535      45,350       255.4      14.9      00:26:40
  9154      10   4,535      45,350       267.3      15.6      00:26:10
  9397       9   4,535      40,815       274.7      16.0      00:26:12
  9658       6   4,535      27,210       283.1      16.5      00:26:08
  9950       6   4,535      27,210       291.9      17.0      00:25:60
 10240       3   4,535      13,605       299.9      17.5      00:25:57
 10515       6   4,535      27,210       308.0      18.0      00:25:53
 10848       7   4,535      31,745       317.5      18.5      00:25:40
 11156       5   4,535      22,675       326.6      19.1      00:25:30
 11425       8   4,535      36,280       334.6      19.5      00:25:26
 11705       7   4,535      31,745       342.9      20.0      00:25:20
 11983       4   4,535      18,140       351.1      20.5      00:25:15
 12259       8   4,535      36,280       359.5      21.0      00:25:08
 12636       8   4,535      36,280       370.5      21.6      00:24:47
 13015       8   4,535      36,280       381.4      22.3      00:24:28
 13383       6   4,535      27,210       392.3      22.9      00:24:09
 13677       9   4,535      40,815       401.7      23.5      00:23:58
 13932       9   4,535      40,815       409.1      23.9      00:23:56
 14206       7   4,535      31,745       417.4      24.4      00:23:50
 14514       7   4,535      31,745       427.0      24.9      00:23:38
 14842       7   4,535      31,745       436.7      25.5      00:23:25
 15224       9   4,535      40,815       448.6      26.2      00:23:03
 15660       7   4,535      31,745       461.6      27.0      00:22:37
 16072       8   4,535      36,280       474.6      27.7      00:22:13
 16448       7   4,535      31,745       486.4      28.4      00:21:53
 16724       9   4,535      40,815       494.7      28.9      00:21:47
 16993       5   4,535      22,675       502.8      29.4      00:21:42
 17268       9   4,535      40,815       511.0      29.8      00:21:36
 17512       9   4,535      40,815       518.9      30.3      00:21:31
 17798       9   4,535      40,815       527.4      30.8      00:21:23
 18140      10   4,535      45,350       537.9      31.4      00:21:09
 18449       1   4,535       4,535       547.1      32.0      00:20:59
 18721       8   4,535      36,280       555.5      32.4      00:20:52
 19014       7   4,535      31,745       564.7      33.0      00:20:42
 19366       9   4,535      40,815       575.6      33.6      00:20:27
 19747      10   4,535      45,350       587.8      34.3      00:20:08
 20128       9   4,535      40,815       600.0      35.0      00:19:49
 20506       7   4,535      31,745       611.4      35.7      00:19:33
 20752       2   4,535       9,070       619.0      36.1      00:19:28
 21012       5   4,535      22,675       627.1      36.6      00:19:22
 21342      10   4,535      45,350       636.0      37.1      00:19:13
 21635       6   4,535      27,210       644.6      37.6      00:19:05
 21925       9   4,535      40,815       652.8      38.1      00:18:58
 22243       9   4,535      40,815       661.8      38.6      00:18:49
 22595       5   4,535      22,675       671.9      39.2      00:18:37
 22935       6   4,535      27,210       681.3      39.8      00:18:27
 23248       7   4,535      31,745       690.9      40.3      00:18:16
 23615       3   4,535      13,605       701.3      41.0      00:18:03
 23938       6   4,535      27,210       711.2      41.5      00:17:52
 24312      10   4,535      45,350       721.8      42.1      00:17:39
 24719       6   4,535      27,210       734.0      42.9      00:17:22
 25138       9   4,535      40,815       746.4      43.6      00:17:04
 25560       7   4,535      31,745       759.2      44.3      00:16:46
 25850      10   4,535      45,350       767.9      44.8      00:16:38
 26179       8   4,535      36,280       777.7      45.4      00:16:27
 26598       4   4,535      18,140       790.1      46.1      00:16:11
 26968       7   4,535      31,745       801.0      46.8      00:15:57
 27297       9   4,535      40,815       810.8      47.3      00:15:47
 27569       9   4,535      40,815       819.0      47.8      00:15:40
 27869       6   4,535      27,210       828.2      48.4      00:15:31
 28249       6   4,535      27,210       839.8      49.0      00:15:16
 28616      10   4,535      45,350       851.5      49.7      00:15:02
 28873      10   4,535      45,350       859.5      50.2      00:14:55
 29139       8   4,535      36,280       867.7      50.7      00:14:48
 29474       5   4,535      22,675       877.9      51.3      00:14:36
 29806       5   4,535      22,675       887.8      51.8      00:14:25
 30067       7   4,535      31,745       895.8      52.3      00:14:18
 30352       9   4,535      40,815       904.6      52.8      00:14:10
 30679       8   4,535      36,280       914.8      53.4      00:13:59
 31057       5   4,535      22,675       926.3      54.1      00:13:45
 31420       8   4,535      36,280       937.6      54.8      00:13:31
 31790       8   4,535      36,280       949.3      55.4      00:13:17
 32183       2   4,535       9,070       961.9      56.2      00:13:02
 32547       9   4,535      40,815       973.6      56.9      00:12:48
 32833       6   4,535      27,210       982.5      57.4      00:12:39
 33125       8   4,535      36,280       991.8      57.9      00:12:30
 33414       9   4,535      40,815     1,000.7      58.4      00:12:21
 33737       5   4,535      22,675     1,011.0      59.0      00:12:10
 34058      10   4,535      45,350     1,021.1      59.6      00:11:59
 34390      10   4,535      45,350     1,031.8      60.3      00:11:47
 34766       5   4,535      22,675     1,043.7      60.9      00:11:33
 35113       7   4,535      31,745     1,054.6      61.6      00:11:21
 35434       8   4,535      36,280     1,064.8      62.2      00:11:10
 35804       6   4,535      27,210     1,076.2      62.8      00:10:57
 36189       8   4,535      36,280     1,088.3      63.6      00:10:43
 36578       5   4,535      22,675     1,100.4      64.3      00:10:30
 36831       5   4,535      22,675     1,108.0      64.7      00:10:23
 37101       8   4,535      36,280     1,116.2      65.2      00:10:15
 37402       6   4,535      27,210     1,124.7      65.7      00:10:07
 37698       7   4,535      31,745     1,133.4      66.2      00:09:59
 37986       7   4,535      31,745     1,141.9      66.7      00:09:51
 38246       7   4,535      31,745     1,150.0      67.2      00:09:43
 38497       9   4,535      40,815     1,158.0      67.6      00:09:36
 38855       8   4,535      36,280     1,168.9      68.3      00:09:24
 39146       4   4,535      18,140     1,177.8      68.8      00:09:15
 39503       7   4,535      31,745     1,188.3      69.4      00:09:04
 39847       5   4,535      22,675     1,198.6      70.0      00:08:52
 40270       2   4,535       9,070     1,211.3      70.7      00:08:38
 40661       7   4,535      31,745     1,223.4      71.4      00:08:24
 41053       8   4,535      36,280     1,235.6      72.2      00:08:11
 41334       9   4,535      40,815     1,244.2      72.7      00:08:03
 41655       7   4,535      31,745     1,254.1      73.2      00:07:52
 41955       9   4,535      40,815     1,263.4      73.8      00:07:43
 42246       7   4,535      31,745     1,271.6      74.3      00:07:35
 42555       4   4,535      18,140     1,281.0      74.8      00:07:25
 42881       5   4,535      22,675     1,290.8      75.4      00:07:15
 43198       7   4,535      31,745     1,300.7      76.0      00:07:05
 43509       8   4,535      36,280     1,310.4      76.5      00:06:55
 43834       8   4,535      36,280     1,319.9      77.1      00:06:45
 44126      10   4,535      45,350     1,328.7      77.6      00:06:36
 44403       5   4,535      22,675     1,336.8      78.1      00:06:28
 44726       5   4,535      22,675     1,346.7      78.6      00:06:18
 45080      10   4,535      45,350     1,357.4      79.3      00:06:07
 45441       8   4,535      36,280     1,367.6      79.9      00:05:56
 45711      10   4,535      45,350     1,375.2      80.3      00:05:49
 45978       7   4,535      31,745     1,383.2      80.8      00:05:41
 46290      10   4,535      45,350     1,393.1      81.4      00:05:31
 46652       6   4,535      27,210     1,404.0      82.0      00:05:19
 47067       3   4,535      13,605     1,416.2      82.7      00:05:06
 47386       8   4,535      36,280     1,425.3      83.2      00:04:57
 47691      10   4,535      45,350     1,434.3      83.8      00:04:47
 47989       7   4,535      31,745     1,443.2      84.3      00:04:38
 48291       8   4,535      36,280     1,452.3      84.8      00:04:29
 48570       7   4,535      31,745     1,460.9      85.3      00:04:20
 48871       8   4,535      36,280     1,469.8      85.8      00:04:11
 49193       7   4,535      31,745     1,479.7      86.4      00:04:01
 49524       7   4,535      31,745     1,489.2      87.0      00:03:51
 49859       5   4,535      22,675     1,498.6      87.5      00:03:41
 50209       9   4,535      40,815     1,509.1      88.1      00:03:31
 50547      10   4,535      45,350     1,518.8      88.7      00:03:20
 50860       7   4,535      31,745     1,528.4      89.3      00:03:11
 51120       6   4,535      27,210     1,536.6      89.7      00:03:02
 51428      10   4,535      45,350     1,545.9      90.3      00:02:53
 51742       9   4,535      40,815     1,555.8      90.9      00:02:42
 52076       2   4,535       9,070     1,566.2      91.5      00:02:31
 52431      10   4,535      45,350     1,577.8      92.1      00:02:19
 52788       5   4,535      22,675     1,589.7      92.8      00:02:07
 53213       7   4,535      31,745     1,603.3      93.6      00:01:53
 53655       6   4,535      27,210     1,617.2      94.4      00:01:38
 53998      10   4,535      45,350     1,627.5      95.0      00:01:27
 54325      10   4,535      45,350     1,637.5      95.6      00:01:17
 54665       4   4,535      18,140     1,647.2      96.2      00:01:07
 55040      10   4,535      45,350     1,658.3      96.8      00:00:56
 55365       8   4,535      36,280     1,667.7      97.4      00:00:46
 55682       8   4,535      36,280     1,676.9      97.9      00:00:36
 56005       6   4,535      27,210     1,686.8      98.5      00:00:26
 56322       7   4,535      31,745     1,696.7      99.1      00:00:16
 56652       8   4,535      36,280     1,707.1      99.7      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1765.075
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed457.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
