
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A200_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   213       5   4,235      21,175         5.2       0.3      00:51:32
   468       9   4,235      38,115        11.5       0.7      00:46:15
   705       5   4,235      21,175        17.5       1.1      00:45:14
   933       3   4,235      12,705        23.4       1.5      00:44:60
  1146       4   4,235      16,940        29.3       1.8      00:44:41
  1361       9   4,235      38,115        35.3       2.2      00:44:22
  1573       5   4,235      21,175        41.3       2.6      00:44:08
  1791       6   4,235      25,410        47.2       3.0      00:43:54
  2031       7   4,235      29,645        53.5       3.3      00:43:24
  2263       8   4,235      33,880        59.9       3.7      00:42:53
  2506       9   4,235      38,115        66.3       4.2      00:42:27
  2725       5   4,235      21,175        72.4       4.5      00:42:14
  2944       9   4,235      38,115        78.4       4.9      00:42:06
  3147       8   4,235      33,880        84.1       5.3      00:42:06
  3367       7   4,235      29,645        90.4       5.7      00:41:45
  3596       8   4,235      33,880        96.8       6.1      00:41:28
  3801       8   4,235      33,880       102.5       6.4      00:41:26
  3958       6   4,235      25,410       106.5       6.7      00:42:06
  4098       8   4,235      33,880       110.3       6.9      00:42:50
  4246       5   4,235      21,175       114.2       7.1      00:43:25
  4392       6   4,235      25,410       117.9       7.4      00:44:03
  4538       8   4,235      33,880       122.0       7.6      00:44:30
  4669       8   4,235      33,880       125.8       7.9      00:44:60
  4831       6   4,235      25,410       130.1       8.1      00:45:15
  4979      10   4,235      42,350       134.3       8.4      00:45:33
  5088       3   4,235      12,705       137.1       8.6      00:46:18
  5216       7   4,235      29,645       140.8       8.8      00:46:42
  5359       4   4,235      16,940       144.8       9.1      00:46:58
  5497       6   4,235      25,410       148.2       9.3      00:47:26
  5620      10   4,235      42,350       151.3       9.5      00:47:57
  5763       4   4,235      16,940       155.2       9.7      00:48:10
  5921      10   4,235      42,350       159.5      10.0      00:48:15
  6098       7   4,235      29,645       164.4      10.3      00:48:06
  6309       8   4,235      33,880       170.0      10.6      00:47:45
  6499      10   4,235      42,350       175.0      11.0      00:47:34
  6648       6   4,235      25,410       179.0      11.2      00:47:43
  6800       8   4,235      33,880       183.1      11.5      00:47:48
  6948       9   4,235      38,115       187.1      11.7      00:47:55
  7151       8   4,235      33,880       192.4      12.0      00:47:38
  7316       8   4,235      33,880       196.9      12.3      00:47:34
  7500       8   4,235      33,880       202.0      12.6      00:47:22
  7685      10   4,235      42,350       207.1      13.0      00:47:09
  7858       7   4,235      29,645       212.2      13.3      00:46:58
  8040       9   4,235      38,115       217.5      13.6      00:46:41
  8222       3   4,235      12,705       222.8      13.9      00:46:26
  8382       7   4,235      29,645       227.4      14.2      00:46:21
  8535       8   4,235      33,880       232.0      14.5      00:46:16
  8710       7   4,235      29,645       236.9      14.8      00:46:07
  8875       8   4,235      33,880       241.7      15.1      00:45:59
  9050       7   4,235      29,645       246.7      15.4      00:45:48
  9199       8   4,235      33,880       251.1      15.7      00:45:45
  9303       6   4,235      25,410       254.1      15.9      00:45:59
  9423       6   4,235      25,410       257.6      16.1      00:46:07
  9560       7   4,235      29,645       261.6      16.4      00:46:07
  9676      10   4,235      42,350       265.1      16.6      00:46:14
  9808       7   4,235      29,645       268.9      16.8      00:46:17
  9963       2   4,235       8,470       273.1      17.1      00:46:14
 10101       8   4,235      33,880       276.7      17.3      00:46:19
 10253       8   4,235      33,880       280.6      17.6      00:46:20
 10381       6   4,235      25,410       284.0      17.8      00:46:25
 10498       4   4,235      16,940       287.3      18.0      00:46:32
 10635      10   4,235      42,350       290.8      18.2      00:46:36
 10790      10   4,235      42,350       295.1      18.5      00:46:31
 10951      10   4,235      42,350       299.7      18.8      00:46:22
 11084      10   4,235      42,350       303.2      19.0      00:46:25
 11205       7   4,235      29,645       306.6      19.2      00:46:29
 11298       7   4,235      29,645       309.1      19.3      00:46:44
 11407      10   4,235      42,350       312.2      19.5      00:46:50
 11533       5   4,235      21,175       315.6      19.8      00:46:53
 11668       5   4,235      21,175       319.4      20.0      00:46:52
 11824       8   4,235      33,880       323.7      20.3      00:46:44
 11948       6   4,235      25,410       327.0      20.5      00:46:48
 12071       5   4,235      21,175       330.6      20.7      00:46:48
 12193       6   4,235      25,410       334.0      20.9      00:46:49
 12367       7   4,235      29,645       338.7      21.2      00:46:37
 12620       8   4,235      33,880       345.8      21.6      00:46:02
 12844       5   4,235      21,175       351.7      22.0      00:45:38
 13087       9   4,235      38,115       358.3      22.4      00:45:07
 13310       8   4,235      33,880       364.5      22.8      00:44:42
 13523       7   4,235      29,645       371.0      23.2      00:44:15
 13666       9   4,235      38,115       375.1      23.5      00:44:10
 13817       7   4,235      29,645       379.1      23.7      00:44:06
 13960      10   4,235      42,350       383.1      24.0      00:44:02
 14137       9   4,235      38,115       388.0      24.3      00:43:49
 14331       9   4,235      38,115       393.7      24.6      00:43:30
 14515       4   4,235      16,940       398.9      25.0      00:43:15
 14629       8   4,235      33,880       402.1      25.2      00:43:17
 14782       9   4,235      38,115       406.4      25.4      00:43:10
 14977      10   4,235      42,350       411.9      25.8      00:42:52
 15203       7   4,235      29,645       418.6      26.2      00:42:25
 15373       9   4,235      38,115       423.4      26.5      00:42:14
 15588       7   4,235      29,645       429.3      26.9      00:41:54
 15793       6   4,235      25,410       435.1      27.2      00:41:34
 16008       9   4,235      38,115       441.5      27.6      00:41:11
 16219       7   4,235      29,645       447.6      28.0      00:40:50
 16425      10   4,235      42,350       453.8      28.4      00:40:29
 16570       3   4,235      12,705       457.8      28.6      00:40:25
 16731       6   4,235      25,410       462.3      28.9      00:40:16
 16873       8   4,235      33,880       466.2      29.2      00:40:12
 17021       7   4,235      29,645       470.6      29.5      00:40:04
 17161       5   4,235      21,175       474.4      29.7      00:40:01
 17303      10   4,235      42,350       478.5      29.9      00:39:55
 17425       8   4,235      33,880       482.1      30.2      00:39:53
 17530       6   4,235      25,410       485.4      30.4      00:39:52
 17643       9   4,235      38,115       488.6      30.6      00:39:52
 17789      10   4,235      42,350       492.5      30.8      00:39:48
 17953       5   4,235      21,175       497.1      31.1      00:39:38
 18156      10   4,235      42,350       503.1      31.5      00:39:19
 18356       7   4,235      29,645       508.7      31.8      00:39:02
 18551       5   4,235      21,175       513.9      32.2      00:38:48
 18714       8   4,235      33,880       518.8      32.5      00:38:37
 18849       8   4,235      33,880       522.6      32.7      00:38:33
 18952       9   4,235      38,115       525.8      32.9      00:38:33
 19071       8   4,235      33,880       529.2      33.1      00:38:30
 19179       8   4,235      33,880       532.4      33.3      00:38:30
 19302       8   4,235      33,880       536.0      33.5      00:38:27
 19454       6   4,235      25,410       540.4      33.8      00:38:18
 19631       7   4,235      29,645       545.6      34.1      00:38:04
 19787       9   4,235      38,115       550.4      34.4      00:37:54
 19952       6   4,235      25,410       555.3      34.7      00:37:42
 20138       9   4,235      38,115       560.8      35.1      00:37:26
 20332       7   4,235      29,645       566.2      35.4      00:37:11
 20494       6   4,235      25,410       570.9      35.7      00:37:01
 20603       7   4,235      29,645       574.1      35.9      00:36:59
 20722       7   4,235      29,645       577.5      36.1      00:36:57
 20839       6   4,235      25,410       580.9      36.4      00:36:54
 20979       8   4,235      33,880       584.9      36.6      00:36:48
 21114       6   4,235      25,410       588.6      36.8      00:36:43
 21232       9   4,235      38,115       591.5      37.0      00:36:43
 21370      10   4,235      42,350       595.1      37.2      00:36:38
 21508       6   4,235      25,410       599.0      37.5      00:36:33
 21639       6   4,235      25,410       602.3      37.7      00:36:30
 21767       8   4,235      33,880       605.6      37.9      00:36:27
 21909       6   4,235      25,410       609.5      38.1      00:36:21
 22073       4   4,235      16,940       613.8      38.4      00:36:12
 22209       9   4,235      38,115       617.4      38.6      00:36:08
 22317      10   4,235      42,350       620.2      38.8      00:36:08
 22428      10   4,235      42,350       623.2      39.0      00:36:07
 22552      10   4,235      42,350       626.5      39.2      00:36:03
 22712       2   4,235       8,470       630.8      39.5      00:35:54
 22917       8   4,235      33,880       636.0      39.8      00:35:40
 23112       5   4,235      21,175       641.5      40.1      00:35:25
 23293       1   4,235       4,235       646.7      40.5      00:35:11
 23503       7   4,235      29,645       652.1      40.8      00:34:56
 23716       8   4,235      33,880       657.9      41.2      00:34:39
 23896       9   4,235      38,115       663.2      41.5      00:34:25
 24116       6   4,235      25,410       669.0      41.9      00:34:08
 24329       8   4,235      33,880       674.5      42.2      00:33:53
 24504       8   4,235      33,880       679.5      42.5      00:33:41
 24705       3   4,235      12,705       685.3      42.9      00:33:25
 24907       7   4,235      29,645       690.6      43.2      00:33:11
 25108       9   4,235      38,115       696.4      43.6      00:32:54
 25304       5   4,235      21,175       701.9      43.9      00:32:40
 25501       6   4,235      25,410       707.6      44.3      00:32:25
 25644       7   4,235      29,645       711.3      44.5      00:32:19
 25751       7   4,235      29,645       714.6      44.7      00:32:15
 25885       7   4,235      29,645       718.3      45.0      00:32:09
 26036       4   4,235      16,940       722.6      45.2      00:32:01
 26182       7   4,235      29,645       726.7      45.5      00:31:53
 26328       8   4,235      33,880       730.8      45.7      00:31:45
 26493      10   4,235      42,350       735.1      46.0      00:31:36
 26666       8   4,235      33,880       739.8      46.3      00:31:26
 26838       9   4,235      38,115       744.7      46.6      00:31:14
 27023       8   4,235      33,880       749.9      46.9      00:31:01
 27172       5   4,235      21,175       754.0      47.2      00:30:53
 27315       5   4,235      21,175       758.0      47.4      00:30:46
 27490       7   4,235      29,645       762.9      47.7      00:30:34
 27662       6   4,235      25,410       767.8      48.0      00:30:23
 27838       6   4,235      25,410       772.9      48.4      00:30:10
 28039       8   4,235      33,880       778.6      48.7      00:29:56
 28222       9   4,235      38,115       783.8      49.0      00:29:43
 28399       6   4,235      25,410       789.0      49.4      00:29:30
 28587      10   4,235      42,350       794.7      49.7      00:29:15
 28745      10   4,235      42,350       799.2      50.0      00:29:05
 28898       6   4,235      25,410       803.7      50.3      00:28:56
 29025       8   4,235      33,880       807.3      50.5      00:28:50
 29173       8   4,235      33,880       811.5      50.8      00:28:42
 29341       7   4,235      29,645       816.3      51.1      00:28:31
 29499       9   4,235      38,115       820.8      51.4      00:28:21
 29653       8   4,235      33,880       824.9      51.6      00:28:13
 29764       9   4,235      38,115       828.2      51.8      00:28:08
 29891       9   4,235      38,115       831.8      52.1      00:28:02
 30003       6   4,235      25,410       835.1      52.3      00:27:58
 30121       8   4,235      33,880       838.4      52.5      00:27:53
 30251       5   4,235      21,175       842.1      52.7      00:27:46
 30379       6   4,235      25,410       845.8      52.9      00:27:40
 30507       7   4,235      29,645       849.7      53.2      00:27:33
 30684      10   4,235      42,350       854.7      53.5      00:27:21
 30915      10   4,235      42,350       861.4      53.9      00:27:02
 31136       5   4,235      21,175       867.6      54.3      00:26:45
 31316       7   4,235      29,645       872.9      54.6      00:26:32
 31478       5   4,235      21,175       877.8      54.9      00:26:21
 31644       7   4,235      29,645       882.6      55.2      00:26:10
 31827       6   4,235      25,410       888.1      55.6      00:25:56
 31992       7   4,235      29,645       893.0      55.9      00:25:45
 32208       9   4,235      38,115       899.5      56.3      00:25:27
 32403       5   4,235      21,175       905.4      56.7      00:25:12
 32548      10   4,235      42,350       909.6      56.9      00:25:04
 32675       8   4,235      33,880       913.2      57.1      00:24:57
 32795       7   4,235      29,645       916.8      57.4      00:24:51
 32907       7   4,235      29,645       920.0      57.6      00:24:46
 33011       8   4,235      33,880       923.2      57.8      00:24:42
 33143       7   4,235      29,645       927.0      58.0      00:24:34
 33287       6   4,235      25,410       931.2      58.3      00:24:26
 33422       7   4,235      29,645       935.1      58.5      00:24:18
 33559       8   4,235      33,880       939.2      58.8      00:24:10
 33695       6   4,235      25,410       943.3      59.0      00:24:02
 33840       8   4,235      33,880       947.6      59.3      00:23:53
 33991       9   4,235      38,115       952.0      59.6      00:23:43
 34175      10   4,235      42,350       957.6      59.9      00:23:29
 34379       7   4,235      29,645       963.6      60.3      00:23:14
 34581       9   4,235      38,115       969.5      60.7      00:22:59
 34796       5   4,235      21,175       976.0      61.1      00:22:42
 35002       2   4,235       8,470       982.0      61.5      00:22:27
 35200       7   4,235      29,645       987.8      61.8      00:22:13
 35402       8   4,235      33,880       993.8      62.2      00:21:58
 35600      10   4,235      42,350       999.5      62.5      00:21:44
 35827       5   4,235      21,175     1,006.1      63.0      00:21:27
 36067       5   4,235      21,175     1,013.0      63.4      00:21:09
 36258       7   4,235      29,645     1,018.7      63.8      00:20:55
 36456       5   4,235      21,175     1,024.5      64.1      00:20:41
 36604       9   4,235      38,115     1,028.8      64.4      00:20:33
 36751       4   4,235      16,940     1,032.7      64.6      00:20:25
 36907       4   4,235      16,940     1,037.4      64.9      00:20:15
 37082       5   4,235      21,175     1,042.2      65.2      00:20:04
 37211       7   4,235      29,645     1,045.4      65.4      00:19:59
 37299       7   4,235      29,645     1,047.7      65.6      00:19:56
 37428       9   4,235      38,115     1,051.3      65.8      00:19:50
 37586      10   4,235      42,350     1,055.8      66.1      00:19:40
 37780       6   4,235      25,410     1,060.9      66.4      00:19:28
 37985       8   4,235      33,880     1,066.7      66.8      00:19:15
 38174       8   4,235      33,880     1,072.3      67.1      00:19:02
 38360       8   4,235      33,880     1,077.7      67.4      00:18:49
 38528       8   4,235      33,880     1,082.6      67.8      00:18:38
 38756       8   4,235      33,880     1,089.2      68.2      00:18:22
 38941       9   4,235      38,115     1,094.4      68.5      00:18:10
 39065       9   4,235      38,115     1,098.0      68.7      00:18:03
 39232       5   4,235      21,175     1,102.5      69.0      00:17:54
 39390       8   4,235      33,880     1,106.9      69.3      00:17:44
 39538       6   4,235      25,410     1,111.0      69.5      00:17:36
 39683       6   4,235      25,410     1,115.1      69.8      00:17:28
 39857       9   4,235      38,115     1,120.0      70.1      00:17:17
 40074      10   4,235      42,350     1,126.0      70.5      00:17:02
 40314       6   4,235      25,410     1,132.7      70.9      00:16:46
 40493      10   4,235      42,350     1,138.0      71.2      00:16:34
 40712       8   4,235      33,880     1,144.3      71.6      00:16:19
 40915       7   4,235      29,645     1,150.2      72.0      00:16:05
 41011       8   4,235      33,880     1,153.1      72.2      00:16:00
 41117       6   4,235      25,410     1,156.0      72.3      00:15:55
 41212       5   4,235      21,175     1,158.8      72.5      00:15:51
 41354       5   4,235      21,175     1,162.7      72.8      00:15:43
 41502       6   4,235      25,410     1,167.0      73.0      00:15:34
 41666       9   4,235      38,115     1,171.7      73.3      00:15:24
 41829       8   4,235      33,880     1,176.4      73.6      00:15:14
 41979      10   4,235      42,350     1,180.7      73.9      00:15:04
 42131       6   4,235      25,410     1,184.7      74.1      00:14:56
 42257      10   4,235      42,350     1,188.0      74.3      00:14:50
 42383       5   4,235      21,175     1,191.7      74.6      00:14:43
 42529       5   4,235      21,175     1,195.8      74.8      00:14:34
 42685       4   4,235      16,940     1,200.1      75.1      00:14:25
 42816       9   4,235      38,115     1,203.9      75.3      00:14:18
 42970      10   4,235      42,350     1,208.2      75.6      00:14:08
 43097       9   4,235      38,115     1,212.1      75.9      00:14:00
 43236       7   4,235      29,645     1,216.2      76.1      00:13:52
 43343       8   4,235      33,880     1,219.3      76.3      00:13:46
 43484       5   4,235      21,175     1,223.4      76.6      00:13:38
 43694       6   4,235      25,410     1,229.0      76.9      00:13:25
 43886       4   4,235      16,940     1,234.5      77.3      00:13:12
 44073       6   4,235      25,410     1,239.8      77.6      00:13:00
 44201       4   4,235      16,940     1,243.3      77.8      00:12:53
 44329       4   4,235      16,940     1,246.8      78.0      00:12:46
 44461       9   4,235      38,115     1,250.5      78.3      00:12:39
 44612      10   4,235      42,350     1,254.7      78.5      00:12:30
 44789       7   4,235      29,645     1,259.7      78.8      00:12:19
 44937       9   4,235      38,115     1,264.0      79.1      00:12:09
 45127       7   4,235      29,645     1,269.1      79.4      00:11:58
 45337       6   4,235      25,410     1,274.5      79.8      00:11:46
 45468       5   4,235      21,175     1,278.2      80.0      00:11:38
 45624       7   4,235      29,645     1,282.2      80.2      00:11:30
 45764       6   4,235      25,410     1,286.0      80.5      00:11:22
 45879       7   4,235      29,645     1,289.1      80.7      00:11:16
 46032       9   4,235      38,115     1,293.6      81.0      00:11:06
 46156       5   4,235      21,175     1,297.2      81.2      00:10:59
 46271      10   4,235      42,350     1,300.6      81.4      00:10:52
 46373       6   4,235      25,410     1,303.4      81.6      00:10:47
 46488       5   4,235      21,175     1,306.6      81.8      00:10:40
 46602       9   4,235      38,115     1,310.0      82.0      00:10:33
 46793       6   4,235      25,410     1,315.5      82.3      00:10:21
 46944       4   4,235      16,940     1,319.5      82.6      00:10:12
 47082       7   4,235      29,645     1,323.2      82.8      00:10:05
 47210       6   4,235      25,410     1,326.5      83.0      00:09:58
 47352       7   4,235      29,645     1,330.4      83.3      00:09:50
 47489       7   4,235      29,645     1,334.0      83.5      00:09:42
 47607       8   4,235      33,880     1,337.2      83.7      00:09:35
 47721       9   4,235      38,115     1,340.6      83.9      00:09:29
 47852       6   4,235      25,410     1,344.1      84.1      00:09:21
 47963       4   4,235      16,940     1,347.3      84.3      00:09:15
 48126       2   4,235       8,470     1,351.8      84.6      00:09:05
 48299       6   4,235      25,410     1,356.8      84.9      00:08:53
 48433       8   4,235      33,880     1,360.6      85.1      00:08:45
 48581       7   4,235      29,645     1,364.8      85.4      00:08:36
 48733       4   4,235      16,940     1,369.0      85.7      00:08:27
 48865       9   4,235      38,115     1,372.7      85.9      00:08:19
 48989      10   4,235      42,350     1,376.1      86.1      00:08:12
 49105       8   4,235      33,880     1,379.5      86.3      00:08:05
 49189       3   4,235      12,705     1,382.1      86.5      00:07:60
 49291       8   4,235      33,880     1,384.8      86.7      00:07:54
 49408       7   4,235      29,645     1,387.8      86.9      00:07:48
 49583       9   4,235      38,115     1,392.4      87.1      00:07:38
 49743       6   4,235      25,410     1,396.6      87.4      00:07:29
 49899       7   4,235      29,645     1,400.9      87.7      00:07:19
 50043       5   4,235      21,175     1,404.9      87.9      00:07:10
 50182      10   4,235      42,350     1,408.7      88.2      00:07:02
 50324       7   4,235      29,645     1,412.4      88.4      00:06:54
 50483       4   4,235      16,940     1,416.8      88.7      00:06:44
 50625       6   4,235      25,410     1,420.8      88.9      00:06:36
 50760       6   4,235      25,410     1,424.8      89.2      00:06:27
 50906       6   4,235      25,410     1,429.1      89.4      00:06:17
 51005       4   4,235      16,940     1,432.1      89.6      00:06:11
 51164       6   4,235      25,410     1,436.5      89.9      00:06:01
 51351       9   4,235      38,115     1,441.8      90.2      00:05:49
 51574       4   4,235      16,940     1,448.3      90.6      00:05:34
 51789       6   4,235      25,410     1,454.7      91.0      00:05:19
 52015       8   4,235      33,880     1,461.3      91.4      00:05:04
 52232       5   4,235      21,175     1,467.9      91.9      00:04:49
 52427      10   4,235      42,350     1,473.9      92.2      00:04:36
 52617      10   4,235      42,350     1,479.8      92.6      00:04:22
 52791       6   4,235      25,410     1,485.1      92.9      00:04:10
 52949       7   4,235      29,645     1,489.8      93.2      00:03:60
 53159       9   4,235      38,115     1,496.1      93.6      00:03:46
 53391       7   4,235      29,645     1,502.8      94.0      00:03:30
 53609       8   4,235      33,880     1,509.3      94.4      00:03:16
 53772       9   4,235      38,115     1,514.0      94.7      00:03:05
 53926       5   4,235      21,175     1,518.2      95.0      00:02:56
 54042       8   4,235      33,880     1,521.5      95.2      00:02:49
 54179       6   4,235      25,410     1,525.4      95.5      00:02:41
 54324       8   4,235      33,880     1,529.5      95.7      00:02:31
 54451       5   4,235      21,175     1,532.7      95.9      00:02:24
 54591       4   4,235      16,940     1,536.4      96.2      00:02:16
 54727       8   4,235      33,880     1,540.3      96.4      00:02:08
 54883       4   4,235      16,940     1,544.6      96.7      00:01:58
 55006       7   4,235      29,645     1,548.0      96.9      00:01:51
 55136       7   4,235      29,645     1,551.6      97.1      00:01:43
 55286      10   4,235      42,350     1,555.6      97.3      00:01:34
 55427       7   4,235      29,645     1,559.4      97.6      00:01:26
 55565       8   4,235      33,880     1,563.0      97.8      00:01:18
 55663       4   4,235      16,940     1,565.9      98.0      00:01:11
 55783      10   4,235      42,350     1,569.3      98.2      00:01:04
 55903      10   4,235      42,350     1,572.8      98.4      00:00:56
 56057      10   4,235      42,350     1,577.2      98.7      00:00:46
 56192       7   4,235      29,645     1,581.1      98.9      00:00:37
 56343       8   4,235      33,880     1,585.6      99.2      00:00:27
 56492       7   4,235      29,645     1,590.1      99.5      00:00:18
 56658       7   4,235      29,645     1,594.8      99.8      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,598.0        Number of regions         = 56,767    
Computed distances (M)  = 1,597.96       Total run time (seconds)  = 3579.499
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
