
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_A300.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_A300.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  10 Apr 2024, 11:57:43

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   326       5   4,335      21,675         8.1       0.5      00:33:38
   677       9   4,335      39,015        17.1       1.0      00:31:41
  1033       8   4,335      34,680        26.7       1.6      00:30:16
  1375       6   4,335      26,010        36.4       2.2      00:29:24
  1702       6   4,335      26,010        45.8       2.8      00:29:01
  2042       7   4,335      30,345        54.9       3.4      00:28:52
  2387       8   4,335      34,680        64.5       3.9      00:28:29
  2734      10   4,335      43,350        74.2       4.5      00:28:09
  3123       9   4,335      39,015        85.1       5.2      00:27:25
  3511       3   4,335      13,005        96.5       5.9      00:26:39
  3896       6   4,335      26,010       107.4       6.6      00:26:09
  4200       6   4,335      26,010       115.6       7.1      00:26:22
  4495       8   4,335      34,680       123.5       7.5      00:26:36
  4788      10   4,335      43,350       132.0       8.1      00:26:39
  5099       3   4,335      13,005       140.5       8.6      00:26:40
  5406       8   4,335      34,680       149.4       9.1      00:26:35
  5705       5   4,335      21,675       157.0       9.6      00:26:45
  6000       4   4,335      17,340       165.2      10.1      00:26:46
  6326      10   4,335      43,350       174.2      10.6      00:26:37
  6633       5   4,335      21,675       182.6      11.2      00:26:35
  6942       8   4,335      34,680       191.2      11.7      00:26:30
  7305      10   4,335      43,350       201.0      12.3      00:26:14
  7660       5   4,335      21,675       211.2      12.9      00:25:55
  7997       4   4,335      17,340       221.2      13.5      00:25:38
  8331       7   4,335      30,345       231.1      14.1      00:25:22
  8676       5   4,335      21,675       241.3      14.7      00:25:06
  9022       7   4,335      30,345       251.5      15.4      00:24:49
  9325       6   4,335      26,010       260.6      15.9      00:24:41
  9609      10   4,335      43,350       269.1      16.4      00:24:36
  9916       2   4,335       8,670       278.1      17.0      00:24:28
 10228       6   4,335      26,010       286.4      17.5      00:24:24
 10548       4   4,335      17,340       295.3      18.0      00:24:16
 10889      10   4,335      43,350       304.8      18.6      00:24:05
 11201       9   4,335      39,015       313.5      19.2      00:23:57
 11447       9   4,335      39,015       320.6      19.6      00:23:59
 11713       7   4,335      30,345       328.0      20.0      00:23:59
 12014       7   4,335      30,345       336.5      20.6      00:23:52
 12312       9   4,335      39,015       345.0      21.1      00:23:45
 12687      10   4,335      43,350       355.7      21.7      00:23:27
 13077      10   4,335      43,350       366.4      22.4      00:23:09
 13460      10   4,335      43,350       377.4      23.1      00:22:50
 13755       9   4,335      39,015       386.2      23.6      00:22:42
 14057       5   4,335      21,675       394.6      24.1      00:22:36
 14379       7   4,335      30,345       404.2      24.7      00:22:24
 14700       6   4,335      26,010       413.4      25.3      00:22:14
 15047       8   4,335      34,680       423.5      25.9      00:22:00
 15435       9   4,335      39,015       434.9      26.6      00:21:41
 15840      10   4,335      43,350       446.6      27.3      00:21:21
 16235      10   4,335      43,350       458.5      28.0      00:21:02
 16596      10   4,335      43,350       469.1      28.7      00:20:47
 16921       9   4,335      39,015       478.4      29.2      00:20:37
 17221       4   4,335      17,340       487.1      29.8      00:20:30
 17502       8   4,335      34,680       495.7      30.3      00:20:22
 17806       9   4,335      39,015       504.4      30.8      00:20:14
 18160       5   4,335      21,675       514.8      31.5      00:20:01
 18526       5   4,335      21,675       525.0      32.1      00:19:48
 18810       5   4,335      21,675       533.6      32.6      00:19:41
 19121       7   4,335      30,345       542.9      33.2      00:19:31
 19443       8   4,335      34,680       552.6      33.8      00:19:20
 19838       7   4,335      30,345       564.6      34.5      00:19:01
 20229       4   4,335      17,340       576.4      35.2      00:18:44
 20584       9   4,335      39,015       586.9      35.9      00:18:31
 20887       9   4,335      39,015       595.8      36.4      00:18:23
 21194       1   4,335       4,335       604.3      36.9      00:18:15
 21529       8   4,335      34,680       613.4      37.5      00:18:06
 21878      10   4,335      43,350       622.8      38.0      00:17:57
 22217       7   4,335      30,345       631.9      38.6      00:17:47
 22570       8   4,335      34,680       641.5      39.2      00:17:37
 22916       8   4,335      34,680       650.7      39.8      00:17:27
 23222       5   4,335      21,675       659.6      40.3      00:17:19
 23555       7   4,335      30,345       668.7      40.9      00:17:10
 23889       8   4,335      34,680       678.4      41.4      00:16:59
 24257       6   4,335      26,010       688.6      42.1      00:16:47
 24648       7   4,335      30,345       699.5      42.7      00:16:33
 25036       8   4,335      34,680       710.5      43.4      00:16:19
 25400       8   4,335      34,680       721.0      44.1      00:16:07
 25717       5   4,335      21,675       730.0      44.6      00:15:58
 26000       7   4,335      30,345       738.3      45.1      00:15:51
 26311      10   4,335      43,350       747.4      45.7      00:15:42
 26676       8   4,335      34,680       757.3      46.3      00:15:31
 27022       6   4,335      26,010       767.4      46.9      00:15:19
 27321       8   4,335      34,680       775.7      47.4      00:15:12
 27623       7   4,335      30,345       784.4      47.9      00:15:03
 27955       9   4,335      39,015       794.3      48.5      00:14:53
 28313       8   4,335      34,680       804.7      49.2      00:14:40
 28659       9   4,335      39,015       815.2      49.8      00:14:28
 28920       8   4,335      34,680       822.9      50.3      00:14:22
 29220       7   4,335      30,345       831.6      50.8      00:14:14
 29554       9   4,335      39,015       841.3      51.4      00:14:03
 29855       8   4,335      34,680       850.2      51.9      00:13:54
 30146       7   4,335      30,345       858.5      52.5      00:13:46
 30445      10   4,335      43,350       867.4      53.0      00:13:37
 30779       6   4,335      26,010       877.3      53.6      00:13:26
 31171       5   4,335      21,675       888.8      54.3      00:13:13
 31561       4   4,335      17,340       900.6      55.0      00:12:58
 31934      10   4,335      43,350       911.9      55.7      00:12:44
 32308       7   4,335      30,345       923.4      56.4      00:12:31
 32622       7   4,335      30,345       932.8      57.0      00:12:21
 32891       8   4,335      34,680       940.9      57.5      00:12:14
 33161      10   4,335      43,350       949.1      58.0      00:12:06
 33478       7   4,335      30,345       958.5      58.6      00:11:56
 33800       8   4,335      34,680       968.3      59.2      00:11:45
 34113       8   4,335      34,680       977.8      59.7      00:11:35
 34448       6   4,335      26,010       988.0      60.4      00:11:24
 34826       7   4,335      30,345       999.5      61.1      00:11:11
 35203       4   4,335      17,340     1,010.8      61.8      00:10:58
 35576       8   4,335      34,680     1,022.0      62.4      00:10:45
 35959       8   4,335      34,680     1,033.4      63.1      00:10:32
 36335       5   4,335      21,675     1,044.8      63.8      00:10:19
 36673       9   4,335      39,015     1,054.8      64.4      00:10:08
 36973       1   4,335       4,335     1,063.4      65.0      00:09:60
 37278       7   4,335      30,345     1,071.7      65.5      00:09:52
 37560       8   4,335      34,680     1,079.5      65.9      00:09:44
 37842       6   4,335      26,010     1,087.4      66.4      00:09:37
 38139       9   4,335      39,015     1,096.1      67.0      00:09:28
 38426       8   4,335      34,680     1,104.8      67.5      00:09:20
 38774       6   4,335      26,010     1,115.1      68.1      00:09:08
 39108       7   4,335      30,345     1,124.8      68.7      00:08:58
 39423       5   4,335      21,675     1,133.6      69.3      00:08:49
 39763       8   4,335      34,680     1,143.3      69.8      00:08:39
 40161       7   4,335      30,345     1,154.8      70.5      00:08:26
 40569      10   4,335      43,350     1,166.8      71.3      00:08:12
 40970       5   4,335      21,675     1,178.7      72.0      00:07:59
 41261       6   4,335      26,010     1,187.2      72.5      00:07:50
 41598       9   4,335      39,015     1,197.0      73.1      00:07:40
 41940      10   4,335      43,350     1,207.2      73.8      00:07:29
 42254      10   4,335      43,350     1,215.8      74.3      00:07:21
 42565      10   4,335      43,350     1,224.8      74.8      00:07:11
 42888       7   4,335      30,345     1,234.0      75.4      00:07:02
 43196      10   4,335      43,350     1,243.3      76.0      00:06:52
 43508      10   4,335      43,350     1,252.6      76.5      00:06:43
 43809       7   4,335      30,345     1,260.9      77.0      00:06:34
 44105      10   4,335      43,350     1,269.6      77.6      00:06:25
 44439       8   4,335      34,680     1,278.9      78.1      00:06:16
 44783       8   4,335      34,680     1,288.9      78.7      00:06:05
 45123       7   4,335      30,345     1,298.7      79.3      00:05:55
 45457       9   4,335      39,015     1,307.7      79.9      00:05:45
 45757       6   4,335      26,010     1,315.9      80.4      00:05:37
 46046       9   4,335      39,015     1,324.3      80.9      00:05:29
 46332       9   4,335      39,015     1,332.8      81.4      00:05:20
 46639       8   4,335      34,680     1,341.7      82.0      00:05:11
 47002       9   4,335      39,015     1,352.0      82.6      00:04:60
 47318       8   4,335      34,680     1,360.5      83.1      00:04:51
 47609      10   4,335      43,350     1,368.6      83.6      00:04:43
 47883       4   4,335      17,340     1,376.4      84.1      00:04:35
 48150       6   4,335      26,010     1,384.2      84.6      00:04:27
 48430       8   4,335      34,680     1,392.3      85.1      00:04:19
 48730       3   4,335      13,005     1,401.0      85.6      00:04:10
 49043       9   4,335      39,015     1,409.8      86.1      00:04:00
 49333      10   4,335      43,350     1,418.4      86.7      00:03:51
 49636       5   4,335      21,675     1,426.5      87.1      00:03:43
 49941      10   4,335      43,350     1,434.8      87.7      00:03:34
 50238       6   4,335      26,010     1,443.3      88.2      00:03:26
 50574      10   4,335      43,350     1,452.6      88.7      00:03:16
 50900       6   4,335      26,010     1,462.1      89.3      00:03:06
 51240       7   4,335      30,345     1,472.2      89.9      00:02:55
 51570      10   4,335      43,350     1,481.9      90.5      00:02:44
 51873       7   4,335      30,345     1,491.1      91.1      00:02:35
 52171      10   4,335      43,350     1,500.2      91.7      00:02:25
 52518      10   4,335      43,350     1,511.0      92.3      00:02:13
 52894       8   4,335      34,680     1,522.9      93.0      00:02:01
 53294       7   4,335      30,345     1,535.0      93.8      00:01:48
 53682       7   4,335      30,345     1,546.6      94.5      00:01:35
 53976       4   4,335      17,340     1,555.1      95.0      00:01:26
 54266       5   4,335      21,675     1,563.6      95.5      00:01:17
 54609       8   4,335      34,680     1,572.9      96.1      00:01:08
 54962       8   4,335      34,680     1,583.0      96.7      00:00:57
 55307      10   4,335      43,350     1,592.7      97.3      00:00:47
 55632       5   4,335      21,675     1,601.4      97.8      00:00:37
 55914       8   4,335      34,680     1,609.8      98.3      00:00:29
 56165       5   4,335      21,675     1,617.2      98.8      00:00:21
 56454      10   4,335      43,350     1,626.0      99.3      00:00:12
 56748       5   4,335      21,675     1,634.7      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1742.977
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300.csv saved

. 
. cap log close

. 
end of do-file
