
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locatio
> ns_total_10000_5_4q_mnl_R100.dta /export/storage_covidvaccine/Result/MNL_part
> ial/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R1
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  18 Jan 2024, 00:45:52

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_5_4q_mnl_R100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_R100.dta /export/storage_covidvaccine/Result/Max
> VaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_R100.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  18 Jan 2024, 00:45:52

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_R100.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R100.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. use "`baselocs'", clear

. 
. 
. ds
latitude   longitude  blkid

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   501       6   4,035      24,210        11.6       0.8      00:21:48
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   494      10   4,035      40,350        11.4       0.8      00:22:05
  1030       8   4,035      32,280        24.7       1.6      00:20:14
  1011       4   4,035      16,140        24.2       1.6      00:20:42
  1559       6   4,035      24,210        38.8       2.5      00:19:11
  1495       7   4,035      28,245        37.1       2.4      00:20:02
  2118       3   4,035      12,105        53.2       3.5      00:18:27
  2010       9   4,035      36,315        50.3       3.3      00:19:32
  2554      10   4,035      40,350        64.2       4.2      00:18:57
  2682       6   4,035      24,210        67.6       4.4      00:17:58
  3112       7   4,035      28,245        78.8       5.2      00:18:20
  3226       5   4,035      20,175        82.0       5.4      00:17:35
  3759       7   4,035      28,245        96.4       6.3      00:17:17
  3638      10   4,035      40,350        93.1       6.1      00:17:56
  4215       6   4,035      24,210       108.0       7.1      00:17:30
  4099       5   4,035      20,175       105.0       6.9      00:18:02
  4675       9   4,035      36,315       119.8       7.9      00:17:35
  4482       6   4,035      24,210       114.6       7.5      00:18:28
  5106       7   4,035      28,245       131.0       8.6      00:17:44
  4846       7   4,035      28,245       124.2       8.2      00:18:48
  5516       6   4,035      24,210       141.5       9.3      00:17:55
  5222       6   4,035      24,210       134.1       8.8      00:19:01
  5910      10   4,035      40,350       151.3       9.9      00:18:09
  5559       6   4,035      24,210       142.5       9.4      00:19:24
  6345       4   4,035      16,140       162.6      10.7      00:18:09
  5915       7   4,035      28,245       151.5       9.9      00:19:39
  6735       8   4,035      32,280       172.5      11.3      00:18:17
  6324       8   4,035      32,280       162.1      10.6      00:19:37
  7187       7   4,035      28,245       184.1      12.1      00:18:13
  6724       7   4,035      28,245       172.3      11.3      00:19:38
  7699       7   4,035      28,245       197.5      13.0      00:17:55
  7131       5   4,035      20,175       182.8      12.0      00:19:35
  8201       6   4,035      24,210       211.6      13.9      00:17:35
  7602      10   4,035      40,350       195.2      12.8      00:19:18
  8655       7   4,035      28,245       224.1      14.7      00:17:25
  8093       6   4,035      24,210       208.5      13.7      00:18:57
  9130       6   4,035      24,210       237.1      15.6      00:17:12
  8569       8   4,035      32,280       221.8      14.6      00:18:37
  9492       8   4,035      32,280       247.1      16.2      00:17:14
  9012       6   4,035      24,210       233.9      15.3      00:18:24
  9905       9   4,035      36,315       258.6      17.0      00:17:08
  9397       9   4,035      36,315       244.4      16.0      00:18:20
 10315       7   4,035      28,245       268.7      17.6      00:17:09
  9749       6   4,035      24,210       254.4      16.7      00:18:19
 10771       3   4,035      12,105       280.5      18.4      00:17:00
 10123       3   4,035      12,105       264.0      17.3      00:18:19
 11201       9   4,035      36,315       291.8      19.2      00:16:54
 10513      10   4,035      40,350       274.0      18.0      00:18:16
 11542       9   4,035      36,315       300.8      19.7      00:16:57
 10940       4   4,035      16,140       285.0      18.7      00:18:08
 11942       8   4,035      32,280       311.3      20.4      00:16:54
 11284       9   4,035      36,315       294.0      19.3      00:18:09
 12339       6   4,035      24,210       321.8      21.1      00:16:49
 11626       6   4,035      24,210       302.9      19.9      00:18:09
 12884      10   4,035      40,350       335.9      22.0      00:16:31
 12008       8   4,035      32,280       313.0      20.5      00:18:04
 13399       8   4,035      32,280       349.5      22.9      00:16:15
 12373      10   4,035      40,350       322.7      21.2      00:18:00
 13940       9   4,035      36,315       364.3      23.9      00:15:56
 12884      10   4,035      40,350       335.9      22.0      00:17:42
 14483       9   4,035      36,315       379.0      24.9      00:15:37
 13398       6   4,035      24,210       349.5      22.9      00:17:23
 15015       5   4,035      20,175       393.3      25.8      00:15:21
 13908       7   4,035      28,245       363.5      23.9      00:17:03
 15560       7   4,035      28,245       408.1      26.8      00:15:03
 14445       8   4,035      32,280       377.9      24.8      00:16:42
 16088       8   4,035      32,280       422.7      27.7      00:14:46
 14979       9   4,035      36,315       392.3      25.8      00:16:22
 16596      10   4,035      40,350       436.7      28.7      00:14:32
 15506       6   4,035      24,210       406.6      26.7      00:16:03
 16991       8   4,035      32,280       447.3      29.4      00:14:27
 16035       7   4,035      28,245       421.2      27.6      00:15:43
 17371       6   4,035      24,210       457.6      30.0      00:14:23
 16532       7   4,035      28,245       435.1      28.6      00:15:27
 17758       9   4,035      36,315       468.3      30.7      00:14:17
 16916       9   4,035      36,315       445.2      29.2      00:15:22
 18195       8   4,035      32,280       480.2      31.5      00:14:08
 17263       5   4,035      20,175       454.5      29.8      00:15:18
 18672      10   4,035      40,350       492.9      32.3      00:13:57
 17595       6   4,035      24,210       464.0      30.5      00:15:15
 19214       6   4,035      24,210       508.0      33.3      00:13:41
 17991      10   4,035      40,350       474.5      31.1      00:15:08
 19734       9   4,035      36,315       522.6      34.3      00:13:25
 18402       2   4,035       8,070       485.7      31.9      00:14:59
 20262       4   4,035      16,140       537.3      35.3      00:13:10
 18880      10   4,035      40,350       498.6      32.7      00:14:45
 20680       7   4,035      28,245       548.9      36.0      00:13:02
 19390       8   4,035      32,280       512.8      33.7      00:14:28
 21035      10   4,035      40,350       558.5      36.7      00:12:58
 19895       9   4,035      36,315       527.1      34.6      00:14:12
 21460       3   4,035      12,105       569.0      37.3      00:12:53
 20413       8   4,035      32,280       541.4      35.5      00:13:55
 21891       7   4,035      28,245       580.0      38.1      00:12:45
 20783       7   4,035      28,245       551.7      36.2      00:13:49
 22320       6   4,035      24,210       590.8      38.8      00:12:39
 21134       8   4,035      32,280       561.0      36.8      00:13:45
 22736       8   4,035      32,280       601.5      39.5      00:12:32
 21553       8   4,035      32,280       571.7      37.5      00:13:37
 23174       6   4,035      24,210       612.7      40.2      00:12:24
 21975       8   4,035      32,280       582.2      38.2      00:13:30
 23622       9   4,035      36,315       624.2      41.0      00:12:16
 22404       6   4,035      24,210       592.8      38.9      00:13:22
 24065       7   4,035      28,245       636.0      41.7      00:12:06
 22758       5   4,035      20,175       601.9      39.5      00:13:18
 24588      10   4,035      40,350       649.5      42.6      00:11:54
 23124      10   4,035      40,350       611.4      40.1      00:13:12
 25109       8   4,035      32,280       663.4      43.5      00:11:41
 23489       8   4,035      32,280       620.9      40.8      00:13:06
 25608       7   4,035      28,245       676.6      44.4      00:11:29
 23864       9   4,035      36,315       630.8      41.4      00:12:60
 25997      10   4,035      40,350       687.1      45.1      00:11:23
 24273       6   4,035      24,210       641.3      42.1      00:12:52
 26458       7   4,035      28,245       699.3      45.9      00:11:13
 24761       7   4,035      28,245       654.2      42.9      00:12:39
 26955       8   4,035      32,280       712.3      46.8      00:11:01
 25264       5   4,035      20,175       667.5      43.8      00:12:25
 27354       8   4,035      32,280       722.9      47.4      00:10:54
 25696       6   4,035      24,210       678.9      44.6      00:12:15
 27763       9   4,035      36,315       734.0      48.2      00:10:46
 26018       6   4,035      24,210       687.7      45.1      00:12:10
 28233       6   4,035      24,210       746.7      49.0      00:10:35
 26397       7   4,035      28,245       697.8      45.8      00:12:03
 28703       8   4,035      32,280       759.9      49.9      00:10:24
 26850       9   4,035      36,315       709.5      46.6      00:11:53
 29058       3   4,035      12,105       769.8      50.5      00:10:18
 27227       6   4,035      24,210       719.6      47.2      00:11:45
 29512       9   4,035      36,315       782.0      51.3      00:10:08
 27590       8   4,035      32,280       729.2      47.9      00:11:38
 29922       6   4,035      24,210       793.1      52.1      00:09:59
 27951       9   4,035      36,315       739.2      48.5      00:11:31
 30318       6   4,035      24,210       804.0      52.8      00:09:51
 28352      10   4,035      40,350       750.1      49.2      00:11:22
 30803       7   4,035      28,245       817.3      53.6      00:09:40
 28699       5   4,035      20,175       759.8      49.9      00:11:15
 31335       9   4,035      36,315       831.9      54.6      00:09:26
 28953       7   4,035      28,245       766.9      50.3      00:11:12
 31858       9   4,035      36,315       846.6      55.6      00:09:12
 29250      10   4,035      40,350       774.8      50.9      00:11:08
 32365       5   4,035      20,175       861.1      56.5      00:08:59
 29590       5   4,035      20,175       784.0      51.5      00:11:01
 32742       7   4,035      28,245       871.6      57.2      00:08:52
 29902       7   4,035      28,245       792.5      52.0      00:10:56
 33105       6   4,035      24,210       881.8      57.9      00:08:45
 30168       8   4,035      32,280       799.8      52.5      00:10:53
 33548      10   4,035      40,350       894.2      58.7      00:08:34
 30477       7   4,035      28,245       808.4      53.1      00:10:47
 34009      10   4,035      40,350       907.2      59.5      00:08:23
 30863       6   4,035      24,210       819.1      53.8      00:10:38
 34496       7   4,035      28,245       921.0      60.4      00:08:11
 31318       6   4,035      24,210       831.4      54.6      00:10:25
 35020       9   4,035      36,315       935.7      61.4      00:07:58
 31755       8   4,035      32,280       843.7      55.4      00:10:14
 35545       3   4,035      12,105       950.5      62.4      00:07:45
 32197       9   4,035      36,315       856.3      56.2      00:10:01
 36082      10   4,035      40,350       965.2      63.4      00:07:32
 32582       7   4,035      28,245       867.2      56.9      00:09:51
 36585       7   4,035      28,245       979.3      64.3      00:07:20
 32856       6   4,035      24,210       874.8      57.4      00:09:47
 36998      10   4,035      40,350       990.4      65.0      00:07:11
 33151       5   4,035      20,175       883.2      58.0      00:09:41
 37391       8   4,035      32,280     1,000.4      65.7      00:07:04
 33486       6   4,035      24,210       892.4      58.6      00:09:34
 37783       9   4,035      36,315     1,010.6      66.3      00:06:57
 33859       9   4,035      36,315       902.9      59.3      00:09:25
 38174       9   4,035      36,315     1,021.3      67.0      00:06:49
 34198       6   4,035      24,210       912.7      59.9      00:09:17
 38548       8   4,035      32,280     1,031.7      67.7      00:06:41
 34639       8   4,035      32,280       925.0      60.7      00:09:05
 38920       8   4,035      32,280     1,041.8      68.4      00:06:34
 35094       4   4,035      16,140       937.8      61.5      00:08:52
 39304       9   4,035      36,315     1,052.0      69.0      00:06:26
 35562       7   4,035      28,245       951.0      62.4      00:08:39
 39773       7   4,035      28,245     1,064.4      69.9      00:06:16
 36048       7   4,035      28,245       964.3      63.3      00:08:25
 40301       8   4,035      32,280     1,078.5      70.8      00:06:04
 36540       4   4,035      16,140       978.0      64.2      00:08:12
 40836       6   4,035      24,210     1,093.3      71.8      00:05:51
 36889       8   4,035      32,280       987.5      64.8      00:08:04
 41233      10   4,035      40,350     1,104.3      72.5      00:05:42
 37253       7   4,035      28,245       996.8      65.4      00:07:56
 41683       5   4,035      20,175     1,116.5      73.3      00:05:32
 37563       8   4,035      32,280     1,004.8      66.0      00:07:51
 42098      10   4,035      40,350     1,127.7      74.0      00:05:23
 37882       5   4,035      20,175     1,013.3      66.5      00:07:44
 42522       6   4,035      24,210     1,138.9      74.8      00:05:14
 38167       8   4,035      32,280     1,021.1      67.0      00:07:38
 42911       8   4,035      32,280     1,149.2      75.4      00:05:07
 38463       9   4,035      36,315     1,029.3      67.6      00:07:32
 43307       7   4,035      28,245     1,160.4      76.2      00:04:58
 38912      10   4,035      40,350     1,041.6      68.4      00:07:20
 43710      10   4,035      40,350     1,171.0      76.9      00:04:49
 39247      10   4,035      40,350     1,050.5      69.0      00:07:13
 44085      10   4,035      40,350     1,181.2      77.5      00:04:42
 39617       8   4,035      32,280     1,060.4      69.6      00:07:04
 44533       9   4,035      36,315     1,193.0      78.3      00:04:32
 40015       4   4,035      16,140     1,071.0      70.3      00:06:55
 44967       5   4,035      20,175     1,204.7      79.1      00:04:22
 40497       7   4,035      28,245     1,084.0      71.1      00:06:42
 45428      10   4,035      40,350     1,216.5      79.8      00:04:13
 40961      10   4,035      40,350     1,096.9      72.0      00:06:30
 45846       9   4,035      36,315     1,227.2      80.5      00:04:04
 41262       8   4,035      32,280     1,105.1      72.5      00:06:23
 46277       5   4,035      20,175     1,239.1      81.3      00:03:54
 41625       7   4,035      28,245     1,115.0      73.2      00:06:14
 46753       7   4,035      28,245     1,251.9      82.2      00:03:44
 41981       7   4,035      28,245     1,124.8      73.8      00:06:06
 47180       9   4,035      36,315     1,262.9      82.9      00:03:35
 42327       6   4,035      24,210     1,133.4      74.4      00:05:59
 47601       9   4,035      36,315     1,273.7      83.6      00:03:26
 42683       7   4,035      28,245     1,143.0      75.0      00:05:50
 47984       8   4,035      32,280     1,284.0      84.3      00:03:18
 43048       7   4,035      28,245     1,153.0      75.7      00:05:41
 48368       7   4,035      28,245     1,294.3      85.0      00:03:10
 43383       4   4,035      16,140     1,162.4      76.3      00:05:33
 48802       6   4,035      24,210     1,306.0      85.7      00:03:00
 43713      10   4,035      40,350     1,171.1      76.9      00:05:26
 49252      10   4,035      40,350     1,318.2      86.5      00:02:50
 44024       5   4,035      20,175     1,179.5      77.4      00:05:18
 49826       6   4,035      24,210     1,332.6      87.5      00:02:38
 44351       4   4,035      16,140     1,188.2      78.0      00:05:11
 50349       6   4,035      24,210     1,346.2      88.4      00:02:26
 44705       9   4,035      36,315     1,197.6      78.6      00:05:03
 50760      10   4,035      40,350     1,357.2      89.1      00:02:18
 45084       7   4,035      28,245     1,207.9      79.3      00:04:53
 51165       8   4,035      32,280     1,368.3      89.8      00:02:08
 45462       4   4,035      16,140     1,217.4      79.9      00:04:45
 51578       6   4,035      24,210     1,379.6      90.5      00:01:59
 45781       1   4,035       4,035     1,225.5      80.4      00:04:38
 52001       8   4,035      32,280     1,391.4      91.3      00:01:49
 46126       8   4,035      32,280     1,234.7      81.0      00:04:29
 52416       7   4,035      28,245     1,403.4      92.1      00:01:39
 46493       6   4,035      24,210     1,244.8      81.7      00:04:20
 52796       8   4,035      32,280     1,414.7      92.9      00:01:30
 46931       7   4,035      28,245     1,256.9      82.5      00:04:09
 53189       8   4,035      32,280     1,425.8      93.6      00:01:21
 47223       2   4,035       8,070     1,263.9      83.0      00:04:03
 53688       3   4,035      12,105     1,439.7      94.5      00:01:09
 47560       6   4,035      24,210     1,272.6      83.5      00:03:55
 54050       9   4,035      36,315     1,449.5      95.1      00:01:01
 47859      10   4,035      40,350     1,280.5      84.0      00:03:48
 54437       7   4,035      28,245     1,459.8      95.8      00:00:53
 48156      10   4,035      40,350     1,288.5      84.6      00:03:41
 54869       7   4,035      28,245     1,470.9      96.5      00:00:44
 48490       7   4,035      28,245     1,297.6      85.2      00:03:33
 55281       9   4,035      36,315     1,481.9      97.3      00:00:35
 48847       9   4,035      36,315     1,307.1      85.8      00:03:24
 55654      10   4,035      40,350     1,491.2      97.9      00:00:27
 49186       3   4,035      12,105     1,316.4      86.4      00:03:15
 56035       7   4,035      28,245     1,501.7      98.6      00:00:18
 49524       7   4,035      28,245     1,325.0      87.0      00:03:08
 56450      10   4,035      40,350     1,513.3      99.3      00:00:09
 49831       5   4,035      20,175     1,332.7      87.5      00:03:01
 50123      10   4,035      40,350     1,340.4      88.0      00:02:54

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1275.419
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 50459       7   4,035      28,245     1,348.9      88.5      00:02:46
 50808       8   4,035      32,280     1,358.5      89.2      00:02:37
 51124      10   4,035      40,350     1,367.3      89.7      00:02:29
 51454       7   4,035      28,245     1,376.1      90.3      00:02:21
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R100.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R100.csv saved

. 
. cap log close

. 
end of do-file
 51777       8   4,035      32,280     1,385.2      90.9      00:02:12
 52101       4   4,035      16,140     1,394.3      91.5      00:02:04
 52448       5   4,035      20,175     1,404.4      92.2      00:01:54
 52890       6   4,035      24,210     1,417.4      93.0      00:01:41
 53343       7   4,035      28,245     1,430.1      93.9      00:01:29
 53770      10   4,035      40,350     1,442.0      94.6      00:01:18
 54064       3   4,035      12,105     1,449.9      95.2      00:01:10
 54456       3   4,035      12,105     1,460.2      95.8      00:01:00
 54892       7   4,035      28,245     1,471.5      96.6      00:00:50
 55322       8   4,035      32,280     1,482.8      97.3      00:00:39
 55703       7   4,035      28,245     1,492.7      98.0      00:00:29
 56098       6   4,035      24,210     1,503.4      98.7      00:00:19
 56516       6   4,035      24,210     1,515.2      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1454.178
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R100.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R100.csv saved

. 
. cap log close

. 
end of do-file
