
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A800_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   396      10   4,835      48,350        11.0       0.6      00:27:38
   799       6   4,835      29,010        22.9       1.3      00:26:14
  1196       6   4,835      29,010        34.9       1.9      00:25:43
  1581       8   4,835      38,680        47.2       2.6      00:25:09
  1981       9   4,835      43,515        59.5       3.3      00:24:47
  2379       8   4,835      38,680        71.7       3.9      00:24:30
  2781       7   4,835      33,845        84.3       4.6      00:24:09
  3176       6   4,835      29,010        96.7       5.3      00:23:53
  3544       6   4,835      29,010       108.6       6.0      00:23:45
  3915       8   4,835      38,680       120.3       6.6      00:23:40
  4209       2   4,835       9,670       129.2       7.1      00:24:07
  4506       3   4,835      14,505       138.0       7.6      00:24:29
  4768       4   4,835      19,340       146.5       8.0      00:24:52
  5023       8   4,835      38,680       154.5       8.5      00:25:17
  5322       7   4,835      33,845       163.8       9.0      00:25:24
  5569       9   4,835      43,515       171.1       9.4      00:25:50
  5803       8   4,835      38,680       178.1       9.8      00:26:16
  6061       7   4,835      33,845       186.3      10.2      00:26:27
  6333       2   4,835       9,670       194.6      10.7      00:26:36
  6592       7   4,835      33,845       202.5      11.1      00:26:46
  6903       5   4,835      24,175       212.0      11.6      00:26:42
  7279       5   4,835      24,175       223.4      12.2      00:26:21
  7674       8   4,835      38,680       236.1      12.9      00:25:51
  8081       7   4,835      33,845       249.4      13.7      00:25:19
  8482       8   4,835      38,680       262.8      14.4      00:24:49
  8878       8   4,835      38,680       275.7      15.1      00:24:24
  9247      10   4,835      48,350       288.0      15.8      00:24:04
  9522       8   4,835      38,680       297.2      16.3      00:24:03
  9839       6   4,835      29,010       307.8      16.9      00:23:53
 10160       5   4,835      24,175       317.4      17.4      00:23:49
 10475       9   4,835      43,515       327.1      17.9      00:23:43
 10856       5   4,835      24,175       338.8      18.6      00:23:27
 11216       8   4,835      38,680       350.2      19.2      00:23:13
 11509       8   4,835      38,680       359.5      19.7      00:23:09
 11821      10   4,835      48,350       369.3      20.2      00:23:03
 12126       7   4,835      33,845       379.0      20.8      00:22:57
 12475       9   4,835      43,515       389.8      21.4      00:22:45
 12902       7   4,835      33,845       403.1      22.1      00:22:24
 13343       7   4,835      33,845       417.0      22.8      00:21:60
 13689      10   4,835      48,350       428.7      23.5      00:21:46
 13968       3   4,835      14,505       437.3      24.0      00:21:44
 14337      10   4,835      48,350       449.3      24.6      00:21:29
 14717       8   4,835      38,680       461.6      25.3      00:21:13
 15107       9   4,835      43,515       474.4      26.0      00:20:56
 15522       5   4,835      24,175       487.8      26.7      00:20:36
 15936       8   4,835      38,680       501.3      27.5      00:20:17
 16342       6   4,835      29,010       514.9      28.2      00:19:59
 16713       9   4,835      43,515       527.0      28.9      00:19:45
 17040      10   4,835      48,350       537.6      29.4      00:19:36
 17370       8   4,835      38,680       548.3      30.0      00:19:27
 17696       9   4,835      43,515       559.3      30.6      00:19:17
 18053      10   4,835      48,350       570.6      31.3      00:19:06
 18396       8   4,835      38,680       581.8      31.9      00:18:55
 18819      10   4,835      48,350       595.4      32.6      00:18:38
 19253       7   4,835      33,845       610.0      33.4      00:18:18
 19680      10   4,835      48,350       624.3      34.2      00:17:59
 20095       8   4,835      38,680       638.6      35.0      00:17:41
 20499      10   4,835      48,350       651.7      35.7      00:17:27
 20751       9   4,835      43,515       659.9      36.1      00:17:24
 21027       9   4,835      43,515       669.0      36.6      00:17:19
 21372       9   4,835      43,515       679.1      37.2      00:17:12
 21720       8   4,835      38,680       689.8      37.8      00:17:03
 22057      10   4,835      48,350       700.1      38.3      00:16:55
 22418       5   4,835      24,175       710.8      38.9      00:16:46
 22749      10   4,835      48,350       721.0      39.5      00:16:38
 23099       2   4,835       9,670       731.8      40.1      00:16:28
 23460       6   4,835      29,010       743.3      40.7      00:16:17
 23851       9   4,835      43,515       755.5      41.4      00:16:05
 24231       8   4,835      38,680       767.1      42.0      00:15:54
 24658      10   4,835      48,350       780.6      42.8      00:15:39
 25087       9   4,835      43,515       794.1      43.5      00:15:24
 25502       9   4,835      43,515       807.6      44.2      00:15:09
 25826       8   4,835      38,680       817.9      44.8      00:15:01
 26152       7   4,835      33,845       828.4      45.4      00:14:52
 26541       6   4,835      29,010       840.5      46.0      00:14:41
 26952       5   4,835      24,175       853.4      46.7      00:14:27
 27262      10   4,835      48,350       863.3      47.3      00:14:20
 27535       6   4,835      29,010       872.1      47.8      00:14:14
 27868       4   4,835      19,340       883.0      48.4      00:14:05
 28309       6   4,835      29,010       897.4      49.2      00:13:49
 28729       8   4,835      38,680       911.5      49.9      00:13:34
 29038      10   4,835      48,350       921.7      50.5      00:13:26
 29427       9   4,835      43,515       934.4      51.2      00:13:13
 29805      10   4,835      48,350       946.5      51.8      00:13:02
 30126       8   4,835      38,680       957.0      52.4      00:12:53
 30459       9   4,835      43,515       968.0      53.0      00:12:43
 30850       6   4,835      29,010       981.0      53.7      00:12:30
 31288       6   4,835      29,010       995.3      54.5      00:12:15
 31716       7   4,835      33,845     1,009.6      55.3      00:12:01
 32138      10   4,835      48,350     1,024.0      56.1      00:11:46
 32530       4   4,835      19,340     1,037.5      56.8      00:11:33
 32811       8   4,835      38,680     1,046.8      57.3      00:11:26
 33103       6   4,835      29,010     1,056.6      57.9      00:11:18
 33432       5   4,835      24,175     1,067.5      58.5      00:11:09
 33776       9   4,835      43,515     1,079.1      59.1      00:10:58
 34124       8   4,835      38,680     1,091.0      59.8      00:10:48
 34529       9   4,835      43,515     1,104.7      60.5      00:10:34
 34974       9   4,835      43,515     1,119.8      61.3      00:10:19
 35425       3   4,835      14,505     1,134.9      62.2      00:10:04
 35867      10   4,835      48,350     1,149.5      63.0      00:09:49
 36305       4   4,835      19,340     1,164.2      63.8      00:09:35
 36702       5   4,835      24,175     1,177.2      64.5      00:09:23
 37040       4   4,835      19,340     1,188.0      65.1      00:09:14
 37383       7   4,835      33,845     1,198.5      65.6      00:09:05
 37705       6   4,835      29,010     1,208.5      66.2      00:08:57
 38030       8   4,835      38,680     1,218.9      66.8      00:08:48
 38365       9   4,835      43,515     1,230.1      67.4      00:08:39
 38680       8   4,835      38,680     1,240.6      68.0      00:08:30
 38983       9   4,835      43,515     1,250.4      68.5      00:08:22
 39295      10   4,835      48,350     1,260.3      69.0      00:08:14
 39670       4   4,835      19,340     1,272.3      69.7      00:08:04
 40094       8   4,835      38,680     1,285.8      70.4      00:07:51
 40543       4   4,835      19,340     1,300.5      71.2      00:07:37
 40985       6   4,835      29,010     1,315.1      72.0      00:07:23
 41308       6   4,835      29,010     1,325.7      72.6      00:07:14
 41694       8   4,835      38,680     1,338.1      73.3      00:07:03
 42033       8   4,835      38,680     1,349.3      73.9      00:06:54
 42380       7   4,835      33,845     1,359.9      74.5      00:06:45
 42717       6   4,835      29,010     1,370.8      75.1      00:06:35
 43071       3   4,835      14,505     1,382.4      75.7      00:06:25
 43400       4   4,835      19,340     1,393.5      76.3      00:06:16
 43741       7   4,835      33,845     1,404.2      76.9      00:06:07
 44028       5   4,835      24,175     1,413.5      77.4      00:05:59
 44347       8   4,835      38,680     1,423.7      78.0      00:05:51
 44688       9   4,835      43,515     1,434.5      78.6      00:05:41
 45062       9   4,835      43,515     1,446.6      79.2      00:05:31
 45453       5   4,835      24,175     1,458.4      79.9      00:05:20
 45806       3   4,835      14,505     1,469.2      80.5      00:05:11
 46168       8   4,835      38,680     1,481.0      81.1      00:05:01
 46520       9   4,835      43,515     1,492.4      81.7      00:04:51
 46904       6   4,835      29,010     1,505.2      82.4      00:04:39
 47226       9   4,835      43,515     1,514.5      83.0      00:04:32
 47555       5   4,835      24,175     1,524.7      83.5      00:04:23
 47867       4   4,835      19,340     1,534.7      84.1      00:04:15
 48188       5   4,835      24,175     1,545.0      84.6      00:04:06
 48519       9   4,835      43,515     1,555.8      85.2      00:03:56
 48890       7   4,835      33,845     1,567.7      85.9      00:03:46
 49242       9   4,835      43,515     1,579.3      86.5      00:03:36
 49572       5   4,835      24,175     1,589.2      87.1      00:03:27
 49895       8   4,835      38,680     1,598.8      87.6      00:03:19
 50210       9   4,835      43,515     1,608.9      88.1      00:03:10
 50548       8   4,835      38,680     1,619.3      88.7      00:03:01
 50902       8   4,835      38,680     1,630.9      89.3      00:02:51
 51244       8   4,835      38,680     1,642.1      89.9      00:02:41
 51598       8   4,835      38,680     1,653.7      90.6      00:02:31
 51948       8   4,835      38,680     1,665.5      91.2      00:02:21
 52289       5   4,835      24,175     1,677.3      91.9      00:02:10
 52628       8   4,835      38,680     1,689.2      92.5      00:01:60
 52903       6   4,835      29,010     1,698.9      93.1      00:01:51
 53210       9   4,835      43,515     1,709.2      93.6      00:01:42
 53629       6   4,835      29,010     1,723.3      94.4      00:01:30
 53972       7   4,835      33,845     1,734.4      95.0      00:01:20
 54274       5   4,835      24,175     1,744.2      95.5      00:01:12
 54617       6   4,835      29,010     1,754.5      96.1      00:01:03
 55008       9   4,835      43,515     1,767.1      96.8      00:00:51
 55370       5   4,835      24,175     1,778.1      97.4      00:00:42
 55707       8   4,835      38,680     1,788.7      98.0      00:00:32
 56036      10   4,835      48,350     1,799.5      98.6      00:00:23
 56373      10   4,835      48,350     1,810.7      99.2      00:00:13
 56724      10   4,835      48,350     1,822.5      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,825.7        Number of regions         = 56,821    
Computed distances (M)  = 1,825.65       Total run time (seconds)  = 1610.694
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
