
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A500_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   419       2   4,535       9,070        10.8       0.6      00:26:10
   867      10   4,535      45,350        23.1       1.4      00:24:22
  1323       4   4,535      18,140        36.5       2.1      00:22:60
  1779       7   4,535      31,745        50.0       2.9      00:22:10
  2250       4   4,535      18,140        63.6       3.7      00:21:37
  2715       5   4,535      22,675        77.0       4.5      00:21:16
  3176       6   4,535      27,210        90.7       5.3      00:20:52
  3647       9   4,535      40,815       105.0       6.1      00:20:26
  4087       6   4,535      27,210       117.6       6.9      00:20:21
  4485       4   4,535      18,140       128.8       7.5      00:20:30
  4847      10   4,535      45,350       139.7       8.2      00:20:40
  5211       7   4,535      31,745       150.4       8.8      00:20:47
  5560       8   4,535      36,280       160.2       9.4      00:21:00
  5902       7   4,535      31,745       169.8       9.9      00:21:13
  6286      10   4,535      45,350       181.2      10.6      00:21:08
  6664       9   4,535      40,815       191.9      11.2      00:21:09
  7034       4   4,535      18,140       202.6      11.8      00:21:09
  7441       9   4,535      40,815       214.5      12.5      00:20:59
  7844      10   4,535      45,350       226.5      13.2      00:20:48
  8249       7   4,535      31,745       239.2      14.0      00:20:33
  8626       7   4,535      31,745       251.0      14.7      00:20:24
  9023       5   4,535      22,675       263.2      15.4      00:20:13
  9351       6   4,535      27,210       273.4      16.0      00:20:12
  9675       9   4,535      40,815       283.6      16.6      00:20:11
  9968       8   4,535      36,280       292.4      17.1      00:20:16
 10302      10   4,535      45,350       301.6      17.6      00:20:18
 10634       3   4,535      13,605       311.3      18.2      00:20:17
 11035       7   4,535      31,745       323.2      18.9      00:20:05
 11364       8   4,535      36,280       332.8      19.4      00:20:04
 11685      10   4,535      45,350       342.3      20.0      00:20:03
 12028      10   4,535      45,350       352.5      20.6      00:19:58
 12385       9   4,535      40,815       363.1      21.2      00:19:51
 12840       7   4,535      31,745       376.2      22.0      00:19:34
 13316       8   4,535      36,280       390.3      22.8      00:19:13
 13700       9   4,535      40,815       402.5      23.5      00:19:01
 13994       9   4,535      40,815       411.0      24.0      00:19:02
 14378       8   4,535      36,280       422.8      24.7      00:18:50
 14765       7   4,535      31,745       434.4      25.4      00:18:40
 15196       8   4,535      36,280       447.7      26.1      00:18:23
 15648      10   4,535      45,350       461.2      26.9      00:18:07
 16075       8   4,535      36,280       474.7      27.7      00:17:51
 16496       9   4,535      40,815       487.9      28.5      00:17:36
 16841       6   4,535      27,210       498.2      29.1      00:17:30
 17161       4   4,535      18,140       507.8      29.7      00:17:25
 17466       7   4,535      31,745       517.3      30.2      00:17:21
 17788       2   4,535       9,070       527.1      30.8      00:17:16
 18141       7   4,535      31,745       538.0      31.4      00:17:08
 18515       6   4,535      27,210       548.9      32.1      00:16:59
 18964       9   4,535      40,815       563.0      32.9      00:16:42
 19421       7   4,535      31,745       577.3      33.7      00:16:24
 19869       5   4,535      22,675       591.6      34.5      00:16:08
 20345       5   4,535      22,675       606.4      35.4      00:15:50
 20716       8   4,535      36,280       618.0      36.1      00:15:40
 21057      10   4,535      45,350       628.3      36.7      00:15:33
 21426       7   4,535      31,745       638.6      37.3      00:15:26
 21775       6   4,535      27,210       648.4      37.9      00:15:20
 22144       9   4,535      40,815       658.9      38.5      00:15:13
 22524       7   4,535      31,745       669.8      39.1      00:15:04
 22892      10   4,535      45,350       680.1      39.7      00:14:57
 23248       7   4,535      31,745       690.9      40.3      00:14:48
 23608       7   4,535      31,745       701.1      40.9      00:14:41
 24013       9   4,535      40,815       713.3      41.7      00:14:30
 24464       6   4,535      27,210       726.1      42.4      00:14:17
 24932       3   4,535      13,605       740.2      43.2      00:14:02
 25356       8   4,535      36,280       753.0      44.0      00:13:49
 25747       8   4,535      36,280       764.6      44.7      00:13:39
 26091       9   4,535      40,815       775.2      45.3      00:13:31
 26506       8   4,535      36,280       787.3      46.0      00:13:20
 26923       7   4,535      31,745       799.6      46.7      00:13:09
 27278       6   4,535      27,210       810.2      47.3      00:13:01
 27611       2   4,535       9,070       820.3      47.9      00:12:53
 28019       3   4,535      13,605       832.8      48.6      00:12:42
 28457       9   4,535      40,815       846.3      49.4      00:12:28
 28825       9   4,535      40,815       857.9      50.1      00:12:18
 29143       4   4,535      18,140       867.8      50.7      00:12:11
 29518       7   4,535      31,745       879.1      51.3      00:12:01
 29866       3   4,535      13,605       889.7      52.0      00:11:53
 30177       5   4,535      22,675       899.2      52.5      00:11:46
 30535       6   4,535      27,210       910.4      53.2      00:11:37
 30961       6   4,535      27,210       923.5      53.9      00:11:24
 31428      10   4,535      45,350       937.9      54.8      00:11:10
 31904       5   4,535      22,675       953.0      55.7      00:10:54
 32369       7   4,535      31,745       968.0      56.5      00:10:39
 32695       4   4,535      18,140       978.1      57.1      00:10:31
 33009       5   4,535      22,675       988.1      57.7      00:10:24
 33366       9   4,535      40,815       999.3      58.4      00:10:15
 33745       7   4,535      31,745     1,011.2      59.1      00:10:04
 34114       9   4,535      40,815     1,022.9      59.7      00:09:54
 34550       8   4,535      36,280     1,036.8      60.5      00:09:41
 34998       7   4,535      31,745     1,051.0      61.4      00:09:27
 35440       8   4,535      36,280     1,065.0      62.2      00:09:14
 35898       9   4,535      40,815     1,079.2      63.0      00:09:01
 36356       5   4,535      22,675     1,093.6      63.9      00:08:47
 36752       6   4,535      27,210     1,105.7      64.6      00:08:37
 37113      10   4,535      45,350     1,116.5      65.2      00:08:28
 37470       9   4,535      40,815     1,126.6      65.8      00:08:20
 37801       6   4,535      27,210     1,136.3      66.4      00:08:12
 38126      10   4,535      45,350     1,146.3      66.9      00:08:05
 38459       6   4,535      27,210     1,156.8      67.6      00:07:56
 38789       9   4,535      40,815     1,167.0      68.1      00:07:48
 39101       8   4,535      36,280     1,176.5      68.7      00:07:41
 39487       8   4,535      36,280     1,187.8      69.4      00:07:31
 39868       5   4,535      22,675     1,199.3      70.0      00:07:21
 40353      10   4,535      45,350     1,213.8      70.9      00:07:08
 40813      10   4,535      45,350     1,228.1      71.7      00:06:55
 41159       6   4,535      27,210     1,238.8      72.3      00:06:46
 41556       7   4,535      31,745     1,250.9      73.1      00:06:35
 41946       8   4,535      36,280     1,263.1      73.8      00:06:25
 42309       6   4,535      27,210     1,273.4      74.4      00:06:16
 42683       7   4,535      31,745     1,284.7      75.0      00:06:07
 43037       3   4,535      13,605     1,295.5      75.7      00:05:58
 43369       7   4,535      31,745     1,306.1      76.3      00:05:49
 43724       6   4,535      27,210     1,316.5      76.9      00:05:40
 43998       8   4,535      36,280     1,325.0      77.4      00:05:34
 44320      10   4,535      45,350     1,334.6      77.9      00:05:26
 44709       9   4,535      40,815     1,346.2      78.6      00:05:16
 45093       9   4,535      40,815     1,357.7      79.3      00:05:06
 45490       4   4,535      18,140     1,369.0      80.0      00:04:56
 45867       2   4,535       9,070     1,379.8      80.6      00:04:47
 46224       5   4,535      22,675     1,390.9      81.2      00:04:38
 46591      10   4,535      45,350     1,402.2      81.9      00:04:28
 47028       3   4,535      13,605     1,415.1      82.6      00:04:17
 47389       6   4,535      27,210     1,425.4      83.2      00:04:08
 47752       9   4,535      40,815     1,436.1      83.9      00:03:59
 48086      10   4,535      45,350     1,446.2      84.5      00:03:50
 48434       6   4,535      27,210     1,456.7      85.1      00:03:41
 48819       8   4,535      36,280     1,468.3      85.7      00:03:31
 49190       6   4,535      27,210     1,479.6      86.4      00:03:22
 49663       8   4,535      36,280     1,493.0      87.2      00:03:10
 50185       6   4,535      27,210     1,508.4      88.1      00:02:56
 50569      10   4,535      45,350     1,519.5      88.7      00:02:47
 50932      10   4,535      45,350     1,530.7      89.4      00:02:37
 51310       8   4,535      36,280     1,542.2      90.1      00:02:27
 51688       9   4,535      40,815     1,554.1      90.8      00:02:17
 52060       8   4,535      36,280     1,565.7      91.4      00:02:07
 52406       8   4,535      36,280     1,577.0      92.1      00:01:57
 52751       7   4,535      31,745     1,588.5      92.8      00:01:47
 53109       7   4,535      31,745     1,600.0      93.4      00:01:37
 53547      10   4,535      45,350     1,613.7      94.2      00:01:25
 53915       5   4,535      22,675     1,625.1      94.9      00:01:15
 54248       6   4,535      27,210     1,635.2      95.5      00:01:07
 54621       7   4,535      31,745     1,645.7      96.1      00:00:58
 55017       9   4,535      40,815     1,657.7      96.8      00:00:47
 55413       8   4,535      36,280     1,669.0      97.5      00:00:37
 55765       6   4,535      27,210     1,679.5      98.1      00:00:28
 56119       2   4,535       9,070     1,690.4      98.7      00:00:19
 56487       5   4,535      22,675     1,702.1      99.4      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1486.689
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
