
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_R400.dta /export/storage_covidvaccine/Result/Max
> VaxDistLogLin/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_5
> _4q_mnl_R400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  18 Jan 2024, 00:45:52

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_R400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locatio
> ns_total_10000_5_4q_mnl_R400.dta /export/storage_covidvaccine/Result/MNL_part
> ial/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R4
> 00.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  18 Jan 2024, 00:45:52

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_5_4q_mnl_R400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
. ds
latitude   longitude  blkid
latitude   longitude  blkid

. 

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   493       5   4,035      20,175        11.4       0.7      00:22:08
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   500       6   4,035      24,210        11.6       0.8      00:21:52
  1009       6   4,035      24,210        24.1       1.6      00:20:44
  1014       6   4,035      24,210        24.3       1.6      00:20:38
  1485      10   4,035      40,350        36.9       2.4      00:20:11
  1499      10   4,035      40,350        37.3       2.4      00:19:59
  1958       5   4,035      20,175        49.0       3.2      00:20:06
  2019       6   4,035      24,210        50.5       3.3      00:19:27
  2452       7   4,035      28,245        61.7       4.0      00:19:46
  2538       3   4,035      12,105        63.8       4.2      00:19:06
  2953       6   4,035      24,210        74.8       4.9      00:19:24
  3067       7   4,035      28,245        77.6       5.1      00:18:39
  3422       9   4,035      36,315        87.4       5.7      00:19:11
  3571       4   4,035      16,140        91.5       6.0      00:18:18
  3886      10   4,035      40,350        99.7       6.5      00:19:04
  4044       7   4,035      28,245       103.5       6.8      00:18:19
  4219       6   4,035      24,210       108.0       7.1      00:19:40
  4415       8   4,035      32,280       112.8       7.4      00:18:48
  4554       8   4,035      32,280       116.5       7.6      00:20:09
  4761       8   4,035      32,280       122.1       8.0      00:19:10
  4882       9   4,035      36,315       125.2       8.2      00:20:29
  5143       9   4,035      36,315       132.0       8.7      00:19:21
  5225       8   4,035      32,280       134.2       8.8      00:20:44
  5529       5   4,035      20,175       141.8       9.3      00:19:31
  5567       4   4,035      16,140       142.8       9.4      00:20:59
  5915       7   4,035      28,245       151.5       9.9      00:19:39
  5920      10   4,035      40,350       151.7      10.0      00:21:08
  6325       6   4,035      24,210       162.1      10.6      00:19:37
  6334       6   4,035      24,210       162.4      10.7      00:20:59
  6747       8   4,035      32,280       172.8      11.3      00:19:34
  7204       8   4,035      32,280       184.5      12.1      00:19:23
  6729      10   4,035      40,350       172.3      11.3      00:20:56
  7697       2   4,035       8,070       197.5      13.0      00:19:03
  7125      10   4,035      40,350       182.7      12.0      00:20:49
  8178       9   4,035      36,315       211.0      13.8      00:18:42
  7556       6   4,035      24,210       193.9      12.7      00:20:36
  8677       9   4,035      36,315       224.6      14.7      00:18:20
  7953       6   4,035      24,210       204.7      13.4      00:20:26
  9114       9   4,035      36,315       236.7      15.5      00:18:09
  8353       7   4,035      28,245       215.7      14.2      00:20:14
  9452       9   4,035      36,315       246.0      16.1      00:18:12
  8765       6   4,035      24,210       227.0      14.9      00:20:01
  9812       4   4,035      16,140       256.1      16.8      00:18:10
  9162       8   4,035      32,280       238.0      15.6      00:19:50
 10191       6   4,035      24,210       265.6      17.4      00:18:11
  9487       9   4,035      36,315       246.9      16.2      00:19:51
 10611      10   4,035      40,350       276.4      18.1      00:18:04
  9836       9   4,035      36,315       256.8      16.9      00:19:46
 11052       4   4,035      16,140       287.9      18.9      00:17:54
 10201       9   4,035      36,315       265.9      17.4      00:19:45
 11407       7   4,035      28,245       297.2      19.5      00:17:54
 10612       1   4,035       4,035       276.4      18.1      00:19:35
 11712       5   4,035      20,175       305.2      20.0      00:17:59
 11045       5   4,035      20,175       287.8      18.9      00:19:21
 12062       8   4,035      32,280       314.6      20.6      00:17:58
 11394       7   4,035      28,245       296.9      19.5      00:19:19
 12461       2   4,035       8,070       325.0      21.3      00:17:51
 11726       8   4,035      32,280       305.6      20.1      00:19:17
 12961       6   4,035      24,210       337.8      22.2      00:17:34
 12080       6   4,035      24,210       315.1      20.7      00:19:13
 13454       9   4,035      36,315       351.1      23.0      00:17:17
 12470       9   4,035      36,315       325.2      21.3      00:19:04
 14001       8   4,035      32,280       365.9      24.0      00:16:54
 12983       6   4,035      24,210       338.4      22.2      00:18:42
 14518       6   4,035      24,210       380.0      24.9      00:16:34
 13471       8   4,035      32,280       351.7      23.1      00:18:21
 15057       6   4,035      24,210       394.4      25.9      00:16:15
 14006       9   4,035      36,315       366.0      24.0      00:17:57
 15607       3   4,035      12,105       409.3      26.9      00:15:54
 14539       4   4,035      16,140       380.5      25.0      00:17:33
 16132       8   4,035      32,280       423.9      27.8      00:15:35
 15071      10   4,035      40,350       394.9      25.9      00:17:11
 16614       8   4,035      32,280       437.1      28.7      00:15:21
 15585       6   4,035      24,210       408.7      26.8      00:16:51
 16988       8   4,035      32,280       447.2      29.4      00:15:16
 16080       7   4,035      28,245       422.5      27.7      00:16:32
 17342       6   4,035      24,210       456.8      30.0      00:15:12
 16550       7   4,035      28,245       435.5      28.6      00:16:16
 17693       5   4,035      20,175       466.7      30.6      00:15:07
 16932       9   4,035      36,315       445.6      29.2      00:16:09
 18100       4   4,035      16,140       477.5      31.3      00:14:59
 17288      10   4,035      40,350       455.3      29.9      00:16:04
 18508       8   4,035      32,280       488.2      32.0      00:14:52
 17620       9   4,035      36,315       464.7      30.5      00:15:58
 19018       8   4,035      32,280       502.5      33.0      00:14:35
 18038       7   4,035      28,245       475.8      31.2      00:15:49
 19538       5   4,035      20,175       517.0      33.9      00:14:18
 18441       7   4,035      28,245       486.6      31.9      00:15:39
 20047       7   4,035      28,245       531.6      34.9      00:14:01
 18953       6   4,035      24,210       500.7      32.9      00:15:21
 20544       8   4,035      32,280       545.1      35.8      00:13:47
 19468       9   4,035      36,315       515.0      33.8      00:15:02
 20907       7   4,035      28,245       555.1      36.4      00:13:41
 19986       5   4,035      20,175       529.7      34.8      00:14:43
 21315       8   4,035      32,280       565.3      37.1      00:13:35
 20501       6   4,035      24,210       543.9      35.7      00:14:26
 21747       6   4,035      24,210       576.3      37.8      00:13:27
 20828       7   4,035      28,245       552.9      36.3      00:14:22
 22133       7   4,035      28,245       586.0      38.5      00:13:21
 21187       1   4,035       4,035       562.4      36.9      00:14:16
 22476       4   4,035      16,140       594.6      39.0      00:13:18
 21562       8   4,035      32,280       571.9      37.5      00:14:10
 22828       7   4,035      28,245       603.5      39.6      00:13:14
 21954      10   4,035      40,350       581.6      38.2      00:14:04
 23164       8   4,035      32,280       612.4      40.2      00:13:10
 22315       8   4,035      32,280       590.6      38.8      00:13:59
 23524       8   4,035      32,280       621.7      40.8      00:13:04
 22676       5   4,035      20,175       600.0      39.4      00:13:53
 23895       7   4,035      28,245       631.6      41.5      00:12:58
 23039       9   4,035      36,315       609.0      40.0      00:13:47
 24303       4   4,035      16,140       642.0      42.1      00:12:50
 23410       3   4,035      12,105       619.0      40.6      00:13:40
 24723       8   4,035      32,280       653.2      42.9      00:12:41
 23800       4   4,035      16,140       629.1      41.3      00:13:32
 25158      10   4,035      40,350       664.8      43.6      00:12:30
 24211       6   4,035      24,210       639.6      42.0      00:13:23
 25600       2   4,035       8,070       676.4      44.4      00:12:20
 24665       8   4,035      32,280       651.6      42.8      00:13:11
 25930       5   4,035      20,175       685.4      45.0      00:12:15
 25118       6   4,035      24,210       663.6      43.6      00:12:59
 26284       6   4,035      24,210       695.0      45.6      00:12:08
 25560       7   4,035      28,245       675.5      44.3      00:12:47
 26680       6   4,035      24,210       705.0      46.3      00:12:01
 25864       8   4,035      32,280       683.6      44.9      00:12:43
 27045       5   4,035      20,175       714.8      46.9      00:11:54
 26159       5   4,035      20,175       691.5      45.4      00:12:39
 27334       8   4,035      32,280       722.4      47.4      00:11:51
 26555       6   4,035      24,210       701.7      46.1      00:12:31
 27635      10   4,035      40,350       730.5      47.9      00:11:47
 26920       2   4,035       8,070       711.4      46.7      00:12:23
 27991      10   4,035      40,350       740.2      48.6      00:11:39
 27245       7   4,035      28,245       720.0      47.3      00:12:18
 28391      10   4,035      40,350       751.2      49.3      00:11:30
 27530       7   4,035      28,245       727.7      47.8      00:12:14
 28750       9   4,035      36,315       761.2      50.0      00:11:22
 27888      10   4,035      40,350       737.5      48.4      00:12:06
 29012       6   4,035      24,210       768.5      50.4      00:11:19
 28295      10   4,035      40,350       748.5      49.1      00:11:56
 29355      10   4,035      40,350       777.7      51.0      00:11:12
 28692       3   4,035      12,105       759.6      49.9      00:11:45
 29733       6   4,035      24,210       787.9      51.7      00:11:04
 28956       5   4,035      20,175       767.0      50.3      00:11:42
 30032       7   4,035      28,245       796.1      52.3      00:10:59
 29303       8   4,035      32,280       776.2      50.9      00:11:34
 30338       1   4,035       4,035       804.4      52.8      00:10:54
 29699       7   4,035      28,245       786.9      51.6      00:11:25
 30651       7   4,035      28,245       813.1      53.4      00:10:47
 30022       7   4,035      28,245       795.8      52.2      00:11:18
 31098       9   4,035      36,315       825.2      54.2      00:10:36
 30387       7   4,035      28,245       805.8      52.9      00:11:09
 31525       8   4,035      32,280       837.3      55.0      00:10:24
 30773       6   4,035      24,210       816.5      53.6      00:10:59
 31958       7   4,035      28,245       849.5      55.8      00:10:12
 31219       6   4,035      24,210       828.6      54.4      00:10:47
 32401       5   4,035      20,175       862.2      56.6      00:09:59
 31654       5   4,035      20,175       840.8      55.2      00:10:34
 32723       6   4,035      24,210       871.1      57.2      00:09:53
 32097       8   4,035      32,280       853.5      56.0      00:10:21
 33036       8   4,035      32,280       879.9      57.8      00:09:46
 32539       8   4,035      32,280       866.0      56.8      00:10:08
 33357       8   4,035      32,280       888.9      58.3      00:09:39
 32819       5   4,035      20,175       873.8      57.4      00:10:03
 33720       6   4,035      24,210       899.1      59.0      00:09:30
 33094       6   4,035      24,210       881.5      57.9      00:09:58
 34100       5   4,035      20,175       909.8      59.7      00:09:21
 33431       7   4,035      28,245       890.9      58.5      00:09:50
 34524       8   4,035      32,280       921.8      60.5      00:09:09
 33808       6   4,035      24,210       901.5      59.2      00:09:41
 34994       8   4,035      32,280       935.0      61.4      00:08:56
 34181       8   4,035      32,280       912.1      59.9      00:09:31
 35476       7   4,035      28,245       948.6      62.3      00:08:42
 34641      10   4,035      40,350       925.0      60.7      00:09:17
 35952      10   4,035      40,350       961.7      63.1      00:08:29
 35136       7   4,035      28,245       938.9      61.6      00:09:03
 36403       6   4,035      24,210       974.3      64.0      00:08:17
 35607      10   4,035      40,350       952.2      62.5      00:08:49
 36774       8   4,035      32,280       984.3      64.6      00:08:08
 36090       4   4,035      16,140       965.5      63.4      00:08:35
 37107       5   4,035      20,175       993.3      65.2      00:08:01
 36572       7   4,035      28,245       978.9      64.2      00:08:22
 37424       7   4,035      28,245     1,001.3      65.7      00:07:55
 36902       5   4,035      20,175       987.8      64.8      00:08:14
 37748       8   4,035      32,280     1,009.7      66.3      00:07:49
 37254       7   4,035      28,245       996.9      65.4      00:08:07
 38059       7   4,035      28,245     1,018.1      66.8      00:07:42
 37569       9   4,035      36,315     1,005.0      66.0      00:08:01
 38384       6   4,035      24,210     1,027.1      67.4      00:07:35
 37910       6   4,035      24,210     1,014.1      66.6      00:07:53
 38844       7   4,035      28,245     1,039.7      68.2      00:07:23
 38277       7   4,035      28,245     1,024.1      67.2      00:07:44
 39219       7   4,035      28,245     1,049.8      68.9      00:07:14
 38603       7   4,035      28,245     1,033.2      67.8      00:07:36
 39620       8   4,035      32,280     1,060.5      69.6      00:07:04
 38951       9   4,035      36,315     1,042.7      68.4      00:07:28
 40123       7   4,035      28,245     1,073.8      70.5      00:06:51
 39311      10   4,035      40,350     1,052.2      69.1      00:07:20
 40633       6   4,035      24,210     1,087.7      71.4      00:06:37
 39705       8   4,035      32,280     1,062.7      69.7      00:07:10
 41057       7   4,035      28,245     1,099.5      72.2      00:06:26
 40149       9   4,035      36,315     1,074.5      70.5      00:06:59
 41359       8   4,035      32,280     1,107.7      72.7      00:06:20
 40633       6   4,035      24,210     1,087.7      71.4      00:06:45
 41721      10   4,035      40,350     1,117.5      73.4      00:06:11
 41044      10   4,035      40,350     1,099.2      72.1      00:06:35
 42044      10   4,035      40,350     1,126.4      73.9      00:06:04
 41379       6   4,035      24,210     1,108.2      72.7      00:06:27
 42399       9   4,035      36,315     1,135.4      74.5      00:05:56
 41751       6   4,035      24,210     1,118.4      73.4      00:06:17
 42748       8   4,035      32,280     1,144.8      75.1      00:05:48
 42111       6   4,035      24,210     1,128.0      74.0      00:06:09
 43085       9   4,035      36,315     1,154.1      75.7      00:05:40
 42466       6   4,035      24,210     1,137.4      74.7      00:06:01
 43388       7   4,035      28,245     1,162.6      76.3      00:05:33
 42859       9   4,035      36,315     1,147.8      75.3      00:05:51
 43695       8   4,035      32,280     1,170.7      76.8      00:05:26
 43199       9   4,035      36,315     1,157.4      76.0      00:05:42
 43987       5   4,035      20,175     1,178.6      77.4      00:05:20
 43569       6   4,035      24,210     1,167.4      76.6      00:05:33
 44279       9   4,035      36,315     1,186.4      77.9      00:05:13
 43915      10   4,035      40,350     1,176.6      77.2      00:05:25
 44645       7   4,035      28,245     1,196.0      78.5      00:05:04
 44253       9   4,035      36,315     1,185.7      77.8      00:05:17
 45025       5   4,035      20,175     1,206.3      79.2      00:04:55
 44642       5   4,035      20,175     1,195.9      78.5      00:05:07
 45412       9   4,035      36,315     1,216.0      79.8      00:04:46
 45022       6   4,035      24,210     1,206.2      79.2      00:04:58
 45751       6   4,035      24,210     1,224.7      80.4      00:04:39
 45415       6   4,035      24,210     1,216.1      79.8      00:04:49
 46092      10   4,035      40,350     1,233.8      81.0      00:04:30
 45767       9   4,035      36,315     1,225.1      80.4      00:04:41
 46431       8   4,035      32,280     1,243.2      81.6      00:04:22
 46129      10   4,035      40,350     1,234.9      81.0      00:04:32
 46846       9   4,035      36,315     1,254.6      82.3      00:04:11
 46470       7   4,035      28,245     1,244.1      81.7      00:04:23
 47208       9   4,035      36,315     1,263.5      82.9      00:04:03
 46853       8   4,035      32,280     1,254.7      82.4      00:04:13
 47598       5   4,035      20,175     1,273.6      83.6      00:03:54
 47161       6   4,035      24,210     1,262.4      82.9      00:04:07
 47961       4   4,035      16,140     1,283.3      84.2      00:03:45
 47500       7   4,035      28,245     1,271.1      83.4      00:03:59
 48323      10   4,035      40,350     1,293.1      84.9      00:03:36
 47810       3   4,035      12,105     1,279.2      84.0      00:03:51
 48718       7   4,035      28,245     1,303.8      85.6      00:03:26
 48132       7   4,035      28,245     1,287.9      84.5      00:03:44
 49067       8   4,035      32,280     1,313.0      86.2      00:03:18
 48507       4   4,035      16,140     1,298.1      85.2      00:03:34
 49461       4   4,035      16,140     1,323.4      86.9      00:03:08
 48892       9   4,035      36,315     1,308.3      85.9      00:03:24
 49972       7   4,035      28,245     1,336.4      87.7      00:02:55
 49261       3   4,035      12,105     1,318.5      86.5      00:03:15
 50391       6   4,035      24,210     1,347.1      88.4      00:02:45
 49646       4   4,035      16,140     1,328.0      87.2      00:03:06
 50718       6   4,035      24,210     1,355.9      89.0      00:02:37
 50011       8   4,035      32,280     1,337.5      87.8      00:02:57
 51037       7   4,035      28,245     1,364.9      89.6      00:02:29
 50421       9   4,035      36,315     1,347.9      88.5      00:02:47
 51359       9   4,035      36,315     1,373.5      90.1      00:02:21
 50825       6   4,035      24,210     1,359.0      89.2      00:02:37
 51659       6   4,035      24,210     1,381.9      90.7      00:02:14
 51240       7   4,035      28,245     1,370.3      89.9      00:02:26
 51965       4   4,035      16,140     1,390.4      91.3      00:02:06
 51663      10   4,035      40,350     1,382.0      90.7      00:02:14
 52299       7   4,035      28,245     1,400.0      91.9      00:01:57
 52074       5   4,035      20,175     1,393.5      91.5      00:02:03
 52738       9   4,035      36,315     1,413.0      92.7      00:01:44
 52473       8   4,035      32,280     1,405.1      92.2      00:01:52
 53201       7   4,035      28,245     1,426.1      93.6      00:01:32
 52877       5   4,035      20,175     1,417.0      93.0      00:01:41
 53650       6   4,035      24,210     1,438.7      94.4      00:01:20
 53308       8   4,035      32,280     1,429.2      93.8      00:01:29
 53953       7   4,035      28,245     1,446.9      95.0      00:01:12
 53800       9   4,035      36,315     1,442.8      94.7      00:01:16
 54244       8   4,035      32,280     1,454.8      95.5      00:01:05
 54175       9   4,035      36,315     1,453.0      95.4      00:01:07
 54548       7   4,035      28,245     1,462.4      96.0      00:00:58
 54600       9   4,035      36,315     1,463.8      96.1      00:00:56
 54862       9   4,035      36,315     1,470.7      96.5      00:00:50
 55069       6   4,035      24,210     1,476.2      96.9      00:00:45
 55182       7   4,035      28,245     1,479.2      97.1      00:00:42
 55494       9   4,035      36,315     1,487.2      97.6      00:00:34
 55516      10   4,035      40,350     1,487.7      97.6      00:00:34
 55863       7   4,035      28,245     1,496.9      98.3      00:00:25
 55815       9   4,035      36,315     1,495.7      98.2      00:00:27
 56286       7   4,035      28,245     1,508.7      99.0      00:00:14
 56138      10   4,035      40,350     1,504.5      98.7      00:00:18
 56718       7   4,035      28,245     1,520.8      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1439.527
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 56466       7   4,035      28,245     1,513.8      99.4      00:00:09
 56815       5   4,035      20,175     1,523.5     100.0      00:00:00

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1457.674
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R400.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R400.csv saved

. 
. cap log close

. 
end of do-file
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R400.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_R400.csv saved

. 
. cap log close

. 
end of do-file
