
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A400.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   492      10   4,435      44,350        12.5       0.7      00:22:12
  1007       4   4,435      17,740        26.5       1.6      00:20:47
  1485      10   4,435      44,350        40.5       2.4      00:20:12
  1983       8   4,435      35,480        54.6       3.3      00:19:48
  2489       7   4,435      31,045        68.8       4.1      00:19:29
  3016       9   4,435      39,915        83.8       5.0      00:19:01
  3532       5   4,435      22,175        99.3       5.9      00:18:32
  4027      10   4,435      44,350       113.3       6.8      00:18:24
  4441       8   4,435      35,480       124.7       7.4      00:18:40
  4817      10   4,435      44,350       135.8       8.1      00:18:55
  5237       5   4,435      22,175       147.8       8.8      00:18:58
  5642       7   4,435      31,045       158.8       9.5      00:19:07
  6033       7   4,435      31,045       170.1      10.2      00:19:12
  6431      10   4,435      44,350       181.2      10.8      00:19:16
  6860       6   4,435      26,610       193.3      11.5      00:19:12
  7308       9   4,435      39,915       205.8      12.3      00:19:04
  7750       3   4,435      13,305       218.7      13.1      00:18:54
  8152       6   4,435      26,610       231.0      13.8      00:18:47
  8579       7   4,435      31,045       244.0      14.6      00:18:35
  8997       9   4,435      39,915       256.6      15.3      00:18:27
  9382       8   4,435      35,480       268.3      16.0      00:18:23
  9719      10   4,435      44,350       278.7      16.6      00:18:23
 10110       8   4,435      35,480       289.9      17.3      00:18:20
 10484       8   4,435      35,480       300.3      17.9      00:18:20
 10910       8   4,435      35,480       312.4      18.7      00:18:12
 11297       6   4,435      26,610       323.4      19.3      00:18:08
 11631       8   4,435      35,480       333.1      19.9      00:18:09
 11973       6   4,435      26,610       343.0      20.5      00:18:09
 12329       8   4,435      35,480       353.4      21.1      00:18:06
 12827       3   4,435      13,305       367.6      21.9      00:17:49
 13319       5   4,435      22,175       381.8      22.8      00:17:31
 13685       6   4,435      26,610       393.1      23.5      00:17:25
 14000       7   4,435      31,045       402.1      24.0      00:17:26
 14378       8   4,435      35,480       413.4      24.7      00:17:19
 14778      10   4,435      44,350       425.2      25.4      00:17:10
 15189       6   4,435      26,610       437.6      26.1      00:16:59
 15658       9   4,435      39,915       451.4      27.0      00:16:44
 16141       9   4,435      39,915       466.3      27.8      00:16:26
 16572       6   4,435      26,610       479.3      28.6      00:16:14
 16924       8   4,435      35,480       489.5      29.2      00:16:10
 17240       5   4,435      22,175       498.9      29.8      00:16:08
 17542       6   4,435      26,610       508.4      30.4      00:16:05
 17898       6   4,435      26,610       518.8      31.0      00:15:60
 18265       5   4,435      22,175       529.8      31.6      00:15:52
 18696       9   4,435      39,915       542.5      32.4      00:15:41
 19165       6   4,435      26,610       556.9      33.3      00:15:25
 19640       4   4,435      17,740       571.3      34.1      00:15:09
 20097       8   4,435      35,480       585.8      35.0      00:14:53
 20533       5   4,435      22,175       598.8      35.8      00:14:42
 20799       5   4,435      22,175       606.8      36.2      00:14:41
 21072       5   4,435      22,175       614.9      36.7      00:14:40
 21440       6   4,435      26,610       624.9      37.3      00:14:35
 21820       8   4,435      35,480       635.4      37.9      00:14:28
 22191       6   4,435      26,610       645.7      38.6      00:14:22
 22583       5   4,435      22,175       656.7      39.2      00:14:14
 23007      10   4,435      44,350       668.4      39.9      00:14:04
 23404       9   4,435      39,915       680.2      40.6      00:13:55
 23808      10   4,435      44,350       691.6      41.3      00:13:46
 24222       9   4,435      39,915       703.4      42.0      00:13:36
 24666       5   4,435      22,175       716.2      42.8      00:13:24
 25125       8   4,435      35,480       729.7      43.6      00:13:11
 25569      10   4,435      44,350       742.7      44.4      00:12:59
 25901       8   4,435      35,480       752.5      44.9      00:12:53
 26282       6   4,435      26,610       763.8      45.6      00:12:44
 26723       9   4,435      39,915       776.1      46.3      00:12:34
 27108       9   4,435      39,915       787.3      47.0      00:12:25
 27422       6   4,435      26,610       796.5      47.6      00:12:20
 27757       6   4,435      26,610       806.5      48.2      00:12:13
 28176       8   4,435      35,480       819.1      48.9      00:12:02
 28579       9   4,435      39,915       831.6      49.7      00:11:51
 28959       9   4,435      39,915       843.1      50.3      00:11:41
 29300      10   4,435      44,350       853.1      50.9      00:11:34
 29685       8   4,435      35,480       864.4      51.6      00:11:25
 30016       8   4,435      35,480       874.5      52.2      00:11:18
 30362       8   4,435      35,480       884.9      52.8      00:11:10
 30742       7   4,435      31,045       896.4      53.5      00:11:01
 31268       6   4,435      26,610       912.3      54.5      00:10:44
 31774       7   4,435      31,045       927.9      55.4      00:10:29
 32267       4   4,435      17,740       943.4      56.3      00:10:13
 32658       9   4,435      39,915       955.5      57.1      00:10:03
 32961      10   4,435      44,350       964.8      57.6      00:09:57
 33290       7   4,435      31,045       974.9      58.2      00:09:49
 33672       7   4,435      31,045       986.7      58.9      00:09:39
 34046       7   4,435      31,045       998.2      59.6      00:09:30
 34444       7   4,435      31,045     1,010.7      60.4      00:09:19
 34901       7   4,435      31,045     1,024.9      61.2      00:09:06
 35372       6   4,435      26,610     1,039.3      62.1      00:08:53
 35832       6   4,435      26,610     1,053.3      62.9      00:08:40
 36323      10   4,435      44,350     1,068.5      63.8      00:08:26
 36728       7   4,435      31,045     1,080.6      64.5      00:08:16
 37073       8   4,435      35,480     1,090.7      65.1      00:08:08
 37422       9   4,435      39,915     1,100.5      65.7      00:08:01
 37739       7   4,435      31,045     1,109.5      66.3      00:07:54
 38020       6   4,435      26,610     1,117.8      66.7      00:07:49
 38325       7   4,435      31,045     1,127.0      67.3      00:07:42
 38689      10   4,435      44,350     1,138.2      68.0      00:07:33
 39101       8   4,435      35,480     1,150.5      68.7      00:07:23
 39475       6   4,435      26,610     1,161.2      69.3      00:07:14
 39873       6   4,435      26,610     1,173.0      70.0      00:07:04
 40384       6   4,435      26,610     1,187.9      70.9      00:06:50
 40889       6   4,435      26,610     1,203.3      71.9      00:06:36
 41280      10   4,435      44,350     1,215.1      72.6      00:06:26
 41674      10   4,435      44,350     1,226.9      73.3      00:06:16
 42033       8   4,435      35,480     1,237.7      73.9      00:06:08
 42419       9   4,435      39,915     1,248.7      74.6      00:05:59
 42770       9   4,435      39,915     1,258.9      75.2      00:05:51
 43117       7   4,435      31,045     1,269.5      75.8      00:05:42
 43459       8   4,435      35,480     1,280.1      76.4      00:05:33
 43803       7   4,435      31,045     1,289.8      77.0      00:05:26
 44165       6   4,435      26,610     1,300.5      77.7      00:05:17
 44590       6   4,435      26,610     1,312.9      78.4      00:05:06
 45008       7   4,435      31,045     1,325.4      79.1      00:04:56
 45429       6   4,435      26,610     1,337.1      79.8      00:04:46
 45795       9   4,435      39,915     1,347.4      80.5      00:04:37
 46166       9   4,435      39,915     1,358.4      81.1      00:04:28
 46536       7   4,435      31,045     1,369.5      81.8      00:04:19
 46969       7   4,435      31,045     1,382.4      82.6      00:04:08
 47366       5   4,435      22,175     1,393.3      83.2      00:03:59
 47714       6   4,435      26,610     1,403.3      83.8      00:03:50
 48050       6   4,435      26,610     1,413.2      84.4      00:03:42
 48385       6   4,435      26,610     1,423.2      85.0      00:03:34
 48762       9   4,435      39,915     1,434.2      85.6      00:03:25
 49144      10   4,435      44,350     1,445.5      86.3      00:03:15
 49587       5   4,435      22,175     1,458.1      87.1      00:03:04
 50104       7   4,435      31,045     1,472.8      87.9      00:02:52
 50517       8   4,435      35,480     1,484.4      88.6      00:02:42
 50895      10   4,435      44,350     1,495.7      89.3      00:02:32
 51301       5   4,435      22,175     1,507.9      90.0      00:02:22
 51697       7   4,435      31,045     1,520.1      90.8      00:02:11
 52111       2   4,435       8,870     1,532.8      91.5      00:02:00
 52485       8   4,435      35,480     1,544.8      92.2      00:01:50
 52848       9   4,435      39,915     1,556.6      93.0      00:01:40
 53237       6   4,435      26,610     1,568.7      93.7      00:01:30
 53734       9   4,435      39,915     1,583.9      94.6      00:01:17
 54101       7   4,435      31,045     1,594.7      95.2      00:01:08
 54463       9   4,435      39,915     1,605.2      95.9      00:00:59
 54875       9   4,435      39,915     1,616.9      96.6      00:00:49
 55281       9   4,435      39,915     1,628.8      97.3      00:00:39
 55654      10   4,435      44,350     1,639.0      97.9      00:00:30
 56002      10   4,435      44,350     1,649.6      98.5      00:00:21
 56384      10   4,435      44,350     1,661.3      99.2      00:00:11
 56789       7   4,435      31,045     1,673.7      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1429.126
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//
    > vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A400.csv not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A400.csv saved

. 
. cap log close

. 
end of do-file
