
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A700_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   180       6   4,735      28,410         4.7       0.3      01:02:56
   394       6   4,735      28,410        10.8       0.6      00:54:50
   614       9   4,735      42,615        17.0       0.9      00:52:19
   836       5   4,735      23,675        23.6       1.3      00:49:57
  1026       8   4,735      37,880        29.1       1.6      00:50:27
  1251       5   4,735      23,675        36.0       2.0      00:48:39
  1462       6   4,735      28,410        42.7       2.4      00:47:45
  1668       7   4,735      33,145        49.2       2.8      00:47:11
  1884       7   4,735      33,145        55.5       3.1      00:46:53
  2116       7   4,735      33,145        62.5       3.5      00:46:05
  2338      10   4,735      47,350        69.2       3.9      00:45:35
  2581       8   4,735      37,880        76.5       4.3      00:44:49
  2800       5   4,735      23,675        83.4       4.7      00:44:20
  3020      10   4,735      47,350        89.9       5.0      00:44:09
  3231      10   4,735      47,350        96.7       5.4      00:43:46
  3424       6   4,735      28,410       103.0       5.8      00:43:42
  3605       4   4,735      18,940       108.5       6.1      00:43:56
  3819       8   4,735      37,880       115.2       6.4      00:43:37
  3993       9   4,735      42,615       120.1       6.7      00:44:02
  4163       5   4,735      23,675       125.3       7.0      00:44:19
  4336       9   4,735      42,615       130.2       7.3      00:44:39
  4493       8   4,735      37,880       135.0       7.6      00:44:59
  4638      10   4,735      47,350       139.6       7.8      00:45:22
  4797       6   4,735      28,410       144.5       8.1      00:45:35
  4963      10   4,735      47,350       149.7       8.4      00:45:43
  5120       7   4,735      33,145       154.4       8.6      00:45:58
  5306       5   4,735      23,675       160.1       9.0      00:45:51
  5477       4   4,735      18,940       165.2       9.2      00:45:57
  5633       9   4,735      42,615       169.6       9.5      00:46:14
  5776       3   4,735      14,205       173.8       9.7      00:46:32
  5948      10   4,735      47,350       179.1      10.0      00:46:30
  6127       8   4,735      37,880       184.7      10.3      00:46:24
  6296       9   4,735      42,615       189.6      10.6      00:46:27
  6454       9   4,735      42,615       194.4      10.9      00:46:34
  6590       3   4,735      14,205       198.4      11.1      00:46:51
  6741       6   4,735      28,410       202.9      11.4      00:46:59
  6893       8   4,735      37,880       207.6      11.6      00:47:04
  7049       9   4,735      42,615       212.2      11.9      00:47:09
  7229       7   4,735      33,145       217.4      12.2      00:47:04
  7408       4   4,735      18,940       223.1      12.5      00:46:51
  7580       8   4,735      37,880       228.5      12.8      00:46:44
  7768       3   4,735      14,205       234.2      13.1      00:46:32
  7938       8   4,735      37,880       239.9      13.4      00:46:21
  8111       9   4,735      42,615       245.5      13.7      00:46:10
  8284      10   4,735      47,350       251.1      14.1      00:46:00
  8455       7   4,735      33,145       256.7      14.4      00:45:50
  8627       4   4,735      18,940       262.2      14.7      00:45:40
  8788       9   4,735      42,615       267.4      15.0      00:45:36
  8942      10   4,735      47,350       272.4      15.2      00:45:32
  9121       9   4,735      42,615       278.2      15.6      00:45:20
  9242       8   4,735      37,880       282.1      15.8      00:45:28
  9351      10   4,735      47,350       285.6      16.0      00:45:42
  9460      10   4,735      47,350       289.1      16.2      00:45:54
  9595      10   4,735      47,350       293.7      16.4      00:45:54
  9744       5   4,735      23,675       298.6      16.7      00:45:50
  9895       8   4,735      37,880       303.3      17.0      00:45:48
 10037       5   4,735      23,675       307.6      17.2      00:45:51
 10150       8   4,735      37,880       310.7      17.4      00:46:05
 10282       5   4,735      23,675       314.5      17.6      00:46:11
 10404       7   4,735      33,145       318.3      17.8      00:46:17
 10568       6   4,735      28,410       323.2      18.1      00:46:11
 10747       4   4,735      18,940       328.7      18.4      00:45:60
 10919       7   4,735      33,145       334.0      18.7      00:45:49
 11095       4   4,735      18,940       339.4      19.0      00:45:39
 11226       8   4,735      37,880       343.4      19.2      00:45:42
 11351       7   4,735      33,145       347.3      19.4      00:45:45
 11465       6   4,735      28,410       350.9      19.6      00:45:51
 11588       9   4,735      42,615       354.5      19.8      00:45:57
 11693      10   4,735      47,350       357.8      20.0      00:46:05
 11804       6   4,735      28,410       361.3      20.2      00:46:11
 11940       7   4,735      33,145       365.4      20.5      00:46:11
 12061       8   4,735      37,880       369.3      20.7      00:46:13
 12177       6   4,735      28,410       373.0      20.9      00:46:17
 12311       9   4,735      42,615       376.9      21.1      00:46:18
 12531      10   4,735      47,350       383.9      21.5      00:45:50
 12746       3   4,735      14,205       390.3      21.8      00:45:29
 12973       9   4,735      42,615       397.0      22.2      00:45:05
 13167       9   4,735      42,615       403.2      22.6      00:44:46
 13377       5   4,735      23,675       409.7      22.9      00:44:25
 13552       4   4,735      18,940       415.5      23.3      00:44:09
 13669       8   4,735      37,880       419.5      23.5      00:44:10
 13805       8   4,735      37,880       423.5      23.7      00:44:09
 13928       8   4,735      37,880       427.3      23.9      00:44:10
 14104       6   4,735      28,410       432.7      24.2      00:43:58
 14274       7   4,735      33,145       438.2      24.5      00:43:45
 14427       4   4,735      18,940       443.1      24.8      00:43:36
 14584       9   4,735      42,615       448.1      25.1      00:43:28
 14736      10   4,735      47,350       452.8      25.3      00:43:21
 14919       7   4,735      33,145       458.6      25.7      00:43:06
 15108       7   4,735      33,145       464.9      26.0      00:42:48
 15298       5   4,735      23,675       470.9      26.4      00:42:32
 15479      10   4,735      47,350       476.5      26.7      00:42:18
 15675       6   4,735      28,410       482.6      27.0      00:42:02
 15873      10   4,735      47,350       489.1      27.4      00:41:43
 16052       8   4,735      37,880       495.1      27.7      00:41:27
 16241       9   4,735      42,615       501.2      28.1      00:41:10
 16447       9   4,735      42,615       508.1      28.4      00:40:49
 16606       7   4,735      33,145       512.9      28.7      00:40:42
 16747       3   4,735      14,205       517.4      29.0      00:40:36
 16887       9   4,735      42,615       521.7      29.2      00:40:33
 17007       7   4,735      33,145       525.7      29.4      00:40:31
 17105       7   4,735      33,145       528.7      29.6      00:40:36
 17219       5   4,735      23,675       532.2      29.8      00:40:36
 17330       8   4,735      37,880       535.9      30.0      00:40:36
 17441       7   4,735      33,145       539.6      30.2      00:40:35
 17512      10   4,735      47,350       542.1      30.3      00:40:42
 17637       6   4,735      28,410       546.1      30.6      00:40:39
 17813      10   4,735      47,350       551.4      30.9      00:40:28
 17985      10   4,735      47,350       556.9      31.2      00:40:16
 18182       5   4,735      23,675       563.4      31.5      00:39:57
 18377       2   4,735       9,470       569.4      31.9      00:39:42
 18525       9   4,735      42,615       573.8      32.1      00:39:36
 18628       9   4,735      42,615       577.2      32.3      00:39:36
 18723       8   4,735      37,880       580.3      32.5      00:39:38
 18825       8   4,735      37,880       583.5      32.7      00:39:40
 18936       7   4,735      33,145       587.3      32.9      00:39:38
 19037       4   4,735      18,940       590.6      33.1      00:39:38
 19127       6   4,735      28,410       593.6      33.2      00:39:40
 19227       7   4,735      33,145       596.9      33.4      00:39:41
 19391       2   4,735       9,470       602.1      33.7      00:39:29
 19559      10   4,735      47,350       607.7      34.0      00:39:16
 19720       8   4,735      37,880       613.1      34.3      00:39:04
 19886       8   4,735      37,880       618.6      34.6      00:38:51
 20047       8   4,735      37,880       624.1      34.9      00:38:38
 20221      10   4,735      47,350       629.6      35.2      00:38:25
 20420      10   4,735      47,350       635.9      35.6      00:38:08
 20524       9   4,735      42,615       639.3      35.8      00:38:08
 20608      10   4,735      47,350       642.1      35.9      00:38:10
 20721       6   4,735      28,410       645.6      36.1      00:38:09
 20808       8   4,735      37,880       648.4      36.3      00:38:11
 20908       6   4,735      28,410       651.8      36.5      00:38:10
 21037       6   4,735      28,410       655.7      36.7      00:38:06
 21165       7   4,735      33,145       659.5      36.9      00:38:02
 21323       6   4,735      28,410       663.8      37.2      00:37:55
 21470       6   4,735      28,410       668.5      37.4      00:37:47
 21610       5   4,735      23,675       672.6      37.6      00:37:41
 21729       6   4,735      28,410       676.0      37.8      00:37:39
 21848       7   4,735      33,145       679.6      38.0      00:37:36
 21966       6   4,735      28,410       683.3      38.2      00:37:33
 22094       3   4,735      14,205       686.8      38.4      00:37:31
 22202       5   4,735      23,675       690.0      38.6      00:37:29
 22310      10   4,735      47,350       693.2      38.8      00:37:28
 22436       6   4,735      28,410       696.9      39.0      00:37:25
 22558       5   4,735      23,675       700.7      39.2      00:37:21
 22681       6   4,735      28,410       704.5      39.4      00:37:16
 22859      10   4,735      47,350       709.4      39.7      00:37:06
 23033      10   4,735      47,350       714.9      40.0      00:36:52
 23220      10   4,735      47,350       720.8      40.3      00:36:37
 23398       8   4,735      37,880       726.3      40.7      00:36:24
 23629       6   4,735      28,410       732.8      41.0      00:36:05
 23830       7   4,735      33,145       739.4      41.4      00:35:47
 23998       5   4,735      23,675       744.5      41.7      00:35:36
 24163       9   4,735      42,615       749.3      41.9      00:35:26
 24322       5   4,735      23,675       754.0      42.2      00:35:18
 24445       5   4,735      23,675       757.8      42.4      00:35:12
 24584       9   4,735      42,615       762.3      42.7      00:35:04
 24753      10   4,735      47,350       767.6      43.0      00:34:52
 24949       9   4,735      42,615       773.5      43.3      00:34:38
 25116       9   4,735      42,615       779.0      43.6      00:34:25
 25278      10   4,735      47,350       784.0      43.9      00:34:14
 25460       8   4,735      37,880       789.8      44.2      00:34:00
 25585       8   4,735      37,880       793.5      44.4      00:33:55
 25686       2   4,735       9,470       796.7      44.6      00:33:53
 25816      10   4,735      47,350       801.0      44.8      00:33:46
 25954       7   4,735      33,145       805.2      45.1      00:33:39
 26098       8   4,735      37,880       809.9      45.3      00:33:30
 26285       5   4,735      23,675       815.8      45.7      00:33:15
 26522      10   4,735      47,350       822.8      46.1      00:32:55
 26747       9   4,735      42,615       829.7      46.4      00:32:36
 26979       6   4,735      28,410       837.2      46.9      00:32:15
 27156       7   4,735      33,145       842.6      47.2      00:32:03
 27334       8   4,735      37,880       848.1      47.5      00:31:51
 27496       7   4,735      33,145       853.2      47.8      00:31:40
 27663       8   4,735      37,880       858.5      48.0      00:31:28
 27799      10   4,735      47,350       862.9      48.3      00:31:21
 27988       9   4,735      42,615       868.9      48.6      00:31:06
 28221      10   4,735      47,350       876.3      49.0      00:30:46
 28472       9   4,735      42,615       884.6      49.5      00:30:22
 28665      10   4,735      47,350       890.9      49.9      00:30:06
 28785       9   4,735      42,615       894.9      50.1      00:30:01
 28898       6   4,735      28,410       898.5      50.3      00:29:56
 29009       9   4,735      42,615       902.1      50.5      00:29:51
 29110       9   4,735      42,615       905.4      50.7      00:29:48
 29245       9   4,735      42,615       909.4      50.9      00:29:42
 29403       9   4,735      42,615       914.7      51.2      00:29:30
 29567      10   4,735      47,350       919.7      51.5      00:29:20
 29715       9   4,735      42,615       924.4      51.7      00:29:11
 29832       4   4,735      18,940       928.2      52.0      00:29:06
 29953       7   4,735      33,145       932.0      52.2      00:29:00
 30044       8   4,735      37,880       935.0      52.3      00:28:58
 30142       6   4,735      28,410       938.1      52.5      00:28:54
 30313       8   4,735      37,880       943.6      52.8      00:28:42
 30508       9   4,735      42,615       950.0      53.2      00:28:26
 30703       7   4,735      33,145       956.2      53.5      00:28:11
 30913       5   4,735      23,675       963.1      53.9      00:27:54
 31111       9   4,735      42,615       969.3      54.3      00:27:39
 31297       8   4,735      37,880       975.4      54.6      00:27:25
 31477      10   4,735      47,350       981.4      54.9      00:27:11
 31672       8   4,735      37,880       987.7      55.3      00:26:56
 31859       8   4,735      37,880       994.0      55.6      00:26:41
 32067      10   4,735      47,350     1,000.9      56.0      00:26:24
 32258       7   4,735      33,145     1,007.3      56.4      00:26:09
 32428       8   4,735      37,880     1,013.2      56.7      00:25:56
 32538      10   4,735      47,350     1,016.6      56.9      00:25:51
 32649       6   4,735      28,410     1,020.2      57.1      00:25:46
 32766       6   4,735      28,410     1,024.1      57.3      00:25:40
 32907       7   4,735      33,145     1,028.7      57.6      00:25:31
 33068       8   4,735      37,880     1,034.0      57.9      00:25:20
 33242      10   4,735      47,350     1,039.7      58.2      00:25:07
 33399      10   4,735      47,350     1,044.8      58.5      00:24:57
 33540       5   4,735      23,675     1,049.5      58.7      00:24:48
 33696       5   4,735      23,675     1,054.7      59.0      00:24:37
 33844       7   4,735      33,145     1,059.5      59.3      00:24:27
 34018       4   4,735      18,940     1,065.2      59.6      00:24:15
 34120       6   4,735      28,410     1,068.7      59.8      00:24:10
 34275      10   4,735      47,350     1,074.0      60.1      00:23:59
 34501       7   4,735      33,145     1,081.4      60.5      00:23:41
 34738      10   4,735      47,350     1,089.2      61.0      00:23:21
 34984       8   4,735      37,880     1,097.3      61.4      00:23:01
 35198       5   4,735      23,675     1,104.4      61.8      00:22:45
 35428       8   4,735      37,880     1,112.0      62.2      00:22:26
 35642       9   4,735      42,615     1,119.0      62.6      00:22:10
 35903       7   4,735      33,145     1,127.4      63.1      00:21:49
 36155       6   4,735      28,410     1,135.7      63.6      00:21:29
 36394       6   4,735      28,410     1,143.5      64.0      00:21:11
 36590       8   4,735      37,880     1,149.7      64.4      00:20:57
 36737       8   4,735      37,880     1,154.2      64.6      00:20:49
 36885      10   4,735      47,350     1,159.1      64.9      00:20:39
 37058      10   4,735      47,350     1,164.4      65.2      00:20:28
 37223       6   4,735      28,410     1,169.2      65.4      00:20:19
 37367       8   4,735      37,880     1,173.5      65.7      00:20:12
 37507       7   4,735      33,145     1,177.8      65.9      00:20:04
 37624       6   4,735      28,410     1,181.5      66.1      00:19:58
 37797       9   4,735      42,615     1,186.7      66.4      00:19:47
 37970       5   4,735      23,675     1,192.2      66.7      00:19:36
 38143       7   4,735      33,145     1,197.9      67.0      00:19:24
 38324       8   4,735      37,880     1,203.7      67.4      00:19:12
 38511       7   4,735      33,145     1,209.9      67.7      00:18:59
 38676      10   4,735      47,350     1,215.2      68.0      00:18:48
 38853       7   4,735      33,145     1,220.8      68.3      00:18:37
 38997      10   4,735      47,350     1,225.5      68.6      00:18:28
 39099       8   4,735      37,880     1,228.7      68.8      00:18:23
 39207       9   4,735      42,615     1,231.9      69.0      00:18:19
 39315       9   4,735      42,615     1,235.3      69.1      00:18:13
 39508      10   4,735      47,350     1,241.3      69.5      00:18:01
 39693      10   4,735      47,350     1,247.0      69.8      00:17:49
 39890       8   4,735      37,880     1,253.2      70.1      00:17:36
 40113       9   4,735      42,615     1,260.2      70.5      00:17:20
 40327       7   4,735      33,145     1,266.8      70.9      00:17:06
 40547       7   4,735      33,145     1,274.0      71.3      00:16:50
 40760       4   4,735      18,940     1,281.0      71.7      00:16:35
 40962       6   4,735      28,410     1,287.6      72.1      00:16:21
 41106      10   4,735      47,350     1,292.2      72.3      00:16:12
 41257       6   4,735      28,410     1,297.0      72.6      00:16:03
 41401      10   4,735      47,350     1,301.5      72.8      00:15:54
 41528       7   4,735      33,145     1,305.6      73.1      00:15:47
 41682       5   4,735      23,675     1,310.6      73.4      00:15:37
 41800       8   4,735      37,880     1,314.3      73.6      00:15:31
 41913       9   4,735      42,615     1,318.2      73.8      00:15:24
 42055      10   4,735      47,350     1,322.3      74.0      00:15:16
 42202       8   4,735      37,880     1,326.7      74.3      00:15:08
 42328       8   4,735      37,880     1,330.5      74.5      00:15:02
 42458       3   4,735      14,205     1,334.8      74.7      00:14:54
 42598       7   4,735      33,145     1,339.0      74.9      00:14:46
 42736       3   4,735      14,205     1,343.3      75.2      00:14:38
 42868       8   4,735      37,880     1,347.6      75.4      00:14:30
 42995       9   4,735      42,615     1,351.7      75.7      00:14:22
 43120      10   4,735      47,350     1,356.0      75.9      00:14:14
 43268       5   4,735      23,675     1,360.8      76.2      00:14:05
 43406       6   4,735      28,410     1,365.4      76.4      00:13:56
 43593       6   4,735      28,410     1,371.0      76.7      00:13:45
 43805       9   4,735      42,615     1,377.7      77.1      00:13:31
 44030       5   4,735      23,675     1,384.7      77.5      00:13:16
 44171       5   4,735      23,675     1,389.2      77.8      00:13:07
 44320      10   4,735      47,350     1,393.7      78.0      00:12:58
 44508       9   4,735      42,615     1,399.5      78.3      00:12:46
 44701       8   4,735      37,880     1,405.6      78.7      00:12:34
 44884       7   4,735      33,145     1,411.5      79.0      00:12:22
 45051       4   4,735      18,940     1,416.6      79.3      00:12:12
 45258       9   4,735      42,615     1,422.8      79.6      00:11:59
 45434      10   4,735      47,350     1,428.0      79.9      00:11:48
 45598       2   4,735       9,470     1,432.9      80.2      00:11:39
 45738       9   4,735      42,615     1,437.1      80.4      00:11:31
 45882       6   4,735      28,410     1,441.4      80.7      00:11:23
 46014       8   4,735      37,880     1,445.8      80.9      00:11:14
 46147       6   4,735      28,410     1,450.1      81.2      00:11:06
 46258       6   4,735      28,410     1,453.8      81.4      00:10:60
 46409      10   4,735      47,350     1,458.4      81.6      00:10:51
 46559       9   4,735      42,615     1,463.3      81.9      00:10:41
 46756       7   4,735      33,145     1,469.5      82.2      00:10:28
 46906       7   4,735      33,145     1,474.4      82.5      00:10:19
 47034       5   4,735      23,675     1,477.9      82.7      00:10:12
 47151       9   4,735      42,615     1,481.3      82.9      00:10:06
 47249      10   4,735      47,350     1,484.3      83.1      00:10:01
 47357       5   4,735      23,675     1,487.6      83.3      00:09:55
 47480       3   4,735      14,205     1,491.1      83.5      00:09:49
 47628       6   4,735      28,410     1,495.8      83.7      00:09:40
 47784       7   4,735      33,145     1,500.6      84.0      00:09:30
 47930       6   4,735      28,410     1,505.4      84.3      00:09:21
 48069      10   4,735      47,350     1,509.7      84.5      00:09:12
 48216      10   4,735      47,350     1,514.2      84.8      00:09:04
 48359       9   4,735      42,615     1,518.9      85.0      00:08:54
 48489       5   4,735      23,675     1,523.0      85.2      00:08:47
 48652       8   4,735      37,880     1,528.1      85.5      00:08:36
 48805       7   4,735      33,145     1,532.9      85.8      00:08:27
 48944       6   4,735      28,410     1,537.3      86.0      00:08:18
 49067       7   4,735      33,145     1,541.1      86.3      00:08:11
 49162       9   4,735      42,615     1,544.4      86.4      00:08:05
 49275       7   4,735      33,145     1,547.8      86.6      00:07:59
 49396       8   4,735      37,880     1,551.3      86.8      00:07:52
 49518       8   4,735      37,880     1,555.0      87.0      00:07:45
 49652       6   4,735      28,410     1,558.8      87.2      00:07:38
 49800       4   4,735      18,940     1,563.2      87.5      00:07:29
 49935       4   4,735      18,940     1,567.4      87.7      00:07:21
 50059       5   4,735      23,675     1,571.3      87.9      00:07:13
 50195      10   4,735      47,350     1,575.5      88.2      00:07:05
 50328       6   4,735      28,410     1,579.2      88.4      00:06:58
 50442       5   4,735      23,675     1,582.8      88.6      00:06:51
 50565       6   4,735      28,410     1,586.7      88.8      00:06:43
 50693       7   4,735      33,145     1,590.7      89.0      00:06:36
 50801       8   4,735      37,880     1,594.3      89.2      00:06:29
 50913       7   4,735      33,145     1,598.0      89.4      00:06:22
 51018       8   4,735      37,880     1,601.6      89.6      00:06:15
 51171       6   4,735      28,410     1,606.3      89.9      00:06:05
 51345       9   4,735      42,615     1,611.8      90.2      00:05:54
 51528       7   4,735      33,145     1,617.8      90.5      00:05:42
 51709       8   4,735      37,880     1,623.8      90.9      00:05:29
 51887       7   4,735      33,145     1,629.6      91.2      00:05:17
 52070       9   4,735      42,615     1,635.7      91.6      00:05:05
 52258       8   4,735      37,880     1,642.1      91.9      00:04:52
 52429       5   4,735      23,675     1,648.0      92.2      00:04:40
 52593      10   4,735      47,350     1,653.7      92.6      00:04:28
 52761       4   4,735      18,940     1,659.5      92.9      00:04:16
 52944       6   4,735      28,410     1,665.5      93.2      00:04:04
 53137      10   4,735      47,350     1,671.9      93.6      00:03:51
 53304       9   4,735      42,615     1,677.5      93.9      00:03:40
 53479       8   4,735      37,880     1,683.2      94.2      00:03:28
 53668       8   4,735      37,880     1,689.3      94.6      00:03:15
 53781       9   4,735      42,615     1,693.0      94.8      00:03:08
 53914       7   4,735      33,145     1,697.1      95.0      00:03:00
 54027       9   4,735      42,615     1,700.7      95.2      00:02:53
 54122       9   4,735      42,615     1,703.8      95.4      00:02:47
 54257      10   4,735      47,350     1,708.0      95.6      00:02:39
 54405       5   4,735      23,675     1,712.3      95.8      00:02:30
 54555       8   4,735      37,880     1,716.7      96.1      00:02:21
 54686      10   4,735      47,350     1,720.9      96.3      00:02:13
 54845       7   4,735      33,145     1,725.8      96.6      00:02:03
 54973      10   4,735      47,350     1,729.8      96.8      00:01:55
 55123       8   4,735      37,880     1,734.4      97.1      00:01:45
 55262       7   4,735      33,145     1,738.6      97.3      00:01:37
 55398       5   4,735      23,675     1,742.6      97.5      00:01:29
 55511       9   4,735      42,615     1,746.0      97.7      00:01:22
 55620       7   4,735      33,145     1,749.3      97.9      00:01:16
 55717      10   4,735      47,350     1,752.4      98.1      00:01:09
 55831      10   4,735      47,350     1,756.1      98.3      00:01:02
 55958       7   4,735      33,145     1,760.2      98.5      00:00:54
 56066      10   4,735      47,350     1,763.7      98.7      00:00:47
 56180       8   4,735      37,880     1,767.4      98.9      00:00:39
 56305       7   4,735      33,145     1,771.5      99.2      00:00:31
 56443       4   4,735      18,940     1,776.2      99.4      00:00:21
 56590       9   4,735      42,615     1,780.9      99.7      00:00:12
 56733       5   4,735      23,675     1,785.6      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 3653.732
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
