
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A300.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A300.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A300.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A300.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   368       5   4,335      21,675         9.1       0.6      00:29:55
   736       9   4,335      39,015        18.7       1.1      00:28:54
  1104       5   4,335      21,675        28.6       1.7      00:28:08
  1488       3   4,335      13,005        39.7       2.4      00:26:53
  1875       5   4,335      21,675        50.4       3.1      00:26:15
  2247       9   4,335      39,015        60.8       3.7      00:25:59
  2597       8   4,335      34,680        70.3       4.3      00:26:03
  2960       6   4,335      26,010        80.5       4.9      00:25:49
  3308       7   4,335      30,345        90.7       5.5      00:25:37
  3706       7   4,335      30,345       102.0       6.2      00:25:07
  4013       6   4,335      26,010       110.3       6.7      00:25:24
  4260       5   4,335      21,675       117.1       7.2      00:25:60
  4457       9   4,335      39,015       122.3       7.5      00:26:52
  4758       2   4,335       8,670       131.1       8.0      00:26:51
  5034       3   4,335      13,005       138.8       8.5      00:27:01
  5303       6   4,335      26,010       146.3       8.9      00:27:13
  5579       8   4,335      34,680       153.7       9.4      00:27:23
  5830       6   4,335      26,010       160.4       9.8      00:27:39
  6135       7   4,335      30,345       169.0      10.3      00:27:33
  6378       9   4,335      39,015       175.6      10.7      00:27:47
  6667       6   4,335      26,010       183.5      11.2      00:27:46
  6893       9   4,335      39,015       189.8      11.6      00:28:00
  7181      10   4,335      43,350       197.6      12.1      00:27:58
  7466       8   4,335      34,680       205.7      12.6      00:27:52
  7769       6   4,335      26,010       214.3      13.1      00:27:43
  8086       6   4,335      26,010       223.8      13.7      00:27:25
  8414       7   4,335      30,345       233.6      14.3      00:27:05
  8735       7   4,335      30,345       243.0      14.8      00:26:49
  9067      10   4,335      43,350       252.8      15.4      00:26:31
  9344       7   4,335      30,345       261.1      16.0      00:26:24
  9571      10   4,335      43,350       267.9      16.4      00:26:27
  9847       7   4,335      30,345       276.2      16.9      00:26:19
 10069       9   4,335      39,015       282.3      17.2      00:26:27
 10319       3   4,335      13,005       288.7      17.6      00:26:31
 10556      10   4,335      43,350       295.5      18.0      00:26:32
 10904       7   4,335      30,345       305.2      18.6      00:26:14
 11210       5   4,335      21,675       313.8      19.2      00:26:03
 11411       8   4,335      34,680       319.4      19.5      00:26:11
 11650       6   4,335      26,010       326.2      19.9      00:26:10
 11904       8   4,335      34,680       333.4      20.4      00:26:07
 12200       6   4,335      26,010       342.0      20.9      00:25:56
 12453       8   4,335      34,680       348.9      21.3      00:25:54
 12819       7   4,335      30,345       359.1      21.9      00:25:34
 13167       6   4,335      26,010       368.9      22.5      00:25:16
 13506       7   4,335      30,345       378.9      23.2      00:24:57
 13701       9   4,335      39,015       384.8      23.5      00:25:00
 13931       6   4,335      26,010       391.0      23.9      00:25:01
 14203       9   4,335      39,015       398.9      24.4      00:24:53
 14463       8   4,335      34,680       406.5      24.8      00:24:46
 14738       9   4,335      39,015       414.4      25.3      00:24:38
 15040       5   4,335      21,675       423.3      25.9      00:24:25
 15379       4   4,335      17,340       433.3      26.5      00:24:08
 15704      10   4,335      43,350       442.5      27.0      00:23:54
 16073       4   4,335      17,340       453.6      27.7      00:23:32
 16419      10   4,335      43,350       464.0      28.3      00:23:13
 16685      10   4,335      43,350       471.7      28.8      00:23:06
 16888       6   4,335      26,010       477.5      29.2      00:23:07
 17115       8   4,335      34,680       484.1      29.6      00:23:04
 17319       7   4,335      30,345       490.0      29.9      00:23:04
 17572       6   4,335      26,010       497.8      30.4      00:22:56
 17815       3   4,335      13,005       504.6      30.8      00:22:52
 18161       6   4,335      26,010       514.8      31.5      00:22:34
 18530       4   4,335      17,340       525.1      32.1      00:22:17
 18729       6   4,335      26,010       531.2      32.5      00:22:15
 18937       5   4,335      21,675       537.4      32.8      00:22:13
 19154       9   4,335      39,015       544.0      33.2      00:22:09
 19430       5   4,335      21,675       552.2      33.7      00:21:59
 19788       9   4,335      39,015       563.1      34.4      00:21:40
 20191       8   4,335      34,680       575.3      35.1      00:21:16
 20512       5   4,335      21,675       584.6      35.7      00:21:03
 20698       5   4,335      21,675       590.2      36.1      00:21:02
 20889       7   4,335      30,345       595.9      36.4      00:21:01
 21138       8   4,335      34,680       602.9      36.8      00:20:55
 21380       9   4,335      39,015       609.1      37.2      00:20:52
 21605      10   4,335      43,350       615.5      37.6      00:20:48
 21817       8   4,335      34,680       621.0      37.9      00:20:46
 22082       7   4,335      30,345       628.4      38.4      00:20:39
 22366       8   4,335      34,680       635.8      38.8      00:20:31
 22566      10   4,335      43,350       641.4      39.2      00:20:29
 22852       6   4,335      26,010       648.9      39.6      00:20:21
 23183      10   4,335      43,350       658.5      40.2      00:20:06
 23530       5   4,335      21,675       668.1      40.8      00:19:52
 23852       9   4,335      39,015       677.4      41.4      00:19:39
 24173       7   4,335      30,345       686.1      41.9      00:19:27
 24513       8   4,335      34,680       695.5      42.5      00:19:13
 24844       6   4,335      26,010       705.0      43.1      00:18:59
 25219       8   4,335      34,680       715.9      43.7      00:18:42
 25508       9   4,335      39,015       724.2      44.2      00:18:32
 25772       9   4,335      39,015       731.7      44.7      00:18:24
 25945       6   4,335      26,010       736.7      45.0      00:18:22
 26194       5   4,335      21,675       743.9      45.4      00:18:15
 26475       8   4,335      34,680       751.8      45.9      00:18:06
 26794       5   4,335      21,675       760.7      46.5      00:17:54
 27045       5   4,335      21,675       767.9      46.9      00:17:46
 27254       9   4,335      39,015       773.8      47.3      00:17:42
 27481       9   4,335      39,015       780.3      47.7      00:17:36
 27671       9   4,335      39,015       785.9      48.0      00:17:33
 27911       7   4,335      30,345       793.0      48.4      00:17:25
 28209       6   4,335      26,010       801.6      49.0      00:17:14
 28560       9   4,335      39,015       812.2      49.6      00:16:58
 28751      10   4,335      43,350       817.9      50.0      00:16:54
 28919       8   4,335      34,680       822.9      50.3      00:16:51
 29088       8   4,335      34,680       827.9      50.6      00:16:49
 29372       7   4,335      30,345       836.1      51.1      00:16:38
 29636       7   4,335      30,345       843.6      51.5      00:16:30
 29888      10   4,335      43,350       851.1      52.0      00:16:21
 30073       6   4,335      26,010       856.5      52.3      00:16:17
 30294       8   4,335      34,680       862.9      52.7      00:16:11
 30496      10   4,335      43,350       869.0      53.1      00:16:05
 30789      10   4,335      43,350       877.7      53.6      00:15:54
 31155       7   4,335      30,345       888.3      54.3      00:15:38
 31487       7   4,335      30,345       898.4      54.9      00:15:23
 31808       8   4,335      34,680       908.0      55.5      00:15:09
 32173       8   4,335      34,680       919.2      56.2      00:14:52
 32508       8   4,335      34,680       929.6      56.8      00:14:37
 32707       5   4,335      21,675       935.3      57.1      00:14:32
 32964      10   4,335      43,350       943.1      57.6      00:14:23
 33145       5   4,335      21,675       948.6      58.0      00:14:18
 33402      10   4,335      43,350       956.2      58.4      00:14:09
 33636      10   4,335      43,350       963.4      58.9      00:14:01
 33956       9   4,335      39,015       973.0      59.4      00:13:48
 34178       9   4,335      39,015       979.9      59.9      00:13:40
 34539       8   4,335      34,680       990.8      60.5      00:13:24
 34872       8   4,335      34,680     1,000.9      61.1      00:13:10
 35260      10   4,335      43,350     1,012.5      61.9      00:12:53
 35612       6   4,335      26,010     1,023.1      62.5      00:12:38
 35939       9   4,335      39,015     1,032.8      63.1      00:12:25
 36277       7   4,335      30,345     1,043.0      63.7      00:12:11
 36609      10   4,335      43,350     1,052.8      64.3      00:11:57
 36825       8   4,335      34,680     1,059.0      64.7      00:11:51
 37093       6   4,335      26,010     1,066.7      65.2      00:11:42
 37316       7   4,335      30,345     1,072.7      65.5      00:11:36
 37582       6   4,335      26,010     1,080.2      66.0      00:11:27
 37826       6   4,335      26,010     1,086.9      66.4      00:11:20
 38033       9   4,335      39,015     1,093.0      66.8      00:11:13
 38250       9   4,335      39,015     1,099.4      67.2      00:11:06
 38494      10   4,335      43,350     1,106.8      67.6      00:10:58
 38828      10   4,335      43,350     1,116.6      68.2      00:10:45
 39163       5   4,335      21,675     1,126.3      68.8      00:10:32
 39510       9   4,335      39,015     1,136.1      69.4      00:10:19
 39820       5   4,335      21,675     1,144.9      69.9      00:10:07
 40276       8   4,335      34,680     1,158.0      70.7      00:09:49
 40719      10   4,335      43,350     1,171.2      71.5      00:09:30
 41134       8   4,335      34,680     1,183.5      72.3      00:09:13
 41527       8   4,335      34,680     1,194.9      73.0      00:08:58
 41884       7   4,335      30,345     1,205.4      73.6      00:08:44
 42167      10   4,335      43,350     1,213.4      74.1      00:08:34
 42453      10   4,335      43,350     1,221.6      74.6      00:08:24
 42765       9   4,335      39,015     1,230.4      75.2      00:08:13
 43116       7   4,335      30,345     1,240.9      75.8      00:07:60
 43456       8   4,335      34,680     1,251.1      76.4      00:07:47
 43781       4   4,335      17,340     1,260.1      77.0      00:07:36
 44088       7   4,335      30,345     1,269.1      77.5      00:07:24
 44418       7   4,335      30,345     1,278.3      78.1      00:07:13
 44793       9   4,335      39,015     1,289.2      78.8      00:06:59
 45150       2   4,335       8,670     1,299.5      79.4      00:06:46
 45501       3   4,335      13,005     1,309.0      80.0      00:06:34
 45815       8   4,335      34,680     1,317.6      80.5      00:06:24
 46102       7   4,335      30,345     1,325.8      81.0      00:06:14
 46416       6   4,335      26,010     1,335.1      81.6      00:06:02
 46785       4   4,335      17,340     1,346.0      82.2      00:05:49
 47173       4   4,335      17,340     1,356.6      82.9      00:05:35
 47530      10   4,335      43,350     1,366.4      83.5      00:05:23
 47833       6   4,335      26,010     1,375.0      84.0      00:05:13
 48093       3   4,335      13,005     1,382.6      84.5      00:05:04
 48372       6   4,335      26,010     1,390.7      85.0      00:04:54
 48702       8   4,335      34,680     1,400.2      85.5      00:04:43
 48987       8   4,335      34,680     1,408.4      86.0      00:04:33
 49317       4   4,335      17,340     1,418.0      86.6      00:04:21
 49615       7   4,335      30,345     1,426.0      87.1      00:04:12
 49886       4   4,335      17,340     1,433.2      87.6      00:04:03
 50140       9   4,335      39,015     1,440.6      88.0      00:03:55
 50433      10   4,335      43,350     1,448.5      88.5      00:03:45
 50730       7   4,335      30,345     1,457.1      89.0      00:03:35
 51017       5   4,335      21,675     1,465.8      89.5      00:03:25
 51335       7   4,335      30,345     1,474.9      90.1      00:03:14
 51633      10   4,335      43,350     1,483.8      90.6      00:03:03
 51938       9   4,335      39,015     1,493.0      91.2      00:02:52
 52246       6   4,335      26,010     1,502.6      91.8      00:02:40
 52685       8   4,335      34,680     1,516.4      92.6      00:02:23
 53145       5   4,335      21,675     1,530.5      93.5      00:02:06
 53573       5   4,335      21,675     1,543.4      94.3      00:01:50
 53889       8   4,335      34,680     1,552.7      94.9      00:01:39
 54170       7   4,335      30,345     1,560.8      95.4      00:01:30
 54463       9   4,335      39,015     1,569.0      95.9      00:01:20
 54813       8   4,335      34,680     1,578.7      96.4      00:01:09
 55104       5   4,335      21,675     1,587.0      97.0      00:00:59
 55386      10   4,335      43,350     1,594.7      97.4      00:00:50
 55640       6   4,335      26,010     1,601.6      97.8      00:00:42
 55958       7   4,335      30,345     1,611.2      98.4      00:00:30
 56325       5   4,335      21,675     1,621.9      99.1      00:00:18
 56734       8   4,335      34,680     1,634.3      99.8      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 1931.821
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A300.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A300.csv saved

. 
. cap log close

. 
end of do-file
