
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A900_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   234       9   4,935      44,415         6.6       0.4      00:46:37
   553       6   4,935      29,610        15.9       0.9      00:38:50
   882       4   4,935      19,740        25.7       1.4      00:35:41
  1181       6   4,935      29,610        35.3       1.9      00:34:32
  1478       3   4,935      14,805        45.0       2.4      00:33:40
  1773       9   4,935      44,415        54.4       2.9      00:33:14
  2069       2   4,935       9,870        63.6       3.4      00:33:03
  2364       8   4,935      39,480        72.9       3.9      00:32:45
  2660       8   4,935      39,480        82.2       4.4      00:32:31
  2944       9   4,935      44,415        91.3       4.9      00:32:21
  3233       8   4,935      39,480       100.9       5.4      00:32:04
  3510       9   4,935      44,415       110.0       5.9      00:31:54
  3798       6   4,935      29,610       119.4       6.4      00:31:41
  4007      10   4,935      49,350       125.7       6.7      00:32:18
  4222       7   4,935      34,545       132.3       7.1      00:32:44
  4438      10   4,935      49,350       138.8       7.5      00:33:09
  4642       8   4,935      39,480       145.6       7.8      00:33:27
  4839       6   4,935      29,610       151.9       8.2      00:33:50
  5040      10   4,935      49,350       158.5       8.5      00:34:06
  5269       8   4,935      39,480       165.6       8.9      00:34:13
  5466       3   4,935      14,805       171.9       9.2      00:34:29
  5600       6   4,935      29,610       175.8       9.4      00:35:15
  5743       7   4,935      34,545       180.2       9.7      00:35:51
  5858       3   4,935      14,805       183.7       9.9      00:36:37
  5966      10   4,935      49,350       187.2      10.1      00:37:22
  6084       8   4,935      39,480       191.1      10.3      00:37:59
  6219       3   4,935      14,805       195.4      10.5      00:38:29
  6342       5   4,935      24,675       199.0      10.7      00:39:06
  6469       6   4,935      29,610       203.1      10.9      00:39:35
  6593      10   4,935      49,350       206.9      11.1      00:40:06
  6734       8   4,935      39,480       211.2      11.3      00:40:29
  6858       7   4,935      34,545       215.2      11.6      00:40:55
  6972       4   4,935      19,740       218.7      11.7      00:41:25
  7110       7   4,935      34,545       223.1      12.0      00:41:43
  7274       9   4,935      44,415       228.1      12.2      00:41:54
  7448       6   4,935      29,610       233.8      12.6      00:41:53
  7601       6   4,935      29,610       238.8      12.8      00:42:02
  7770       6   4,935      29,610       244.2      13.1      00:42:04
  7897       9   4,935      44,415       248.6      13.3      00:42:18
  8060       7   4,935      34,545       254.1      13.6      00:42:18
  8196       3   4,935      14,805       258.8      13.9      00:42:27
  8344       9   4,935      44,415       263.8      14.2      00:42:32
  8501       7   4,935      34,545       269.1      14.5      00:42:32
  8680       6   4,935      29,610       275.0      14.8      00:42:26
  8826      10   4,935      49,350       279.9      15.0      00:42:30
  8978       9   4,935      44,415       285.1      15.3      00:42:32
  9143       8   4,935      39,480       290.7      15.6      00:42:27
  9265      10   4,935      49,350       294.8      15.8      00:42:39
  9380       7   4,935      34,545       298.6      16.0      00:42:53
  9493      10   4,935      49,350       302.5      16.2      00:43:05
  9613       6   4,935      29,610       306.7      16.5      00:43:14
  9717       8   4,935      39,480       310.3      16.7      00:43:29
  9836       7   4,935      34,545       314.3      16.9      00:43:39
  9944       8   4,935      39,480       317.6      17.1      00:43:54
 10062       7   4,935      34,545       321.4      17.3      00:44:05
 10202       5   4,935      24,675       325.4      17.5      00:44:13
 10338      10   4,935      49,350       329.6      17.7      00:44:19
 10469       7   4,935      34,545       333.9      17.9      00:44:23
 10623       9   4,935      44,415       338.6      18.2      00:44:24
 10767       8   4,935      39,480       343.2      18.4      00:44:25
 10903       4   4,935      19,740       347.6      18.7      00:44:27
 11045       8   4,935      39,480       352.1      18.9      00:44:28
 11162       8   4,935      39,480       355.8      19.1      00:44:36
 11261       9   4,935      44,415       359.0      19.3      00:44:49
 11381      10   4,935      49,350       362.9      19.5      00:44:55
 11494       6   4,935      29,610       366.6      19.7      00:45:02
 11595       5   4,935      24,675       369.7      19.9      00:45:15
 11702       9   4,935      44,415       373.2      20.0      00:45:23
 11815       7   4,935      34,545       376.9      20.2      00:45:29
 11929       6   4,935      29,610       380.5      20.4      00:45:35
 12036       6   4,935      29,610       384.1      20.6      00:45:42
 12157       8   4,935      39,480       388.1      20.8      00:45:44
 12289       9   4,935      44,415       392.2      21.1      00:45:46
 12504       7   4,935      34,545       399.2      21.4      00:45:22
 12756      10   4,935      49,350       407.0      21.9      00:44:51
 13025       7   4,935      34,545       415.6      22.3      00:44:15
 13304       4   4,935      19,740       424.6      22.8      00:43:36
 13556       5   4,935      24,675       433.3      23.3      00:43:01
 13724       7   4,935      34,545       438.9      23.6      00:42:51
 13903       6   4,935      29,610       444.5      23.9      00:42:40
 14124       9   4,935      44,415       451.7      24.3      00:42:18
 14351       9   4,935      44,415       459.4      24.7      00:41:53
 14550       7   4,935      34,545       465.9      25.0      00:41:35
 14764       5   4,935      24,675       472.9      25.4      00:41:16
 15024       9   4,935      44,415       481.6      25.9      00:40:45
 15298       5   4,935      24,675       490.8      26.4      00:40:11
 15571      10   4,935      49,350       499.6      26.8      00:39:40
 15844       5   4,935      24,675       508.7      27.3      00:39:09
 16114       7   4,935      34,545       518.2      27.8      00:38:36
 16388       8   4,935      39,480       527.4      28.3      00:38:05
 16620       5   4,935      24,675       534.9      28.7      00:37:45
 16824       8   4,935      39,480       541.8      29.1      00:37:29
 16990       4   4,935      19,740       547.3      29.4      00:37:21
 17161       5   4,935      24,675       552.8      29.7      00:37:14
 17322       6   4,935      29,610       558.3      30.0      00:37:06
 17495       9   4,935      44,415       564.4      30.3      00:36:54
 17652       7   4,935      34,545       569.7      30.6      00:36:48
 17886       5   4,935      24,675       577.1      31.0      00:36:29
 18138       9   4,935      44,415       585.6      31.4      00:36:05
 18431      10   4,935      49,350       595.1      32.0      00:35:36
 18600       7   4,935      34,545       600.5      32.3      00:35:29
 18770       7   4,935      34,545       606.4      32.6      00:35:19
 18964       7   4,935      34,545       613.1      32.9      00:35:05
 19145      10   4,935      49,350       619.3      33.3      00:34:54
 19382       7   4,935      34,545       627.3      33.7      00:34:34
 19655       9   4,935      44,415       636.7      34.2      00:34:07
 19939      10   4,935      49,350       646.6      34.7      00:33:38
 20217       6   4,935      29,610       656.1      35.2      00:33:12
 20486       5   4,935      24,675       665.0      35.7      00:32:49
 20685       7   4,935      34,545       671.7      36.1      00:32:36
 20868       9   4,935      44,415       677.9      36.4      00:32:25
 21077       7   4,935      34,545       684.7      36.8      00:32:12
 21298       6   4,935      29,610       691.0      37.1      00:32:01
 21502       4   4,935      19,740       697.8      37.5      00:31:48
 21714       5   4,935      24,675       704.1      37.8      00:31:37
 21926       8   4,935      39,480       710.8      38.2      00:31:25
 22150       6   4,935      29,610       717.5      38.5      00:31:12
 22372       8   4,935      39,480       724.4      38.9      00:30:59
 22600       6   4,935      29,610       731.6      39.3      00:30:44
 22881       4   4,935      19,740       739.9      39.7      00:30:26
 23172       8   4,935      39,480       749.6      40.3      00:30:01
 23483       6   4,935      29,610       759.3      40.8      00:29:37
 23778       6   4,935      29,610       768.9      41.3      00:29:14
 24072       7   4,935      34,545       778.4      41.8      00:28:52
 24380       8   4,935      39,480       787.6      42.3      00:28:31
 24677       9   4,935      44,415       797.7      42.8      00:28:06
 24970      10   4,935      49,350       806.9      43.3      00:27:46
 25246      10   4,935      49,350       816.1      43.8      00:27:26
 25528       6   4,935      29,610       825.4      44.3      00:27:05
 25724       4   4,935      19,740       831.7      44.7      00:26:56
 25905       8   4,935      39,480       837.7      45.0      00:26:47
 26112       8   4,935      39,480       844.5      45.4      00:26:35
 26346       8   4,935      39,480       852.2      45.8      00:26:21
 26602       9   4,935      44,415       860.2      46.2      00:26:06
 26845       3   4,935      14,805       868.0      46.6      00:25:51
 27073       6   4,935      29,610       875.4      47.0      00:25:38
 27267       5   4,935      24,675       881.7      47.3      00:25:28
 27449       9   4,935      44,415       887.7      47.7      00:25:20
 27631       9   4,935      44,415       893.7      48.0      00:25:11
 27860       6   4,935      29,610       901.4      48.4      00:24:57
 28145       8   4,935      39,480       910.9      48.9      00:24:37
 28423       7   4,935      34,545       920.2      49.4      00:24:18
 28678       9   4,935      44,415       929.0      49.9      00:24:01
 28848       6   4,935      29,610       934.8      50.2      00:23:53
 29028      10   4,935      49,350       940.9      50.5      00:23:44
 29253      10   4,935      49,350       948.1      50.9      00:23:32
 29484       8   4,935      39,480       955.9      51.3      00:23:18
 29719       7   4,935      34,545       963.7      51.8      00:23:04
 29891       9   4,935      44,415       969.3      52.1      00:22:56
 30063       6   4,935      29,610       975.1      52.4      00:22:49
 30252       7   4,935      34,545       981.4      52.7      00:22:39
 30467       5   4,935      24,675       988.8      53.1      00:22:26
 30705       8   4,935      39,480       996.7      53.5      00:22:12
 30987       7   4,935      34,545     1,006.1      54.0      00:21:54
 31272       8   4,935      39,480     1,015.8      54.6      00:21:35
 31565       8   4,935      39,480     1,025.7      55.1      00:21:16
 31850       4   4,935      19,740     1,035.7      55.6      00:20:56
 32133       8   4,935      39,480     1,045.5      56.1      00:20:38
 32402       8   4,935      39,480     1,055.0      56.7      00:20:20
 32589      10   4,935      49,350     1,061.3      57.0      00:20:11
 32772       6   4,935      29,610     1,067.6      57.3      00:20:02
 32952       7   4,935      34,545     1,073.7      57.7      00:19:53
 33148       6   4,935      29,610     1,080.4      58.0      00:19:43
 33392       8   4,935      39,480     1,088.7      58.5      00:19:28
 33625       7   4,935      34,545     1,096.8      58.9      00:19:15
 33854       7   4,935      34,545     1,104.6      59.3      00:19:02
 34070       9   4,935      44,415     1,112.1      59.7      00:18:50
 34288      10   4,935      49,350     1,119.9      60.1      00:18:37
 34544       8   4,935      39,480     1,128.5      60.6      00:18:22
 34783       5   4,935      24,675     1,136.8      61.1      00:18:08
 35050       8   4,935      39,480     1,145.9      61.5      00:17:52
 35300       9   4,935      44,415     1,154.6      62.0      00:17:37
 35556       8   4,935      39,480     1,163.2      62.5      00:17:22
 35821      10   4,935      49,350     1,172.2      62.9      00:17:07
 36078       8   4,935      39,480     1,180.9      63.4      00:16:52
 36334       7   4,935      34,545     1,189.7      63.9      00:16:38
 36555       9   4,935      44,415     1,197.1      64.3      00:16:26
 36725       4   4,935      19,740     1,202.7      64.6      00:16:19
 36891       9   4,935      44,415     1,208.2      64.9      00:16:12
 37072      10   4,935      49,350     1,214.1      65.2      00:16:04
 37262       6   4,935      29,610     1,219.9      65.5      00:15:56
 37446       7   4,935      34,545     1,225.6      65.8      00:15:48
 37627       6   4,935      29,610     1,231.5      66.1      00:15:40
 37834       5   4,935      24,675     1,238.1      66.5      00:15:30
 38035      10   4,935      49,350     1,244.8      66.9      00:15:20
 38234       7   4,935      34,545     1,251.5      67.2      00:15:10
 38443       7   4,935      34,545     1,258.7      67.6      00:14:59
 38674       7   4,935      34,545     1,266.4      68.0      00:14:47
 38937       5   4,935      24,675     1,275.2      68.5      00:14:32
 39109       7   4,935      34,545     1,280.9      68.8      00:14:25
 39280       5   4,935      24,675     1,286.3      69.1      00:14:17
 39487      10   4,935      49,350     1,293.0      69.4      00:14:07
 39723       7   4,935      34,545     1,300.6      69.8      00:13:56
 39988       9   4,935      44,415     1,309.4      70.3      00:13:41
 40282       7   4,935      34,545     1,318.9      70.8      00:13:26
 40565       6   4,935      29,610     1,328.5      71.3      00:13:10
 40823       7   4,935      34,545     1,337.1      71.8      00:12:56
 41021      10   4,935      49,350     1,344.0      72.2      00:12:45
 41208       8   4,935      39,480     1,350.2      72.5      00:12:37
 41435       9   4,935      44,415     1,357.7      72.9      00:12:25
 41667       5   4,935      24,675     1,365.4      73.3      00:12:13
 41915       6   4,935      29,610     1,373.9      73.8      00:11:60
 42120       9   4,935      44,415     1,380.2      74.1      00:11:51
 42316       5   4,935      24,675     1,386.3      74.4      00:11:42
 42503       6   4,935      29,610     1,392.7      74.8      00:11:33
 42708      10   4,935      49,350     1,399.2      75.1      00:11:23
 42914       8   4,935      39,480     1,406.1      75.5      00:11:13
 43109       9   4,935      44,415     1,412.9      75.9      00:11:03
 43311       9   4,935      44,415     1,419.7      76.2      00:10:53
 43500       8   4,935      39,480     1,426.0      76.6      00:10:44
 43797       6   4,935      29,610     1,435.5      77.1      00:10:29
 44084      10   4,935      49,350     1,445.0      77.6      00:10:14
 44275       9   4,935      44,415     1,451.3      77.9      00:10:05
 44487       9   4,935      44,415     1,458.0      78.3      00:09:55
 44726       7   4,935      34,545     1,465.8      78.7      00:09:43
 44955       2   4,935       9,870     1,473.4      79.1      00:09:31
 45207       7   4,935      34,545     1,481.4      79.6      00:09:19
 45411       6   4,935      29,610     1,487.6      79.9      00:09:10
 45628       4   4,935      19,740     1,494.3      80.2      00:09:01
 45841       8   4,935      39,480     1,501.0      80.6      00:08:51
 46060       7   4,935      34,545     1,508.3      81.0      00:08:40
 46264       8   4,935      39,480     1,515.4      81.4      00:08:29
 46494      10   4,935      49,350     1,522.8      81.8      00:08:18
 46760       7   4,935      34,545     1,531.7      82.3      00:08:05
 46982       6   4,935      29,610     1,538.8      82.6      00:07:54
 47181       9   4,935      44,415     1,544.7      83.0      00:07:46
 47342       8   4,935      39,480     1,549.9      83.2      00:07:39
 47527      10   4,935      49,350     1,555.7      83.5      00:07:30
 47709      10   4,935      49,350     1,561.7      83.9      00:07:22
 47904       6   4,935      29,610     1,568.0      84.2      00:07:13
 48104       6   4,935      29,610     1,574.6      84.6      00:07:03
 48295       9   4,935      44,415     1,580.9      84.9      00:06:54
 48522       4   4,935      19,740     1,588.4      85.3      00:06:43
 48743       5   4,935      24,675     1,595.6      85.7      00:06:32
 48966       3   4,935      14,805     1,602.9      86.1      00:06:21
 49145       5   4,935      24,675     1,609.0      86.4      00:06:12
 49371       5   4,935      24,675     1,616.0      86.8      00:06:02
 49579       6   4,935      29,610     1,622.4      87.1      00:05:53
 49804       6   4,935      29,610     1,629.3      87.5      00:05:42
 50035       4   4,935      19,740     1,636.9      87.9      00:05:31
 50256       6   4,935      29,610     1,643.8      88.3      00:05:21
 50459       8   4,935      39,480     1,650.2      88.6      00:05:12
 50682       8   4,935      39,480     1,657.6      89.0      00:05:01
 50895      10   4,935      49,350     1,664.9      89.4      00:04:50
 51092       2   4,935       9,870     1,671.5      89.8      00:04:40
 51323       9   4,935      44,415     1,679.1      90.2      00:04:29
 51566       8   4,935      39,480     1,687.4      90.6      00:04:16
 51794       9   4,935      44,415     1,695.3      91.0      00:04:05
 52060       8   4,935      39,480     1,704.4      91.5      00:03:51
 52346      10   4,935      49,350     1,714.6      92.1      00:03:36
 52643       6   4,935      29,610     1,725.4      92.7      00:03:19
 52962       6   4,935      29,610     1,736.6      93.3      00:03:03
 53279       7   4,935      34,545     1,747.4      93.8      00:02:47
 53565       7   4,935      34,545     1,757.3      94.4      00:02:32
 53816       6   4,935      29,610     1,765.6      94.8      00:02:20
 53999       2   4,935       9,870     1,771.6      95.1      00:02:11
 54208       5   4,935      24,675     1,778.5      95.5      00:02:01
 54458       3   4,935      14,805     1,786.2      95.9      00:01:50
 54756       6   4,935      29,610     1,795.8      96.4      00:01:36
 55029       8   4,935      39,480     1,804.6      96.9      00:01:23
 55274       2   4,935       9,870     1,812.4      97.3      00:01:12
 55518      10   4,935      49,350     1,819.9      97.7      00:01:01
 55725       7   4,935      34,545     1,826.7      98.1      00:00:51
 55976       7   4,935      34,545     1,835.2      98.6      00:00:39
 56252       6   4,935      29,610     1,844.5      99.1      00:00:25
 56553       8   4,935      39,480     1,854.9      99.6      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 2679.412
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
