
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed457.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A900_randomseed457.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed457.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed457.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   210       4   4,935      19,740         5.9       0.3      00:52:10
   448       8   4,935      39,480        12.7       0.7      00:48:34
   663       6   4,935      29,610        19.1       1.0      00:48:13
   867       6   4,935      29,610        25.3       1.4      00:48:27
  1058      10   4,935      49,350        31.4       1.7      00:48:41
  1243       9   4,935      44,415        37.3       2.0      00:49:01
  1420       7   4,935      34,545        43.1       2.3      00:49:21
  1596       8   4,935      39,480        48.9       2.6      00:49:37
  1796       8   4,935      39,480        55.2       3.0      00:49:15
  1999       9   4,935      44,415        61.4       3.3      00:49:01
  2185       8   4,935      39,480        67.3       3.6      00:48:59
  2386       3   4,935      14,805        73.6       4.0      00:48:42
  2585      10   4,935      49,350        79.8       4.3      00:48:30
  2773       5   4,935      24,675        86.0       4.6      00:48:19
  2974       6   4,935      29,610        92.1       4.9      00:48:10
  3160       6   4,935      29,610        98.4       5.3      00:47:55
  3345       9   4,935      44,415       104.6       5.6      00:47:43
  3538      10   4,935      49,350       110.9       6.0      00:47:30
  3721       4   4,935      19,740       116.9       6.3      00:47:26
  3890       9   4,935      44,415       122.2       6.6      00:47:36
  4029       8   4,935      39,480       126.3       6.8      00:48:14
  4137       6   4,935      29,610       129.7       7.0      00:49:08
  4260       8   4,935      39,480       133.4       7.2      00:49:49
  4395       8   4,935      39,480       137.4       7.4      00:50:22
  4523       7   4,935      34,545       141.6       7.6      00:50:48
  4661       9   4,935      44,415       146.3       7.9      00:51:01
  4790       6   4,935      29,610       150.4       8.1      00:51:23
  4909       8   4,935      39,480       154.2       8.3      00:51:52
  5023      10   4,935      49,350       157.9       8.5      00:52:23
  5118       9   4,935      44,415       160.8       8.6      00:53:06
  5280       9   4,935      44,415       166.0       8.9      00:53:00
  5430       8   4,935      39,480       170.9       9.2      00:52:58
  5604       9   4,935      44,415       175.9       9.4      00:52:56
  5747       7   4,935      34,545       180.3       9.7      00:53:04
  5879       5   4,935      24,675       184.3       9.9      00:53:18
  5987       6   4,935      29,610       187.9      10.1      00:53:40
  6093       2   4,935       9,870       191.4      10.3      00:54:03
  6202       5   4,935      24,675       194.8      10.5      00:54:26
  6316       3   4,935      14,805       198.3      10.6      00:54:45
  6417       6   4,935      29,610       201.4      10.8      00:55:11
  6532       8   4,935      39,480       205.0      11.0      00:55:28
  6655       8   4,935      39,480       208.8      11.2      00:55:40
  6792       9   4,935      44,415       213.1      11.4      00:55:41
  6939      10   4,935      49,350       217.8      11.7      00:55:36
  7076       9   4,935      44,415       222.0      11.9      00:55:38
  7235       5   4,935      24,675       226.8      12.2      00:55:30
  7392      10   4,935      49,350       232.0      12.5      00:55:15
  7538      10   4,935      49,350       236.7      12.7      00:55:09
  7688       4   4,935      19,740       241.5      13.0      00:55:02
  7795       8   4,935      39,480       245.0      13.2      00:55:13
  7960      10   4,935      49,350       250.8      13.5      00:54:50
  8129       6   4,935      29,610       256.5      13.8      00:54:29
  8298       9   4,935      44,415       262.2      14.1      00:54:08
  8456       6   4,935      29,610       267.6      14.4      00:53:51
  8628       7   4,935      34,545       273.3      14.7      00:53:30
  8769      10   4,935      49,350       278.0      14.9      00:53:25
  8936       8   4,935      39,480       283.7      15.2      00:53:04
  9096       8   4,935      39,480       289.1      15.5      00:52:49
  9233       7   4,935      34,545       293.8      15.8      00:52:43
  9378       9   4,935      44,415       298.5      16.0      00:52:36
  9505       5   4,935      24,675       302.9      16.3      00:52:33
  9636       7   4,935      34,545       307.5      16.5      00:52:27
  9744       5   4,935      24,675       311.2      16.7      00:52:33
  9844       8   4,935      39,480       314.5      16.9      00:52:42
  9979       1   4,935       4,935       318.7      17.1      00:52:41
 10096       1   4,935       4,935       322.3      17.3      00:52:47
 10201      10   4,935      49,350       325.4      17.5      00:52:58
 10324       9   4,935      44,415       329.1      17.7      00:53:01
 10426      10   4,935      49,350       332.5      17.9      00:53:08
 10556       5   4,935      24,675       336.5      18.1      00:53:07
 10689      10   4,935      49,350       340.8      18.3      00:53:03
 10825       7   4,935      34,545       345.0      18.5      00:52:60
 10935       6   4,935      29,610       348.6      18.7      00:53:03
 11031       7   4,935      34,545       351.7      18.9      00:53:12
 11155       6   4,935      29,610       355.6      19.1      00:53:11
 11253      10   4,935      49,350       358.7      19.3      00:53:19
 11344       9   4,935      44,415       361.7      19.4      00:53:28
 11432      10   4,935      49,350       364.6      19.6      00:53:38
 11536       9   4,935      44,415       367.9      19.8      00:53:44
 11646      10   4,935      49,350       371.4      19.9      00:53:46
 11772       7   4,935      34,545       375.5      20.2      00:53:42
 11899       4   4,935      19,740       379.5      20.4      00:53:38
 12036       6   4,935      29,610       384.1      20.6      00:53:29
 12167       8   4,935      39,480       388.5      20.9      00:53:22
 12304       2   4,935       9,870       392.7      21.1      00:53:16
 12502       8   4,935      39,480       399.1      21.4      00:52:47
 12698      10   4,935      49,350       405.4      21.8      00:52:21
 12894       7   4,935      34,545       411.3      22.1      00:51:59
 13096       9   4,935      44,415       417.9      22.4      00:51:30
 13260       9   4,935      44,415       423.1      22.7      00:51:15
 13429      10   4,935      49,350       428.9      23.0      00:50:55
 13572       9   4,935      44,415       433.8      23.3      00:50:43
 13656       8   4,935      39,480       436.8      23.5      00:50:49
 13760       8   4,935      39,480       440.0      23.6      00:50:53
 13865       7   4,935      34,545       443.4      23.8      00:50:54
 13967       7   4,935      34,545       446.5      24.0      00:50:57
 14060       8   4,935      39,480       449.6      24.1      00:51:02
 14198      10   4,935      49,350       454.2      24.4      00:50:52
 14314      10   4,935      49,350       458.1      24.6      00:50:48
 14432       7   4,935      34,545       462.0      24.8      00:50:44
 14560       7   4,935      34,545       466.3      25.0      00:50:38
 14694      10   4,935      49,350       470.6      25.3      00:50:30
 14862      10   4,935      49,350       476.1      25.6      00:50:12
 15058       4   4,935      19,740       482.7      25.9      00:49:46
 15234      10   4,935      49,350       488.7      26.2      00:49:25
 15413       9   4,935      44,415       494.6      26.6      00:49:05
 15571      10   4,935      49,350       499.6      26.8      00:48:51
 15787       7   4,935      34,545       506.8      27.2      00:48:21
 15997       8   4,935      39,480       514.0      27.6      00:47:52
 16185      10   4,935      49,350       520.6      28.0      00:47:28
 16361      10   4,935      49,350       526.5      28.3      00:47:08
 16522       4   4,935      19,740       532.0      28.6      00:46:53
 16656      10   4,935      49,350       536.2      28.8      00:46:46
 16758      10   4,935      49,350       539.6      29.0      00:46:46
 16874       4   4,935      19,740       543.3      29.2      00:46:44
 16974       9   4,935      44,415       546.8      29.4      00:46:43
 17063       5   4,935      24,675       549.7      29.5      00:46:46
 17153       8   4,935      39,480       552.5      29.7      00:46:50
 17252       9   4,935      44,415       555.9      29.9      00:46:49
 17339      10   4,935      49,350       558.9      30.0      00:46:51
 17426       5   4,935      24,675       561.8      30.2      00:46:53
 17509       6   4,935      29,610       564.9      30.3      00:46:54
 17599       8   4,935      39,480       567.9      30.5      00:46:56
 17692       3   4,935      14,805       570.9      30.7      00:46:58
 17842       7   4,935      34,545       575.7      30.9      00:46:47
 17972       8   4,935      39,480       579.9      31.1      00:46:39
 18105       7   4,935      34,545       584.5      31.4      00:46:29
 18276       8   4,935      39,480       590.2      31.7      00:46:12
 18426       4   4,935      19,740       594.9      31.9      00:46:01
 18527       8   4,935      39,480       598.1      32.1      00:46:01
 18614       9   4,935      44,415       601.1      32.3      00:46:01
 18678      10   4,935      49,350       603.3      32.4      00:46:07
 18779       2   4,935       9,870       606.7      32.6      00:46:05
 18881       8   4,935      39,480       610.1      32.8      00:46:03
 18990       8   4,935      39,480       614.0      33.0      00:45:57
 19101       7   4,935      34,545       617.7      33.2      00:45:53
 19202       9   4,935      44,415       621.2      33.4      00:45:50
 19339       6   4,935      29,610       625.7      33.6      00:45:40
 19521       6   4,935      29,610       632.1      33.9      00:45:18
 19688       9   4,935      44,415       637.9      34.3      00:44:60
 19840       9   4,935      44,415       643.1      34.5      00:44:45
 19998       5   4,935      24,675       648.6      34.8      00:44:29
 20134       7   4,935      34,545       653.3      35.1      00:44:18
 20314       5   4,935      24,675       659.2      35.4      00:44:00
 20483      10   4,935      49,350       664.9      35.7      00:43:43
 20587       8   4,935      39,480       668.4      35.9      00:43:40
 20675      10   4,935      49,350       671.4      36.1      00:43:39
 20779       9   4,935      44,415       674.8      36.2      00:43:36
 20871       6   4,935      29,610       678.0      36.4      00:43:35
 20991       6   4,935      29,610       682.0      36.6      00:43:28
 21156       7   4,935      34,545       687.1      36.9      00:43:15
 21298       6   4,935      29,610       691.0      37.1      00:43:08
 21417       7   4,935      34,545       694.9      37.3      00:43:02
 21519       7   4,935      34,545       698.4      37.5      00:42:58
 21641       9   4,935      44,415       702.0      37.7      00:42:54
 21774       3   4,935      14,805       705.9      37.9      00:42:48
 21875       4   4,935      19,740       709.2      38.1      00:42:45
 21962      10   4,935      49,350       712.0      38.2      00:42:45
 22092       6   4,935      29,610       715.7      38.4      00:42:39
 22215       7   4,935      34,545       719.7      38.6      00:42:32
 22327       6   4,935      29,610       723.0      38.8      00:42:29
 22450       9   4,935      44,415       726.8      39.0      00:42:23
 22567       2   4,935       9,870       730.5      39.2      00:42:17
 22694       9   4,935      44,415       734.6      39.5      00:42:09
 22840       3   4,935      14,805       738.7      39.7      00:42:02
 23027       8   4,935      39,480       744.8      40.0      00:41:42
 23224       7   4,935      34,545       751.4      40.4      00:41:20
 23442       7   4,935      34,545       758.2      40.7      00:40:58
 23653      10   4,935      49,350       764.7      41.1      00:40:37
 23841       8   4,935      39,480       771.0      41.4      00:40:17
 24044       7   4,935      34,545       777.5      41.8      00:39:57
 24245       8   4,935      39,480       783.7      42.1      00:39:38
 24459       9   4,935      44,415       790.3      42.4      00:39:17
 24661       9   4,935      44,415       797.1      42.8      00:38:55
 24837       9   4,935      44,415       802.7      43.1      00:38:40
 25015       9   4,935      44,415       808.4      43.4      00:38:25
 25177       8   4,935      39,480       813.9      43.7      00:38:10
 25335       5   4,935      24,675       819.0      44.0      00:37:58
 25508       8   4,935      39,480       824.8      44.3      00:37:42
 25619       4   4,935      19,740       828.0      44.5      00:37:39
 25718      10   4,935      49,350       831.5      44.7      00:37:34
 25827       6   4,935      29,610       835.2      44.9      00:37:28
 25958       5   4,935      24,675       839.4      45.1      00:37:20
 26052       9   4,935      44,415       842.5      45.2      00:37:17
 26180      10   4,935      49,350       846.7      45.5      00:37:09
 26342       5   4,935      24,675       852.0      45.8      00:36:55
 26494       9   4,935      44,415       856.7      46.0      00:36:45
 26644       8   4,935      39,480       861.5      46.3      00:36:34
 26775       4   4,935      19,740       865.8      46.5      00:36:25
 26897      10   4,935      49,350       869.6      46.7      00:36:18
 27031      10   4,935      49,350       874.1      46.9      00:36:09
 27118       6   4,935      29,610       876.9      47.1      00:36:07
 27226       4   4,935      19,740       880.4      47.3      00:36:02
 27338       9   4,935      44,415       884.0      47.5      00:35:56
 27421       9   4,935      44,415       886.7      47.6      00:35:55
 27526       5   4,935      24,675       890.2      47.8      00:35:50
 27633       4   4,935      19,740       893.8      48.0      00:35:44
 27761       6   4,935      29,610       898.0      48.2      00:35:36
 27881       5   4,935      24,675       902.1      48.4      00:35:28
 28053       9   4,935      44,415       907.7      48.7      00:35:12
 28182       5   4,935      24,675       912.0      49.0      00:35:04
 28321       9   4,935      44,415       916.8      49.2      00:34:53
 28502       3   4,935      14,805       923.1      49.6      00:34:35
 28665      10   4,935      49,350       928.5      49.9      00:34:21
 28750       7   4,935      34,545       931.5      50.0      00:34:18
 28844       7   4,935      34,545       934.7      50.2      00:34:14
 28931       3   4,935      14,805       937.6      50.4      00:34:10
 29028      10   4,935      49,350       940.9      50.5      00:34:06
 29171       7   4,935      34,545       945.5      50.8      00:33:56
 29286      10   4,935      49,350       949.3      51.0      00:33:49
 29421       5   4,935      24,675       953.9      51.2      00:33:38
 29543       6   4,935      29,610       957.7      51.4      00:33:31
 29660       6   4,935      29,610       961.5      51.6      00:33:24
 29771       5   4,935      24,675       965.3      51.8      00:33:17
 29877       7   4,935      34,545       968.9      52.0      00:33:11
 29961       8   4,935      39,480       971.6      52.2      00:33:09
 30057       8   4,935      39,480       974.9      52.4      00:33:04
 30164       8   4,935      39,480       978.6      52.6      00:32:58
 30291      10   4,935      49,350       982.7      52.8      00:32:49
 30422      10   4,935      49,350       987.2      53.0      00:32:39
 30543       8   4,935      39,480       991.3      53.2      00:32:31
 30717       8   4,935      39,480       997.1      53.5      00:32:15
 30917       4   4,935      19,740     1,003.9      53.9      00:31:56
 31114       4   4,935      19,740     1,010.3      54.3      00:31:38
 31301       7   4,935      34,545     1,016.7      54.6      00:31:20
 31486       9   4,935      44,415     1,023.2      54.9      00:31:02
 31679      10   4,935      49,350     1,029.6      55.3      00:30:44
 31859       8   4,935      39,480     1,036.0      55.6      00:30:27
 32023       9   4,935      44,415     1,041.7      55.9      00:30:12
 32184      10   4,935      49,350     1,047.3      56.2      00:29:58
 32346       8   4,935      39,480     1,053.1      56.6      00:29:43
 32492       8   4,935      39,480     1,058.0      56.8      00:29:31
 32569       6   4,935      29,610     1,060.6      57.0      00:29:29
 32622       8   4,935      39,480     1,062.4      57.1      00:29:30
 32712       7   4,935      34,545     1,065.5      57.2      00:29:25
 32793       8   4,935      39,480     1,068.3      57.4      00:29:22
 32896       6   4,935      29,610     1,071.7      57.6      00:29:16
 32981       8   4,935      39,480     1,074.7      57.7      00:29:12
 33080       7   4,935      34,545     1,078.1      57.9      00:29:06
 33149      10   4,935      49,350     1,080.5      58.0      00:29:05
 33251       8   4,935      39,480     1,083.9      58.2      00:28:59
 33361      10   4,935      49,350     1,087.6      58.4      00:28:52
 33465       9   4,935      44,415     1,091.1      58.6      00:28:46
 33560       8   4,935      39,480     1,094.5      58.8      00:28:39
 33689       8   4,935      39,480     1,099.0      59.0      00:28:30
 33806       9   4,935      44,415     1,103.0      59.2      00:28:21
 33940       9   4,935      44,415     1,107.6      59.5      00:28:11
 34071       7   4,935      34,545     1,112.1      59.7      00:28:01
 34178       6   4,935      29,610     1,116.0      59.9      00:27:53
 34354       5   4,935      24,675     1,122.0      60.3      00:27:37
 34550       6   4,935      29,610     1,128.7      60.6      00:27:19
 34730       5   4,935      24,675     1,134.9      60.9      00:27:02
 34911       4   4,935      19,740     1,141.2      61.3      00:26:46
 35052       9   4,935      44,415     1,145.9      61.5      00:26:35
 35247       5   4,935      24,675     1,152.7      61.9      00:26:17
 35446       6   4,935      29,610     1,159.6      62.3      00:25:58
 35594       6   4,935      29,610     1,164.5      62.5      00:25:47
 35768       5   4,935      24,675     1,170.3      62.9      00:25:32
 35961      10   4,935      49,350     1,176.9      63.2      00:25:15
 36156       9   4,935      44,415     1,183.7      63.6      00:24:57
 36335       6   4,935      29,610     1,189.8      63.9      00:24:42
 36514       7   4,935      34,545     1,195.7      64.2      00:24:27
 36619       2   4,935       9,870     1,199.4      64.4      00:24:20
 36737       8   4,935      39,480     1,203.0      64.6      00:24:13
 36837      10   4,935      49,350     1,206.3      64.8      00:24:07
 36933       9   4,935      44,415     1,209.7      65.0      00:24:02
 37041       9   4,935      44,415     1,213.1      65.1      00:23:55
 37154       8   4,935      39,480     1,216.5      65.3      00:23:49
 37283       7   4,935      34,545     1,220.4      65.5      00:23:41
 37350       5   4,935      24,675     1,222.6      65.7      00:23:39
 37446       7   4,935      34,545     1,225.6      65.8      00:23:34
 37537       8   4,935      39,480     1,228.6      66.0      00:23:29
 37649       6   4,935      29,610     1,232.2      66.2      00:23:22
 37777       9   4,935      44,415     1,236.2      66.4      00:23:14
 37870       8   4,935      39,480     1,239.3      66.6      00:23:08
 37961      10   4,935      49,350     1,242.3      66.7      00:23:04
 38114       6   4,935      29,610     1,247.4      67.0      00:22:51
 38235       7   4,935      34,545     1,251.5      67.2      00:22:43
 38358       6   4,935      29,610     1,255.8      67.4      00:22:33
 38480       8   4,935      39,480     1,260.0      67.7      00:22:24
 38641       6   4,935      29,610     1,265.3      68.0      00:22:12
 38810       8   4,935      39,480     1,271.0      68.3      00:21:58
 38948       4   4,935      19,740     1,275.6      68.5      00:21:47
 39041       5   4,935      24,675     1,278.7      68.7      00:21:42
 39137      10   4,935      49,350     1,281.8      68.8      00:21:36
 39227       7   4,935      34,545     1,284.6      69.0      00:21:32
 39338       9   4,935      44,415     1,288.3      69.2      00:21:24
 39471       8   4,935      39,480     1,292.4      69.4      00:21:15
 39596       7   4,935      34,545     1,296.7      69.6      00:21:06
 39737       6   4,935      29,610     1,301.0      69.9      00:20:57
 39860       3   4,935      14,805     1,305.1      70.1      00:20:48
 40039      10   4,935      49,350     1,311.0      70.4      00:20:33
 40192       9   4,935      44,415     1,316.1      70.7      00:20:21
 40331       8   4,935      39,480     1,320.4      70.9      00:20:12
 40489       8   4,935      39,480     1,325.9      71.2      00:19:59
 40677      10   4,935      49,350     1,332.3      71.5      00:19:43
 40882       5   4,935      24,675     1,339.1      71.9      00:19:25
 41016      10   4,935      49,350     1,343.8      72.2      00:19:15
 41144       9   4,935      44,415     1,348.0      72.4      00:19:06
 41258      10   4,935      49,350     1,351.8      72.6      00:18:58
 41332       6   4,935      29,610     1,354.2      72.7      00:18:54
 41402       6   4,935      29,610     1,356.6      72.9      00:18:51
 41529       8   4,935      39,480     1,360.8      73.1      00:18:41
 41651       6   4,935      29,610     1,364.8      73.3      00:18:33
 41782       8   4,935      39,480     1,369.3      73.5      00:18:23
 41919       6   4,935      29,610     1,374.0      73.8      00:18:12
 42051       8   4,935      39,480     1,378.1      74.0      00:18:03
 42161       5   4,935      24,675     1,381.5      74.2      00:17:57
 42270       7   4,935      34,545     1,384.8      74.4      00:17:50
 42372       9   4,935      44,415     1,388.3      74.6      00:17:43
 42473      10   4,935      49,350     1,391.7      74.7      00:17:36
 42594       1   4,935       4,935     1,395.4      74.9      00:17:28
 42729       9   4,935      44,415     1,399.9      75.2      00:17:18
 42842       6   4,935      29,610     1,403.7      75.4      00:17:10
 42957       8   4,935      39,480     1,407.5      75.6      00:17:02
 43055       6   4,935      29,610     1,410.9      75.8      00:16:55
 43153      10   4,935      49,350     1,414.4      76.0      00:16:48
 43261       8   4,935      39,480     1,418.1      76.2      00:16:40
 43365       4   4,935      19,740     1,421.6      76.3      00:16:33
 43463       7   4,935      34,545     1,424.8      76.5      00:16:27
 43654       6   4,935      29,610     1,430.8      76.8      00:16:12
 43821       7   4,935      34,545     1,436.3      77.1      00:15:59
 44007      10   4,935      49,350     1,442.5      77.5      00:15:44
 44135       8   4,935      39,480     1,446.5      77.7      00:15:35
 44209       9   4,935      44,415     1,449.1      77.8      00:15:30
 44285       6   4,935      29,610     1,451.6      78.0      00:15:26
 44370       8   4,935      39,480     1,454.0      78.1      00:15:22
 44500       8   4,935      39,480     1,458.4      78.3      00:15:12
 44635       4   4,935      19,740     1,462.8      78.6      00:15:02
 44777       7   4,935      34,545     1,467.5      78.8      00:14:52
 44889       6   4,935      29,610     1,471.3      79.0      00:14:43
 45003       6   4,935      29,610     1,475.0      79.2      00:14:35
 45136       6   4,935      29,610     1,479.2      79.4      00:14:26
 45249       6   4,935      29,610     1,482.7      79.6      00:14:19
 45350       6   4,935      29,610     1,485.6      79.8      00:14:13
 45465      10   4,935      49,350     1,489.4      80.0      00:14:05
 45571       8   4,935      39,480     1,492.6      80.2      00:13:58
 45682       5   4,935      24,675     1,496.0      80.3      00:13:51
 45835       5   4,935      24,675     1,500.8      80.6      00:13:40
 45967      10   4,935      49,350     1,505.3      80.8      00:13:30
 46082       9   4,935      44,415     1,509.0      81.0      00:13:22
 46180      10   4,935      49,350     1,512.4      81.2      00:13:14
 46280       7   4,935      34,545     1,515.9      81.4      00:13:07
 46416       5   4,935      24,675     1,520.1      81.6      00:12:57
 46550       5   4,935      24,675     1,524.8      81.9      00:12:47
 46702      10   4,935      49,350     1,529.8      82.2      00:12:35
 46842       5   4,935      24,675     1,534.6      82.4      00:12:24
 46950       5   4,935      24,675     1,537.8      82.6      00:12:17
 47026       4   4,935      19,740     1,540.0      82.7      00:12:13
 47129       4   4,935      19,740     1,543.2      82.9      00:12:07
 47227       4   4,935      19,740     1,546.3      83.0      00:12:00
 47320       8   4,935      39,480     1,549.2      83.2      00:11:54
 47432       3   4,935      14,805     1,552.6      83.4      00:11:47
 47539       9   4,935      44,415     1,556.0      83.6      00:11:39
 47636       6   4,935      29,610     1,559.3      83.7      00:11:33
 47747       4   4,935      19,740     1,562.9      83.9      00:11:25
 47869       7   4,935      34,545     1,566.8      84.1      00:11:16
 47959       9   4,935      44,415     1,569.9      84.3      00:11:09
 48087       9   4,935      44,415     1,574.1      84.5      00:10:60
 48229       9   4,935      44,415     1,578.6      84.8      00:10:50
 48378       9   4,935      44,415     1,583.7      85.0      00:10:38
 48555       6   4,935      29,610     1,589.5      85.4      00:10:24
 48711       4   4,935      19,740     1,594.6      85.6      00:10:12
 48870       7   4,935      34,545     1,599.7      85.9      00:09:60
 48958       9   4,935      44,415     1,602.6      86.1      00:09:54
 49065      10   4,935      49,350     1,606.1      86.3      00:09:46
 49194       4   4,935      19,740     1,610.7      86.5      00:09:35
 49330       6   4,935      29,610     1,614.9      86.7      00:09:26
 49485       8   4,935      39,480     1,619.6      87.0      00:09:15
 49616       6   4,935      29,610     1,623.5      87.2      00:09:06
 49749       7   4,935      34,545     1,627.7      87.4      00:08:57
 49896       4   4,935      19,740     1,632.3      87.7      00:08:46
 50038       8   4,935      39,480     1,637.0      87.9      00:08:35
 50180       7   4,935      34,545     1,641.5      88.2      00:08:25
 50316       4   4,935      19,740     1,645.6      88.4      00:08:16
 50424       7   4,935      34,545     1,649.0      88.6      00:08:08
 50552       7   4,935      34,545     1,653.3      88.8      00:07:58
 50694       8   4,935      39,480     1,658.0      89.0      00:07:48
 50809       6   4,935      29,610     1,661.9      89.2      00:07:39
 50928       7   4,935      34,545     1,666.1      89.5      00:07:29
 51039      10   4,935      49,350     1,670.0      89.7      00:07:20
 51240       9   4,935      44,415     1,676.4      90.0      00:07:05
 51454       6   4,935      29,610     1,683.5      90.4      00:06:48
 51652      10   4,935      49,350     1,690.4      90.8      00:06:32
 51850       9   4,935      44,415     1,697.2      91.1      00:06:16
 52031       6   4,935      29,610     1,703.4      91.5      00:06:01
 52254       7   4,935      34,545     1,711.3      91.9      00:05:43
 52433       8   4,935      39,480     1,717.7      92.2      00:05:28
 52627       6   4,935      29,610     1,724.8      92.6      00:05:11
 52826       6   4,935      29,610     1,731.9      93.0      00:04:55
 53017       9   4,935      44,415     1,738.5      93.4      00:04:39
 53223       6   4,935      29,610     1,745.6      93.7      00:04:23
 53420      10   4,935      49,350     1,752.3      94.1      00:04:07
 53620       5   4,935      24,675     1,759.0      94.5      00:03:52
 53773       3   4,935      14,805     1,764.2      94.7      00:03:40
 53893       9   4,935      44,415     1,768.1      95.0      00:03:31
 54010      10   4,935      49,350     1,771.9      95.2      00:03:23
 54120       7   4,935      34,545     1,775.7      95.4      00:03:15
 54223       5   4,935      24,675     1,779.0      95.5      00:03:07
 54332       9   4,935      44,415     1,782.6      95.7      00:02:59
 54451       5   4,935      24,675     1,786.0      95.9      00:02:52
 54600       6   4,935      29,610     1,790.7      96.2      00:02:41
 54755       6   4,935      29,610     1,795.8      96.4      00:02:29
 54917       5   4,935      24,675     1,801.0      96.7      00:02:18
 55067       7   4,935      34,545     1,805.8      97.0      00:02:07
 55201       9   4,935      44,415     1,810.2      97.2      00:01:57
 55313       4   4,935      19,740     1,813.5      97.4      00:01:50
 55429      10   4,935      49,350     1,817.2      97.6      00:01:41
 55536       3   4,935      14,805     1,820.4      97.8      00:01:34
 55619      10   4,935      49,350     1,823.2      97.9      00:01:28
 55697       6   4,935      29,610     1,825.8      98.1      00:01:22
 55807       7   4,935      34,545     1,829.4      98.2      00:01:14
 55921       6   4,935      29,610     1,833.4      98.5      00:01:05
 56055       6   4,935      29,610     1,837.8      98.7      00:00:55
 56173       7   4,935      34,545     1,841.8      98.9      00:00:46
 56266       8   4,935      39,480     1,844.9      99.1      00:00:39
 56370       6   4,935      29,610     1,848.6      99.3      00:00:31
 56566       8   4,935      39,480     1,855.3      99.6      00:00:15

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 4214.194
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed457.csv sav
> ed

. 
. cap log close

. 
end of do-file
