
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A500.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   390       7   4,535      31,745        10.3       0.6      00:28:10
   468       9   4,535      40,815        12.3       0.7      00:46:53
   661       9   4,535      40,815        17.5       1.0      00:48:53
  1007       9   4,535      40,815        27.2       1.6      00:41:36
  1365       6   4,535      27,210        37.9       2.2      00:37:03
  1735       5   4,535      22,675        49.0       2.9      00:34:10
  2106       8   4,535      36,280        59.6       3.5      00:32:31
  2489       6   4,535      27,210        70.5       4.1      00:31:12
  2853       5   4,535      22,675        81.5       4.8      00:30:09
  3231      10   4,535      45,350        92.6       5.4      00:29:16
  3602      10   4,535      45,350       103.8       6.1      00:28:31
  3944       6   4,535      27,210       113.7       6.6      00:28:13
  4234       7   4,535      31,745       121.9       7.1      00:28:21
  4520       8   4,535      36,280       130.0       7.6      00:28:29
  4813      10   4,535      45,350       138.8       8.1      00:28:25
  5108       7   4,535      31,745       147.5       8.6      00:28:23
  5393       6   4,535      27,210       156.1       9.1      00:28:19
  5671       2   4,535       9,070       163.5       9.6      00:28:30
  5964       6   4,535      27,210       172.0      10.1      00:28:26
  6266       5   4,535      22,675       180.9      10.6      00:28:18
  6569      10   4,535      45,350       189.5      11.1      00:28:12
  6858       7   4,535      31,745       197.7      11.6      00:28:09
  7181       3   4,535      13,605       206.8      12.1      00:27:58
  7514      10   4,535      45,350       216.8      12.7      00:27:39
  7849       7   4,535      31,745       226.9      13.3      00:27:20
  8180       7   4,535      31,745       237.3      13.9      00:26:59
  8502       8   4,535      36,280       247.4      14.5      00:26:42
  8821      10   4,535      45,350       257.1      15.0      00:26:28
  9138      10   4,535      45,350       267.0      15.6      00:26:13
  9366       8   4,535      36,280       274.1      16.0      00:26:18
  9522       6   4,535      27,210       278.9      16.3      00:26:37
  9683       8   4,535      36,280       284.1      16.6      00:26:52
  9806       7   4,535      31,745       287.9      16.8      00:27:16
  9949       6   4,535      27,210       292.1      17.1      00:27:37
 10083       8   4,535      36,280       295.8      17.3      00:27:59
 10198       8   4,535      36,280       298.9      17.5      00:28:26
 10343       7   4,535      31,745       303.0      17.7      00:28:45
 10440       8   4,535      36,280       306.0      17.9      00:29:11
 10605       6   4,535      27,210       310.6      18.2      00:29:24
 10790      10   4,535      45,350       316.0      18.5      00:29:32
 11002      10   4,535      45,350       322.4      18.8      00:29:31
 11196      10   4,535      45,350       328.1      19.2      00:29:37
 11353       6   4,535      27,210       332.7      19.4      00:29:48
 11479       8   4,535      36,280       336.5      19.7      00:30:04
 11620       9   4,535      40,815       340.5      19.9      00:30:17
 11766       8   4,535      36,280       344.8      20.2      00:30:29
 11926       7   4,535      31,745       349.6      20.4      00:30:37
 12062       7   4,535      31,745       353.8      20.7      00:30:48
 12214       6   4,535      27,210       358.4      20.9      00:30:56
 12447       9   4,535      40,815       365.0      21.3      00:30:51
 12702       6   4,535      27,210       372.6      21.8      00:30:38
 12945       6   4,535      27,210       379.4      22.2      00:30:31
 13145       4   4,535      18,140       385.4      22.5      00:30:29
 13374       6   4,535      27,210       392.3      22.9      00:30:21
 13568       8   4,535      36,280       398.5      23.3      00:30:18
 13661       6   4,535      27,210       401.5      23.5      00:30:33
 13753       6   4,535      27,210       404.1      23.6      00:30:50
 13855       5   4,535      22,675       407.2      23.8      00:31:04
 13978      10   4,535      45,350       410.7      24.0      00:31:15
 14093       7   4,535      31,745       414.0      24.2      00:31:26
 14225       9   4,535      40,815       418.2      24.4      00:31:33
 14390      10   4,535      45,350       423.3      24.7      00:31:33
 14575      10   4,535      45,350       428.9      25.1      00:31:30
 14757      10   4,535      45,350       434.4      25.4      00:31:28
 14907       6   4,535      27,210       438.8      25.6      00:31:32
 15100       3   4,535      13,605       444.9      26.0      00:31:25
 15319       8   4,535      36,280       451.6      26.4      00:31:15
 15540       6   4,535      27,210       458.2      26.8      00:31:06
 15737       9   4,535      40,815       464.2      27.1      00:31:01
 15945      10   4,535      45,350       470.7      27.5      00:30:51
 16147       9   4,535      40,815       477.2      27.9      00:30:43
 16366       9   4,535      40,815       484.0      28.3      00:30:32
 16532       4   4,535      18,140       489.1      28.6      00:30:30
 16649      10   4,535      45,350       492.5      28.8      00:30:38
 16779       7   4,535      31,745       496.6      29.0      00:30:41
 16928      10   4,535      45,350       501.0      29.3      00:30:43
 17015      10   4,535      45,350       503.8      29.4      00:30:52
 17160       9   4,535      40,815       507.9      29.7      00:30:55
 17263      10   4,535      45,350       511.1      29.9      00:31:02
 17361       6   4,535      27,210       514.3      30.1      00:31:09
 17469      10   4,535      45,350       517.7      30.3      00:31:14
 17584       8   4,535      36,280       521.4      30.5      00:31:18
 17705      10   4,535      45,350       525.0      30.7      00:31:22
 17869       7   4,535      31,745       529.8      31.0      00:31:20
 18034       9   4,535      40,815       534.8      31.3      00:31:17
 18260       8   4,535      36,280       541.8      31.7      00:31:03
 18473       4   4,535      18,140       547.9      32.0      00:30:54
 18580       9   4,535      40,815       551.3      32.2      00:30:59
 18697       6   4,535      27,210       555.0      32.4      00:31:01
 18844       8   4,535      36,280       559.5      32.7      00:30:60
 18972       9   4,535      40,815       563.6      32.9      00:30:60
 19124       9   4,535      40,815       568.4      33.2      00:30:57
 19262       2   4,535       9,070       572.6      33.5      00:30:56
 19485       7   4,535      31,745       579.7      33.9      00:30:42
 19712       7   4,535      31,745       587.0      34.3      00:30:26
 19929       8   4,535      36,280       593.8      34.7      00:30:13
 20116       7   4,535      31,745       599.9      35.1      00:30:04
 20286       5   4,535      22,675       604.9      35.4      00:29:59
 20478       7   4,535      31,745       610.8      35.7      00:29:50
 20625      10   4,535      45,350       615.5      36.0      00:29:47
 20718       6   4,535      27,210       618.3      36.1      00:29:52
 20848       6   4,535      27,210       622.3      36.4      00:29:51
 20969       7   4,535      31,745       626.0      36.6      00:29:52
 21147       5   4,535      22,675       631.2      36.9      00:29:46
 21268       4   4,535      18,140       634.3      37.1      00:29:49
 21381      10   4,535      45,350       637.6      37.3      00:29:52
 21499       8   4,535      36,280       641.1      37.5      00:29:53
 21631       9   4,535      40,815       644.8      37.7      00:29:53
 21784       7   4,535      31,745       649.0      37.9      00:29:51
 21925       9   4,535      40,815       653.2      38.2      00:29:49
 22067       4   4,535      18,140       657.2      38.4      00:29:47
 22223       8   4,535      36,280       661.5      38.7      00:29:44
 22364       2   4,535       9,070       665.4      38.9      00:29:43
 22485       6   4,535      27,210       669.0      39.1      00:29:43
 22634       8   4,535      36,280       673.4      39.4      00:29:39
 22820       9   4,535      40,815       678.2      39.6      00:29:34
 23044       9   4,535      40,815       685.0      40.0      00:29:19
 23232       4   4,535      18,140       690.7      40.4      00:29:10
 23468       2   4,535       9,070       697.4      40.8      00:28:56
 23697       6   4,535      27,210       704.0      41.1      00:28:43
 23888       4   4,535      18,140       709.9      41.5      00:28:33
 24097       8   4,535      36,280       715.9      41.8      00:28:22
 24275      10   4,535      45,350       720.9      42.1      00:28:16
 24464       4   4,535      18,140       726.4      42.5      00:28:07
 24637       7   4,535      31,745       731.7      42.8      00:27:59
 24835       7   4,535      31,745       737.6      43.1      00:27:49
 25053       9   4,535      40,815       744.1      43.5      00:27:37
 25235       7   4,535      31,745       749.6      43.8      00:27:28
 25439       8   4,535      36,280       755.8      44.2      00:27:17
 25585       8   4,535      36,280       760.0      44.4      00:27:13
 25684       7   4,535      31,745       763.0      44.6      00:27:14
 25813       7   4,535      31,745       767.0      44.8      00:27:11
 25935       6   4,535      27,210       770.7      45.0      00:27:09
 26063       7   4,535      31,745       774.6      45.3      00:27:06
 26205       7   4,535      31,745       778.9      45.5      00:27:02
 26387       8   4,535      36,280       784.2      45.8      00:26:54
 26567       8   4,535      36,280       789.5      46.1      00:26:45
 26749      10   4,535      45,350       794.8      46.4      00:26:37
 26909       5   4,535      22,675       799.5      46.7      00:26:31
 27081       6   4,535      27,210       804.6      47.0      00:26:23
 27241       6   4,535      27,210       809.4      47.3      00:26:17
 27366       5   4,535      22,675       813.2      47.5      00:26:14
 27490       7   4,535      31,745       817.0      47.7      00:26:11
 27620       7   4,535      31,745       820.9      48.0      00:26:07
 27760       5   4,535      22,675       825.2      48.2      00:26:03
 27929       6   4,535      27,210       830.4      48.5      00:25:54
 28153       8   4,535      36,280       837.3      48.9      00:25:40
 28377       5   4,535      22,675       844.2      49.3      00:25:26
 28566       8   4,535      36,280       850.3      49.7      00:25:14
 28708       8   4,535      36,280       854.6      49.9      00:25:09
 28815      10   4,535      45,350       858.0      50.1      00:25:07
 28939       8   4,535      36,280       861.9      50.4      00:25:03
 29057       8   4,535      36,280       865.5      50.6      00:25:01
 29206       8   4,535      36,280       869.8      50.8      00:24:55
 29355       2   4,535       9,070       874.5      51.1      00:24:48
 29503      10   4,535      45,350       879.0      51.4      00:24:42
 29673       7   4,535      31,745       884.0      51.7      00:24:34
 29818       5   4,535      22,675       888.6      51.9      00:24:28
 29940       4   4,535      18,140       892.2      52.1      00:24:25
 30071      10   4,535      45,350       896.3      52.4      00:24:20
 30206       5   4,535      22,675       900.5      52.6      00:24:15
 30337       9   4,535      40,815       904.4      52.9      00:24:10
 30457       8   4,535      36,280       908.3      53.1      00:24:06
 30573       9   4,535      40,815       911.9      53.3      00:24:03
 30779       9   4,535      40,815       918.3      53.7      00:23:50
 30984       8   4,535      36,280       924.5      54.0      00:23:38
 31196      10   4,535      45,350       931.1      54.4      00:23:24
 31402       8   4,535      36,280       937.5      54.8      00:23:11
 31632      10   4,535      45,350       944.7      55.2      00:22:56
 31837      10   4,535      45,350       951.3      55.6      00:22:43
 32032      10   4,535      45,350       957.6      56.0      00:22:31
 32230      10   4,535      45,350       963.9      56.3      00:22:18
 32428       8   4,535      36,280       970.4      56.7      00:22:06
 32551       8   4,535      36,280       974.1      56.9      00:22:02
 32664       8   4,535      36,280       977.6      57.1      00:21:58
 32775       7   4,535      31,745       981.1      57.3      00:21:55
 32903       8   4,535      36,280       985.1      57.6      00:21:49
 33012      10   4,535      45,350       988.6      57.8      00:21:46
 33137       7   4,535      31,745       992.5      58.0      00:21:41
 33294       7   4,535      31,745       997.4      58.3      00:21:33
 33432       7   4,535      31,745     1,001.7      58.5      00:21:27
 33560       8   4,535      36,280     1,005.8      58.8      00:21:21
 33702      10   4,535      45,350     1,010.3      59.0      00:21:14
 33839       9   4,535      40,815     1,014.6      59.3      00:21:08
 33980      10   4,535      45,350     1,019.0      59.6      00:21:01
 34149       7   4,535      31,745     1,024.6      59.9      00:20:51
 34354       5   4,535      22,675     1,031.1      60.3      00:20:38
 34593      10   4,535      45,350     1,038.5      60.7      00:20:22
 34821       9   4,535      40,815     1,045.9      61.1      00:20:07
 35035       7   4,535      31,745     1,052.5      61.5      00:19:53
 35230       6   4,535      27,210     1,058.8      61.9      00:19:41
 35450       7   4,535      31,745     1,065.7      62.3      00:19:27
 35675       9   4,535      40,815     1,072.6      62.7      00:19:13
 35899       9   4,535      40,815     1,079.6      63.1      00:18:59
 36115       9   4,535      40,815     1,086.4      63.5      00:18:45
 36330       6   4,535      27,210     1,093.2      63.9      00:18:32
 36536       6   4,535      27,210     1,099.5      64.3      00:18:20
 36678       7   4,535      31,745     1,103.8      64.5      00:18:13
 36832       4   4,535      18,140     1,108.4      64.8      00:18:06
 36971       7   4,535      31,745     1,112.6      65.0      00:17:60
 37132       3   4,535      13,605     1,117.3      65.3      00:17:52
 37283       7   4,535      31,745     1,121.5      65.5      00:17:46
 37410       5   4,535      22,675     1,125.2      65.8      00:17:41
 37510       6   4,535      27,210     1,128.1      65.9      00:17:38
 37635       5   4,535      22,675     1,131.9      66.2      00:17:33
 37791      10   4,535      45,350     1,136.4      66.4      00:17:26
 37934       7   4,535      31,745     1,140.8      66.7      00:17:19
 38026       9   4,535      40,815     1,143.6      66.8      00:17:16
 38141      10   4,535      45,350     1,147.2      67.0      00:17:11
 38274       6   4,535      27,210     1,151.3      67.3      00:17:05
 38393       5   4,535      22,675     1,155.2      67.5      00:16:59
 38575       7   4,535      31,745     1,160.8      67.8      00:16:49
 38802       7   4,535      31,745     1,167.7      68.2      00:16:35
 38991       7   4,535      31,745     1,173.6      68.6      00:16:24
 39111      10   4,535      45,350     1,177.2      68.8      00:16:19
 39259       5   4,535      22,675     1,181.4      69.0      00:16:12
 39408       9   4,535      40,815     1,185.8      69.3      00:16:05
 39573      10   4,535      45,350     1,190.9      69.6      00:15:56
 39748       9   4,535      40,815     1,196.0      69.9      00:15:47
 39971       1   4,535       4,535     1,202.8      70.3      00:15:33
 40214      10   4,535      45,350     1,210.0      70.7      00:15:19
 40450       8   4,535      36,280     1,217.2      71.1      00:15:04
 40652       7   4,535      31,745     1,223.5      71.5      00:14:52
 40849       8   4,535      36,280     1,229.6      71.9      00:14:41
 40988       9   4,535      40,815     1,234.0      72.1      00:14:33
 41099       7   4,535      31,745     1,237.3      72.3      00:14:29
 41184       6   4,535      27,210     1,240.0      72.5      00:14:26
 41318       9   4,535      40,815     1,244.1      72.7      00:14:19
 41440       9   4,535      40,815     1,247.8      72.9      00:14:13
 41602       7   4,535      31,745     1,252.8      73.2      00:14:05
 41781       4   4,535      18,140     1,258.2      73.5      00:13:55
 41946       1   4,535       4,535     1,263.5      73.8      00:13:45
 42151      10   4,535      45,350     1,269.2      74.2      00:13:34
 42360       9   4,535      40,815     1,275.3      74.5      00:13:23
 42532       7   4,535      31,745     1,280.6      74.8      00:13:13
 42745       6   4,535      27,210     1,286.9      75.2      00:13:01
 42951       6   4,535      27,210     1,293.2      75.6      00:12:49
 43150       7   4,535      31,745     1,299.6      76.0      00:12:36
 43394       5   4,535      22,675     1,307.3      76.4      00:12:21
 43742       9   4,535      40,815     1,317.5      77.0      00:11:60
 44081       7   4,535      31,745     1,327.8      77.6      00:11:38
 44280       6   4,535      27,210     1,333.8      77.9      00:11:27
 44587       3   4,535      13,605     1,342.8      78.5      00:11:09
 44872       7   4,535      31,745     1,351.6      79.0      00:10:52
 45098       4   4,535      18,140     1,358.2      79.4      00:10:39
 45345       7   4,535      31,745     1,365.0      79.8      00:10:26
 45541       8   4,535      36,280     1,370.8      80.1      00:10:15
 45742       3   4,535      13,605     1,376.5      80.4      00:10:05
 46038       7   4,535      31,745     1,385.4      81.0      00:09:48
 46373       6   4,535      27,210     1,395.7      81.6      00:09:27
 46702      10   4,535      45,350     1,405.8      82.2      00:09:07
 46999       8   4,535      36,280     1,414.5      82.7      00:08:50
 47283       5   4,535      22,675     1,422.5      83.1      00:08:35
 47553       5   4,535      22,675     1,430.3      83.6      00:08:21
 47751       4   4,535      18,140     1,436.3      83.9      00:08:10
 47971      10   4,535      45,350     1,443.0      84.3      00:07:58
 48199       7   4,535      31,745     1,449.7      84.7      00:07:45
 48485       6   4,535      27,210     1,458.5      85.2      00:07:28
 48695       9   4,535      40,815     1,464.9      85.6      00:07:17
 48949       9   4,535      40,815     1,472.5      86.1      00:07:03
 49203      10   4,535      45,350     1,480.4      86.5      00:06:48
 49401       6   4,535      27,210     1,485.9      86.8      00:06:39
 49622       8   4,535      36,280     1,492.1      87.2      00:06:28
 49831       5   4,535      22,675     1,498.1      87.5      00:06:17
 50067       5   4,535      22,675     1,505.1      88.0      00:06:04
 50336       7   4,535      31,745     1,512.8      88.4      00:05:50
 50613       7   4,535      31,745     1,521.2      88.9      00:05:35
 50869       8   4,535      36,280     1,529.1      89.4      00:05:20
 51128       6   4,535      27,210     1,537.1      89.8      00:05:06
 51380       8   4,535      36,280     1,544.8      90.3      00:04:52
 51623       6   4,535      27,210     1,552.5      90.7      00:04:38
 51854       7   4,535      31,745     1,559.8      91.2      00:04:25
 52109       6   4,535      27,210     1,567.9      91.6      00:04:10
 52395       5   4,535      22,675     1,577.2      92.2      00:03:53
 52732       7   4,535      31,745     1,588.4      92.8      00:03:33
 53072       5   4,535      22,675     1,599.3      93.5      00:03:14
 53345      10   4,535      45,350     1,607.8      94.0      00:02:59
 53584       6   4,535      27,210     1,615.4      94.4      00:02:45
 53829       9   4,535      40,815     1,622.9      94.8      00:02:32
 54073       6   4,535      27,210     1,630.2      95.3      00:02:20
 54371       5   4,535      22,675     1,639.1      95.8      00:02:04
 54668      10   4,535      45,350     1,647.7      96.3      00:01:49
 54958      10   4,535      45,350     1,656.3      96.8      00:01:34
 55244       2   4,535       9,070     1,664.7      97.3      00:01:20
 55517       4   4,535      18,140     1,672.4      97.7      00:01:06
 55776       8   4,535      36,280     1,680.2      98.2      00:00:53
 56066      10   4,535      45,350     1,689.2      98.7      00:00:37
 56350       4   4,535      18,140     1,698.2      99.2      00:00:22
 56564       5   4,535      22,675     1,704.9      99.6      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 2916.509
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
