
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A400_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A400_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A400_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   352       8   4,435      35,480         9.0       0.5      00:30:50
   678       5   4,435      22,175        17.6       1.1      00:31:25
  1005       5   4,435      22,175        26.6       1.6      00:31:04
  1323      10   4,435      44,350        35.9       2.1      00:30:31
  1625       6   4,435      26,610        44.8       2.7      00:30:24
  1958      10   4,435      44,350        54.1       3.2      00:30:00
  2280       9   4,435      39,915        63.2       3.8      00:29:46
  2598       8   4,435      35,480        72.1       4.3      00:29:40
  2893       8   4,435      35,480        80.7       4.8      00:29:39
  3211       8   4,435      35,480        89.9       5.4      00:29:24
  3518       8   4,435      35,480        99.1       5.9      00:29:10
  3817       6   4,435      26,610       107.8       6.4      00:29:05
  4071       7   4,435      31,045       114.8       6.9      00:29:29
  4308       6   4,435      26,610       121.1       7.2      00:29:58
  4539      10   4,435      44,350       127.8       7.6      00:30:20
  4749       6   4,435      26,610       134.0       8.0      00:30:43
  4989      10   4,435      44,350       140.9       8.4      00:30:54
  5206      10   4,435      44,350       147.1       8.8      00:31:12
  5407       7   4,435      31,045       153.1       9.1      00:31:32
  5620      10   4,435      44,350       158.5       9.5      00:31:57
  5780       4   4,435      17,740       162.9       9.7      00:32:32
  6000       6   4,435      26,610       169.3      10.1      00:32:39
  6194       5   4,435      22,175       174.8      10.4      00:32:57
  6396       8   4,435      35,480       180.4      10.8      00:33:11
  6594       4   4,435      17,740       186.0      11.1      00:33:25
  6807      10   4,435      44,350       192.0      11.5      00:33:32
  7013       8   4,435      35,480       197.7      11.8      00:33:41
  7270       6   4,435      26,610       204.8      12.2      00:33:33
  7521      10   4,435      44,350       212.3      12.7      00:33:22
  7768       3   4,435      13,305       219.4      13.1      00:33:14
  8013       8   4,435      35,480       227.0      13.6      00:33:01
  8263       7   4,435      31,045       234.5      14.0      00:32:49
  8501       7   4,435      31,045       241.9      14.5      00:32:38
  8735       5   4,435      22,175       248.8      14.9      00:32:32
  8955       4   4,435      17,740       255.6      15.3      00:32:27
  9171       6   4,435      26,610       262.1      15.7      00:32:23
  9335       1   4,435       4,435       267.0      16.0      00:32:34
  9511       6   4,435      26,610       272.4      16.3      00:32:39
  9692       9   4,435      39,915       278.1      16.6      00:32:41
  9885       9   4,435      39,915       283.8      17.0      00:32:43
 10072       4   4,435      17,740       289.1      17.3      00:32:48
 10275       6   4,435      26,610       294.4      17.6      00:32:52
 10457      10   4,435      44,350       299.7      17.9      00:32:55
 10680       9   4,435      39,915       306.0      18.3      00:32:51
 10886       9   4,435      39,915       311.9      18.6      00:32:50
 11104       8   4,435      35,480       318.1      19.0      00:32:45
 11292       8   4,435      35,480       323.5      19.3      00:32:47
 11478       9   4,435      39,915       329.0      19.7      00:32:47
 11699       8   4,435      35,480       335.3      20.0      00:32:41
 11924       8   4,435      35,480       341.8      20.4      00:32:33
 12146       6   4,435      26,610       348.5      20.8      00:32:24
 12393      10   4,435      44,350       355.5      21.2      00:32:13
 12708       5   4,435      22,175       364.6      21.8      00:31:48
 13016       7   4,435      31,045       373.2      22.3      00:31:26
 13322       7   4,435      31,045       382.1      22.8      00:31:04
 13577      10   4,435      44,350       390.1      23.3      00:30:47
 13783       6   4,435      26,610       396.1      23.7      00:30:43
 14005      10   4,435      44,350       402.4      24.0      00:30:37
 14270       7   4,435      31,045       410.3      24.5      00:30:21
 14517      10   4,435      44,350       417.8      25.0      00:30:08
 14772       7   4,435      31,045       425.2      25.4      00:29:55
 15060       8   4,435      35,480       433.9      25.9      00:29:36
 15372       8   4,435      35,480       443.3      26.5      00:29:13
 15682       8   4,435      35,480       452.2      27.0      00:28:53
 15972       9   4,435      39,915       461.2      27.6      00:28:33
 16256      10   4,435      44,350       469.9      28.1      00:28:15
 16530       5   4,435      22,175       478.3      28.6      00:27:59
 16777       8   4,435      35,480       485.6      29.0      00:27:48
 16995       8   4,435      35,480       492.0      29.4      00:27:41
 17193      10   4,435      44,350       497.8      29.7      00:27:38
 17395       7   4,435      31,045       503.9      30.1      00:27:32
 17594       8   4,435      35,480       510.2      30.5      00:27:26
 17841       7   4,435      31,045       517.3      30.9      00:27:16
 18121      10   4,435      44,350       525.8      31.4      00:26:60
 18431      10   4,435      44,350       534.8      32.0      00:26:41
 18626       9   4,435      39,915       540.6      32.3      00:26:37
 18824       6   4,435      26,610       546.5      32.7      00:26:32
 19039       7   4,435      31,045       553.3      33.1      00:26:24
 19271      10   4,435      44,350       560.3      33.5      00:26:14
 19569      10   4,435      44,350       569.5      34.0      00:25:55
 19861       8   4,435      35,480       578.6      34.6      00:25:37
 20150       6   4,435      26,610       587.6      35.1      00:25:19
 20467       8   4,435      35,480       597.0      35.7      00:25:00
 20661       9   4,435      39,915       603.0      36.0      00:24:55
 20866       6   4,435      26,610       609.2      36.4      00:24:49
 21087       3   4,435      13,305       615.6      36.8      00:24:42
 21321       9   4,435      39,915       621.7      37.2      00:24:36
 21532       8   4,435      35,480       628.1      37.5      00:24:29
 21768       8   4,435      35,480       634.2      37.9      00:24:22
 21997       7   4,435      31,045       640.8      38.3      00:24:14
 22230       9   4,435      39,915       647.2      38.7      00:24:07
 22463       8   4,435      35,480       653.6      39.1      00:23:59
 22674       8   4,435      35,480       659.6      39.4      00:23:53
 22985       4   4,435      17,740       668.1      39.9      00:23:38
 23286       8   4,435      35,480       677.1      40.5      00:23:21
 23607       8   4,435      35,480       685.8      41.0      00:23:06
 23888       4   4,435      17,740       694.2      41.5      00:22:52
 24189       9   4,435      39,915       702.6      42.0      00:22:38
 24492       3   4,435      13,305       711.2      42.5      00:22:23
 24781       8   4,435      35,480       719.7      43.0      00:22:08
 25078       9   4,435      39,915       728.5      43.5      00:21:53
 25360       8   4,435      35,480       736.7      44.0      00:21:40
 25621      10   4,435      44,350       744.2      44.5      00:21:30
 25827       6   4,435      26,610       750.6      44.9      00:21:22
 26039       4   4,435      17,740       756.8      45.2      00:21:15
 26284       8   4,435      35,480       764.1      45.7      00:21:05
 26565       5   4,435      22,175       772.0      46.1      00:20:53
 26851       8   4,435      35,480       780.2      46.6      00:20:40
 27095      10   4,435      44,350       787.4      47.1      00:20:30
 27311       5   4,435      22,175       793.6      47.4      00:20:22
 27509       6   4,435      26,610       799.6      47.8      00:20:16
 27757       7   4,435      31,045       806.9      48.2      00:20:06
 28035       7   4,435      31,045       815.2      48.7      00:19:53
 28332       6   4,435      26,610       824.2      49.3      00:19:38
 28613       6   4,435      26,610       832.9      49.8      00:19:23
 28765       6   4,435      26,610       837.6      50.1      00:19:21
 28922       6   4,435      26,610       842.4      50.3      00:19:17
 29106       7   4,435      31,045       847.9      50.7      00:19:12
 29285       9   4,435      39,915       853.0      51.0      00:19:07
 29430       9   4,435      39,915       857.6      51.2      00:19:05
 29599       7   4,435      31,045       862.4      51.5      00:19:01
 29731       6   4,435      26,610       866.4      51.8      00:18:59
 29859       5   4,435      22,175       870.2      52.0      00:18:58
 30009       5   4,435      22,175       874.7      52.3      00:18:55
 30147       8   4,435      35,480       878.8      52.5      00:18:53
 30352       7   4,435      31,045       885.0      52.9      00:18:46
 30535       9   4,435      39,915       890.7      53.2      00:18:39
 30751       7   4,435      31,045       897.1      53.6      00:18:30
 30988      10   4,435      44,350       904.2      54.0      00:18:20
 31219       9   4,435      39,915       911.2      54.5      00:18:10
 31434      10   4,435      44,350       917.9      54.8      00:18:01
 31656       5   4,435      22,175       924.6      55.2      00:17:52
 31862       9   4,435      39,915       931.1      55.6      00:17:43
 32095       7   4,435      31,045       938.4      56.1      00:17:32
 32304       8   4,435      35,480       944.9      56.5      00:17:23
 32501      10   4,435      44,350       951.1      56.8      00:17:15
 32642       7   4,435      31,045       955.4      57.1      00:17:12
 32787      10   4,435      44,350       959.9      57.4      00:17:08
 32914       6   4,435      26,610       963.7      57.6      00:17:06
 33024       7   4,435      31,045       967.2      57.8      00:17:05
 33142       7   4,435      31,045       970.8      58.0      00:17:03
 33295       7   4,435      31,045       975.5      58.3      00:16:59
 33468       8   4,435      35,480       980.6      58.6      00:16:53
 33615       9   4,435      39,915       985.4      58.9      00:16:48
 33784       4   4,435      17,740       990.5      59.2      00:16:42
 33942       7   4,435      31,045       995.5      59.5      00:16:37
 34113      10   4,435      44,350     1,000.8      59.8      00:16:30
 34285      10   4,435      44,350     1,006.3      60.1      00:16:24
 34528       7   4,435      31,045     1,013.6      60.6      00:16:12
 34762       6   4,435      26,610     1,020.9      61.0      00:16:01
 34979       9   4,435      39,915     1,027.6      61.4      00:15:51
 35197       8   4,435      35,480     1,034.4      61.8      00:15:42
 35411       8   4,435      35,480     1,041.0      62.2      00:15:32
 35644       6   4,435      26,610     1,048.1      62.6      00:15:21
 35898       9   4,435      39,915     1,055.8      63.1      00:15:09
 36127      10   4,435      44,350     1,062.9      63.5      00:14:58
 36345      10   4,435      44,350     1,069.5      63.9      00:14:49
 36553       3   4,435      13,305     1,075.8      64.3      00:14:40
 36715       5   4,435      22,175     1,080.6      64.6      00:14:35
 36864       6   4,435      26,610     1,084.9      64.8      00:14:30
 37017       9   4,435      39,915     1,089.4      65.1      00:14:25
 37156       8   4,435      35,480     1,093.3      65.3      00:14:22
 37299       7   4,435      31,045     1,097.2      65.6      00:14:18
 37422       6   4,435      26,610     1,100.7      65.8      00:14:15
 37561       8   4,435      35,480     1,104.8      66.0      00:14:11
 37721       6   4,435      26,610     1,109.3      66.3      00:14:06
 37900       6   4,435      26,610     1,114.6      66.6      00:13:59
 38053       8   4,435      35,480     1,119.3      66.9      00:13:54
 38214      10   4,435      44,350     1,124.1      67.2      00:13:48
 38363       8   4,435      35,480     1,128.7      67.4      00:13:43
 38489       7   4,435      31,045     1,132.6      67.7      00:13:39
 38703       5   4,435      22,175     1,139.0      68.1      00:13:29
 38916       6   4,435      26,610     1,145.4      68.4      00:13:20
 39077       6   4,435      26,610     1,150.2      68.7      00:13:14
 39221       5   4,435      22,175     1,154.3      69.0      00:13:09
 39358       6   4,435      26,610     1,158.3      69.2      00:13:05
 39499       3   4,435      13,305     1,162.3      69.5      00:13:00
 39650       5   4,435      22,175     1,166.8      69.7      00:12:55
 39818      10   4,435      44,350     1,171.7      70.0      00:12:49
 40038       7   4,435      31,045     1,178.2      70.4      00:12:39
 40268       9   4,435      39,915     1,184.9      70.8      00:12:28
 40488       7   4,435      31,045     1,191.6      71.2      00:12:18
 40700       8   4,435      35,480     1,198.0      71.6      00:12:08
 40907       7   4,435      31,045     1,204.2      72.0      00:11:59
 41062       5   4,435      22,175     1,209.0      72.2      00:11:53
 41196       7   4,435      31,045     1,213.0      72.5      00:11:48
 41371       8   4,435      35,480     1,218.1      72.8      00:11:41
 41540       8   4,435      35,480     1,223.2      73.1      00:11:34
 41710       5   4,435      22,175     1,228.4      73.4      00:11:27
 41863       6   4,435      26,610     1,233.1      73.7      00:11:20
 42021       4   4,435      17,740     1,237.6      74.0      00:11:14
 42183       3   4,435      13,305     1,242.0      74.2      00:11:09
 42327       7   4,435      31,045     1,246.2      74.5      00:11:03
 42436       9   4,435      39,915     1,249.6      74.7      00:10:60
 42566       6   4,435      26,610     1,253.3      74.9      00:10:55
 42708      10   4,435      44,350     1,257.4      75.1      00:10:50
 42845       7   4,435      31,045     1,261.6      75.4      00:10:45
 42967       8   4,435      35,480     1,265.2      75.6      00:10:41
 43087       7   4,435      31,045     1,269.0      75.8      00:10:36
 43219      10   4,435      44,350     1,273.1      76.1      00:10:31
 43382      10   4,435      44,350     1,278.1      76.4      00:10:23
 43508       8   4,435      35,480     1,281.7      76.6      00:10:19
 43725       6   4,435      26,610     1,287.9      77.0      00:10:09
 43926       9   4,435      39,915     1,294.0      77.3      00:09:60
 44116       4   4,435      17,740     1,299.4      77.6      00:09:52
 44277       8   4,435      35,480     1,304.3      77.9      00:09:45
 44450       9   4,435      39,915     1,309.1      78.2      00:09:38
 44625       8   4,435      35,480     1,314.3      78.5      00:09:30
 44785       9   4,435      39,915     1,319.0      78.8      00:09:23
 44944       6   4,435      26,610     1,323.9      79.1      00:09:16
 45118       3   4,435      13,305     1,328.8      79.4      00:09:09
 45305       3   4,435      13,305     1,333.9      79.7      00:09:01
 45455      10   4,435      44,350     1,338.2      80.0      00:08:55
 45595       7   4,435      31,045     1,342.0      80.2      00:08:50
 45720      10   4,435      44,350     1,345.5      80.4      00:08:46
 45881       9   4,435      39,915     1,350.1      80.7      00:08:39
 46023       8   4,435      35,480     1,354.5      80.9      00:08:32
 46182      10   4,435      44,350     1,359.3      81.2      00:08:25
 46352       4   4,435      17,740     1,364.3      81.5      00:08:18
 46524       5   4,435      22,175     1,369.5      81.8      00:08:10
 46729       9   4,435      39,915     1,375.7      82.2      00:07:60
 46906       7   4,435      31,045     1,381.0      82.5      00:07:51
 47070       7   4,435      31,045     1,385.3      82.8      00:07:45
 47227       4   4,435      17,740     1,389.6      83.0      00:07:39
 47404       5   4,435      22,175     1,394.7      83.3      00:07:31
 47573       7   4,435      31,045     1,399.4      83.6      00:07:24
 47731       5   4,435      22,175     1,404.1      83.9      00:07:17
 47852       6   4,435      26,610     1,407.5      84.1      00:07:12
 47983       9   4,435      39,915     1,411.6      84.4      00:07:06
 48118       7   4,435      31,045     1,415.5      84.6      00:07:00
 48271       6   4,435      26,610     1,420.0      84.9      00:06:53
 48502       9   4,435      39,915     1,426.9      85.3      00:06:42
 48728      10   4,435      44,350     1,433.6      85.7      00:06:31
 48894       9   4,435      39,915     1,438.4      86.0      00:06:24
 49055       7   4,435      31,045     1,443.1      86.2      00:06:16
 49219       2   4,435       8,870     1,448.2      86.5      00:06:08
 49404      10   4,435      44,350     1,453.3      86.8      00:06:00
 49551       8   4,435      35,480     1,457.3      87.1      00:05:54
 49707       5   4,435      22,175     1,461.6      87.3      00:05:47
 49872       9   4,435      39,915     1,466.2      87.6      00:05:40
 49999       7   4,435      31,045     1,470.0      87.8      00:05:34
 50171       4   4,435      17,740     1,475.0      88.1      00:05:27
 50340       5   4,435      22,175     1,479.5      88.4      00:05:19
 50496       8   4,435      35,480     1,484.1      88.7      00:05:12
 50673       9   4,435      39,915     1,489.3      89.0      00:05:04
 50843      10   4,435      44,350     1,494.6      89.3      00:04:55
 51033       6   4,435      26,610     1,500.6      89.7      00:04:45
 51271       9   4,435      39,915     1,507.5      90.1      00:04:34
 51583       7   4,435      31,045     1,516.9      90.6      00:04:18
 51925       8   4,435      35,480     1,527.4      91.3      00:03:60
 52265       9   4,435      39,915     1,538.2      91.9      00:03:41
 52586      10   4,435      44,350     1,548.7      92.5      00:03:24
 52926       6   4,435      26,610     1,559.4      93.2      00:03:05
 53227       5   4,435      22,175     1,568.9      93.8      00:02:50
 53558       8   4,435      35,480     1,579.0      94.4      00:02:33
 53841       5   4,435      22,175     1,587.5      94.9      00:02:19
 54074       7   4,435      31,045     1,594.2      95.3      00:02:08
 54358       8   4,435      35,480     1,602.7      95.8      00:01:54
 54656       7   4,435      31,045     1,610.9      96.3      00:01:41
 54947       7   4,435      31,045     1,619.5      96.8      00:01:27
 55201       9   4,435      39,915     1,626.8      97.2      00:01:15
 55394       7   4,435      31,045     1,632.1      97.5      00:01:07
 55662       7   4,435      31,045     1,639.8      98.0      00:00:54
 55963       5   4,435      22,175     1,648.8      98.5      00:00:40
 56263       8   4,435      35,480     1,657.9      99.1      00:00:25
 56605       7   4,435      31,045     1,668.6      99.7      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,673.4        Number of regions         = 56,767    
Computed distances (M)  = 1,673.42       Total run time (seconds)  = 2677.474
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A400_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
