
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A900_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   303       2   4,935       9,870         8.4       0.5      00:36:46
   635       9   4,935      44,415        18.2       1.0      00:33:49
   973       5   4,935      24,675        28.4       1.5      00:32:22
  1287       5   4,935      24,675        38.5       2.1      00:31:37
  1608       5   4,935      24,675        49.0       2.6      00:30:51
  1950       4   4,935      19,740        59.6       3.2      00:30:17
  2272       9   4,935      44,415        69.9       3.8      00:29:58
  2606       7   4,935      34,545        80.3       4.3      00:29:39
  2921       5   4,935      24,675        90.5       4.9      00:29:25
  3243      10   4,935      49,350       100.9       5.4      00:29:08
  3562      10   4,935      49,350       111.6       6.0      00:28:50
  3881       7   4,935      34,545       121.7       6.5      00:28:40
  4134       7   4,935      34,545       129.4       6.9      00:29:04
  4398       7   4,935      34,545       137.4       7.4      00:29:22
  4657       9   4,935      44,415       145.9       7.8      00:29:29
  4894       8   4,935      39,480       153.6       8.2      00:29:45
  5139      10   4,935      49,350       161.3       8.7      00:29:58
  5377      10   4,935      49,350       169.1       9.1      00:30:07
  5634       6   4,935      29,610       176.5       9.5      00:30:20
  5881       5   4,935      24,675       184.2       9.9      00:30:28
  6109       4   4,935      19,740       191.7      10.3      00:30:36
  6359       5   4,935      24,675       199.3      10.7      00:30:41
  6609       3   4,935      14,805       207.1      11.1      00:30:43
  6855      10   4,935      49,350       214.9      11.5      00:30:45
  7108       8   4,935      39,480       222.8      12.0      00:30:44
  7397       9   4,935      44,415       232.0      12.5      00:30:32
  7682       4   4,935      19,740       241.2      12.9      00:30:20
  7951      10   4,935      49,350       250.2      13.4      00:30:09
  8213       5   4,935      24,675       259.2      13.9      00:29:59
  8480      10   4,935      49,350       268.2      14.4      00:29:48
  8747       5   4,935      24,675       277.1      14.9      00:29:38
  9034       9   4,935      44,415       286.7      15.4      00:29:23
  9284      10   4,935      49,350       295.2      15.8      00:29:16
  9512      10   4,935      49,350       303.0      16.3      00:29:15
  9735       7   4,935      34,545       310.7      16.7      00:29:13
  9965       8   4,935      39,480       318.1      17.1      00:29:13
 10196       6   4,935      29,610       325.0      17.4      00:29:15
 10423       6   4,935      29,610       332.1      17.8      00:29:16
 10673       9   4,935      44,415       340.0      18.2      00:29:11
 10937       8   4,935      39,480       348.5      18.7      00:29:02
 11182       6   4,935      29,610       356.3      19.1      00:28:58
 11375       9   4,935      44,415       362.5      19.5      00:29:03
 11576       8   4,935      39,480       368.9      19.8      00:29:06
 11804      10   4,935      49,350       376.3      20.2      00:29:03
 12014       7   4,935      34,545       383.1      20.6      00:29:03
 12219       9   4,935      44,415       389.9      20.9      00:29:02
 12478       6   4,935      29,610       398.0      21.4      00:28:54
 12765       9   4,935      44,415       407.2      21.8      00:28:41
 13059      10   4,935      49,350       416.5      22.4      00:28:26
 13353       6   4,935      29,610       425.9      22.9      00:28:11
 13607      10   4,935      49,350       434.9      23.3      00:27:59
 13824      10   4,935      49,350       441.8      23.7      00:27:57
 14038       4   4,935      19,740       448.5      24.1      00:27:56
 14293       7   4,935      34,545       457.1      24.5      00:27:45
 14541      10   4,935      49,350       465.4      25.0      00:27:36
 14803       7   4,935      34,545       474.0      25.4      00:27:25
 15089       6   4,935      29,610       483.5      25.9      00:27:11
 15395       8   4,935      39,480       493.8      26.5      00:26:52
 15710       8   4,935      39,480       503.9      27.0      00:26:36
 15999       4   4,935      19,740       513.9      27.6      00:26:20
 16288       6   4,935      29,610       523.7      28.1      00:26:04
 16561       1   4,935       4,935       533.0      28.6      00:25:51
 16814       9   4,935      44,415       541.3      29.0      00:25:42
 17036       9   4,935      44,415       548.6      29.4      00:25:37
 17248       6   4,935      29,610       555.4      29.8      00:25:34
 17450       8   4,935      39,480       562.3      30.2      00:25:31
 17656       9   4,935      44,415       569.6      30.6      00:25:26
 17927       8   4,935      39,480       578.2      31.0      00:25:15
 18217       5   4,935      24,675       588.1      31.6      00:24:60
 18519       7   4,935      34,545       597.5      32.1      00:24:47
 18724       6   4,935      29,610       604.6      32.4      00:24:42
 18947       6   4,935      29,610       612.1      32.8      00:24:35
 19169       9   4,935      44,415       619.8      33.3      00:24:28
 19439       9   4,935      44,415       628.9      33.7      00:24:16
 19727       7   4,935      34,545       638.9      34.3      00:24:01
 20013      10   4,935      49,350       648.8      34.8      00:23:46
 20318       7   4,935      34,545       659.0      35.4      00:23:31
 20568       9   4,935      44,415       667.5      35.8      00:23:21
 20775       9   4,935      44,415       674.4      36.2      00:23:16
 20973       3   4,935      14,805       681.2      36.6      00:23:12
 21222       7   4,935      34,545       688.8      37.0      00:23:05
 21465       7   4,935      34,545       696.1      37.4      00:22:58
 21714       7   4,935      34,545       703.9      37.8      00:22:51
 21956       7   4,935      34,545       711.4      38.2      00:22:43
 22201      10   4,935      49,350       718.8      38.6      00:22:37
 22447      10   4,935      49,350       726.4      39.0      00:22:29
 22674      10   4,935      49,350       733.7      39.4      00:22:23
 22972      10   4,935      49,350       742.7      39.9      00:22:11
 23262       8   4,935      39,480       752.4      40.4      00:21:58
 23578       7   4,935      34,545       762.1      40.9      00:21:44
 23876       8   4,935      39,480       771.9      41.4      00:21:30
 24188       8   4,935      39,480       781.6      41.9      00:21:17
 24502       9   4,935      44,415       791.5      42.5      00:21:03
 24795       6   4,935      29,610       801.1      43.0      00:20:49
 25089      10   4,935      49,350       810.7      43.5      00:20:37
 25394       8   4,935      39,480       820.7      44.0      00:20:23
 25665       8   4,935      39,480       829.2      44.5      00:20:13
 25873       7   4,935      34,545       836.4      44.9      00:20:06
 26099       7   4,935      34,545       843.8      45.3      00:19:59
 26362       6   4,935      29,610       852.4      45.7      00:19:49
 26649       7   4,935      34,545       861.3      46.2      00:19:38
 26908       7   4,935      34,545       869.7      46.7      00:19:28
 27149      10   4,935      49,350       877.5      47.1      00:19:20
 27358       7   4,935      34,545       884.3      47.5      00:19:14
 27549       6   4,935      29,610       890.6      47.8      00:19:10
 27779       6   4,935      29,610       898.2      48.2      00:19:02
 28052       9   4,935      44,415       907.3      48.7      00:18:50
 28343       6   4,935      29,610       917.1      49.2      00:18:37
 28637       9   4,935      44,415       927.3      49.8      00:18:23
 28843       8   4,935      39,480       934.2      50.1      00:18:17
 29043       8   4,935      39,480       941.0      50.5      00:18:11
 29284       8   4,935      39,480       948.7      50.9      00:18:02
 29548       6   4,935      29,610       957.6      51.4      00:17:51
 29799       8   4,935      39,480       965.9      51.8      00:17:42
 30005       4   4,935      19,740       972.7      52.2      00:17:36
 30209       5   4,935      24,675       979.7      52.6      00:17:29
 30430      10   4,935      49,350       986.9      53.0      00:17:22
 30676       8   4,935      39,480       995.4      53.4      00:17:12
 30979       9   4,935      44,415     1,005.5      54.0      00:16:58
 31286       6   4,935      29,610     1,015.8      54.5      00:16:44
 31583       6   4,935      29,610     1,026.0      55.1      00:16:30
 31866       5   4,935      24,675     1,035.8      55.6      00:16:17
 32154       8   4,935      39,480     1,045.7      56.1      00:16:04
 32435      10   4,935      49,350     1,055.7      56.7      00:15:51
 32652      10   4,935      49,350     1,063.0      57.0      00:15:44
 32856       6   4,935      29,610     1,069.9      57.4      00:15:37
 33057       8   4,935      39,480     1,076.9      57.8      00:15:30
 33281       7   4,935      34,545     1,084.5      58.2      00:15:22
 33533      10   4,935      49,350     1,093.1      58.7      00:15:11
 33774      10   4,935      49,350     1,101.4      59.1      00:15:02
 34012       4   4,935      19,740     1,109.6      59.5      00:14:52
 34241       7   4,935      34,545     1,117.7      60.0      00:14:43
 34529       9   4,935      44,415     1,127.6      60.5      00:14:30
 34822       6   4,935      29,610     1,137.7      61.1      00:14:17
 35117       1   4,935       4,935     1,147.7      61.6      00:14:04
 35405       7   4,935      34,545     1,157.6      62.1      00:13:51
 35693       8   4,935      39,480     1,167.5      62.7      00:13:39
 35978       6   4,935      29,610     1,177.0      63.2      00:13:27
 36262      10   4,935      49,350     1,186.8      63.7      00:13:14
 36569       5   4,935      24,675     1,197.1      64.2      00:13:01
 36783       6   4,935      29,610     1,204.1      64.6      00:12:54
 36996       5   4,935      24,675     1,211.2      65.0      00:12:46
 37213       3   4,935      14,805     1,217.9      65.4      00:12:40
 37421       7   4,935      34,545     1,224.5      65.7      00:12:33
 37620       5   4,935      24,675     1,230.9      66.1      00:12:27
 37823       7   4,935      34,545     1,237.3      66.4      00:12:21
 38027       8   4,935      39,480     1,244.0      66.8      00:12:14
 38235       8   4,935      39,480     1,251.2      67.1      00:12:06
 38450       6   4,935      29,610     1,258.6      67.5      00:11:58
 38730      10   4,935      49,350     1,267.9      68.0      00:11:46
 39007       9   4,935      44,415     1,277.1      68.5      00:11:35
 39212       1   4,935       4,935     1,283.7      68.9      00:11:28
 39439       9   4,935      44,415     1,291.0      69.3      00:11:20
 39693       4   4,935      19,740     1,299.3      69.7      00:11:10
 39973       2   4,935       9,870     1,308.5      70.2      00:10:59
 40304       4   4,935      19,740     1,319.2      70.8      00:10:45
 40613       4   4,935      19,740     1,329.7      71.4      00:10:32
 40906       7   4,935      34,545     1,339.5      71.9      00:10:19
 41124      10   4,935      49,350     1,346.9      72.3      00:10:11
 41348       7   4,935      34,545     1,354.4      72.7      00:10:03
 41574       7   4,935      34,545     1,361.9      73.1      00:09:54
 41807       7   4,935      34,545     1,369.7      73.5      00:09:45
 42015       5   4,935      24,675     1,376.7      73.9      00:09:38
 42233       6   4,935      29,610     1,383.3      74.2      00:09:31
 42454       6   4,935      29,610     1,390.7      74.6      00:09:22
 42683       7   4,935      34,545     1,398.0      75.0      00:09:14
 42899       3   4,935      14,805     1,405.2      75.4      00:09:06
 43112      10   4,935      49,350     1,412.5      75.8      00:08:58
 43332       7   4,935      34,545     1,420.0      76.2      00:08:49
 43556       6   4,935      29,610     1,427.4      76.6      00:08:41
 43863       5   4,935      24,675     1,437.3      77.1      00:08:28
 44140       4   4,935      19,740     1,446.3      77.6      00:08:17
 44341       5   4,935      24,675     1,452.9      78.0      00:08:10
 44581       8   4,935      39,480     1,460.6      78.4      00:08:01
 44843       6   4,935      29,610     1,469.3      78.8      00:07:51
 45106       9   4,935      44,415     1,477.9      79.3      00:07:40
 45380       5   4,935      24,675     1,486.2      79.8      00:07:30
 45612       7   4,935      34,545     1,493.6      80.2      00:07:22
 45878       5   4,935      24,675     1,501.9      80.6      00:07:12
 46125       9   4,935      44,415     1,510.1      81.0      00:07:02
 46370       7   4,935      34,545     1,518.5      81.5      00:06:52
 46595       9   4,935      44,415     1,526.0      81.9      00:06:43
 46893       7   4,935      34,545     1,535.9      82.4      00:06:31
 47127       3   4,935      14,805     1,543.0      82.8      00:06:23
 47325       6   4,935      29,610     1,549.0      83.1      00:06:16
 47494      10   4,935      49,350     1,554.4      83.4      00:06:11
 47679       7   4,935      34,545     1,560.4      83.7      00:06:04
 47872       8   4,935      39,480     1,566.6      84.1      00:05:57
 48067      10   4,935      49,350     1,573.0      84.4      00:05:50
 48279       8   4,935      39,480     1,579.9      84.8      00:05:42
 48520       7   4,935      34,545     1,588.1      85.2      00:05:32
 48778       7   4,935      34,545     1,596.5      85.7      00:05:22
 49003       5   4,935      24,675     1,603.8      86.1      00:05:13
 49249       7   4,935      34,545     1,612.2      86.5      00:05:03
 49497       4   4,935      19,740     1,619.7      86.9      00:04:54
 49757       9   4,935      44,415     1,627.6      87.3      00:04:45
 50007       5   4,935      24,675     1,635.7      87.8      00:04:35
 50316       4   4,935      19,740     1,645.4      88.3      00:04:23
 50562       5   4,935      24,675     1,653.3      88.7      00:04:14
 50830       7   4,935      34,545     1,662.2      89.2      00:04:03
 51102       9   4,935      44,415     1,671.6      89.7      00:03:51
 51405       6   4,935      29,610     1,681.4      90.2      00:03:39
 51690       9   4,935      44,415     1,691.2      90.8      00:03:27
 51976       5   4,935      24,675     1,700.9      91.3      00:03:15
 52235      10   4,935      49,350     1,710.2      91.8      00:03:04
 52601       8   4,935      39,480     1,723.1      92.5      00:02:48
 52998      10   4,935      49,350     1,737.2      93.2      00:02:31
 53386       9   4,935      44,415     1,750.6      93.9      00:02:14
 53736       6   4,935      29,610     1,762.5      94.6      00:01:60
 54012      10   4,935      49,350     1,771.6      95.1      00:01:49
 54282       5   4,935      24,675     1,780.5      95.5      00:01:39
 54572       6   4,935      29,610     1,789.3      96.0      00:01:28
 54854       7   4,935      34,545     1,798.5      96.5      00:01:17
 55130      10   4,935      49,350     1,807.5      97.0      00:01:06
 55395       9   4,935      44,415     1,815.7      97.4      00:00:57
 55600       6   4,935      29,610     1,822.0      97.8      00:00:49
 55797       8   4,935      39,480     1,828.7      98.1      00:00:41
 56052       9   4,935      44,415     1,837.3      98.6      00:00:31
 56331       8   4,935      39,480     1,846.7      99.1      00:00:20
 56600       9   4,935      44,415     1,856.0      99.6      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,863.4        Number of regions         = 56,821    
Computed distances (M)  = 1,863.41       Total run time (seconds)  = 2220.567
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
