
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_Dollar_locatio
> ns_total_10000_5_4q_mnl_logdistabove1.0.dta /export/storage_covidvaccine/Resu
> lt/MNL_partial/M5_K10000_4q/Dollar/vaccinated/ca_blk_Dollar_dist_total_10000_
> 5_4q_mnl_logdistabove1.0.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. log using "geonear.log", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  23 Jan 2024, 14:52:25

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove1.0.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.0.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   532       8   4,035      32,280        12.4       0.8      00:20:24
  1069       9   4,035      36,315        25.8       1.7      00:19:24
  1600       6   4,035      24,210        39.9       2.6      00:18:37
  2133       9   4,035      36,315        53.5       3.5      00:18:20
  2652       6   4,035      24,210        66.8       4.4      00:18:11
  3191       9   4,035      36,315        81.1       5.3      00:17:48
  3736       6   4,035      24,210        95.8       6.3      00:17:25
  4175       8   4,035      32,280       106.9       7.0      00:17:41
  4571       6   4,035      24,210       116.9       7.7      00:18:04
  4945       6   4,035      24,210       126.9       8.3      00:18:22
  5306      10   4,035      40,350       136.2       8.9      00:18:42
  5616       6   4,035      24,210       143.9       9.4      00:19:12
  5933       9   4,035      36,315       152.0      10.0      00:19:35
  6288       9   4,035      36,315       161.3      10.6      00:19:44
  6662      10   4,035      40,350       170.7      11.2      00:19:51
  7044       8   4,035      32,280       180.5      11.8      00:19:53
  7507       5   4,035      20,175       192.6      12.6      00:19:37
  7994       6   4,035      24,210       205.8      13.5      00:19:14
  8469       8   4,035      32,280       219.0      14.4      00:18:54
  8942       9   4,035      36,315       232.0      15.2      00:18:36
  9329       8   4,035      32,280       242.6      15.9      00:18:31
  9682      10   4,035      40,350       252.6      16.6      00:18:29
 10073      10   4,035      40,350       262.9      17.3      00:18:25
 10499       3   4,035      12,105       273.6      18.0      00:18:18
 10978      10   4,035      40,350       286.1      18.8      00:18:03
 11375       9   4,035      36,315       296.4      19.5      00:17:58
 11782       9   4,035      36,315       307.0      20.2      00:17:52
 12159       8   4,035      32,280       317.2      20.8      00:17:47
 12599       8   4,035      32,280       328.7      21.6      00:17:36
 13127       7   4,035      28,245       342.3      22.5      00:17:17
 13654       7   4,035      28,245       356.8      23.4      00:16:55
 14241       4   4,035      16,140       372.3      24.4      00:16:31
 14850       6   4,035      24,210       388.8      25.5      00:16:05
 15434       5   4,035      20,175       404.7      26.6      00:15:41
 16016       6   4,035      24,210       420.6      27.6      00:15:19
 16568       7   4,035      28,245       436.0      28.6      00:14:60
 17009       6   4,035      24,210       447.8      29.4      00:14:50
 17403       6   4,035      24,210       458.5      30.1      00:14:44
 17813       3   4,035      12,105       469.7      30.8      00:14:37
 18247       3   4,035      12,105       481.6      31.6      00:14:27
 18679       6   4,035      24,210       493.0      32.4      00:14:18
 19188       7   4,035      28,245       507.3      33.3      00:14:03
 19711       9   4,035      36,315       521.9      34.3      00:13:47
 20236       4   4,035      16,140       536.7      35.2      00:13:30
 20639       5   4,035      20,175       547.7      36.0      00:13:23
 20940       5   4,035      20,175       556.1      36.5      00:13:22
 21311       5   4,035      20,175       565.2      37.1      00:13:18
 21675       8   4,035      32,280       574.6      37.7      00:13:14
 22033       4   4,035      16,140       583.7      38.3      00:13:10
 22409       7   4,035      28,245       593.0      38.9      00:13:06
 22770       3   4,035      12,105       602.1      39.5      00:13:02
 23146       9   4,035      36,315       611.9      40.2      00:12:56
 23518       9   4,035      36,315       621.6      40.8      00:12:50
 23924       6   4,035      24,210       632.4      41.5      00:12:42
 24382       5   4,035      20,175       643.8      42.3      00:12:33
 24840       2   4,035       8,070       656.1      43.1      00:12:21
 25310       9   4,035      36,315       668.8      43.9      00:12:10
 25743      10   4,035      40,350       680.2      44.6      00:12:00
 26087       4   4,035      16,140       689.6      45.3      00:11:55
 26544       8   4,035      32,280       701.5      46.0      00:11:44
 27016       8   4,035      32,280       714.1      46.9      00:11:32
 27428       6   4,035      24,210       724.9      47.6      00:11:24
 27873       7   4,035      28,245       737.0      48.4      00:11:13
 28350       5   4,035      20,175       750.0      49.2      00:11:01
 28762       5   4,035      20,175       761.6      50.0      00:10:51
 29091       8   4,035      32,280       770.7      50.6      00:10:46
 29530       8   4,035      32,280       782.5      51.4      00:10:35
 29900       5   4,035      20,175       792.5      52.0      00:10:28
 30216       8   4,035      32,280       801.2      52.6      00:10:23
 30574       6   4,035      24,210       811.1      53.2      00:10:16
 31040       6   4,035      24,210       823.7      54.1      00:10:04
 31504       6   4,035      24,210       836.7      54.9      00:09:52
 31993       8   4,035      32,280       850.5      55.8      00:09:38
 32475       9   4,035      36,315       864.3      56.7      00:09:25
 32761       7   4,035      28,245       872.2      57.2      00:09:21
 33050       7   4,035      28,245       880.3      57.8      00:09:16
 33386       7   4,035      28,245       889.6      58.4      00:09:10
 33772      10   4,035      40,350       900.5      59.1      00:09:01
 34167      10   4,035      40,350       911.7      59.8      00:08:51
 34637       9   4,035      36,315       924.9      60.7      00:08:39
 35145       7   4,035      28,245       939.1      61.6      00:08:25
 35640       6   4,035      24,210       953.1      62.6      00:08:12
 36123       8   4,035      32,280       966.5      63.4      00:07:59
 36591      10   4,035      40,350       979.5      64.3      00:07:47
 36925       7   4,035      28,245       988.5      64.9      00:07:41
 37268      10   4,035      40,350       997.2      65.5      00:07:35
 37609       7   4,035      28,245     1,006.1      66.0      00:07:28
 37946       9   4,035      36,315     1,015.0      66.6      00:07:22
 38276       7   4,035      28,245     1,024.0      67.2      00:07:15
 38562       3   4,035      12,105     1,032.1      67.7      00:07:09
 38857       4   4,035      16,140     1,040.1      68.3      00:07:04
 39130       5   4,035      20,175     1,047.5      68.8      00:06:59
 39519       7   4,035      28,245     1,057.7      69.4      00:06:50
 40011       7   4,035      28,245     1,070.9      70.3      00:06:38
 40530       7   4,035      28,245     1,084.9      71.2      00:06:25
 41011      10   4,035      40,350     1,098.3      72.1      00:06:12
 41355       4   4,035      16,140     1,107.6      72.7      00:06:05
 41756      10   4,035      40,350     1,118.5      73.4      00:05:55
 42144       8   4,035      32,280     1,128.9      74.1      00:05:47
 42548       9   4,035      36,315     1,139.6      74.8      00:05:37
 42939       9   4,035      36,315     1,150.0      75.5      00:05:29
 43330       5   4,035      20,175     1,161.0      76.2      00:05:19
 43726       9   4,035      36,315     1,171.4      76.9      00:05:10
 44084       5   4,035      20,175     1,181.1      77.5      00:05:02
 44470       4   4,035      16,140     1,191.2      78.2      00:04:53
 44862       6   4,035      24,210     1,201.8      78.9      00:04:44
 45318       9   4,035      36,315     1,213.7      79.7      00:04:34
 45748       9   4,035      36,315     1,224.6      80.4      00:04:24
 46084       8   4,035      32,280     1,233.7      81.0      00:04:17
 46416       6   4,035      24,210     1,242.8      81.6      00:04:09
 46805      10   4,035      40,350     1,253.3      82.3      00:03:60
 47127       3   4,035      12,105     1,261.6      82.8      00:03:53
 47482       6   4,035      24,210     1,270.6      83.4      00:03:45
 47864       6   4,035      24,210     1,280.7      84.1      00:03:37
 48269       8   4,035      32,280     1,291.5      84.8      00:03:27
 48701       5   4,035      20,175     1,303.3      85.5      00:03:16
 49078       7   4,035      28,245     1,313.3      86.2      00:03:08
 49467       6   4,035      24,210     1,323.6      86.9      00:02:58
 50020       7   4,035      28,245     1,337.7      87.8      00:02:46
 50532       7   4,035      28,245     1,350.9      88.7      00:02:34
 50947       8   4,035      32,280     1,362.3      89.4      00:02:23
 51351       8   4,035      32,280     1,373.3      90.1      00:02:14
 51754       4   4,035      16,140     1,384.6      90.9      00:02:04
 52154       9   4,035      36,315     1,395.9      91.6      00:01:54
 52520       8   4,035      32,280     1,406.5      92.3      00:01:44
 52852       9   4,035      36,315     1,416.3      93.0      00:01:36
 53226      10   4,035      40,350     1,426.9      93.7      00:01:26
 53724       6   4,035      24,210     1,440.7      94.6      00:01:14
 54071       9   4,035      36,315     1,450.1      95.2      00:01:05
 54444       8   4,035      32,280     1,460.0      95.8      00:00:57
 54876       8   4,035      32,280     1,471.1      96.6      00:00:47
 55248       6   4,035      24,210     1,481.0      97.2      00:00:38
 55562       4   4,035      16,140     1,488.8      97.7      00:00:31
 55853       9   4,035      36,315     1,496.6      98.2      00:00:24
 56186      10   4,035      40,350     1,505.8      98.8      00:00:16
 56534       7   4,035      28,245     1,515.7      99.5      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1376.447
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.0.csv saved

. 
. cap log close

. 
end of do-file
