
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A1000.dta /export/storage_covidvaccine
> /Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchoo
> ls_dist_total_10000_5_4q_mnl_A1000.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A1000.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A1000.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   359       9   5,035      45,315        10.3       0.5      00:30:41
   679       7   5,035      35,245        19.9       1.0      00:31:32
  1079       7   5,035      35,245        32.5       1.7      00:28:48
  1417       9   5,035      45,315        43.7       2.3      00:28:24
  1781       4   5,035      20,140        55.6       2.9      00:27:43
  2137       7   5,035      35,245        66.9       3.5      00:27:28
  2465      10   5,035      50,350        77.4       4.1      00:27:32
  2820       7   5,035      35,245        89.1       4.7      00:27:10
  3176       6   5,035      30,210       100.7       5.3      00:26:52
  3510       8   5,035      40,280       112.0       5.9      00:26:40
  3840       6   5,035      30,210       122.9       6.5      00:26:34
  4134       7   5,035      35,245       132.1       6.9      00:26:50
  4374      10   5,035      50,350       139.4       7.3      00:27:26
  4602       7   5,035      35,245       146.9       7.7      00:27:54
  4786       9   5,035      45,315       153.2       8.1      00:28:34
  5025       5   5,035      25,175       161.0       8.5      00:28:53
  5224       7   5,035      35,245       167.4       8.8      00:29:24
  5498      10   5,035      50,350       176.1       9.3      00:29:26
  5765       7   5,035      35,245       184.3       9.7      00:29:33
  5996       4   5,035      20,140       191.7      10.1      00:29:46
  6265       7   5,035      35,245       200.6      10.5      00:29:44
  6517       8   5,035      40,280       208.4      11.0      00:29:50
  6783       9   5,035      45,315       216.9      11.4      00:29:49
  6972       9   5,035      45,315       223.0      11.7      00:30:10
  7302       6   5,035      30,210       233.4      12.3      00:29:50
  7567       8   5,035      40,280       242.3      12.7      00:29:43
  7855       6   5,035      30,210       251.9      13.2      00:29:31
  8109       9   5,035      45,315       260.8      13.7      00:29:25
  8401       7   5,035      35,245       270.8      14.2      00:29:09
  8666       5   5,035      25,175       279.9      14.7      00:29:01
  8958       9   5,035      45,315       290.0      15.3      00:28:46
  9190       6   5,035      30,210       298.0      15.7      00:28:45
  9412      10   5,035      50,350       305.6      16.1      00:28:46
  9618      10   5,035      50,350       312.9      16.5      00:28:49
  9819       3   5,035      15,105       319.8      16.8      00:28:54
 10047       4   5,035      20,140       327.1      17.2      00:28:55
 10253       8   5,035      40,280       333.4      17.5      00:29:03
 10438       9   5,035      45,315       339.4      17.9      00:29:12
 10691       3   5,035      15,105       347.5      18.3      00:29:07
 10969       8   5,035      40,280       356.6      18.8      00:28:56
 11197       8   5,035      40,280       364.0      19.1      00:28:55
 11375       9   5,035      45,315       369.9      19.5      00:29:02
 11579       9   5,035      45,315       376.5      19.8      00:29:05
 11768       7   5,035      35,245       382.6      20.1      00:29:10
 11960       6   5,035      30,210       389.0      20.5      00:29:13
 12123       9   5,035      45,315       394.6      20.8      00:29:20
 12351       7   5,035      35,245       402.0      21.1      00:29:16
 12640       8   5,035      40,280       411.5      21.6      00:29:01
 13011       9   5,035      45,315       423.3      22.3      00:28:34
 13349       7   5,035      35,245       434.5      22.9      00:28:11
 13603      10   5,035      50,350       443.5      23.3      00:27:60
 13764       3   5,035      15,105       448.8      23.6      00:28:06
 13970       6   5,035      30,210       455.5      24.0      00:28:05
 14246       6   5,035      30,210       464.8      24.4      00:27:52
 14457      10   5,035      50,350       472.0      24.8      00:27:49
 14721       9   5,035      45,315       480.8      25.3      00:27:38
 14946       8   5,035      40,280       488.3      25.7      00:27:32
 15281       4   5,035      20,140       499.9      26.3      00:27:09
 15551       8   5,035      40,280       508.9      26.8      00:26:57
 15887       9   5,035      45,315       520.3      27.4      00:26:35
 16173       7   5,035      35,245       530.4      27.9      00:26:19
 16482       6   5,035      30,210       541.2      28.5      00:26:01
 16673      10   5,035      50,350       547.4      28.8      00:26:01
 16884       8   5,035      40,280       554.4      29.2      00:25:58
 17113       8   5,035      40,280       562.2      29.6      00:25:51
 17263       5   5,035      25,175       567.2      29.8      00:25:55
 17459       6   5,035      30,210       574.1      30.2      00:25:52
 17640       9   5,035      45,315       580.5      30.5      00:25:50
 17842      10   5,035      50,350       587.1      30.9      00:25:48
 18120       4   5,035      20,140       596.5      31.4      00:25:34
 18442       8   5,035      40,280       607.2      31.9      00:25:16
 18650       4   5,035      20,140       614.2      32.3      00:25:12
 18790       3   5,035      15,105       619.1      32.6      00:25:15
 18982       9   5,035      45,315       625.8      32.9      00:25:11
 19150       9   5,035      45,315       631.7      33.2      00:25:11
 19392      10   5,035      50,350       639.9      33.7      00:25:01
 19648       8   5,035      40,280       648.9      34.1      00:24:49
 19939      10   5,035      50,350       659.3      34.7      00:24:32
 20286      10   5,035      50,350       671.3      35.3      00:24:11
 20544       8   5,035      40,280       680.1      35.8      00:23:59
 20747       6   5,035      30,210       687.1      36.1      00:23:54
 20901       5   5,035      25,175       692.5      36.4      00:23:54
 21162       3   5,035      15,105       700.9      36.9      00:23:44
 21376       7   5,035      35,245       707.3      37.2      00:23:41
 21612       6   5,035      30,210       715.1      37.6      00:23:33
 21798       8   5,035      40,280       720.6      37.9      00:23:32
 22008       9   5,035      45,315       727.5      38.3      00:23:27
 22248       7   5,035      35,245       735.0      38.7      00:23:19
 22494       7   5,035      35,245       742.7      39.1      00:23:11
 22722       9   5,035      45,315       750.1      39.5      00:23:04
 23039       9   5,035      45,315       760.0      40.0      00:22:50
 23339       6   5,035      30,210       770.1      40.5      00:22:34
 23635       6   5,035      30,210       779.3      41.0      00:22:22
 23938       6   5,035      30,210       789.6      41.5      00:22:06
 24210       6   5,035      30,210       798.1      42.0      00:21:56
 24517       9   5,035      45,315       808.0      42.5      00:21:42
 24764       7   5,035      35,245       816.4      42.9      00:21:32
 25071      10   5,035      50,350       826.4      43.5      00:21:17
 25329      10   5,035      50,350       835.1      43.9      00:21:07
 25621       6   5,035      30,210       844.7      44.4      00:20:53
 25793       5   5,035      25,175       850.6      44.7      00:20:50
 25987      10   5,035      50,350       857.0      45.1      00:20:45
 26167       2   5,035      10,070       863.1      45.4      00:20:42
 26399       7   5,035      35,245       870.8      45.8      00:20:33
 26652       8   5,035      40,280       878.8      46.2      00:20:24
 26903       7   5,035      35,245       887.1      46.7      00:20:14
 27153       8   5,035      40,280       895.5      47.1      00:20:04
 27329       5   5,035      25,175       901.3      47.4      00:20:01
 27578      10   5,035      50,350       909.6      47.8      00:19:51
 27757       6   5,035      30,210       915.7      48.2      00:19:47
 27982       7   5,035      35,245       923.3      48.6      00:19:38
 28234       7   5,035      35,245       931.8      49.0      00:19:28
 28487       9   5,035      45,315       940.7      49.5      00:19:16
 28703       8   5,035      40,280       948.2      49.9      00:19:08
 28873      10   5,035      50,350       954.2      50.2      00:19:04
 29044       3   5,035      15,105       960.1      50.5      00:18:60
 29258       6   5,035      30,210       967.0      50.9      00:18:53
 29465       7   5,035      35,245       974.3      51.2      00:18:45
 29721      10   5,035      50,350       982.7      51.7      00:18:35
 29888      10   5,035      50,350       988.5      52.0      00:18:30
 30067       7   5,035      35,245       994.6      52.3      00:18:25
 30244       5   5,035      25,175     1,000.7      52.6      00:18:20
 30403       6   5,035      30,210     1,006.0      52.9      00:18:17
 30604       9   5,035      45,315     1,013.1      53.3      00:18:09
 30922       9   5,035      45,315     1,024.0      53.9      00:17:53
 31247       6   5,035      30,210     1,035.0      54.4      00:17:37
 31526       9   5,035      45,315     1,044.8      55.0      00:17:23
 31857       6   5,035      30,210     1,056.4      55.6      00:17:06
 32139       4   5,035      20,140     1,066.4      56.1      00:16:52
 32489       9   5,035      45,315     1,079.0      56.8      00:16:33
 32634       8   5,035      40,280     1,083.9      57.0      00:16:30
 32800       5   5,035      25,175     1,089.7      57.3      00:16:25
 32981       7   5,035      35,245     1,096.0      57.6      00:16:19
 33154       4   5,035      20,140     1,102.1      58.0      00:16:14
 33370      10   5,035      50,350     1,109.6      58.4      00:16:05
 33565       8   5,035      40,280     1,116.4      58.7      00:15:58
 33754       4   5,035      20,140     1,123.1      59.1      00:15:51
 33994       5   5,035      25,175     1,131.5      59.5      00:15:41
 34305       9   5,035      45,315     1,142.6      60.1      00:15:25
 34693       7   5,035      35,245     1,156.1      60.8      00:15:04
 35080       9   5,035      45,315     1,169.7      61.5      00:14:44
 35485       9   5,035      45,315     1,184.0      62.3      00:14:22
 35896       5   5,035      25,175     1,198.1      63.0      00:14:01
 36279       7   5,035      35,245     1,211.5      63.7      00:13:42
 36639      10   5,035      50,350     1,223.8      64.4      00:13:24
 36929       4   5,035      20,140     1,233.6      64.9      00:13:12
 37220       6   5,035      30,210     1,242.8      65.4      00:13:00
 37464       6   5,035      30,210     1,250.6      65.8      00:12:52
 37727      10   5,035      50,350     1,259.2      66.2      00:12:41
 37944       9   5,035      45,315     1,266.5      66.6      00:12:33
 38200       9   5,035      45,315     1,275.3      67.1      00:12:23
 38483       6   5,035      30,210     1,285.1      67.6      00:12:10
 38830       8   5,035      40,280     1,296.9      68.2      00:11:54
 39118       6   5,035      30,210     1,306.8      68.7      00:11:42
 39370      10   5,035      50,350     1,315.1      69.2      00:11:32
 39688       5   5,035      25,175     1,325.5      69.7      00:11:19
 40051       8   5,035      40,280     1,337.6      70.4      00:11:03
 40458       5   5,035      25,175     1,351.3      71.1      00:10:44
 40850       6   5,035      30,210     1,364.7      71.8      00:10:26
 41113       6   5,035      30,210     1,373.8      72.3      00:10:16
 41358       6   5,035      30,210     1,382.2      72.7      00:10:06
 41660       5   5,035      25,175     1,392.5      73.2      00:09:53
 41972       8   5,035      40,280     1,403.3      73.8      00:09:40
 42230       8   5,035      40,280     1,411.3      74.2      00:09:31
 42453      10   5,035      50,350     1,418.9      74.6      00:09:22
 42730       2   5,035      10,070     1,427.9      75.1      00:09:11
 42962       6   5,035      30,210     1,435.8      75.5      00:09:03
 43225      10   5,035      50,350     1,445.2      76.0      00:08:51
 43474       6   5,035      30,210     1,453.8      76.5      00:08:41
 43789       4   5,035      20,140     1,463.9      77.0      00:08:29
 44137       5   5,035      25,175     1,475.5      77.6      00:08:14
 44392      10   5,035      50,350     1,483.9      78.1      00:08:05
 44702       6   5,035      30,210     1,494.3      78.6      00:07:52
 45011       5   5,035      25,175     1,504.8      79.1      00:07:39
 45331      10   5,035      50,350     1,514.9      79.7      00:07:27
 45559       8   5,035      40,280     1,522.2      80.1      00:07:19
 45810       6   5,035      30,210     1,530.2      80.5      00:07:10
 46078       6   5,035      30,210     1,539.2      81.0      00:06:59
 46332       9   5,035      45,315     1,548.1      81.4      00:06:49
 46578       8   5,035      40,280     1,556.3      81.9      00:06:40
 46899       4   5,035      20,140     1,567.3      82.4      00:06:26
 47220      10   5,035      50,350     1,577.0      83.0      00:06:15
 47505       5   5,035      25,175     1,586.3      83.4      00:06:04
 47780       5   5,035      25,175     1,595.4      83.9      00:05:53
 47996       6   5,035      30,210     1,602.6      84.3      00:05:45
 48222       8   5,035      40,280     1,610.0      84.7      00:05:37
 48492       7   5,035      35,245     1,619.2      85.2      00:05:26
 48739       7   5,035      35,245     1,627.6      85.6      00:05:17
 48984       6   5,035      30,210     1,635.7      86.0      00:05:07
 49248       3   5,035      15,105     1,644.8      86.5      00:04:57
 49542       5   5,035      25,175     1,654.0      87.0      00:04:46
 49837       4   5,035      20,140     1,663.1      87.5      00:04:35
 50068       1   5,035       5,035     1,670.8      87.9      00:04:27
 50315       8   5,035      40,280     1,678.7      88.3      00:04:18
 50602       7   5,035      35,245     1,688.1      88.8      00:04:07
 50861       7   5,035      35,245     1,696.9      89.3      00:03:56
 51138       8   5,035      40,280     1,706.5      89.8      00:03:45
 51397       5   5,035      25,175     1,715.2      90.2      00:03:35
 51647      10   5,035      50,350     1,723.9      90.7      00:03:25
 51906       8   5,035      40,280     1,733.0      91.2      00:03:15
 52146       9   5,035      45,315     1,741.5      91.6      00:03:05
 52452       4   5,035      20,140     1,752.6      92.2      00:02:52
 52807      10   5,035      50,350     1,765.7      92.9      00:02:36
 53179       9   5,035      45,315     1,778.8      93.6      00:02:21
 53561       9   5,035      45,315     1,792.2      94.3      00:02:05
 53865       6   5,035      30,210     1,802.6      94.8      00:01:53
 54122       8   5,035      40,280     1,811.1      95.3      00:01:43
 54379       3   5,035      15,105     1,819.8      95.7      00:01:33
 54705       5   5,035      25,175     1,830.1      96.3      00:01:21
 55005      10   5,035      50,350     1,840.1      96.8      00:01:10
 55296       5   5,035      25,175     1,849.6      97.3      00:00:59
 55582       7   5,035      35,245     1,858.4      97.8      00:00:49
 55840      10   5,035      50,350     1,867.2      98.2      00:00:39
 56149       4   5,035      20,140     1,877.8      98.8      00:00:27
 56462      10   5,035      50,350     1,888.8      99.4      00:00:14
 56787       5   5,035      25,175     1,900.1      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,901.2        Number of regions         = 56,821    
Computed distances (M)  = 1,901.17       Total run time (seconds)  = 2170.95
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A1000.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A1000.csv saved

. 
. cap log close

. 
end of do-file
