
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A500.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A500.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A500.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A500.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   340       8   4,535      36,280         8.8       0.5      00:32:14
   711       6   4,535      27,210        18.8       1.1      00:30:06
  1046       5   4,535      22,675        28.3       1.7      00:29:52
  1406       7   4,535      31,745        39.0       2.3      00:28:39
  1753      10   4,535      45,350        49.3       2.9      00:28:09
  2133       9   4,535      40,815        60.2       3.5      00:27:31
  2497       2   4,535       9,070        70.5       4.1      00:27:13
  2872       9   4,535      40,815        81.8       4.8      00:26:38
  3246       8   4,535      36,280        92.9       5.4      00:26:13
  3597       5   4,535      22,675       103.4       6.0      00:25:59
  3907       6   4,535      27,210       112.6       6.6      00:26:06
  4187       9   4,535      40,815       120.5       7.0      00:26:29
  4414       6   4,535      27,210       126.7       7.4      00:27:11
  4658       3   4,535      13,605       134.1       7.8      00:27:31
  4919      10   4,535      45,350       141.8       8.3      00:27:44
  5195       8   4,535      36,280       149.9       8.8      00:27:51
  5463       7   4,535      31,745       157.8       9.2      00:27:58
  5677       3   4,535      13,605       163.4       9.5      00:28:30
  5917       3   4,535      13,605       170.3       9.9      00:28:44
  6138       8   4,535      36,280       177.0      10.3      00:28:59
  6409       9   4,535      40,815       184.6      10.8      00:29:01
  6687       8   4,535      36,280       192.6      11.2      00:29:00
  6930       9   4,535      40,815       199.7      11.7      00:29:06
  7303       8   4,535      36,280       210.2      12.3      00:28:38
  7662      10   4,535      45,350       221.1      12.9      00:28:10
  8007       7   4,535      31,745       231.7      13.5      00:27:45
  8258       8   4,535      36,280       239.4      14.0      00:27:44
  8522       8   4,535      36,280       247.8      14.5      00:27:38
  8831       4   4,535      18,140       257.1      15.0      00:27:25
  9148       4   4,535      18,140       267.1      15.6      00:27:07
  9337       6   4,535      27,210       272.9      15.9      00:27:18
  9545       8   4,535      36,280       279.4      16.3      00:27:25
  9744       7   4,535      31,745       285.8      16.7      00:27:31
  9996      10   4,535      45,350       293.2      17.1      00:27:29
 10238       8   4,535      36,280       299.9      17.5      00:27:32
 10472       5   4,535      22,675       306.7      17.9      00:27:34
 10802       8   4,535      36,280       316.2      18.5      00:27:17
 11045       5   4,535      22,675       323.4      18.9      00:27:16
 11301       9   4,535      40,815       330.8      19.3      00:27:12
 11439       6   4,535      27,210       335.1      19.6      00:27:28
 11615       8   4,535      36,280       340.1      19.9      00:27:38
 11847       8   4,535      36,280       347.1      20.3      00:27:35
 12120       6   4,535      27,210       355.3      20.7      00:27:26
 12325       6   4,535      27,210       361.3      21.1      00:27:29
 12665       5   4,535      22,675       371.4      21.7      00:27:09
 13001       8   4,535      36,280       380.9      22.2      00:26:52
 13317       8   4,535      36,280       390.4      22.8      00:26:35
 13598       9   4,535      40,815       399.3      23.3      00:26:22
 13792       9   4,535      40,815       405.0      23.7      00:26:25
 14074       6   4,535      27,210       413.3      24.1      00:26:15
 14312       7   4,535      31,745       420.7      24.6      00:26:10
 14597       9   4,535      40,815       429.4      25.1      00:25:58
 14889       6   4,535      27,210       438.1      25.6      00:25:45
 15272       9   4,535      40,815       450.0      26.3      00:25:18
 15614       6   4,535      27,210       460.2      26.9      00:24:60
 15940       8   4,535      36,280       470.3      27.5      00:24:42
 16270       8   4,535      36,280       480.7      28.1      00:24:24
 16556       4   4,535      18,140       489.6      28.6      00:24:12
 16762      10   4,535      45,350       495.8      29.0      00:24:11
 17007       6   4,535      27,210       503.2      29.4      00:24:05
 17223      10   4,535      45,350       509.7      29.8      00:24:03
 17488       6   4,535      27,210       518.1      30.3      00:23:53
 17721      10   4,535      45,350       525.3      30.7      00:23:47
 18007       4   4,535      18,140       533.8      31.2      00:23:37
 18348       5   4,535      22,675       544.3      31.8      00:23:18
 18659       8   4,535      36,280       553.5      32.3      00:23:05
 18935      10   4,535      45,350       562.1      32.8      00:22:54
 19171      10   4,535      45,350       569.7      33.3      00:22:47
 19505       7   4,535      31,745       580.0      33.9      00:22:30
 19819       8   4,535      36,280       590.1      34.5      00:22:15
 20177       5   4,535      22,675       601.4      35.1      00:21:55
 20506       7   4,535      31,745       611.4      35.7      00:21:39
 20711       7   4,535      31,745       617.8      36.1      00:21:36
 20871       6   4,535      27,210       622.8      36.4      00:21:38
 21023       9   4,535      40,815       627.4      36.6      00:21:40
 21228       6   4,535      27,210       633.2      37.0      00:21:38
 21454      10   4,535      45,350       639.3      37.3      00:21:35
 21736       7   4,535      31,745       647.4      37.8      00:21:26
 21961       2   4,535       9,070       653.9      38.2      00:21:22
 22207       4   4,535      18,140       660.7      38.6      00:21:16
 22442       6   4,535      27,210       667.4      39.0      00:21:11
 22712       9   4,535      40,815       675.3      39.4      00:21:02
 23026       8   4,535      36,280       684.1      39.9      00:20:51
 23319       8   4,535      36,280       693.1      40.5      00:20:38
 23660       7   4,535      31,745       702.6      41.0      00:20:24
 23953       5   4,535      22,675       711.5      41.6      00:20:13
 24276       5   4,535      22,675       720.9      42.1      00:19:59
 24579       7   4,535      31,745       729.7      42.6      00:19:48
 24911       7   4,535      31,745       739.6      43.2      00:19:33
 25209       4   4,535      18,140       748.7      43.7      00:19:21
 25562       6   4,535      27,210       759.3      44.3      00:19:05
 25762       6   4,535      27,210       765.1      44.7      00:19:02
 25974       6   4,535      27,210       771.5      45.1      00:18:57
 26131       6   4,535      27,210       776.4      45.3      00:18:56
 26398       7   4,535      31,745       784.3      45.8      00:18:47
 26673       9   4,535      40,815       792.1      46.3      00:18:38
 26945       8   4,535      36,280       800.3      46.7      00:18:28
 27165       7   4,535      31,745       806.9      47.1      00:18:22
 27353       9   4,535      40,815       812.5      47.4      00:18:19
 27602       5   4,535      22,675       820.0      47.9      00:18:11
 27836       8   4,535      36,280       827.2      48.3      00:18:03
 28176       8   4,535      36,280       837.6      48.9      00:17:48
 28514       9   4,535      40,815       848.2      49.5      00:17:32
 28814       7   4,535      31,745       857.6      50.1      00:17:19
 29005       8   4,535      36,280       863.5      50.4      00:17:15
 29285       9   4,535      40,815       871.9      50.9      00:17:04
 29510       7   4,535      31,745       878.9      51.3      00:16:57
 29769       8   4,535      36,280       886.7      51.8      00:16:48
 29959       7   4,535      31,745       892.5      52.1      00:16:44
 30179      10   4,535      45,350       899.2      52.5      00:16:37
 30405       5   4,535      22,675       906.1      52.9      00:16:30
 30656       7   4,535      31,745       914.1      53.4      00:16:21
 30995       9   4,535      40,815       924.5      54.0      00:16:05
 31331       6   4,535      27,210       934.8      54.6      00:15:50
 31632      10   4,535      45,350       944.3      55.1      00:15:38
 31979       7   4,535      31,745       955.4      55.8      00:15:21
 32336       8   4,535      36,280       966.8      56.5      00:15:04
 32616       5   4,535      22,675       975.7      57.0      00:14:53
 32806       6   4,535      27,210       981.7      57.3      00:14:48
 32982       6   4,535      27,210       987.2      57.7      00:14:44
 33187       5   4,535      22,675       993.7      58.0      00:14:37
 33395       8   4,535      36,280     1,000.1      58.4      00:14:31
 33639       3   4,535      13,605     1,008.0      58.9      00:14:22
 33844       8   4,535      36,280     1,014.3      59.2      00:14:15
 34100       5   4,535      22,675     1,022.5      59.7      00:14:05
 34357       8   4,535      36,280     1,030.8      60.2      00:13:55
 34723      10   4,535      45,350     1,042.2      60.9      00:13:39
 35084       5   4,535      22,675     1,053.6      61.5      00:13:22
 35426       8   4,535      36,280     1,064.5      62.2      00:13:07
 35780      10   4,535      45,350     1,075.4      62.8      00:12:52
 36080       5   4,535      22,675     1,084.8      63.3      00:12:40
 36412       6   4,535      27,210     1,095.3      64.0      00:12:25
 36662      10   4,535      45,350     1,103.1      64.4      00:12:16
 36884      10   4,535      45,350     1,109.6      64.8      00:12:10
 37101       8   4,535      36,280     1,116.2      65.2      00:12:03
 37371       5   4,535      22,675     1,123.7      65.6      00:11:54
 37611       7   4,535      31,745     1,130.9      66.0      00:11:46
 37869      10   4,535      45,350     1,138.4      66.5      00:11:37
 38132       9   4,535      40,815     1,146.5      67.0      00:11:28
 38372       5   4,535      22,675     1,154.0      67.4      00:11:19
 38713       4   4,535      18,140     1,164.6      68.0      00:11:05
 39061       4   4,535      18,140     1,175.3      68.6      00:10:50
 39370      10   4,535      45,350     1,184.5      69.2      00:10:39
 39719       4   4,535      18,140     1,194.7      69.8      00:10:25
 40096       7   4,535      31,745     1,206.1      70.4      00:10:10
 40492       8   4,535      36,280     1,218.1      71.1      00:09:54
 40884      10   4,535      45,350     1,230.3      71.8      00:09:37
 41147       4   4,535      18,140     1,238.4      72.3      00:09:28
 41471      10   4,535      45,350     1,248.4      72.9      00:09:15
 41820       8   4,535      36,280     1,259.1      73.5      00:09:01
 42142       4   4,535      18,140     1,268.7      74.1      00:08:49
 42460      10   4,535      45,350     1,278.2      74.6      00:08:38
 42732       7   4,535      31,745     1,286.2      75.1      00:08:28
 42979       9   4,535      40,815     1,293.7      75.5      00:08:20
 43220       8   4,535      36,280     1,301.4      76.0      00:08:11
 43504       7   4,535      31,745     1,310.2      76.5      00:07:60
 43799       4   4,535      18,140     1,318.8      77.0      00:07:50
 44106       7   4,535      31,745     1,328.2      77.6      00:07:38
 44451       7   4,535      31,745     1,338.2      78.2      00:07:26
 44797       7   4,535      31,745     1,348.8      78.8      00:07:12
 45092       2   4,535       9,070     1,357.7      79.3      00:07:02
 45421       6   4,535      27,210     1,367.0      79.8      00:06:50
 45670       9   4,535      40,815     1,374.1      80.2      00:06:42
 45982      10   4,535      45,350     1,383.3      80.8      00:06:31
 46282       6   4,535      27,210     1,392.8      81.3      00:06:20
 46580       7   4,535      31,745     1,401.8      81.9      00:06:09
 46929       8   4,535      36,280     1,412.5      82.5      00:05:55
 47276       8   4,535      36,280     1,422.1      83.0      00:05:44
 47607       8   4,535      36,280     1,431.7      83.6      00:05:32
 47923       7   4,535      31,745     1,441.1      84.2      00:05:21
 48174       4   4,535      18,140     1,448.7      84.6      00:05:12
 48440       8   4,535      36,280     1,456.8      85.1      00:05:02
 48733      10   4,535      45,350     1,465.8      85.6      00:04:52
 49036      10   4,535      45,350     1,474.7      86.1      00:04:41
 49349       2   4,535       9,070     1,484.3      86.7      00:04:30
 49681       9   4,535      40,815     1,493.5      87.2      00:04:19
 49976       6   4,535      27,210     1,502.1      87.7      00:04:08
 50285       7   4,535      31,745     1,511.2      88.3      00:03:57
 50577       3   4,535      13,605     1,519.7      88.7      00:03:47
 50861       7   4,535      31,745     1,528.4      89.3      00:03:37
 51159       9   4,535      40,815     1,537.6      89.8      00:03:26
 51510       4   4,535      18,140     1,548.3      90.4      00:03:13
 51846       6   4,535      27,210     1,559.0      91.0      00:03:00
 52161      10   4,535      45,350     1,569.1      91.6      00:02:48
 52514       7   4,535      31,745     1,580.6      92.3      00:02:35
 52911      10   4,535      45,350     1,593.7      93.1      00:02:19
 53345       4   4,535      18,140     1,607.4      93.9      00:02:02
 53728       7   4,535      31,745     1,619.4      94.6      00:01:48
 53978       7   4,535      31,745     1,626.9      95.0      00:01:39
 54232       6   4,535      27,210     1,634.6      95.5      00:01:31
 54462       7   4,535      31,745     1,641.3      95.9      00:01:23
 54807       7   4,535      31,745     1,651.4      96.4      00:01:11
 55156       9   4,535      40,815     1,661.8      97.0      00:00:59
 55475      10   4,535      45,350     1,670.9      97.6      00:00:48
 55784       7   4,535      31,745     1,680.0      98.1      00:00:38
 56106       5   4,535      22,675     1,689.9      98.7      00:00:26
 56417       6   4,535      27,210     1,699.8      99.3      00:00:15
 56714       5   4,535      22,675     1,709.1      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,712.4        Number of regions         = 56,821    
Computed distances (M)  = 1,712.38       Total run time (seconds)  = 1993.176
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A500.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A500.csv saved

. 
. cap log close

. 
end of do-file
