
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A400.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A400.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   411       2   4,435       8,870        10.4       0.6      00:26:35
   787      10   4,435      44,350        20.7       1.2      00:26:41
  1182      10   4,435      44,350        31.6       1.9      00:26:02
  1518      10   4,435      44,350        41.5       2.5      00:26:17
  1908       5   4,435      22,175        52.4       3.1      00:25:51
  2241       6   4,435      26,610        62.0       3.7      00:26:03
  2575       7   4,435      31,045        71.3       4.3      00:26:17
  2941       5   4,435      22,175        81.8       4.9      00:25:59
  3293       6   4,435      26,610        92.3       5.5      00:25:45
  3658      10   4,435      44,350       103.0       6.1      00:25:29
  3949      10   4,435      44,350       111.2       6.6      00:25:49
  4203       9   4,435      39,915       118.3       7.1      00:26:21
  4446      10   4,435      44,350       124.9       7.5      00:26:57
  4705       9   4,435      39,915       132.6       7.9      00:27:11
  4913       6   4,435      26,610       138.5       8.3      00:27:46
  5200       3   4,435      13,305       146.8       8.8      00:27:49
  5424       4   4,435      17,740       153.3       9.2      00:28:10
  5713       6   4,435      26,610       160.8       9.6      00:28:17
  5937      10   4,435      44,350       167.2      10.0      00:28:36
  6187       7   4,435      31,045       174.3      10.4      00:28:44
  6469       7   4,435      31,045       182.3      10.9      00:28:42
  6768       6   4,435      26,610       190.6      11.4      00:28:36
  7047      10   4,435      44,350       198.4      11.8      00:28:34
  7365       7   4,435      31,045       207.5      12.4      00:28:20
  7755       7   4,435      31,045       218.8      13.1      00:27:46
  8024       3   4,435      13,305       227.1      13.6      00:27:40
  8363       9   4,435      39,915       237.4      14.2      00:27:17
  8661       7   4,435      31,045       246.4      14.7      00:27:05
  8994       9   4,435      39,915       256.5      15.3      00:26:46
  9236       3   4,435      13,305       263.9      15.8      00:26:46
  9532       5   4,435      22,175       272.9      16.3      00:26:35
  9731       6   4,435      26,610       279.1      16.7      00:26:43
  9994       3   4,435      13,305       286.7      17.1      00:26:40
 10208       4   4,435      17,740       292.4      17.5      00:26:50
 10434       6   4,435      26,610       298.8      17.8      00:26:54
 10731       9   4,435      39,915       307.3      18.3      00:26:44
 10981       9   4,435      39,915       314.5      18.8      00:26:43
 11238      10   4,435      44,350       321.8      19.2      00:26:40
 11418      10   4,435      44,350       327.0      19.5      00:26:50
 11622       8   4,435      35,480       332.8      19.9      00:26:55
 11864       6   4,435      26,610       340.0      20.3      00:26:52
 12101       9   4,435      39,915       346.9      20.7      00:26:50
 12334       9   4,435      39,915       353.5      21.1      00:26:50
 12677       9   4,435      39,915       363.6      21.7      00:26:29
 13039       5   4,435      22,175       373.6      22.3      00:26:10
 13375      10   4,435      44,350       383.5      22.9      00:25:52
 13661       5   4,435      22,175       392.4      23.4      00:25:39
 13873       9   4,435      39,915       398.5      23.8      00:25:40
 14145       8   4,435      35,480       406.3      24.3      00:25:33
 14376      10   4,435      44,350       413.4      24.7      00:25:29
 14670       9   4,435      39,915       422.1      25.2      00:25:17
 14937       8   4,435      35,480       429.8      25.7      00:25:09
 15293       9   4,435      39,915       440.7      26.3      00:24:47
 15649      10   4,435      44,350       451.1      26.9      00:24:28
 16002       8   4,435      35,480       461.9      27.6      00:24:07
 16373      10   4,435      44,350       473.3      28.3      00:23:44
 16628       8   4,435      35,480       480.8      28.7      00:23:38
 16932       9   4,435      39,915       489.8      29.2      00:23:26
 17129      10   4,435      44,350       495.6      29.6      00:23:26
 17338      10   4,435      44,350       501.9      30.0      00:23:25
 17550       9   4,435      39,915       508.7      30.4      00:23:21
 17721      10   4,435      44,350       513.7      30.7      00:23:24
 18038       7   4,435      31,045       522.9      31.2      00:23:10
 18380       7   4,435      31,045       533.2      31.8      00:22:53
 18666       6   4,435      26,610       541.5      32.3      00:22:43
 18861       7   4,435      31,045       547.4      32.7      00:22:42
 19072       5   4,435      22,175       554.0      33.1      00:22:38
 19303       7   4,435      31,045       561.0      33.5      00:22:33
 19606       7   4,435      31,045       570.4      34.1      00:22:19
 19980       6   4,435      26,610       582.1      34.8      00:21:57
 20308       8   4,435      35,480       592.0      35.4      00:21:41
 20613       8   4,435      35,480       601.2      35.9      00:21:28
 20797       5   4,435      22,175       606.8      36.2      00:21:27
 21010       6   4,435      26,610       613.2      36.6      00:21:24
 21246       9   4,435      39,915       619.6      37.0      00:21:20
 21464       5   4,435      22,175       625.6      37.4      00:21:17
 21670       6   4,435      26,610       631.4      37.7      00:21:15
 21891       7   4,435      31,045       637.5      38.1      00:21:12
 22224       5   4,435      22,175       646.7      38.6      00:20:59
 22427       6   4,435      26,610       652.3      39.0      00:20:57
 22661       4   4,435      17,740       659.0      39.4      00:20:51
 22916       8   4,435      35,480       665.7      39.8      00:20:45
 23225      10   4,435      44,350       674.9      40.3      00:20:32
 23533       5   4,435      22,175       683.6      40.8      00:20:21
 23852       9   4,435      39,915       693.0      41.4      00:20:07
 24187       6   4,435      26,610       702.3      41.9      00:19:53
 24525      10   4,435      44,350       712.0      42.5      00:19:39
 24815       8   4,435      35,480       720.5      43.0      00:19:28
 25127       8   4,435      35,480       729.7      43.6      00:19:15
 25471      10   4,435      44,350       739.8      44.2      00:18:60
 25734       9   4,435      39,915       747.3      44.6      00:18:52
 25958       9   4,435      39,915       754.1      45.0      00:18:46
 26138       7   4,435      31,045       759.5      45.4      00:18:43
 26419       6   4,435      26,610       767.5      45.8      00:18:34
 26663       5   4,435      22,175       774.4      46.2      00:18:27
 26968       7   4,435      31,045       783.4      46.8      00:18:15
 27157      10   4,435      44,350       788.9      47.1      00:18:12
 27377       5   4,435      22,175       795.3      47.5      00:18:06
 27576       5   4,435      22,175       801.1      47.8      00:18:02
 27847       7   4,435      31,045       809.2      48.3      00:17:52
 28132       9   4,435      39,915       817.8      48.8      00:17:40
 28429       7   4,435      31,045       826.8      49.4      00:17:28
 28705      10   4,435      44,350       835.3      49.9      00:17:17
 28883       5   4,435      22,175       840.8      50.2      00:17:14
 29093       9   4,435      39,915       847.1      50.6      00:17:08
 29290       5   4,435      22,175       852.8      50.9      00:17:04
 29573       6   4,435      26,610       861.3      51.4      00:16:53
 29795       6   4,435      26,610       867.9      51.8      00:16:46
 30020      10   4,435      44,350       874.6      52.2      00:16:39
 30187       8   4,435      35,480       879.7      52.5      00:16:36
 30436       9   4,435      39,915       887.1      53.0      00:16:28
 30607       6   4,435      26,610       892.5      53.3      00:16:24
 30927      10   4,435      44,350       902.1      53.9      00:16:10
 31233       6   4,435      26,610       911.3      54.4      00:15:57
 31590       6   4,435      26,610       922.2      55.1      00:15:41
 31892       6   4,435      26,610       931.6      55.6      00:15:27
 32289      10   4,435      44,350       944.1      56.4      00:15:07
 32549       7   4,435      31,045       952.2      56.9      00:14:57
 32766       9   4,435      39,915       958.8      57.3      00:14:51
 32945       9   4,435      39,915       964.3      57.6      00:14:46
 33147       9   4,435      39,915       970.6      58.0      00:14:40
 33431       7   4,435      31,045       979.2      58.5      00:14:29
 33657       5   4,435      22,175       986.3      58.9      00:14:21
 33911       6   4,435      26,610       994.1      59.4      00:14:11
 34134       8   4,435      35,480     1,001.0      59.8      00:14:03
 34487       9   4,435      39,915     1,012.0      60.4      00:13:47
 34804      10   4,435      44,350     1,021.8      61.0      00:13:33
 35133      10   4,435      44,350     1,031.9      61.6      00:13:19
 35464       7   4,435      31,045     1,042.2      62.2      00:13:05
 35834       7   4,435      31,045     1,053.4      62.9      00:12:49
 36161       6   4,435      26,610     1,063.5      63.5      00:12:35
 36542       6   4,435      26,610     1,075.0      64.2      00:12:18
 36816       7   4,435      31,045     1,083.1      64.7      00:12:08
 37101       8   4,435      35,480     1,091.6      65.2      00:11:57
 37323       2   4,435       8,870     1,097.6      65.5      00:11:51
 37563       8   4,435      35,480     1,104.5      66.0      00:11:44
 37766       7   4,435      31,045     1,110.3      66.3      00:11:38
 37990       6   4,435      26,610     1,116.9      66.7      00:11:31
 38306       8   4,435      35,480     1,126.5      67.3      00:11:18
 38617       7   4,435      31,045     1,136.1      67.8      00:11:05
 39015       5   4,435      22,175     1,148.0      68.6      00:10:48
 39315       8   4,435      35,480     1,156.7      69.1      00:10:37
 39688       5   4,435      22,175     1,167.5      69.7      00:10:23
 40118       7   4,435      31,045     1,180.1      70.5      00:10:05
 40507       9   4,435      39,915     1,191.8      71.2      00:09:49
 40891       8   4,435      35,480     1,203.4      71.9      00:09:33
 41254       5   4,435      22,175     1,214.4      72.5      00:09:18
 41587       9   4,435      39,915     1,224.3      73.1      00:09:06
 41915       8   4,435      35,480     1,234.3      73.7      00:08:53
 42235       5   4,435      22,175     1,243.2      74.2      00:08:42
 42549       5   4,435      22,175     1,252.6      74.8      00:08:30
 42882       7   4,435      31,045     1,262.3      75.4      00:08:18
 43218       5   4,435      22,175     1,272.7      76.0      00:08:04
 43531       6   4,435      26,610     1,282.2      76.6      00:07:52
 43803       7   4,435      31,045     1,289.8      77.0      00:07:43
 44107      10   4,435      44,350     1,299.0      77.6      00:07:32
 44367       3   4,435      13,305     1,306.4      78.0      00:07:23
 44712       7   4,435      31,045     1,316.6      78.6      00:07:11
 45088      10   4,435      44,350     1,327.7      79.3      00:06:56
 45426       9   4,435      39,915     1,337.0      79.8      00:06:45
 45711      10   4,435      44,350     1,344.9      80.3      00:06:36
 46037       7   4,435      31,045     1,354.6      80.9      00:06:24
 46352       9   4,435      39,915     1,364.2      81.5      00:06:12
 46683       7   4,435      31,045     1,373.9      82.0      00:05:60
 47032       7   4,435      31,045     1,384.0      82.6      00:05:47
 47316      10   4,435      44,350     1,391.8      83.1      00:05:38
 47622      10   4,435      44,350     1,400.6      83.6      00:05:27
 47947       6   4,435      26,610     1,410.1      84.2      00:05:16
 48200      10   4,435      44,350     1,417.6      84.6      00:05:07
 48468       9   4,435      39,915     1,425.5      85.1      00:04:58
 48764      10   4,435      44,350     1,434.3      85.6      00:04:47
 49092       8   4,435      35,480     1,443.9      86.2      00:04:35
 49409       4   4,435      17,740     1,453.2      86.8      00:04:24
 49724       9   4,435      39,915     1,461.8      87.3      00:04:14
 50027       8   4,435      35,480     1,470.6      87.8      00:04:03
 50345       6   4,435      26,610     1,479.5      88.3      00:03:53
 50642       5   4,435      22,175     1,488.1      88.9      00:03:42
 50904       8   4,435      35,480     1,496.0      89.3      00:03:33
 51146      10   4,435      44,350     1,503.4      89.8      00:03:24
 51439       9   4,435      39,915     1,512.1      90.3      00:03:14
 51719       8   4,435      35,480     1,520.7      90.8      00:03:04
 51997       7   4,435      31,045     1,529.2      91.3      00:02:53
 52250       7   4,435      31,045     1,537.3      91.8      00:02:44
 52649       5   4,435      22,175     1,550.2      92.6      00:02:28
 53106      10   4,435      44,350     1,564.6      93.4      00:02:10
 53532       8   4,435      35,480     1,577.7      94.2      00:01:55
 53839       2   4,435       8,870     1,587.0      94.8      00:01:43
 54116       4   4,435      17,740     1,595.1      95.3      00:01:34
 54408       9   4,435      39,915     1,603.8      95.8      00:01:24
 54764       5   4,435      22,175     1,613.8      96.4      00:01:12
 55107       5   4,435      22,175     1,623.7      97.0      00:01:00
 55464       5   4,435      22,175     1,633.7      97.6      00:00:48
 55755       8   4,435      35,480     1,642.2      98.1      00:00:38
 56087      10   4,435      44,350     1,652.1      98.7      00:00:26
 56398       8   4,435      35,480     1,661.8      99.2      00:00:15
 56718       7   4,435      31,045     1,671.5      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,435     
Bases * Neighbors  (M)  = 1,674.6        Number of regions         = 56,821    
Computed distances (M)  = 1,674.62       Total run time (seconds)  = 1973.047
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A400.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A400.csv saved

. 
. cap log close

. 
end of do-file
