
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A100_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A100_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A100_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   373      10   4,135      41,350         8.8       0.6      00:29:26
   791       6   4,135      24,810        19.4       1.2      00:26:35
  1201       2   4,135       8,270        29.9       1.9      00:25:37
  1612       8   4,135      33,080        41.2       2.6      00:24:37
  2078       4   4,135      16,540        53.3       3.4      00:23:35
  2483       2   4,135       8,270        64.0       4.1      00:23:25
  2913      10   4,135      41,350        75.6       4.8      00:22:57
  3381       4   4,135      16,540        88.5       5.7      00:22:13
  3856       6   4,135      24,810       101.4       6.5      00:21:37
  4251       9   4,135      37,215       111.4       7.1      00:21:42
  4635       7   4,135      28,945       121.7       7.8      00:21:43
  4990       8   4,135      33,080       131.2       8.4      00:21:49
  5367       6   4,135      24,810       141.4       9.1      00:21:47
  5708       9   4,135      37,215       149.8       9.6      00:22:00
  6055      10   4,135      41,350       159.2      10.2      00:22:03
  6405       3   4,135      12,405       168.2      10.8      00:22:07
  6767       7   4,135      28,945       177.7      11.4      00:22:05
  7187       7   4,135      28,945       188.6      12.1      00:21:51
  7627       6   4,135      24,810       200.6      12.8      00:21:30
  8045       9   4,135      37,215       212.4      13.6      00:21:12
  8467       7   4,135      28,945       224.4      14.4      00:20:53
  8876       8   4,135      33,080       235.8      15.1      00:20:38
  9232      10   4,135      41,350       245.9      15.8      00:20:32
  9509       8   4,135      33,080       253.7      16.3      00:20:38
  9838       6   4,135      24,810       263.2      16.9      00:20:35
 10198       8   4,135      33,080       272.4      17.4      00:20:32
 10549       1   4,135       4,135       281.6      18.0      00:20:28
 10904       7   4,135      28,945       291.1      18.6      00:20:23
 11230       9   4,135      37,215       299.9      19.2      00:20:22
 11540       4   4,135      16,540       308.2      19.7      00:20:21
 11919       2   4,135       8,270       318.4      20.4      00:20:12
 12303       8   4,135      33,080       328.9      21.1      00:20:01
 12796       4   4,135      16,540       341.9      21.9      00:19:38
 13306       6   4,135      24,810       355.6      22.8      00:19:14
 13818       6   4,135      24,810       370.0      23.7      00:18:48
 14341       9   4,135      37,215       384.4      24.6      00:18:24
 14849       5   4,135      20,675       398.4      25.5      00:18:01
 15361       9   4,135      37,215       412.8      26.4      00:17:39
 15884       8   4,135      33,080       427.2      27.4      00:17:17
 16404       7   4,135      28,945       442.2      28.3      00:16:54
 16798       7   4,135      28,945       453.1      29.0      00:16:44
 17136       5   4,135      20,675       462.3      29.6      00:16:40
 17468       8   4,135      33,080       471.7      30.2      00:16:34
 17842      10   4,135      41,350       482.1      30.9      00:16:26
 18230       6   4,135      24,810       493.1      31.6      00:16:16
 18714       5   4,135      20,675       506.3      32.4      00:15:60
 19234       7   4,135      28,945       521.2      33.4      00:15:39
 19754       9   4,135      37,215       536.1      34.3      00:15:19
 20273       7   4,135      28,945       550.9      35.3      00:14:60
 20674       9   4,135      37,215       562.3      36.0      00:14:49
 21005       8   4,135      33,080       571.6      36.6      00:14:44
 21437       6   4,135      24,810       582.5      37.3      00:14:35
 21842      10   4,135      41,350       593.0      38.0      00:14:27
 22265      10   4,135      41,350       604.0      38.7      00:14:17
 22681       8   4,135      33,080       615.0      39.4      00:14:08
 23085       5   4,135      20,675       625.5      40.1      00:13:59
 23487       9   4,135      37,215       636.3      40.8      00:13:50
 23896      10   4,135      41,350       647.3      41.5      00:13:40
 24403      10   4,135      41,350       660.3      42.3      00:13:26
 24917       7   4,135      28,945       674.6      43.2      00:13:10
 25408       7   4,135      28,945       688.0      44.1      00:12:55
 25811       7   4,135      28,945       699.1      44.8      00:12:46
 26182       6   4,135      24,810       709.2      45.4      00:12:38
 26660       9   4,135      37,215       721.9      46.2      00:12:25
 27132       6   4,135      24,810       734.8      47.1      00:12:12
 27514       7   4,135      28,945       745.2      47.7      00:12:04
 27924       9   4,135      37,215       756.7      48.5      00:11:53
 28371       9   4,135      37,215       769.2      49.3      00:11:41
 28755       9   4,135      37,215       780.3      50.0      00:11:32
 29112       4   4,135      16,540       790.3      50.6      00:11:24
 29528       8   4,135      33,080       801.9      51.4      00:11:13
 29890       9   4,135      37,215       811.9      52.0      00:11:06
 30208      10   4,135      41,350       820.8      52.6      00:10:60
 30576       5   4,135      20,675       831.2      53.2      00:10:51
 31026       9   4,135      37,215       843.8      54.0      00:10:39
 31511       7   4,135      28,945       857.6      54.9      00:10:25
 32008       6   4,135      24,810       872.0      55.9      00:10:10
 32496       6   4,135      24,810       886.3      56.8      00:09:55
 32801       8   4,135      33,080       894.9      57.3      00:09:49
 33145       5   4,135      20,675       904.9      58.0      00:09:41
 33591       6   4,135      24,810       917.6      58.8      00:09:29
 34012       4   4,135      16,540       929.7      59.5      00:09:18
 34477       6   4,135      24,810       943.2      60.4      00:09:05
 34996       8   4,135      33,080       958.2      61.4      00:08:49
 35517       8   4,135      33,080       973.3      62.3      00:08:34
 36043       8   4,135      33,080       988.1      63.3      00:08:20
 36562      10   4,135      41,350     1,002.8      64.2      00:08:05
 36940      10   4,135      41,350     1,013.4      64.9      00:07:56
 37355       6   4,135      24,810     1,024.2      65.6      00:07:47
 37749       3   4,135      12,405     1,034.7      66.3      00:07:39
 38111       9   4,135      37,215     1,044.8      66.9      00:07:31
 38449       8   4,135      33,080     1,054.5      67.5      00:07:23
 38792      10   4,135      41,350     1,064.1      68.2      00:07:15
 39072       9   4,135      37,215     1,071.9      68.7      00:07:10
 39387       9   4,135      37,215     1,080.4      69.2      00:07:03
 39760      10   4,135      41,350     1,090.4      69.8      00:06:55
 40243       8   4,135      33,080     1,103.8      70.7      00:06:43
 40772      10   4,135      41,350     1,118.6      71.6      00:06:28
 41150       6   4,135      24,810     1,129.3      72.3      00:06:19
 41566       9   4,135      37,215     1,140.9      73.1      00:06:09
 41988       1   4,135       4,135     1,152.8      73.8      00:05:59
 42398       5   4,135      20,675     1,163.5      74.5      00:05:49
 42784       8   4,135      33,080     1,174.1      75.2      00:05:40
 43152       9   4,135      37,215     1,184.7      75.9      00:05:31
 43522       9   4,135      37,215     1,195.2      76.5      00:05:22
 43921       5   4,135      20,675     1,206.0      77.2      00:05:13
 44334       9   4,135      37,215     1,217.2      78.0      00:05:03
 44764       4   4,135      16,540     1,228.9      78.7      00:04:53
 45128       7   4,135      28,945     1,238.9      79.4      00:04:44
 45552       8   4,135      33,080     1,249.9      80.1      00:04:35
 45963      10   4,135      41,350     1,260.8      80.8      00:04:25
 46342       6   4,135      24,810     1,271.6      81.4      00:04:16
 46778       8   4,135      33,080     1,283.7      82.2      00:04:05
 47151       8   4,135      33,080     1,293.4      82.8      00:03:57
 47546      10   4,135      41,350     1,303.7      83.5      00:03:48
 47930       5   4,135      20,675     1,314.2      84.2      00:03:39
 48294       9   4,135      37,215     1,324.3      84.8      00:03:30
 48672       4   4,135      16,540     1,334.8      85.5      00:03:21
 49075       7   4,135      28,945     1,345.7      86.2      00:03:11
 49502       4   4,135      16,540     1,357.3      86.9      00:03:01
 50054       9   4,135      37,215     1,371.8      87.9      00:02:48
 50505       6   4,135      24,810     1,383.6      88.6      00:02:37
 50868       7   4,135      28,945     1,393.8      89.3      00:02:28
 51278      10   4,135      41,350     1,405.2      90.0      00:02:18
 51691       5   4,135      20,675     1,417.1      90.8      00:02:08
 52093       9   4,135      37,215     1,428.6      91.5      00:01:57
 52454       7   4,135      28,945     1,439.3      92.2      00:01:48
 52760       9   4,135      37,215     1,448.7      92.8      00:01:40
 53100       5   4,135      20,675     1,458.6      93.4      00:01:31
 53486       5   4,135      20,675     1,469.7      94.1      00:01:21
 53911      10   4,135      41,350     1,481.6      94.9      00:01:11
 54247      10   4,135      41,350     1,490.9      95.5      00:01:02
 54604       7   4,135      28,945     1,500.1      96.1      00:00:54
 55009       2   4,135       8,270     1,511.3      96.8      00:00:44
 55394       6   4,135      24,810     1,521.4      97.4      00:00:36
 55762       8   4,135      33,080     1,531.3      98.1      00:00:27
 56116       9   4,135      37,215     1,541.2      98.7      00:00:18
 56488      10   4,135      41,350     1,552.0      99.4      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,135     
Bases * Neighbors  (M)  = 1,561.3        Number of regions         = 56,821    
Computed distances (M)  = 1,561.34       Total run time (seconds)  = 1397.817
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A100_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
