
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//vaccinated/ca_Coffee_lo
> cations_total_10000_5_4q_mnl_A700.dta /export/storage_covidvaccine/Result/MNL
> _partial_new/M5_K10000_4q/Coffee//vaccinated/ca_blk_Coffee_dist_total_10000_5
> _4q_mnl_A700.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coff
> ee//vaccinated/ca_Coffee_locations_total_10000_5_4q_mnl_A700.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffe
> e//vaccinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A700.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   310       8   4,735      37,880         8.5       0.5      00:35:01
   670      10   4,735      47,350        18.6       1.0      00:31:46
  1019       8   4,735      37,880        28.9       1.6      00:30:34
  1346       2   4,735       9,470        39.0       2.2      00:29:57
  1685       4   4,735      18,940        49.7       2.8      00:29:13
  2030       8   4,735      37,880        59.8       3.3      00:28:57
  2378       6   4,735      28,410        70.4       3.9      00:28:30
  2726      10   4,735      47,350        81.0       4.5      00:28:08
  3074      10   4,735      47,350        91.4       5.1      00:27:53
  3409       9   4,735      42,615       102.4       5.7      00:27:29
  3748      10   4,735      47,350       113.0       6.3      00:27:13
  4050       8   4,735      37,880       121.9       6.8      00:27:23
  4315       5   4,735      23,675       129.5       7.2      00:27:47
  4561       7   4,735      33,145       137.1       7.7      00:28:09
  4825       6   4,735      28,410       145.3       8.1      00:28:19
  5080       5   4,735      23,675       153.1       8.6      00:28:31
  5344       9   4,735      42,615       161.3       9.0      00:28:36
  5570      10   4,735      47,350       167.8       9.4      00:29:01
  5768       6   4,735      28,410       173.7       9.7      00:29:29
  6030       5   4,735      23,675       181.7      10.2      00:29:30
  6303       6   4,735      28,410       189.8      10.6      00:29:31
  6561       6   4,735      28,410       197.6      11.1      00:29:34
  6817       7   4,735      33,145       205.2      11.5      00:29:36
  7100       4   4,735      18,940       213.8      12.0      00:29:30
  7422       9   4,735      42,615       223.5      12.5      00:29:12
  7728      10   4,735      47,350       233.0      13.0      00:28:58
  8017       9   4,735      42,615       242.5      13.6      00:28:43
  8296      10   4,735      47,350       251.5      14.1      00:28:33
  8588       6   4,735      28,410       261.0      14.6      00:28:19
  8889       8   4,735      37,880       270.7      15.1      00:28:04
  9183       7   4,735      33,145       280.2      15.7      00:27:50
  9378       9   4,735      42,615       286.4      16.0      00:27:60
  9601       7   4,735      33,145       293.9      16.5      00:27:60
  9840       7   4,735      33,145       301.7      16.9      00:27:58
 10088       6   4,735      28,410       309.0      17.3      00:27:57
 10336       5   4,735      23,675       316.2      17.7      00:27:58
 10592       8   4,735      37,880       323.9      18.1      00:27:55
 10861       6   4,735      28,410       332.2      18.6      00:27:48
 11124       8   4,735      37,880       340.3      19.0      00:27:43
 11341       8   4,735      37,880       346.9      19.4      00:27:45
 11553       8   4,735      37,880       353.4      19.8      00:27:48
 11794       8   4,735      37,880       361.0      20.2      00:27:44
 12023       6   4,735      28,410       368.1      20.6      00:27:42
 12256       8   4,735      37,880       375.4      21.0      00:27:39
 12540       9   4,735      42,615       384.2      21.5      00:27:28
 12866       1   4,735       4,735       393.8      22.0      00:27:12
 13186       9   4,735      42,615       403.7      22.6      00:26:55
 13482       7   4,735      33,145       413.4      23.1      00:26:40
 13694      10   4,735      47,350       420.3      23.5      00:26:38
 13920       7   4,735      33,145       427.1      23.9      00:26:37
 14187       9   4,735      42,615       435.4      24.4      00:26:27
 14450       5   4,735      23,675       443.9      24.8      00:26:18
 14728       7   4,735      33,145       452.5      25.3      00:26:07
 15019       7   4,735      33,145       461.9      25.9      00:25:53
 15340      10   4,735      47,350       472.2      26.4      00:25:35
 15666       7   4,735      33,145       482.3      27.0      00:25:19
 15984       7   4,735      33,145       492.8      27.6      00:25:01
 16292       8   4,735      37,880       502.9      28.1      00:24:45
 16578       8   4,735      37,880       512.1      28.7      00:24:33
 16820       5   4,735      23,675       519.7      29.1      00:24:27
 17042       9   4,735      42,615       526.8      29.5      00:24:23
 17272       9   4,735      42,615       534.0      29.9      00:24:18
 17478       8   4,735      37,880       540.9      30.3      00:24:15
 17705      10   4,735      47,350       548.2      30.7      00:24:10
 17974       8   4,735      37,880       556.5      31.1      00:24:01
 18288       6   4,735      28,410       566.6      31.7      00:23:45
 18563       7   4,735      33,145       575.0      32.2      00:23:36
 18772       5   4,735      23,675       581.9      32.6      00:23:32
 19007      10   4,735      47,350       589.7      33.0      00:23:24
 19243       8   4,735      37,880       597.3      33.4      00:23:17
 19539      10   4,735      47,350       607.1      34.0      00:23:03
 19851       8   4,735      37,880       617.4      34.6      00:22:47
 20161      10   4,735      47,350       627.7      35.1      00:22:31
 20478       7   4,735      33,145       637.8      35.7      00:22:17
 20691       8   4,735      37,880       644.7      36.1      00:22:12
 20906       6   4,735      28,410       651.7      36.5      00:22:07
 21160       1   4,735       4,735       659.4      36.9      00:22:01
 21405       9   4,735      42,615       666.4      37.3      00:21:56
 21654      10   4,735      47,350       674.0      37.7      00:21:49
 21903       8   4,735      37,880       681.3      38.1      00:21:43
 22162       7   4,735      33,145       688.8      38.6      00:21:36
 22395       9   4,735      42,615       695.8      38.9      00:21:30
 22641      10   4,735      47,350       703.3      39.4      00:21:23
 22936      10   4,735      47,350       711.7      39.8      00:21:13
 23234      10   4,735      47,350       721.2      40.4      00:21:00
 23546       5   4,735      23,675       730.4      40.9      00:20:48
 23840       6   4,735      28,410       739.7      41.4      00:20:36
 24147      10   4,735      47,350       748.8      41.9      00:20:24
 24447       8   4,735      37,880       757.9      42.4      00:20:12
 24728       4   4,735      18,940       766.9      42.9      00:20:01
 25044      10   4,735      47,350       776.6      43.5      00:19:48
 25351       4   4,735      18,940       786.3      44.0      00:19:35
 25617      10   4,735      47,350       794.4      44.5      00:19:26
 25754       5   4,735      23,675       799.0      44.7      00:19:26
 25970       7   4,735      33,145       805.7      45.1      00:19:20
 26183       6   4,735      28,410       812.5      45.5      00:19:15
 26445      10   4,735      47,350       820.6      45.9      00:19:06
 26727       9   4,735      42,615       829.1      46.4      00:18:56
 26990       6   4,735      28,410       837.5      46.9      00:18:46
 27188       8   4,735      37,880       843.6      47.2      00:18:42
 27403       3   4,735      14,205       850.2      47.6      00:18:36
 27594       9   4,735      42,615       856.2      47.9      00:18:32
 27823       7   4,735      33,145       863.6      48.3      00:18:24
 28116       8   4,735      37,880       873.1      48.9      00:18:12
 28421       8   4,735      37,880       882.9      49.4      00:17:58
 28685       8   4,735      37,880       891.6      49.9      00:17:48
 28858       9   4,735      42,615       897.3      50.2      00:17:44
 29056      10   4,735      47,350       903.6      50.6      00:17:39
 29313       9   4,735      42,615       911.7      51.0      00:17:30
 29566      10   4,735      47,350       919.6      51.5      00:17:20
 29791       9   4,735      42,615       926.9      51.9      00:17:13
 29997      10   4,735      47,350       933.5      52.2      00:17:07
 30195       6   4,735      28,410       939.8      52.6      00:17:01
 30417       9   4,735      42,615       947.0      53.0      00:16:54
 30646       8   4,735      37,880       954.4      53.4      00:16:46
 30948       5   4,735      23,675       964.2      54.0      00:16:33
 31251       7   4,735      33,145       973.9      54.5      00:16:20
 31548       6   4,735      28,410       983.6      55.1      00:16:06
 31813      10   4,735      47,350       992.4      55.5      00:15:55
 32111       5   4,735      23,675     1,002.3      56.1      00:15:42
 32406      10   4,735      47,350     1,012.4      56.7      00:15:28
 32617       9   4,735      42,615     1,019.2      57.0      00:15:22
 32817       8   4,735      37,880     1,025.7      57.4      00:15:16
 33003       5   4,735      23,675     1,031.9      57.8      00:15:10
 33202       7   4,735      33,145     1,038.4      58.1      00:15:04
 33447       5   4,735      23,675     1,046.3      58.6      00:14:54
 33677      10   4,735      47,350     1,054.1      59.0      00:14:45
 33926       8   4,735      37,880     1,062.2      59.5      00:14:36
 34152       7   4,735      33,145     1,069.9      59.9      00:14:27
 34438       7   4,735      33,145     1,079.3      60.4      00:14:15
 34721       7   4,735      33,145     1,088.6      60.9      00:14:03
 35017       8   4,735      37,880     1,098.4      61.5      00:13:50
 35315       5   4,735      23,675     1,108.2      62.0      00:13:37
 35627       8   4,735      37,880     1,118.4      62.6      00:13:23
 35927      10   4,735      47,350     1,128.1      63.1      00:13:11
 36231      10   4,735      47,350     1,138.1      63.7      00:12:57
 36537       5   4,735      23,675     1,148.0      64.3      00:12:45
 36736       7   4,735      33,145     1,154.2      64.6      00:12:39
 36942       7   4,735      33,145     1,160.9      65.0      00:12:32
 37163      10   4,735      47,350     1,167.4      65.3      00:12:25
 37367       8   4,735      37,880     1,173.5      65.7      00:12:19
 37578       5   4,735      23,675     1,180.1      66.1      00:12:12
 37782       9   4,735      42,615     1,186.3      66.4      00:12:06
 38002       6   4,735      28,410     1,193.2      66.8      00:11:59
 38227       6   4,735      28,410     1,200.5      67.2      00:11:50
 38450       8   4,735      37,880     1,207.9      67.6      00:11:42
 38723       7   4,735      33,145     1,216.8      68.1      00:11:31
 38987       8   4,735      37,880     1,225.2      68.6      00:11:21
 39178       9   4,735      42,615     1,231.0      68.9      00:11:15
 39405       3   4,735      14,205     1,238.0      69.3      00:11:07
 39650       5   4,735      23,675     1,245.7      69.7      00:10:58
 39916       9   4,735      42,615     1,254.1      70.2      00:10:48
 40215       8   4,735      37,880     1,263.4      70.7      00:10:36
 40483       8   4,735      37,880     1,272.0      71.2      00:10:25
 40797       8   4,735      37,880     1,282.2      71.8      00:10:12
 41035       4   4,735      18,940     1,290.0      72.2      00:10:03
 41235       6   4,735      28,410     1,296.3      72.6      00:09:56
 41475       9   4,735      42,615     1,303.9      73.0      00:09:47
 41715       7   4,735      33,145     1,311.6      73.4      00:09:38
 41946       1   4,735       4,735     1,319.2      73.8      00:09:29
 42181       2   4,735       9,470     1,326.0      74.2      00:09:21
 42376       9   4,735      42,615     1,332.2      74.6      00:09:15
 42584       5   4,735      23,675     1,338.6      74.9      00:09:08
 42802       6   4,735      28,410     1,345.5      75.3      00:08:60
 42990       9   4,735      42,615     1,351.6      75.6      00:08:53
 43184       7   4,735      33,145     1,358.2      76.0      00:08:46
 43370       5   4,735      23,675     1,364.2      76.4      00:08:39
 43592       6   4,735      28,410     1,371.0      76.7      00:08:31
 43896       7   4,735      33,145     1,380.6      77.3      00:08:19
 44149      10   4,735      47,350     1,388.4      77.7      00:08:09
 44314       7   4,735      33,145     1,393.5      78.0      00:08:04
 44526       6   4,735      28,410     1,400.1      78.4      00:07:57
 44737       6   4,735      28,410     1,406.7      78.7      00:07:49
 44947       8   4,735      37,880     1,413.5      79.1      00:07:41
 45208       7   4,735      33,145     1,421.4      79.6      00:07:31
 45425       7   4,735      33,145     1,427.7      79.9      00:07:24
 45649       6   4,735      28,410     1,434.3      80.3      00:07:16
 45887       7   4,735      33,145     1,441.6      80.7      00:07:08
 46111      10   4,735      47,350     1,448.9      81.1      00:06:59
 46324       5   4,735      23,675     1,455.8      81.5      00:06:51
 46562       9   4,735      42,615     1,463.4      81.9      00:06:41
 46852       6   4,735      28,410     1,472.7      82.4      00:06:29
 47048       6   4,735      28,410     1,478.3      82.7      00:06:23
 47241       5   4,735      23,675     1,484.0      83.1      00:06:17
 47434       4   4,735      18,940     1,489.8      83.4      00:06:10
 47634       5   4,735      23,675     1,496.0      83.7      00:06:03
 47846      10   4,735      47,350     1,502.6      84.1      00:05:55
 48045       6   4,735      28,410     1,508.9      84.5      00:05:47
 48254       7   4,735      33,145     1,515.5      84.8      00:05:39
 48492       8   4,735      37,880     1,523.0      85.2      00:05:30
 48716       9   4,735      42,615     1,530.1      85.6      00:05:21
 48940       8   4,735      37,880     1,537.2      86.0      00:05:13
 49157       7   4,735      33,145     1,544.2      86.4      00:05:04
 49371       5   4,735      23,675     1,550.6      86.8      00:04:56
 49574       6   4,735      28,410     1,556.5      87.1      00:04:49
 49778       6   4,735      28,410     1,562.6      87.5      00:04:42
 49987       5   4,735      23,675     1,569.1      87.8      00:04:34
 50215       7   4,735      33,145     1,576.1      88.2      00:04:25
 50427       8   4,735      37,880     1,582.3      88.6      00:04:18
 50654       7   4,735      33,145     1,589.5      89.0      00:04:09
 50862       8   4,735      37,880     1,596.3      89.3      00:04:00
 51083       6   4,735      28,410     1,603.6      89.8      00:03:51
 51313       8   4,735      37,880     1,610.7      90.2      00:03:42
 51530       5   4,735      23,675     1,617.8      90.6      00:03:34
 51747       9   4,735      42,615     1,625.1      91.0      00:03:24
 52009      10   4,735      47,350     1,633.6      91.4      00:03:14
 52276       7   4,735      33,145     1,642.7      91.9      00:03:02
 52556       8   4,735      37,880     1,652.3      92.5      00:02:50
 52835      10   4,735      47,350     1,662.0      93.0      00:02:37
 53137      10   4,735      47,350     1,671.9      93.6      00:02:25
 53434       8   4,735      37,880     1,681.7      94.1      00:02:12
 53713       7   4,735      33,145     1,690.8      94.6      00:02:01
 53922      10   4,735      47,350     1,697.3      95.0      00:01:52
 54131       5   4,735      23,675     1,704.0      95.4      00:01:44
 54372       7   4,735      33,145     1,711.4      95.8      00:01:35
 54655      10   4,735      47,350     1,719.9      96.3      00:01:24
 54941      10   4,735      47,350     1,728.8      96.8      00:01:13
 55178       9   4,735      42,615     1,736.1      97.2      00:01:04
 55432       6   4,735      28,410     1,743.6      97.6      00:00:54
 55688       9   4,735      42,615     1,751.5      98.0      00:00:44
 55919       7   4,735      33,145     1,759.0      98.5      00:00:35
 56164       8   4,735      37,880     1,766.9      98.9      00:00:25
 56426       7   4,735      33,145     1,775.6      99.4      00:00:14
 56751       9   4,735      42,615     1,786.2     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,786.6        Number of regions         = 56,767    
Computed distances (M)  = 1,786.62       Total run time (seconds)  = 2255.294
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Coffee//v
> accinated/ca_blk_Coffee_dist_total_10000_5_4q_mnl_A700.csv saved

. 
. cap log close

. 
end of do-file
