
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A500_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A500_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A500_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   196       5   4,535      22,675         5.0       0.3      00:57:07
   411       2   4,535       9,070        10.8       0.6      00:52:48
   600       8   4,535      36,280        15.9       0.9      00:53:20
   754       6   4,535      27,210        20.2       1.2      00:55:47
   992       9   4,535      40,815        26.8       1.6      00:52:26
  1226       9   4,535      40,815        33.8       2.0      00:49:46
  1454       9   4,535      40,815        40.6       2.4      00:48:04
  1698       7   4,535      31,745        48.0       2.8      00:46:20
  1944       5   4,535      22,675        54.8       3.2      00:45:27
  2152       8   4,535      36,280        60.9       3.6      00:45:15
  2374       9   4,535      40,815        67.3       3.9      00:44:53
  2601       4   4,535      18,140        73.8       4.3      00:44:29
  2783       6   4,535      27,210        79.4       4.6      00:44:39
  2998       9   4,535      40,815        85.4       5.0      00:44:33
  3181       7   4,535      31,745        91.1       5.3      00:44:35
  3370       2   4,535       9,070        96.9       5.7      00:44:31
  3616      10   4,535      45,350       104.2       6.1      00:43:48
  3840       9   4,535      40,815       110.9       6.5      00:43:22
  3966       9   4,535      40,815       114.3       6.7      00:44:21
  4133       8   4,535      36,280       119.1       7.0      00:44:41
  4273      10   4,535      45,350       122.9       7.2      00:45:20
  4424       8   4,535      36,280       127.2       7.4      00:45:46
  4564       6   4,535      27,210       131.4       7.7      00:46:12
  4716       8   4,535      36,280       136.1       8.0      00:46:25
  4881       9   4,535      40,815       140.9       8.2      00:46:34
  5011       5   4,535      22,675       144.7       8.5      00:47:02
  5152       9   4,535      40,815       148.8       8.7      00:47:22
  5320      10   4,535      45,350       153.8       9.0      00:47:24
  5450       5   4,535      22,675       157.6       9.2      00:47:46
  5571       4   4,535      18,140       160.7       9.4      00:48:22
  5701       4   4,535      18,140       164.4       9.6      00:48:45
  5826       5   4,535      22,675       167.9       9.8      00:49:09
  5965       5   4,535      22,675       172.0      10.1      00:49:21
  6123       3   4,535      13,605       176.7      10.3      00:49:20
  6258       9   4,535      40,815       180.7      10.6      00:49:34
  6404       4   4,535      18,140       184.7      10.8      00:49:44
  6533       9   4,535      40,815       188.4      11.0      00:49:59
  6673       7   4,535      31,745       192.4      11.2      00:50:09
  6825       7   4,535      31,745       196.8      11.5      00:50:10
  6986       9   4,535      40,815       201.5      11.8      00:50:06
  7208       4   4,535      18,140       207.6      12.1      00:49:38
  7365       4   4,535      18,140       212.4      12.4      00:49:32
  7564       9   4,535      40,815       218.3      12.8      00:49:09
  7752       7   4,535      31,745       223.8      13.1      00:48:52
  7932      10   4,535      45,350       229.5      13.4      00:48:33
  8120      10   4,535      45,350       235.4      13.8      00:48:12
  8310       6   4,535      27,210       241.4      14.1      00:47:50
  8490       5   4,535      22,675       247.0      14.4      00:47:34
  8649       8   4,535      36,280       251.8      14.7      00:47:28
  8799       8   4,535      36,280       256.4      15.0      00:47:26
  8958       5   4,535      22,675       261.4      15.3      00:47:17
  9124      10   4,535      45,350       266.5      15.6      00:47:07
  9243       7   4,535      31,745       270.2      15.8      00:47:14
  9364      10   4,535      45,350       274.0      16.0      00:47:21
  9501       7   4,535      31,745       278.3      16.3      00:47:21
  9633       7   4,535      31,745       282.5      16.5      00:47:21
  9793       7   4,535      31,745       287.5      16.8      00:47:11
  9956       5   4,535      22,675       292.2      17.1      00:47:05
 10096       1   4,535       4,535       296.1      17.3      00:47:08
 10274       8   4,535      36,280       301.0      17.6      00:47:00
 10397       9   4,535      40,815       304.6      17.8      00:47:06
 10551       6   4,535      27,210       309.2      18.1      00:47:01
 10716       8   4,535      36,280       313.9      18.3      00:46:53
 10832       9   4,535      40,815       317.3      18.5      00:47:01
 10953       5   4,535      22,675       320.9      18.8      00:47:05
 11141       6   4,535      27,210       326.4      19.1      00:46:50
 11257      10   4,535      45,350       329.8      19.3      00:46:56
 11367      10   4,535      45,350       333.1      19.5      00:47:03
 11491       8   4,535      36,280       336.9      19.7      00:47:05
 11635       7   4,535      31,745       341.0      19.9      00:47:03
 11792       7   4,535      31,745       345.6      20.2      00:46:55
 11957       8   4,535      36,280       350.5      20.5      00:46:45
 12120       4   4,535      18,140       355.5      20.8      00:46:33
 12263       8   4,535      36,280       359.7      21.0      00:46:30
 12506       8   4,535      36,280       366.9      21.4      00:45:57
 12756      10   4,535      45,350       374.0      21.9      00:45:26
 13014       3   4,535      13,605       381.5      22.3      00:44:52
 13247       6   4,535      27,210       388.4      22.7      00:44:25
 13501       9   4,535      40,815       396.5      23.2      00:43:48
 13642       7   4,535      31,745       400.9      23.4      00:43:44
 13771       7   4,535      31,745       404.6      23.6      00:43:44
 13904       7   4,535      31,745       408.5      23.9      00:43:44
 14047       5   4,535      22,675       412.7      24.1      00:43:40
 14205       3   4,535      13,605       417.6      24.4      00:43:31
 14350       8   4,535      36,280       422.1      24.7      00:43:25
 14496       2   4,535       9,070       426.6      24.9      00:43:18
 14643       2   4,535       9,070       430.9      25.2      00:43:13
 14774       9   4,535      40,815       434.9      25.4      00:43:11
 14995      10   4,535      45,350       441.6      25.8      00:42:47
 15252       7   4,535      31,745       449.6      26.3      00:42:14
 15501      10   4,535      45,350       457.2      26.7      00:41:45
 15724       5   4,535      22,675       463.7      27.1      00:41:23
 15950       8   4,535      36,280       470.9      27.5      00:40:58
 16160       5   4,535      22,675       477.5      27.9      00:40:36
 16395      10   4,535      45,350       484.9      28.3      00:40:10
 16581       5   4,535      22,675       490.5      28.7      00:39:57
 16735      10   4,535      45,350       495.2      28.9      00:39:50
 16880       5   4,535      22,675       499.5      29.2      00:39:45
 16998       8   4,535      36,280       503.2      29.4      00:39:45
 17133       7   4,535      31,745       507.2      29.6      00:39:42
 17245       7   4,535      31,745       510.6      29.8      00:39:43
 17339      10   4,535      45,350       513.6      30.0      00:39:46
 17457      10   4,535      45,350       517.3      30.2      00:39:45
 17579       5   4,535      22,675       521.3      30.5      00:39:42
 17715       7   4,535      31,745       525.3      30.7      00:39:38
 17914       6   4,535      27,210       531.2      31.0      00:39:23
 18132       7   4,535      31,745       538.0      31.4      00:39:01
 18390       7   4,535      31,745       545.6      31.9      00:38:35
 18592       5   4,535      22,675       551.6      32.2      00:38:19
 18731       9   4,535      40,815       556.1      32.5      00:38:13
 18867       9   4,535      40,815       560.2      32.7      00:38:08
 19006       5   4,535      22,675       564.7      33.0      00:38:01
 19170      10   4,535      45,350       569.9      33.3      00:37:51
 19356       8   4,535      36,280       575.5      33.6      00:37:37
 19581       7   4,535      31,745       582.7      34.1      00:37:14
 19791       5   4,535      22,675       589.5      34.4      00:36:55
 20021       7   4,535      31,745       596.9      34.9      00:36:31
 20203       4   4,535      18,140       602.5      35.2      00:36:18
 20385       9   4,535      40,815       608.0      35.5      00:36:06
 20512       7   4,535      31,745       611.9      35.8      00:36:03
 20640       6   4,535      27,210       615.9      36.0      00:35:59
 20817       9   4,535      40,815       621.4      36.3      00:35:47
 20990      10   4,535      45,350       626.7      36.6      00:35:36
 21160       1   4,535       4,535       631.5      36.9      00:35:28
 21275       4   4,535      18,140       634.5      37.1      00:35:29
 21433       8   4,535      36,280       639.1      37.3      00:35:22
 21630       7   4,535      31,745       644.7      37.7      00:35:09
 21781       5   4,535      22,675       648.9      37.9      00:35:04
 21920       3   4,535      13,605       653.0      38.2      00:34:58
 22073       4   4,535      18,140       657.3      38.4      00:34:52
 22205       8   4,535      36,280       661.0      38.6      00:34:49
 22367       7   4,535      31,745       665.5      38.9      00:34:42
 22508      10   4,535      45,350       669.6      39.1      00:34:37
 22654       3   4,535      13,605       673.9      39.4      00:34:30
 22810       9   4,535      40,815       678.0      39.6      00:34:25
 23035       5   4,535      22,675       684.7      40.0      00:34:06
 23221       7   4,535      31,745       690.4      40.3      00:33:53
 23485       9   4,535      40,815       697.8      40.8      00:33:32
 23739       6   4,535      27,210       705.3      41.2      00:33:10
 24013      10   4,535      45,350       713.5      41.7      00:32:45
 24262       1   4,535       4,535       720.6      42.1      00:32:26
 24499      10   4,535      45,350       727.5      42.5      00:32:07
 24709       5   4,535      22,675       733.9      42.9      00:31:51
 24983      10   4,535      45,350       741.9      43.4      00:31:28
 25213       5   4,535      22,675       748.9      43.8      00:31:10
 25482       9   4,535      40,815       757.1      44.2      00:30:47
 25653       6   4,535      27,210       762.0      44.5      00:30:38
 25797       6   4,535      27,210       766.6      44.8      00:30:30
 25969       7   4,535      31,745       771.7      45.1      00:30:21
 26097       6   4,535      27,210       775.6      45.3      00:30:16
 26339       5   4,535      22,675       782.9      45.8      00:29:57
 26593       6   4,535      27,210       790.1      46.2      00:29:38
 26826      10   4,535      45,350       797.0      46.6      00:29:21
 27070       7   4,535      31,745       804.3      47.0      00:29:03
 27280       9   4,535      40,815       810.6      47.4      00:28:48
 27480       8   4,535      36,280       816.6      47.7      00:28:35
 27682       6   4,535      27,210       822.8      48.1      00:28:21
 27927       7   4,535      31,745       830.4      48.5      00:28:02
 28222       9   4,535      40,815       839.3      49.0      00:27:38
 28515       8   4,535      36,280       848.7      49.6      00:27:12
 28711      10   4,535      45,350       854.8      50.0      00:26:59
 28878       6   4,535      27,210       859.9      50.3      00:26:49
 29059      10   4,535      45,350       865.6      50.6      00:26:38
 29239      10   4,535      45,350       870.8      50.9      00:26:28
 29418      10   4,535      45,350       876.5      51.2      00:26:17
 29629       4   4,535      18,140       882.6      51.6      00:26:04
 29780       8   4,535      36,280       887.3      51.9      00:25:56
 29891       9   4,535      40,815       890.7      52.1      00:25:53
 30026       9   4,535      40,815       894.9      52.3      00:25:47
 30153       5   4,535      22,675       898.9      52.5      00:25:42
 30270       9   4,535      40,815       902.5      52.7      00:25:38
 30412       9   4,535      40,815       906.9      53.0      00:25:31
 30564       9   4,535      40,815       911.6      53.3      00:25:23
 30804      10   4,535      45,350       919.1      53.7      00:25:05
 31072       8   4,535      36,280       927.1      54.2      00:24:45
 31318       7   4,535      31,745       934.8      54.6      00:24:27
 31568       6   4,535      27,210       942.7      55.1      00:24:08
 31801       6   4,535      27,210       950.1      55.5      00:23:51
 32008       6   4,535      27,210       956.8      55.9      00:23:36
 32255       9   4,535      40,815       964.7      56.4      00:23:18
 32472       9   4,535      40,815       971.8      56.8      00:23:02
 32555       8   4,535      36,280       974.2      56.9      00:23:02
 32716       7   4,535      31,745       979.2      57.2      00:22:53
 32818       5   4,535      22,675       982.4      57.4      00:22:50
 32915       6   4,535      27,210       985.5      57.6      00:22:47
 33008       8   4,535      36,280       988.5      57.8      00:22:45
 33113       4   4,535      18,140       991.8      58.0      00:22:41
 33263       7   4,535      31,745       996.5      58.2      00:22:33
 33403       7   4,535      31,745     1,000.8      58.5      00:22:26
 33572       8   4,535      36,280     1,006.2      58.8      00:22:16
 33751       6   4,535      27,210     1,011.8      59.1      00:22:05
 33940       9   4,535      40,815     1,017.9      59.5      00:21:53
 34063       6   4,535      27,210     1,021.7      59.7      00:21:47
 34210       7   4,535      31,745     1,026.6      60.0      00:21:39
 34478       5   4,535      22,675     1,035.0      60.5      00:21:18
 34745      10   4,535      45,350     1,043.5      61.0      00:20:59
 34968       9   4,535      40,815     1,050.5      61.4      00:20:43
 35218       4   4,535      18,140     1,058.3      61.8      00:20:26
 35447       5   4,535      22,675     1,065.6      62.3      00:20:10
 35705       7   4,535      31,745     1,073.6      62.7      00:19:52
 35962      10   4,535      45,350     1,081.6      63.2      00:19:34
 36203       7   4,535      31,745     1,089.1      63.6      00:19:18
 36490       4   4,535      18,140     1,098.0      64.2      00:18:58
 36655       6   4,535      27,210     1,103.2      64.5      00:18:48
 36796       8   4,535      36,280     1,107.3      64.7      00:18:42
 36941       5   4,535      22,675     1,111.8      65.0      00:18:34
 37119       9   4,535      40,815     1,117.1      65.3      00:18:25
 37319       5   4,535      22,675     1,122.5      65.6      00:18:15
 37512       9   4,535      40,815     1,128.2      65.9      00:18:04
 37674       9   4,535      40,815     1,132.9      66.2      00:17:56
 37878       9   4,535      40,815     1,139.1      66.6      00:17:43
 38078       7   4,535      31,745     1,145.3      66.9      00:17:31
 38255       3   4,535      13,605     1,150.7      67.2      00:17:21
 38401       7   4,535      31,745     1,155.4      67.5      00:17:13
 38630       7   4,535      31,745     1,162.4      67.9      00:16:58
 38845       6   4,535      27,210     1,169.0      68.3      00:16:45
 38975      10   4,535      45,350     1,173.1      68.6      00:16:39
 39103       7   4,535      31,745     1,176.9      68.8      00:16:33
 39259       5   4,535      22,675     1,181.4      69.0      00:16:25
 39458       8   4,535      36,280     1,187.3      69.4      00:16:14
 39630       7   4,535      31,745     1,192.5      69.7      00:16:05
 39814       6   4,535      27,210     1,198.0      70.0      00:15:54
 40075       4   4,535      18,140     1,205.8      70.5      00:15:38
 40310       6   4,535      27,210     1,212.8      70.9      00:15:24
 40552       8   4,535      36,280     1,220.4      71.3      00:15:08
 40811       4   4,535      18,140     1,228.4      71.8      00:14:51
 40993       4   4,535      18,140     1,234.2      72.1      00:14:40
 41138       6   4,535      27,210     1,238.5      72.4      00:14:33
 41289      10   4,535      45,350     1,243.2      72.7      00:14:25
 41466       6   4,535      27,210     1,248.6      73.0      00:14:15
 41626       9   4,535      40,815     1,253.5      73.3      00:14:06
 41786       6   4,535      27,210     1,258.4      73.5      00:13:58
 41946       1   4,535       4,535     1,263.5      73.8      00:13:49
 42167       9   4,535      40,815     1,269.7      74.2      00:13:37
 42337       7   4,535      31,745     1,274.6      74.5      00:13:28
 42494       6   4,535      27,210     1,279.5      74.8      00:13:19
 42689       7   4,535      31,745     1,285.3      75.1      00:13:08
 42878       9   4,535      40,815     1,291.0      75.4      00:12:57
 43059       6   4,535      27,210     1,296.7      75.8      00:12:47
 43248       6   4,535      27,210     1,302.7      76.1      00:12:35
 43435       8   4,535      36,280     1,308.6      76.5      00:12:24
 43680       6   4,535      27,210     1,315.6      76.9      00:12:10
 43903       6   4,535      27,210     1,322.5      77.3      00:11:57
 44135       8   4,535      36,280     1,329.3      77.7      00:11:43
 44332       3   4,535      13,605     1,335.2      78.0      00:11:32
 44496       9   4,535      40,815     1,340.1      78.3      00:11:24
 44657       5   4,535      22,675     1,344.9      78.6      00:11:15
 44831       4   4,535      18,140     1,350.2      78.9      00:11:05
 45062       9   4,535      40,815     1,357.1      79.3      00:10:52
 45322       6   4,535      27,210     1,364.4      79.7      00:10:38
 45542       7   4,535      31,745     1,370.9      80.1      00:10:25
 45791       7   4,535      31,745     1,377.9      80.5      00:10:12
 45977       9   4,535      40,815     1,383.6      80.9      00:10:01
 46139       7   4,535      31,745     1,388.5      81.1      00:09:52
 46300       2   4,535       9,070     1,393.6      81.4      00:09:43
 46482       9   4,535      40,815     1,399.0      81.8      00:09:33
 46717       7   4,535      31,745     1,406.3      82.2      00:09:19
 46978       9   4,535      40,815     1,413.9      82.6      00:09:04
 47181       9   4,535      40,815     1,419.5      83.0      00:08:54
 47310      10   4,535      45,350     1,423.3      83.2      00:08:48
 47488       4   4,535      18,140     1,428.4      83.5      00:08:38
 47639       6   4,535      27,210     1,433.0      83.7      00:08:30
 47795       8   4,535      36,280     1,437.6      84.0      00:08:22
 47945       6   4,535      27,210     1,442.2      84.3      00:08:14
 48057      10   4,535      45,350     1,445.6      84.5      00:08:09
 48203       9   4,535      40,815     1,449.9      84.7      00:08:01
 48403       7   4,535      31,745     1,456.0      85.1      00:07:50
 48612       7   4,535      31,745     1,462.4      85.5      00:07:37
 48826      10   4,535      45,350     1,468.7      85.8      00:07:26
 48993       6   4,535      27,210     1,473.7      86.1      00:07:17
 49158      10   4,535      45,350     1,479.0      86.4      00:07:07
 49315       7   4,535      31,745     1,483.6      86.7      00:06:59
 49501       8   4,535      36,280     1,488.8      87.0      00:06:49
 49683       7   4,535      31,745     1,493.9      87.3      00:06:40
 49816       6   4,535      27,210     1,497.6      87.5      00:06:33
 49940       6   4,535      27,210     1,501.4      87.7      00:06:27
 50118       7   4,535      31,745     1,506.7      88.0      00:06:17
 50278       8   4,535      36,280     1,511.2      88.3      00:06:09
 50462       4   4,535      18,140     1,516.5      88.6      00:05:59
 50651       6   4,535      27,210     1,522.3      89.0      00:05:49
 50832      10   4,535      45,350     1,527.9      89.3      00:05:38
 50975       6   4,535      27,210     1,532.5      89.6      00:05:30
 51151       5   4,535      22,675     1,537.8      89.9      00:05:20
 51371       8   4,535      36,280     1,544.5      90.3      00:05:07
 51673       9   4,535      40,815     1,554.1      90.8      00:04:49
 51957       8   4,535      36,280     1,562.9      91.3      00:04:32
 52234       2   4,535       9,070     1,572.0      91.9      00:04:15
 52509       8   4,535      36,280     1,581.0      92.4      00:03:58
 52776       6   4,535      27,210     1,589.9      92.9      00:03:41
 53058       9   4,535      40,815     1,598.9      93.4      00:03:24
 53338       6   4,535      27,210     1,607.6      93.9      00:03:08
 53618       4   4,535      18,140     1,616.4      94.5      00:02:52
 53804       7   4,535      31,745     1,622.2      94.8      00:02:41
 53999       2   4,535       9,070     1,628.0      95.1      00:02:31
 54223       5   4,535      22,675     1,634.8      95.5      00:02:18
 54380       8   4,535      36,280     1,639.4      95.8      00:02:10
 54547       9   4,535      40,815     1,643.9      96.1      00:02:02
 54735       8   4,535      36,280     1,649.7      96.4      00:01:51
 54936       6   4,535      27,210     1,655.7      96.8      00:01:41
 55112       5   4,535      22,675     1,660.9      97.1      00:01:31
 55359       8   4,535      36,280     1,667.8      97.5      00:01:18
 55541       7   4,535      31,745     1,673.0      97.8      00:01:09
 55703       8   4,535      36,280     1,678.0      98.1      00:01:00
 55857       4   4,535      18,140     1,682.8      98.3      00:00:51
 56009       7   4,535      31,745     1,687.5      98.6      00:00:43
 56147       7   4,535      31,745     1,691.7      98.9      00:00:35
 56284      10   4,535      45,350     1,696.0      99.1      00:00:28
 56450       6   4,535      27,210     1,701.4      99.4      00:00:18
 56720       7   4,535      31,745     1,709.8      99.9      00:00:03

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,535     
Bases * Neighbors  (M)  = 1,711.2        Number of regions         = 56,767    
Computed distances (M)  = 1,711.16       Total run time (seconds)  = 3112.136
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A500_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
