
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A300_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A300_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A300_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   340       8   4,335      34,680         8.4       0.5      00:32:11
   713       5   4,335      21,675        18.0       1.1      00:29:58
  1080       6   4,335      26,010        28.0       1.7      00:28:44
  1443       8   4,335      34,680        38.4       2.3      00:27:47
  1813       3   4,335      13,005        48.7       3.0      00:27:11
  2185      10   4,335      43,350        59.0       3.6      00:26:48
  2561       9   4,335      39,015        69.2       4.2      00:26:28
  2936      10   4,335      43,350        79.9       4.9      00:26:02
  3303       8   4,335      34,680        90.5       5.5      00:25:40
  3667       5   4,335      21,675       100.9       6.2      00:25:25
  3998       7   4,335      30,345       109.9       6.7      00:25:30
  4290       5   4,335      21,675       117.8       7.2      00:25:50
  4561       7   4,335      30,345       125.3       7.7      00:26:10
  4836       3   4,335      13,005       133.2       8.1      00:26:23
  5114       8   4,335      34,680       141.0       8.6      00:26:34
  5375      10   4,335      43,350       148.5       9.1      00:26:46
  5631       8   4,335      34,680       155.0       9.5      00:27:08
  5893      10   4,335      43,350       162.1       9.9      00:27:20
  6156       7   4,335      30,345       169.6      10.4      00:27:26
  6428       8   4,335      34,680       177.0      10.8      00:27:33
  6705       5   4,335      21,675       184.6      11.3      00:27:35
  6972       9   4,335      39,015       192.0      11.7      00:27:39
  7297       6   4,335      26,010       200.8      12.3      00:27:28
  7607       8   4,335      34,680       209.8      12.8      00:27:15
  7924       8   4,335      34,680       219.0      13.4      00:27:02
  8233      10   4,335      43,350       228.2      13.9      00:26:48
  8528       5   4,335      21,675       237.0      14.5      00:26:38
  8833       6   4,335      26,010       245.9      15.0      00:26:27
  9140       9   4,335      39,015       255.0      15.6      00:26:14
  9367       9   4,335      39,015       261.7      16.0      00:26:19
  9596       6   4,335      26,010       268.7      16.4      00:26:22
  9867       2   4,335       8,670       276.7      16.9      00:26:16
 10128       6   4,335      26,010       283.7      17.3      00:26:17
 10375       9   4,335      39,015       290.4      17.7      00:26:19
 10648       6   4,335      26,010       297.9      18.2      00:26:16
 10942       7   4,335      30,345       306.3      18.7      00:26:07
 11196       9   4,335      39,015       313.4      19.1      00:26:06
 11417       9   4,335      39,015       319.6      19.5      00:26:09
 11644       8   4,335      34,680       326.0      19.9      00:26:11
 11905       8   4,335      34,680       333.5      20.4      00:26:06
 12152       7   4,335      30,345       340.6      20.8      00:26:03
 12433       9   4,335      39,015       348.4      21.3      00:25:56
 12770       3   4,335      13,005       357.8      21.9      00:25:40
 13090      10   4,335      43,350       366.7      22.4      00:25:27
 13416       9   4,335      39,015       376.0      23.0      00:25:12
 13683       8   4,335      34,680       384.2      23.5      00:25:03
 13921       9   4,335      39,015       390.8      23.9      00:25:01
 14203       9   4,335      39,015       398.9      24.4      00:24:53
 14478       4   4,335      17,340       407.0      24.9      00:24:43
 14766       7   4,335      30,345       415.2      25.4      00:24:34
 15075       3   4,335      13,005       424.3      25.9      00:24:20
 15401       7   4,335      30,345       434.0      26.5      00:24:04
 15733       9   4,335      39,015       443.3      27.1      00:23:49
 16065       8   4,335      34,680       453.4      27.7      00:23:32
 16392       4   4,335      17,340       463.2      28.3      00:23:16
 16680      10   4,335      43,350       471.5      28.8      00:23:06
 16945       9   4,335      39,015       479.1      29.3      00:22:60
 17192       6   4,335      26,010       486.2      29.7      00:22:55
 17429       9   4,335      39,015       493.3      30.1      00:22:50
 17656       9   4,335      39,015       500.3      30.6      00:22:46
 17957       4   4,335      17,340       508.8      31.1      00:22:35
 18254       8   4,335      34,680       517.6      31.6      00:22:23
 18549       8   4,335      34,680       525.8      32.1      00:22:14
 18783       9   4,335      39,015       532.8      32.6      00:22:09
 19029       5   4,335      21,675       540.2      33.0      00:22:02
 19282       6   4,335      26,010       547.7      33.5      00:21:55
 19587       6   4,335      26,010       556.9      34.0      00:21:42
 19922       6   4,335      26,010       567.1      34.6      00:21:25
 20244       4   4,335      17,340       576.8      35.2      00:21:10
 20544       8   4,335      34,680       585.6      35.8      00:20:59
 20761      10   4,335      43,350       592.0      36.2      00:20:55
 20975       8   4,335      34,680       598.4      36.6      00:20:52
 21239       1   4,335       4,335       605.4      37.0      00:20:46
 21502       6   4,335      26,010       612.6      37.4      00:20:39
 21790       4   4,335      17,340       620.2      37.9      00:20:32
 22056       5   4,335      21,675       627.7      38.3      00:20:24
 22319       5   4,335      21,675       634.7      38.8      00:20:18
 22585      10   4,335      43,350       642.0      39.2      00:20:11
 22864       8   4,335      34,680       649.3      39.7      00:20:04
 23136       7   4,335      30,345       657.1      40.1      00:19:55
 23412       9   4,335      39,015       665.1      40.6      00:19:46
 23694       5   4,335      21,675       672.7      41.1      00:19:38
 23963      10   4,335      43,350       680.4      41.6      00:19:29
 24276       5   4,335      21,675       689.1      42.1      00:19:18
 24605       8   4,335      34,680       698.3      42.7      00:19:05
 24929      10   4,335      43,350       707.5      43.2      00:18:52
 25240       6   4,335      26,010       716.5      43.8      00:18:40
 25562       6   4,335      26,010       725.8      44.3      00:18:27
 25806       6   4,335      26,010       732.7      44.8      00:18:20
 26047       5   4,335      21,675       739.7      45.2      00:18:14
 26318       6   4,335      26,010       747.5      45.7      00:18:05
 26631       4   4,335      17,340       756.0      46.2      00:17:54
 26927       8   4,335      34,680       764.5      46.7      00:17:43
 27182       8   4,335      34,680       771.8      47.2      00:17:36
 27421      10   4,335      43,350       778.6      47.6      00:17:29
 27680       7   4,335      30,345       786.1      48.0      00:17:21
 27966       8   4,335      34,680       794.6      48.5      00:17:10
 28288       8   4,335      34,680       803.9      49.1      00:16:58
 28607       8   4,335      34,680       813.7      49.7      00:16:44
 28851      10   4,335      43,350       820.8      50.1      00:16:36
 29101       8   4,335      34,680       828.3      50.6      00:16:28
 29394       7   4,335      30,345       836.7      51.1      00:16:17
 29683       6   4,335      26,010       844.9      51.6      00:16:07
 29919      10   4,335      43,350       852.0      52.0      00:16:00
 30169       7   4,335      30,345       859.3      52.5      00:15:52
 30413       7   4,335      30,345       866.4      52.9      00:15:45
 30679       8   4,335      34,680       874.4      53.4      00:15:35
 31014       5   4,335      21,675       884.3      54.0      00:15:21
 31344       7   4,335      30,345       894.0      54.6      00:15:08
 31683       8   4,335      34,680       904.2      55.2      00:14:53
 31999       5   4,335      21,675       913.9      55.8      00:14:40
 32308       7   4,335      30,345       923.4      56.4      00:14:27
 32584       7   4,335      30,345       931.7      56.9      00:14:17
 32803       7   4,335      30,345       938.3      57.3      00:14:10
 33038       6   4,335      26,010       945.4      57.8      00:14:03
 33284       3   4,335      13,005       952.7      58.2      00:13:55
 33556      10   4,335      43,350       960.9      58.7      00:13:45
 33842       4   4,335      17,340       969.5      59.2      00:13:34
 34122       9   4,335      39,015       978.1      59.8      00:13:23
 34446       9   4,335      39,015       988.0      60.4      00:13:10
 34792       6   4,335      26,010       998.4      61.0      00:12:55
 35132      10   4,335      43,350     1,008.6      61.6      00:12:42
 35469       8   4,335      34,680     1,018.9      62.2      00:12:28
 35824       5   4,335      21,675     1,029.3      62.9      00:12:13
 36162       5   4,335      21,675     1,039.5      63.5      00:11:60
 36521       5   4,335      21,675     1,050.2      64.2      00:11:45
 36772       5   4,335      21,675     1,057.4      64.6      00:11:37
 37037       4   4,335      17,340     1,065.1      65.1      00:11:29
 37305       9   4,335      39,015     1,072.4      65.5      00:11:20
 37551      10   4,335      43,350     1,079.2      65.9      00:11:13
 37794      10   4,335      43,350     1,086.1      66.4      00:11:06
 38025       5   4,335      21,675     1,092.7      66.8      00:10:59
 38261      10   4,335      43,350     1,099.8      67.2      00:10:51
 38501       9   4,335      39,015     1,107.0      67.6      00:10:43
 38825       7   4,335      30,345     1,116.5      68.2      00:10:30
 39098       8   4,335      34,680     1,124.5      68.7      00:10:21
 39352       5   4,335      21,675     1,131.7      69.1      00:10:13
 39630       9   4,335      39,015     1,139.6      69.6      00:10:03
 39916       5   4,335      21,675     1,147.7      70.1      00:09:54
 40248       8   4,335      34,680     1,157.3      70.7      00:09:41
 40586       5   4,335      21,675     1,167.2      71.3      00:09:29
 40926       7   4,335      30,345     1,177.2      71.9      00:09:16
 41155       4   4,335      17,340     1,184.1      72.3      00:09:08
 41410       5   4,335      21,675     1,191.4      72.8      00:08:59
 41662       9   4,335      39,015     1,198.9      73.2      00:08:51
 41918      10   4,335      43,350     1,206.5      73.7      00:08:42
 42173       6   4,335      26,010     1,213.5      74.1      00:08:34
 42441       9   4,335      39,015     1,221.2      74.6      00:08:25
 42702       7   4,335      30,345     1,228.6      75.1      00:08:16
 42960       5   4,335      21,675     1,236.1      75.5      00:08:07
 43211       7   4,335      30,345     1,243.8      76.0      00:07:58
 43478       8   4,335      34,680     1,251.8      76.5      00:07:49
 43733       8   4,335      34,680     1,258.7      76.9      00:07:41
 43997       6   4,335      26,010     1,266.5      77.4      00:07:31
 44286       9   4,335      39,015     1,274.8      77.9      00:07:21
 44589       6   4,335      26,010     1,283.3      78.4      00:07:11
 44878      10   4,335      43,350     1,291.7      78.9      00:07:00
 45172       6   4,335      26,010     1,300.0      79.4      00:06:50
 45434       5   4,335      21,675     1,307.1      79.9      00:06:42
 45671      10   4,335      43,350     1,313.5      80.2      00:06:35
 45934       7   4,335      30,345     1,320.9      80.7      00:06:26
 46172       7   4,335      30,345     1,327.9      81.1      00:06:18
 46403       9   4,335      39,015     1,334.8      81.5      00:06:10
 46669      10   4,335      43,350     1,342.5      82.0      00:06:00
 46972       5   4,335      21,675     1,351.3      82.6      00:05:49
 47230       8   4,335      34,680     1,358.1      83.0      00:05:41
 47460       7   4,335      30,345     1,364.5      83.4      00:05:34
 47680       5   4,335      21,675     1,370.7      83.7      00:05:27
 47897       6   4,335      26,010     1,376.8      84.1      00:05:20
 48109      10   4,335      43,350     1,383.1      84.5      00:05:13
 48331       7   4,335      30,345     1,389.5      84.9      00:05:05
 48566       5   4,335      21,675     1,396.3      85.3      00:04:57
 48834      10   4,335      43,350     1,403.9      85.8      00:04:48
 49068      10   4,335      43,350     1,410.6      86.2      00:04:40
 49289       9   4,335      39,015     1,417.2      86.6      00:04:32
 49545       8   4,335      34,680     1,424.1      87.0      00:04:23
 49790       6   4,335      26,010     1,430.6      87.4      00:04:16
 50036       5   4,335      21,675     1,437.6      87.8      00:04:07
 50274       5   4,335      21,675     1,444.3      88.2      00:03:59
 50495       4   4,335      17,340     1,450.3      88.6      00:03:52
 50741       8   4,335      34,680     1,457.4      89.0      00:03:43
 51008       7   4,335      30,345     1,465.5      89.5      00:03:33
 51306       8   4,335      34,680     1,474.1      90.1      00:03:22
 51594       8   4,335      34,680     1,482.6      90.6      00:03:12
 51873       7   4,335      30,345     1,491.1      91.1      00:03:01
 52127       6   4,335      26,010     1,498.7      91.6      00:02:52
 52409       6   4,335      26,010     1,507.5      92.1      00:02:41
 52755       9   4,335      39,015     1,518.6      92.8      00:02:27
 53105       6   4,335      26,010     1,529.3      93.4      00:02:13
 53482       6   4,335      26,010     1,540.6      94.1      00:01:59
 53842       4   4,335      17,340     1,551.3      94.8      00:01:46
 54154       7   4,335      30,345     1,560.3      95.3      00:01:34
 54480       7   4,335      30,345     1,569.4      95.9      00:01:23
 54896       5   4,335      21,675     1,581.1      96.6      00:01:09
 55258       6   4,335      26,010     1,591.4      97.2      00:00:56
 55608       6   4,335      26,010     1,600.7      97.8      00:00:44
 55925       6   4,335      26,010     1,610.2      98.4      00:00:33
 56300       8   4,335      34,680     1,621.2      99.0      00:00:19
 56658       9   4,335      39,015     1,632.1      99.7      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,335     
Bases * Neighbors  (M)  = 1,636.9        Number of regions         = 56,821    
Computed distances (M)  = 1,636.86       Total run time (seconds)  = 2003.905
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed129.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A300_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
