
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A900_randomseed42.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A900_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A900_randomseed42.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   253       8   4,935      39,480         7.1       0.4      00:43:31
   535       4   4,935      19,740        15.3       0.8      00:40:13
   794       9   4,935      44,415        23.4       1.3      00:39:22
  1054       6   4,935      29,610        31.2       1.7      00:39:09
  1298       7   4,935      34,545        39.1       2.1      00:38:58
  1573       5   4,935      24,675        48.1       2.6      00:37:47
  1846       6   4,935      29,610        56.7       3.0      00:37:12
  2143       5   4,935      24,675        66.0       3.5      00:36:22
  2413       8   4,935      39,480        74.5       4.0      00:36:03
  2697       7   4,935      34,545        83.4       4.5      00:35:37
  2970       6   4,935      29,610        92.0       4.9      00:35:20
  3250       4   4,935      19,740       101.5       5.5      00:34:45
  3517       8   4,935      39,480       110.3       5.9      00:34:29
  3766      10   4,935      49,350       118.4       6.4      00:34:25
  3987       5   4,935      24,675       125.0       6.7      00:34:48
  4180       9   4,935      44,415       131.2       7.0      00:35:16
  4397       7   4,935      34,545       137.5       7.4      00:35:37
  4593       6   4,935      29,610       143.9       7.7      00:35:53
  4809       5   4,935      24,675       151.0       8.1      00:35:57
  5008      10   4,935      49,350       157.4       8.5      00:36:11
  5219       4   4,935      19,740       164.1       8.8      00:36:17
  5414       9   4,935      44,415       170.5       9.2      00:36:27
  5629       7   4,935      34,545       176.6       9.5      00:36:40
  5834       9   4,935      44,415       183.0       9.8      00:36:47
  6048       9   4,935      44,415       190.0      10.2      00:36:44
  6267      10   4,935      49,350       196.9      10.6      00:36:44
  6481       1   4,935       4,935       203.5      10.9      00:36:45
  6683       5   4,935      24,675       209.7      11.3      00:36:51
  6892       7   4,935      34,545       216.3      11.6      00:36:51
  7146       2   4,935       9,870       224.0      12.0      00:36:39
  7390       7   4,935      34,545       231.9      12.5      00:36:23
  7625       7   4,935      34,545       239.5      12.9      00:36:12
  7858       7   4,935      34,545       247.2      13.3      00:35:60
  8075       7   4,935      34,545       254.6      13.7      00:35:51
  8298       9   4,935      44,415       262.2      14.1      00:35:40
  8530       8   4,935      39,480       270.1      14.5      00:35:25
  8791       8   4,935      39,480       278.8      15.0      00:35:05
  9054       5   4,935      24,675       287.6      15.4      00:34:44
  9267      10   4,935      49,350       294.9      15.8      00:34:37
  9432      10   4,935      49,350       300.4      16.1      00:34:44
  9637       7   4,935      34,545       307.6      16.5      00:34:36
  9851       2   4,935       9,870       314.6      16.9      00:34:30
 10049       8   4,935      39,480       321.0      17.2      00:34:29
 10275       6   4,935      29,610       327.6      17.6      00:34:25
 10464       5   4,935      24,675       333.7      17.9      00:34:25
 10696       7   4,935      34,545       341.0      18.3      00:34:16
 10928       6   4,935      29,610       348.4      18.7      00:34:06
 11167       8   4,935      39,480       356.0      19.1      00:33:55
 11345       3   4,935      14,805       361.7      19.4      00:33:57
 11543       5   4,935      24,675       368.1      19.8      00:33:54
 11752       9   4,935      44,415       374.7      20.1      00:33:49
 11941      10   4,935      49,350       380.9      20.5      00:33:46
 12142       6   4,935      29,610       387.6      20.8      00:33:41
 12376       5   4,935      24,675       395.0      21.2      00:33:30
 12666       8   4,935      39,480       404.4      21.7      00:33:07
 12982      10   4,935      49,350       414.1      22.2      00:32:42
 13263       7   4,935      34,545       423.2      22.7      00:32:22
 13532       9   4,935      44,415       432.5      23.2      00:32:01
 13732       2   4,935       9,870       439.1      23.6      00:31:56
 13922       7   4,935      34,545       445.2      23.9      00:31:54
 14162       6   4,935      29,610       453.0      24.3      00:31:42
 14395       2   4,935       9,870       460.8      24.7      00:31:30
 14621       5   4,935      24,675       468.2      25.1      00:31:20
 14873       6   4,935      29,610       476.5      25.6      00:31:05
 15167       9   4,935      44,415       486.5      26.1      00:30:42
 15473      10   4,935      49,350       496.5      26.7      00:30:19
 15770       9   4,935      44,415       506.3      27.2      00:29:58
 16070       7   4,935      34,545       516.7      27.7      00:29:35
 16349      10   4,935      49,350       526.1      28.3      00:29:16
 16617      10   4,935      49,350       534.9      28.7      00:29:01
 16850       5   4,935      24,675       542.6      29.1      00:28:50
 17059       4   4,935      19,740       549.5      29.5      00:28:43
 17257       8   4,935      39,480       556.0      29.9      00:28:39
 17439      10   4,935      49,350       562.3      30.2      00:28:35
 17638       9   4,935      44,415       569.2      30.6      00:28:27
 17880       8   4,935      39,480       576.9      31.0      00:28:17
 18164       3   4,935      14,805       586.5      31.5      00:27:59
 18469      10   4,935      49,350       596.1      32.0      00:27:40
 18658       8   4,935      39,480       602.6      32.4      00:27:35
 18863       5   4,935      24,675       609.5      32.7      00:27:28
 19088      10   4,935      49,350       617.3      33.2      00:27:17
 19335       5   4,935      24,675       625.6      33.6      00:27:04
 19619      10   4,935      49,350       635.3      34.1      00:26:47
 19912       8   4,935      39,480       645.6      34.7      00:26:26
 20201       6   4,935      29,610       655.6      35.2      00:26:08
 20490       8   4,935      39,480       665.1      35.7      00:25:51
 20687       8   4,935      39,480       671.8      36.1      00:25:45
 20857       8   4,935      39,480       677.5      36.4      00:25:42
 21050       8   4,935      39,480       683.8      36.7      00:25:37
 21254       8   4,935      39,480       690.0      37.1      00:25:33
 21457      10   4,935      49,350       696.3      37.4      00:25:27
 21642       7   4,935      34,545       702.0      37.7      00:25:24
 21861       8   4,935      39,480       708.8      38.1      00:25:17
 22035       9   4,935      44,415       714.3      38.4      00:25:14
 22227       9   4,935      44,415       720.0      38.7      00:25:10
 22414      10   4,935      49,350       725.7      39.0      00:25:07
 22604       5   4,935      24,675       731.8      39.3      00:25:02
 22803       8   4,935      39,480       737.5      39.6      00:24:58
 23058       7   4,935      34,545       745.9      40.1      00:24:45
 23322       5   4,935      24,675       754.5      40.5      00:24:31
 23600       9   4,935      44,415       763.0      41.0      00:24:19
 23865       7   4,935      34,545       771.7      41.4      00:24:05
 24165       8   4,935      39,480       781.0      41.9      00:23:49
 24442       9   4,935      44,415       789.7      42.4      00:23:36
 24708       9   4,935      44,415       798.7      42.9      00:23:21
 24971       6   4,935      29,610       806.9      43.3      00:23:10
 25242       6   4,935      29,610       815.9      43.8      00:22:55
 25513       7   4,935      34,545       824.9      44.3      00:22:41
 25716      10   4,935      49,350       831.4      44.6      00:22:35
 25902       9   4,935      44,415       837.7      45.0      00:22:29
 26068       9   4,935      44,415       843.1      45.3      00:22:25
 26282       2   4,935       9,870       850.2      45.7      00:22:16
 26517       7   4,935      34,545       857.4      46.0      00:22:07
 26783      10   4,935      49,350       866.0      46.5      00:21:54
 27035       8   4,935      39,480       874.2      46.9      00:21:43
 27235       6   4,935      29,610       880.7      47.3      00:21:36
 27440       6   4,935      29,610       887.4      47.7      00:21:28
 27653       6   4,935      29,610       894.4      48.0      00:21:20
 27898       8   4,935      39,480       902.7      48.5      00:21:08
 28182       5   4,935      24,675       912.0      49.0      00:20:53
 28415       7   4,935      34,545       919.9      49.4      00:20:42
 28653       7   4,935      34,545       928.1      49.8      00:20:31
 28809       9   4,935      44,415       933.5      50.1      00:20:27
 28992       7   4,935      34,545       939.6      50.5      00:20:20
 29210      10   4,935      49,350       946.6      50.8      00:20:12
 29448       7   4,935      34,545       954.8      51.3      00:20:00
 29715       9   4,935      44,415       963.5      51.7      00:19:47
 29928       9   4,935      44,415       970.5      52.1      00:19:39
 30127       9   4,935      44,415       977.2      52.5      00:19:31
 30352       7   4,935      34,545       984.7      52.9      00:19:21
 30573       9   4,935      44,415       992.4      53.3      00:19:11
 30872       8   4,935      39,480     1,002.4      53.8      00:18:55
 31169       9   4,935      44,415     1,012.2      54.4      00:18:39
 31473       6   4,935      29,610     1,022.7      54.9      00:18:23
 31727       5   4,935      24,675     1,031.3      55.4      00:18:10
 32004       9   4,935      44,415     1,041.0      55.9      00:17:55
 32267       6   4,935      29,610     1,050.2      56.4      00:17:42
 32517       9   4,935      44,415     1,058.9      56.9      00:17:29
 32688       5   4,935      24,675     1,064.6      57.2      00:17:24
 32854       7   4,935      34,545     1,070.3      57.5      00:17:18
 33027      10   4,935      49,350     1,076.3      57.8      00:17:12
 33247       7   4,935      34,545     1,083.8      58.2      00:17:02
 33487       9   4,935      44,415     1,091.9      58.6      00:16:51
 33681       4   4,935      19,740     1,098.7      59.0      00:16:43
 33925       6   4,935      29,610     1,107.1      59.5      00:16:31
 34170       7   4,935      34,545     1,115.7      59.9      00:16:19
 34438       7   4,935      34,545     1,124.8      60.4      00:16:06
 34709      10   4,935      49,350     1,134.2      60.9      00:15:52
 35030       6   4,935      29,610     1,145.2      61.5      00:15:35
 35284       8   4,935      39,480     1,154.0      62.0      00:15:23
 35543       8   4,935      39,480     1,162.8      62.4      00:15:10
 35826      10   4,935      49,350     1,172.3      63.0      00:14:57
 36114       9   4,935      44,415     1,182.2      63.5      00:14:42
 36406       6   4,935      29,610     1,192.2      64.0      00:14:27
 36625       4   4,935      19,740     1,199.6      64.4      00:14:18
 36833       7   4,935      34,545     1,206.2      64.8      00:14:10
 37074       8   4,935      39,480     1,214.1      65.2      00:13:60
 37298       7   4,935      34,545     1,220.9      65.6      00:13:52
 37516       8   4,935      39,480     1,227.8      65.9      00:13:43
 37713       6   4,935      29,610     1,234.1      66.3      00:13:36
 37905       9   4,935      44,415     1,240.5      66.6      00:13:29
 38136       4   4,935      19,740     1,248.2      67.0      00:13:19
 38377      10   4,935      49,350     1,256.5      67.5      00:13:08
 38676      10   4,935      49,350     1,266.5      68.0      00:12:53
 38934       7   4,935      34,545     1,275.1      68.5      00:12:41
 39104       4   4,935      19,740     1,280.8      68.8      00:12:35
 39285       7   4,935      34,545     1,286.5      69.1      00:12:29
 39519       5   4,935      24,675     1,294.1      69.5      00:12:19
 39790       9   4,935      44,415     1,302.8      70.0      00:12:07
 40100       8   4,935      39,480     1,313.0      70.5      00:11:53
 40367       9   4,935      44,415     1,321.8      71.0      00:11:41
 40637       7   4,935      34,545     1,330.9      71.5      00:11:28
 40913       8   4,935      39,480     1,340.3      72.0      00:11:15
 41094       5   4,935      24,675     1,346.3      72.3      00:11:08
 41298       5   4,935      24,675     1,353.1      72.7      00:10:60
 41519       5   4,935      24,675     1,360.5      73.1      00:10:51
 41738       2   4,935       9,870     1,367.8      73.5      00:10:41
 41947       5   4,935      24,675     1,374.9      73.8      00:10:32
 42091       5   4,935      24,675     1,379.3      74.1      00:10:28
 42270       7   4,935      34,545     1,384.8      74.4      00:10:22
 42433       7   4,935      34,545     1,390.4      74.7      00:10:16
 42600      10   4,935      49,350     1,395.7      75.0      00:10:10
 42788       5   4,935      24,675     1,401.8      75.3      00:10:02
 42960      10   4,935      49,350     1,407.6      75.6      00:09:56
 43095       7   4,935      34,545     1,412.3      75.8      00:09:51
 43232       7   4,935      34,545     1,417.1      76.1      00:09:46
 43392       9   4,935      44,415     1,422.6      76.4      00:09:39
 43614       8   4,935      39,480     1,429.6      76.8      00:09:30
 43865       7   4,935      34,545     1,437.8      77.2      00:09:19
 44130       8   4,935      39,480     1,446.3      77.7      00:09:08
 44332       3   4,935      14,805     1,452.9      78.0      00:08:59
 44566       8   4,935      39,480     1,460.6      78.4      00:08:49
 44783       5   4,935      24,675     1,467.7      78.8      00:08:40
 45026       9   4,935      44,415     1,475.7      79.3      00:08:29
 45287      10   4,935      49,350     1,483.8      79.7      00:08:18
 45501       7   4,935      34,545     1,490.5      80.0      00:08:10
 45757       7   4,935      34,545     1,498.3      80.5      00:07:59
 45974       6   4,935      29,610     1,505.5      80.9      00:07:50
 46203       8   4,935      39,480     1,513.2      81.3      00:07:40
 46432       9   4,935      44,415     1,520.7      81.7      00:07:30
 46580       6   4,935      29,610     1,525.8      81.9      00:07:24
 46867       7   4,935      34,545     1,535.4      82.5      00:07:11
 47071       9   4,935      44,415     1,541.5      82.8      00:07:03
 47263       9   4,935      44,415     1,547.3      83.1      00:06:56
 47402      10   4,935      49,350     1,551.8      83.3      00:06:51
 47565       5   4,935      24,675     1,556.9      83.6      00:06:45
 47727       8   4,935      39,480     1,562.3      83.9      00:06:38
 47905       9   4,935      44,415     1,568.0      84.2      00:06:31
 48117       7   4,935      34,545     1,575.0      84.6      00:06:22
 48373       6   4,935      29,610     1,583.5      85.0      00:06:10
 48689       5   4,935      24,675     1,593.9      85.6      00:05:56
 48919       5   4,935      24,675     1,601.4      86.0      00:05:46
 49157       7   4,935      34,545     1,609.4      86.4      00:05:35
 49374       4   4,935      19,740     1,616.1      86.8      00:05:26
 49605       4   4,935      19,740     1,623.2      87.2      00:05:17
 49825      10   4,935      49,350     1,630.1      87.5      00:05:08
 50034       7   4,935      34,545     1,636.9      87.9      00:04:59
 50282       9   4,935      44,415     1,644.6      88.3      00:04:49
 50532       9   4,935      44,415     1,652.7      88.8      00:04:38
 50808       5   4,935      24,675     1,661.9      89.2      00:04:26
 51039      10   4,935      49,350     1,670.0      89.7      00:04:15
 51262       7   4,935      34,545     1,677.1      90.1      00:04:05
 51491       9   4,935      44,415     1,684.8      90.5      00:03:55
 51765       7   4,935      34,545     1,694.4      91.0      00:03:42
 52074       6   4,935      29,610     1,704.9      91.6      00:03:28
 52366       8   4,935      39,480     1,715.3      92.1      00:03:14
 52593      10   4,935      49,350     1,723.5      92.6      00:03:03
 52892       8   4,935      39,480     1,734.2      93.1      00:02:49
 53119       7   4,935      34,545     1,741.9      93.5      00:02:38
 53419       7   4,935      34,545     1,752.2      94.1      00:02:25
 53693       7   4,935      34,545     1,761.5      94.6      00:02:12
 53908       8   4,935      39,480     1,768.6      95.0      00:02:03
 54160       7   4,935      34,545     1,776.8      95.4      00:01:52
 54393       9   4,935      44,415     1,784.4      95.8      00:01:42
 54608       9   4,935      44,415     1,791.0      96.2      00:01:34
 54898       7   4,935      34,545     1,800.4      96.7      00:01:21
 55158       7   4,935      34,545     1,808.8      97.1      00:01:10
 55414       8   4,935      39,480     1,816.7      97.6      00:00:60
 55646       5   4,935      24,675     1,824.2      98.0      00:00:50
 55867       8   4,935      39,480     1,831.5      98.4      00:00:40
 56142       8   4,935      39,480     1,840.7      98.9      00:00:28
 56391       7   4,935      34,545     1,849.3      99.3      00:00:17
 56669       4   4,935      19,740     1,858.8      99.8      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 2446.375
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A900_randomseed42.csv save
> d

. 
. cap log close

. 
end of do-file
