
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl.dta /export/storage_covidvaccine/Resul
> t/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchools_dis
> t_total_10000_5_4q_mnl.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   599       2   4,035       8,070        14.0       0.9      00:17:56
  1263       7   4,035      28,245        30.9       2.0      00:16:08
  1927       7   4,035      28,245        48.1       3.2      00:15:20
  2601      10   4,035      40,350        65.5       4.3      00:14:51
  3227      10   4,035      40,350        82.1       5.4      00:14:39
  3847       7   4,035      28,245        98.7       6.5      00:14:27
  4314       8   4,035      32,280       110.2       7.2      00:14:59
  4736       6   4,035      24,210       121.5       8.0      00:15:24
  5199       9   4,035      36,315       133.5       8.8      00:15:38
  5596      10   4,035      40,350       143.5       9.4      00:16:03
  5968       6   4,035      24,210       153.0      10.0      00:16:27
  6368       7   4,035      28,245       163.2      10.7      00:16:41
  6844       7   4,035      28,245       175.4      11.5      00:16:40
  7374       6   4,035      24,210       189.1      12.4      00:16:29
  7906       7   4,035      28,245       203.3      13.3      00:16:15
  8406      10   4,035      40,350       217.2      14.3      00:16:03
  8935       6   4,035      24,210       231.8      15.2      00:15:49
  9338       4   4,035      16,140       242.8      15.9      00:15:50
  9681       6   4,035      24,210       252.6      16.6      00:15:57
 10021       4   4,035      16,140       261.5      17.2      00:16:06
 10386      10   4,035      40,350       270.6      17.8      00:16:13
 10767       9   4,035      36,315       280.4      18.4      00:16:16
 11175      10   4,035      40,350       291.1      19.1      00:16:15
 11473       6   4,035      24,210       299.0      19.6      00:16:24
 11824       6   4,035      24,210       308.2      20.2      00:16:27
 12163       9   4,035      36,315       317.3      20.8      00:16:30
 12572       9   4,035      36,315       328.0      21.5      00:16:25
 13072       7   4,035      28,245       340.9      22.4      00:16:13
 13530       7   4,035      28,245       353.4      23.2      00:16:01
 13850       8   4,035      32,280       361.9      23.8      00:16:04
 14213       8   4,035      32,280       371.6      24.4      00:16:02
 14582       7   4,035      28,245       381.6      25.0      00:15:59
 14974      10   4,035      40,350       392.2      25.7      00:15:53
 15499       8   4,035      32,280       406.4      26.7      00:15:36
 15990      10   4,035      40,350       419.9      27.6      00:15:21
 16497       8   4,035      32,280       434.2      28.5      00:15:05
 16870       9   4,035      36,315       444.0      29.1      00:15:01
 17178       8   4,035      32,280       452.2      29.7      00:15:02
 17489       5   4,035      20,175       461.0      30.3      00:15:00
 17836       4   4,035      16,140       470.3      30.9      00:14:57
 18222      10   4,035      40,350       481.0      31.6      00:14:50
 18667       8   4,035      32,280       492.7      32.3      00:14:40
 19183      10   4,035      40,350       507.1      33.3      00:14:23
 19706       7   4,035      28,245       521.8      34.2      00:14:06
 20202       9   4,035      36,315       535.9      35.2      00:13:51
 20634      10   4,035      40,350       547.6      35.9      00:13:41
 20929      10   4,035      40,350       555.8      36.5      00:13:40
 21331      10   4,035      40,350       565.6      37.1      00:13:34
 21784       9   4,035      36,315       577.1      37.9      00:13:25
 22145      10   4,035      40,350       586.3      38.5      00:13:21
 22515       5   4,035      20,175       595.8      39.1      00:13:16
 22876       9   4,035      36,315       604.7      39.7      00:13:11
 23215       5   4,035      20,175       613.8      40.3      00:13:07
 23599       9   4,035      36,315       623.6      40.9      00:13:01
 23993      10   4,035      40,350       634.1      41.6      00:12:53
 24471       6   4,035      24,210       646.3      42.4      00:12:41
 24958      10   4,035      40,350       659.2      43.3      00:12:29
 25429       9   4,035      36,315       672.0      44.1      00:12:16
 25787       7   4,035      28,245       681.5      44.7      00:12:10
 26090       8   4,035      32,280       689.7      45.3      00:12:07
 26474       6   4,035      24,210       699.7      45.9      00:11:59
 26901       7   4,035      28,245       710.9      46.7      00:11:50
 27263       5   4,035      20,175       720.5      47.3      00:11:43
 27587       6   4,035      24,210       729.1      47.9      00:11:38
 27978       8   4,035      32,280       739.9      48.6      00:11:30
 28411       8   4,035      32,280       751.7      49.3      00:11:19
 28796       7   4,035      28,245       762.5      50.0      00:11:10
 29118      10   4,035      40,350       771.4      50.6      00:11:04
 29562       5   4,035      20,175       783.3      51.4      00:10:53
 29959       7   4,035      28,245       794.1      52.1      00:10:44
 30389       9   4,035      36,315       805.8      52.9      00:10:33
 30883       9   4,035      36,315       819.6      53.8      00:10:19
 31474      10   4,035      40,350       835.9      54.9      00:10:02
 32071       7   4,035      28,245       852.7      56.0      00:09:43
 32591       7   4,035      28,245       867.4      56.9      00:09:28
 32948       7   4,035      28,245       877.4      57.6      00:09:21
 33367       2   4,035       8,070       889.1      58.4      00:09:10
 33868       9   4,035      36,315       903.2      59.3      00:08:56
 34424       8   4,035      32,280       919.0      60.3      00:08:41
 35044       9   4,035      36,315       936.4      61.5      00:08:22
 35651       9   4,035      36,315       953.4      62.6      00:08:05
 36252       9   4,035      36,315       970.1      63.7      00:07:49
 36721      10   4,035      40,350       983.0      64.5      00:07:37
 37078       7   4,035      28,245       992.5      65.1      00:07:30
 37442       7   4,035      28,245     1,001.7      65.7      00:07:23
 37807       7   4,035      28,245     1,011.2      66.4      00:07:16
 38147       8   4,035      32,280     1,020.5      67.0      00:07:09
 38522       8   4,035      32,280     1,031.0      67.7      00:07:01
 38900       9   4,035      36,315     1,041.3      68.3      00:06:53
 39312       8   4,035      32,280     1,052.3      69.1      00:06:44
 39810       7   4,035      28,245     1,065.4      69.9      00:06:32
 40420       6   4,035      24,210     1,081.8      71.0      00:06:16
 41006       8   4,035      32,280     1,098.1      72.1      00:06:01
 41378       5   4,035      20,175     1,108.2      72.7      00:05:53
 41871       8   4,035      32,280     1,121.7      73.6      00:05:41
 42317       4   4,035      16,140     1,133.2      74.4      00:05:31
 42769       7   4,035      28,245     1,145.3      75.2      00:05:21
 43182       8   4,035      32,280     1,156.9      75.9      00:05:11
 43607      10   4,035      40,350     1,168.4      76.7      00:05:01
 44008       5   4,035      20,175     1,179.1      77.4      00:04:53
 44481       6   4,035      24,210     1,191.5      78.2      00:04:42
 44946       5   4,035      20,175     1,204.2      79.0      00:04:31
 45437       4   4,035      16,140     1,216.7      79.9      00:04:20
 45871       5   4,035      20,175     1,227.8      80.6      00:04:11
 46317       9   4,035      36,315     1,240.2      81.4      00:04:00
 46804       8   4,035      32,280     1,253.3      82.3      00:03:49
 47229       7   4,035      28,245     1,264.1      83.0      00:03:40
 47677       8   4,035      32,280     1,275.8      83.7      00:03:30
 48106       6   4,035      24,210     1,287.3      84.5      00:03:20
 48565      10   4,035      40,350     1,299.7      85.3      00:03:10
 49063       6   4,035      24,210     1,312.8      86.2      00:02:58
 49589       3   4,035      12,105     1,326.6      87.1      00:02:46
 50231      10   4,035      40,350     1,343.2      88.2      00:02:32
 50679      10   4,035      40,350     1,354.9      88.9      00:02:22
 51086       6   4,035      24,210     1,366.3      89.7      00:02:13
 51547       6   4,035      24,210     1,378.7      90.5      00:02:02
 52008       9   4,035      36,315     1,391.6      91.3      00:01:51
 52458       8   4,035      32,280     1,404.7      92.2      00:01:40
 52872       9   4,035      36,315     1,416.9      93.0      00:01:30
 53327       9   4,035      36,315     1,429.7      93.8      00:01:19
 53848       8   4,035      32,280     1,444.1      94.8      00:01:07
 54238       7   4,035      28,245     1,454.6      95.5      00:00:58
 54703       9   4,035      36,315     1,466.5      96.3      00:00:48
 55180       6   4,035      24,210     1,479.2      97.1      00:00:37
 55601       7   4,035      28,245     1,489.8      97.8      00:00:28
 55993       8   4,035      32,280     1,500.6      98.5      00:00:19
 56422       8   4,035      32,280     1,512.5      99.3      00:00:09

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1285.397
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl.csv not
    found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl.csv saved

. 
. cap log close

. 
end of do-file
