
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A600_randomseed129.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A600_randomseed129.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A600_randomseed129.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed129.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   225       3   4,635      13,905         6.0       0.3      00:48:47
   477       9   4,635      41,715        12.8       0.7      00:45:16
   715       9   4,635      41,715        19.5       1.1      00:44:30
   933       3   4,635      13,905        25.6       1.5      00:44:56
  1153       8   4,635      37,080        32.3       1.8      00:44:22
  1348      10   4,635      46,350        38.3       2.2      00:44:47
  1548      10   4,635      46,350        44.4       2.5      00:44:56
  1742      10   4,635      46,350        50.3       2.9      00:45:11
  1968       4   4,635      18,540        56.8       3.2      00:44:48
  2186       9   4,635      41,715        63.3       3.6      00:44:30
  2426       6   4,635      27,810        70.3       4.0      00:43:52
  2627      10   4,635      46,350        76.3       4.4      00:43:58
  2830       7   4,635      32,445        82.6       4.7      00:43:51
  3026       9   4,635      41,715        88.1       5.0      00:44:05
  3218       7   4,635      32,445        94.2       5.4      00:44:01
  3422       9   4,635      41,715       100.7       5.8      00:43:45
  3639       3   4,635      13,905       107.2       6.1      00:43:30
  3846      10   4,635      46,350       113.5       6.5      00:43:19
  4009       5   4,635      23,175       118.0       6.7      00:43:52
  4169       7   4,635      32,445       122.8       7.0      00:44:15
  4344      10   4,635      46,350       127.6       7.3      00:44:34
  4516       9   4,635      41,715       132.8       7.6      00:44:44
  4662       3   4,635      13,905       137.4       7.9      00:45:04
  4817       8   4,635      37,080       142.0       8.1      00:45:21
  4981       7   4,635      32,445       147.0       8.4      00:45:30
  5148       8   4,635      37,080       152.0       8.7      00:45:38
  5313       8   4,635      37,080       156.9       9.0      00:45:45
  5467       9   4,635      41,715       161.5       9.2      00:45:60
  5625       8   4,635      37,080       165.8       9.5      00:46:16
  5774       7   4,635      32,445       170.1       9.7      00:46:31
  5943       4   4,635      18,540       175.2      10.0      00:46:31
  6111       7   4,635      32,445       180.3      10.3      00:46:31
  6303       6   4,635      27,810       185.8      10.6      00:46:22
  6466       8   4,635      37,080       190.7      10.9      00:46:25
  6631      10   4,635      46,350       195.4      11.2      00:46:30
  6760       6   4,635      27,810       199.2      11.4      00:46:48
  6867      10   4,635      46,350       202.4      11.6      00:47:15
  7044       8   4,635      37,080       207.5      11.9      00:47:10
  7227      10   4,635      46,350       212.7      12.2      00:47:04
  7411       7   4,635      32,445       218.5      12.5      00:46:49
  7602       5   4,635      23,175       224.3      12.8      00:46:35
  7793       6   4,635      27,810       230.1      13.2      00:46:20
  7970       3   4,635      13,905       235.9      13.5      00:46:06
  8138       9   4,635      41,715       241.2      13.8      00:45:58
  8305       8   4,635      37,080       246.5      14.1      00:45:50
  8450       8   4,635      37,080       251.2      14.4      00:45:51
  8595       6   4,635      27,810       255.7      14.6      00:45:52
  8770       8   4,635      37,080       261.1      14.9      00:45:43
  8914       7   4,635      32,445       265.8      15.2      00:45:43
  9032       6   4,635      27,810       269.4      15.4      00:45:54
  9180       9   4,635      41,715       274.2      15.7      00:45:52
  9318       6   4,635      27,810       278.5      15.9      00:45:54
  9435       6   4,635      27,810       282.3      16.1      00:46:03
  9591      10   4,635      46,350       287.3      16.4      00:45:56
  9714       6   4,635      27,810       291.4      16.7      00:46:00
  9852       5   4,635      23,175       295.5      16.9      00:46:03
  9970       9   4,635      41,715       299.1      17.1      00:46:12
 10077       5   4,635      23,175       302.2      17.3      00:46:26
 10207       6   4,635      27,810       305.7      17.5      00:46:34
 10331      10   4,635      46,350       309.4      17.7      00:46:42
 10454       8   4,635      37,080       313.1      17.9      00:46:47
 10603       8   4,635      37,080       317.4      18.1      00:46:47
 10706       6   4,635      27,810       320.6      18.3      00:46:57
 10864       9   4,635      41,715       325.3      18.6      00:46:52
 10994       9   4,635      41,715       329.3      18.8      00:46:53
 11140       8   4,635      37,080       333.5      19.1      00:46:51
 11257      10   4,635      46,350       337.1      19.3      00:46:57
 11364       7   4,635      32,445       340.4      19.5      00:47:05
 11433       6   4,635      27,810       342.5      19.6      00:47:24
 11535       3   4,635      13,905       345.5      19.8      00:47:34
 11662      10   4,635      46,350       349.3      20.0      00:47:35
 11789       6   4,635      27,810       353.2      20.2      00:47:36
 11914       5   4,635      23,175       356.9      20.4      00:47:37
 12028       5   4,635      23,175       360.5      20.6      00:47:40
 12162       9   4,635      41,715       364.7      20.9      00:47:37
 12292       8   4,635      37,080       368.5      21.1      00:47:38
 12502       8   4,635      37,080       374.9      21.4      00:47:13
 12718       1   4,635       4,635       381.3      21.8      00:46:48
 12941       7   4,635      32,445       387.6      22.2      00:46:24
 13158       7   4,635      32,445       394.4      22.6      00:45:58
 13350       5   4,635      23,175       400.2      22.9      00:45:40
 13518       9   4,635      41,715       405.8      23.2      00:45:24
 13641       7   4,635      32,445       409.7      23.4      00:45:23
 13787       6   4,635      27,810       414.1      23.7      00:45:18
 13918       5   4,635      23,175       418.0      23.9      00:45:17
 14054       7   4,635      32,445       422.0      24.1      00:45:14
 14202       7   4,635      32,445       426.7      24.4      00:45:05
 14340       7   4,635      32,445       431.1      24.6      00:44:60
 14472      10   4,635      46,350       435.3      24.9      00:44:56
 14627       7   4,635      32,445       440.0      25.2      00:44:47
 14775       8   4,635      37,080       444.5      25.4      00:44:40
 14934       5   4,635      23,175       449.4      25.7      00:44:30
 15114       8   4,635      37,080       455.2      26.0      00:44:13
 15323       9   4,635      41,715       461.7      26.4      00:43:50
 15542       5   4,635      23,175       468.4      26.8      00:43:27
 15745      10   4,635      46,350       474.7      27.1      00:43:07
 15940       7   4,635      32,445       481.0      27.5      00:42:47
 16070       7   4,635      32,445       485.3      27.7      00:42:41
 16252       3   4,635      13,905       491.0      28.1      00:42:26
 16433       6   4,635      27,810       496.9      28.4      00:42:09
 16563       4   4,635      18,540       500.8      28.6      00:42:07
 16707      10   4,635      46,350       505.2      28.9      00:42:00
 16835       8   4,635      37,080       509.2      29.1      00:41:57
 16947       7   4,635      32,445       512.7      29.3      00:41:57
 17036       9   4,635      41,715       515.5      29.5      00:42:02
 17157      10   4,635      46,350       519.1      29.7      00:42:01
 17296       6   4,635      27,810       523.4      29.9      00:41:55
 17413      10   4,635      46,350       527.2      30.1      00:41:52
 17517       6   4,635      27,810       530.8      30.4      00:41:51
 17644       7   4,635      32,445       534.8      30.6      00:41:47
 17787       8   4,635      37,080       539.0      30.8      00:41:42
 17951       5   4,635      23,175       544.0      31.1      00:41:30
 18131       7   4,635      32,445       549.8      31.4      00:41:14
 18328       5   4,635      23,175       555.9      31.8      00:40:56
 18499       7   4,635      32,445       560.8      32.1      00:40:46
 18594       7   4,635      32,445       563.8      32.2      00:40:47
 18696      10   4,635      46,350       567.2      32.4      00:40:47
 18813       8   4,635      37,080       570.8      32.6      00:40:45
 18938       9   4,635      41,715       574.9      32.9      00:40:39
 19034      10   4,635      46,350       578.1      33.1      00:40:40
 19145      10   4,635      46,350       581.7      33.3      00:40:37
 19264      10   4,635      46,350       585.3      33.5      00:40:35
 19430       9   4,635      41,715       590.7      33.8      00:40:21
 19617       6   4,635      27,810       596.6      34.1      00:40:04
 19810       5   4,635      23,175       603.0      34.5      00:39:44
 19992      10   4,635      46,350       609.0      34.8      00:39:28
 20166      10   4,635      46,350       614.6      35.1      00:39:13
 20308       8   4,635      37,080       618.9      35.4      00:39:06
 20465       8   4,635      37,080       623.9      35.7      00:38:55
 20555       6   4,635      27,810       626.8      35.8      00:38:56
 20663       5   4,635      23,175       630.2      36.0      00:38:54
 20768       8   4,635      37,080       633.5      36.2      00:38:53
 20861       9   4,635      41,715       636.5      36.4      00:38:54
 20968       5   4,635      23,175       639.8      36.6      00:38:52
 21099       6   4,635      27,810       643.7      36.8      00:38:47
 21222       8   4,635      37,080       647.1      37.0      00:38:45
 21338       4   4,635      18,540       650.3      37.2      00:38:44
 21431       8   4,635      37,080       653.1      37.3      00:38:45
 21533       2   4,635       9,270       656.4      37.5      00:38:43
 21661       8   4,635      37,080       660.0      37.7      00:38:39
 21793       5   4,635      23,175       663.5      37.9      00:38:35
 21930       3   4,635      13,905       667.7      38.2      00:38:28
 22064       7   4,635      32,445       671.6      38.4      00:38:23
 22209       9   4,635      41,715       675.7      38.6      00:38:16
 22365       7   4,635      32,445       680.1      38.9      00:38:08
 22505       6   4,635      27,810       684.3      39.1      00:38:01
 22630      10   4,635      46,350       688.1      39.3      00:37:55
 22817       9   4,635      41,715       693.1      39.6      00:37:44
 23012       8   4,635      37,080       699.0      40.0      00:37:27
 23182       5   4,635      23,175       704.3      40.3      00:37:14
 23338       9   4,635      41,715       709.2      40.5      00:37:03
 23548       4   4,635      18,540       715.0      40.9      00:36:47
 23708       7   4,635      32,445       719.9      41.2      00:36:36
 23831       9   4,635      41,715       723.9      41.4      00:36:30
 24020       8   4,635      37,080       729.5      41.7      00:36:15
 24212       6   4,635      27,810       735.0      42.0      00:36:01
 24419       7   4,635      32,445       741.0      42.4      00:35:44
 24597       6   4,635      27,810       746.6      42.7      00:35:30
 24694       7   4,635      32,445       749.7      42.9      00:35:28
 24865      10   4,635      46,350       754.8      43.2      00:35:16
 25005       7   4,635      32,445       758.9      43.4      00:35:09
 25177       8   4,635      37,080       764.4      43.7      00:34:55
 25348       9   4,635      41,715       769.6      44.0      00:34:43
 25459       5   4,635      23,175       773.1      44.2      00:34:39
 25583       9   4,635      41,715       776.7      44.4      00:34:34
 25694       8   4,635      37,080       780.1      44.6      00:34:30
 25795       9   4,635      41,715       783.4      44.8      00:34:27
 25916       8   4,635      37,080       787.1      45.0      00:34:21
 26027      10   4,635      46,350       790.5      45.2      00:34:17
 26124       7   4,635      32,445       793.5      45.4      00:34:15
 26263       8   4,635      37,080       797.9      45.6      00:34:07
 26437       5   4,635      23,175       803.0      45.9      00:33:54
 26609       7   4,635      32,445       808.1      46.2      00:33:43
 26784       8   4,635      37,080       813.4      46.5      00:33:30
 26922       7   4,635      32,445       817.6      46.7      00:33:22
 27047       9   4,635      41,715       821.4      47.0      00:33:15
 27151       8   4,635      37,080       824.7      47.2      00:33:12
 27258       4   4,635      18,540       827.8      47.3      00:33:09
 27388       6   4,635      27,810       831.8      47.6      00:33:02
 27494       9   4,635      41,715       835.1      47.8      00:32:58
 27604       7   4,635      32,445       838.5      47.9      00:32:54
 27734       4   4,635      18,540       842.6      48.2      00:32:46
 27845       6   4,635      27,810       846.1      48.4      00:32:41
 27989       4   4,635      18,540       850.6      48.6      00:32:31
 28164       8   4,635      37,080       856.1      48.9      00:32:17
 28338       5   4,635      23,175       861.6      49.3      00:32:03
 28536       9   4,635      41,715       868.1      49.6      00:31:45
 28683       6   4,635      27,810       872.7      49.9      00:31:35
 28790       6   4,635      27,810       876.2      50.1      00:31:30
 28901       6   4,635      27,810       879.7      50.3      00:31:25
 28996       4   4,635      18,540       882.6      50.5      00:31:22
 29080       5   4,635      23,175       885.3      50.6      00:31:21
 29184       9   4,635      41,715       888.4      50.8      00:31:17
 29331       6   4,635      27,810       893.0      51.1      00:31:07
 29493       6   4,635      27,810       898.1      51.4      00:30:55
 29655      10   4,635      46,350       902.9      51.6      00:30:44
 29765      10   4,635      46,350       906.5      51.8      00:30:38
 29864       3   4,635      13,905       909.5      52.0      00:30:35
 29953       7   4,635      32,445       912.3      52.2      00:30:33
 30068       6   4,635      27,810       915.9      52.4      00:30:26
 30154       9   4,635      41,715       918.7      52.5      00:30:24
 30253       4   4,635      18,540       921.7      52.7      00:30:20
 30394      10   4,635      46,350       926.2      53.0      00:30:11
 30518      10   4,635      46,350       930.3      53.2      00:30:03
 30663       6   4,635      27,810       934.8      53.4      00:29:53
 30858       7   4,635      32,445       941.0      53.8      00:29:36
 31054       7   4,635      32,445       947.0      54.1      00:29:20
 31239       8   4,635      37,080       953.0      54.5      00:29:04
 31453       9   4,635      41,715       959.9      54.9      00:28:45
 31658       5   4,635      23,175       966.3      55.3      00:28:28
 31847      10   4,635      46,350       972.6      55.6      00:28:11
 32014       4   4,635      18,540       978.1      55.9      00:27:58
 32185       9   4,635      41,715       983.7      56.2      00:27:44
 32364       6   4,635      27,810       989.6      56.6      00:27:29
 32507       6   4,635      27,810       994.2      56.8      00:27:19
 32594       9   4,635      41,715       997.0      57.0      00:27:16
 32690       7   4,635      32,445       999.9      57.2      00:27:12
 32812       9   4,635      41,715     1,003.9      57.4      00:27:05
 32918       8   4,635      37,080     1,007.3      57.6      00:26:59
 33044       6   4,635      27,810     1,011.4      57.8      00:26:51
 33129      10   4,635      46,350     1,014.2      58.0      00:26:48
 33260       6   4,635      27,810     1,018.3      58.2      00:26:39
 33409       8   4,635      37,080     1,023.1      58.5      00:26:29
 33551       6   4,635      27,810     1,027.7      58.8      00:26:19
 33687       8   4,635      37,080     1,032.1      59.0      00:26:09
 33802       6   4,635      27,810     1,035.8      59.2      00:26:03
 33941       9   4,635      41,715     1,040.3      59.5      00:25:52
 34090       5   4,635      23,175     1,045.2      59.8      00:25:42
 34271       9   4,635      41,715     1,051.2      60.1      00:25:26
 34459       9   4,635      41,715     1,057.2      60.4      00:25:11
 34658       9   4,635      41,715     1,063.5      60.8      00:24:55
 34848      10   4,635      46,350     1,069.8      61.2      00:24:39
 35032       5   4,635      23,175     1,075.6      61.5      00:24:24
 35212       6   4,635      27,810     1,081.5      61.8      00:24:10
 35404       7   4,635      32,445     1,087.7      62.2      00:23:54
 35623       9   4,635      41,715     1,094.7      62.6      00:23:36
 35839       9   4,635      41,715     1,101.5      63.0      00:23:19
 36030       7   4,635      32,445     1,107.5      63.3      00:23:04
 36223       5   4,635      23,175     1,113.8      63.7      00:22:48
 36407       5   4,635      23,175     1,119.8      64.0      00:22:34
 36579       4   4,635      18,540     1,125.1      64.3      00:22:22
 36716       6   4,635      27,810     1,129.3      64.6      00:22:13
 36846       8   4,635      37,080     1,133.3      64.8      00:22:05
 36954       6   4,635      27,810     1,136.7      65.0      00:21:60
 37081       8   4,635      37,080     1,140.6      65.2      00:21:52
 37216       8   4,635      37,080     1,144.3      65.4      00:21:45
 37335       6   4,635      27,810     1,147.8      65.6      00:21:39
 37469       7   4,635      32,445     1,151.8      65.9      00:21:31
 37597       6   4,635      27,810     1,155.8      66.1      00:21:23
 37726       8   4,635      37,080     1,159.5      66.3      00:21:16
 37879       8   4,635      37,080     1,164.3      66.6      00:21:05
 38036       9   4,635      41,715     1,169.2      66.9      00:20:55
 38214      10   4,635      46,350     1,174.8      67.2      00:20:41
 38376       8   4,635      37,080     1,180.0      67.5      00:20:30
 38559       8   4,635      37,080     1,185.9      67.8      00:20:16
 38771       7   4,635      32,445     1,192.5      68.2      00:19:59
 38936      10   4,635      46,350     1,197.6      68.5      00:19:48
 39051      10   4,635      46,350     1,201.3      68.7      00:19:41
 39178       9   4,635      41,715     1,205.0      68.9      00:19:34
 39286       9   4,635      41,715     1,208.4      69.1      00:19:28
 39433       6   4,635      27,810     1,212.7      69.3      00:19:19
 39560       8   4,635      37,080     1,216.7      69.6      00:19:11
 39705       9   4,635      41,715     1,221.0      69.8      00:19:02
 39869       6   4,635      27,810     1,226.1      70.1      00:18:50
 40059       8   4,635      37,080     1,231.9      70.4      00:18:37
 40219       5   4,635      23,175     1,236.8      70.7      00:18:26
 40366      10   4,635      46,350     1,241.4      71.0      00:18:16
 40565       6   4,635      27,810     1,247.7      71.3      00:18:01
 40765       8   4,635      37,080     1,254.1      71.7      00:17:46
 40940       8   4,635      37,080     1,259.7      72.0      00:17:33
 41074       5   4,635      23,175     1,263.9      72.3      00:17:24
 41186       8   4,635      37,080     1,267.4      72.5      00:17:18
 41315       8   4,635      37,080     1,271.4      72.7      00:17:10
 41421      10   4,635      46,350     1,274.7      72.9      00:17:04
 41572       6   4,635      27,810     1,279.5      73.2      00:16:53
 41715       7   4,635      32,445     1,283.9      73.4      00:16:44
 41825       7   4,635      32,445     1,287.4      73.6      00:16:37
 41946       1   4,635       4,635     1,291.3      73.8      00:16:30
 42063       3   4,635      13,905     1,294.6      74.0      00:16:23
 42208       5   4,635      23,175     1,298.8      74.3      00:16:15
 42318       9   4,635      41,715     1,302.1      74.5      00:16:09
 42415       6   4,635      27,810     1,305.3      74.6      00:16:03
 42537       4   4,635      18,540     1,309.0      74.8      00:15:55
 42661      10   4,635      46,350     1,312.7      75.1      00:15:48
 42804       6   4,635      27,810     1,317.1      75.3      00:15:39
 42922       6   4,635      27,810     1,320.8      75.5      00:15:31
 43011       8   4,635      37,080     1,323.7      75.7      00:15:26
 43143       7   4,635      32,445     1,328.1      75.9      00:15:17
 43273       7   4,635      32,445     1,332.2      76.2      00:15:08
 43393       9   4,635      41,715     1,336.1      76.4      00:14:60
 43548       8   4,635      37,080     1,340.7      76.7      00:14:50
 43771       6   4,635      27,810     1,347.4      77.0      00:14:34
 43983       8   4,635      37,080     1,354.1      77.4      00:14:18
 44125       8   4,635      37,080     1,358.3      77.7      00:14:09
 44243       7   4,635      32,445     1,362.1      77.9      00:14:02
 44335       9   4,635      41,715     1,364.7      78.0      00:13:57
 44461       9   4,635      41,715     1,368.6      78.3      00:13:49
 44634       9   4,635      41,715     1,373.9      78.6      00:13:37
 44754       6   4,635      27,810     1,377.6      78.8      00:13:30
 44859       6   4,635      27,810     1,380.9      79.0      00:13:23
 45003       6   4,635      27,810     1,385.3      79.2      00:13:13
 45147       8   4,635      37,080     1,389.6      79.5      00:13:04
 45298       9   4,635      41,715     1,393.8      79.7      00:12:55
 45406      10   4,635      46,350     1,397.0      79.9      00:12:49
 45526       8   4,635      37,080     1,400.6      80.1      00:12:42
 45665       7   4,635      32,445     1,404.5      80.3      00:12:34
 45812       7   4,635      32,445     1,408.9      80.6      00:12:24
 45935       7   4,635      32,445     1,412.7      80.8      00:12:16
 46021       8   4,635      37,080     1,415.5      80.9      00:12:11
 46128       5   4,635      23,175     1,418.8      81.1      00:12:05
 46246       7   4,635      32,445     1,422.7      81.3      00:11:56
 46383       6   4,635      27,810     1,426.8      81.6      00:11:47
 46533       9   4,635      41,715     1,431.5      81.9      00:11:37
 46694       9   4,635      41,715     1,436.6      82.1      00:11:26
 46848       6   4,635      27,810     1,441.4      82.4      00:11:15
 46947       6   4,635      27,810     1,444.2      82.6      00:11:10
 47052       8   4,635      37,080     1,447.2      82.8      00:11:04
 47142       6   4,635      27,810     1,449.8      82.9      00:10:59
 47242       7   4,635      32,445     1,452.7      83.1      00:10:53
 47361       9   4,635      41,715     1,456.3      83.3      00:10:46
 47507       9   4,635      41,715     1,460.5      83.5      00:10:37
 47619      10   4,635      46,350     1,464.0      83.7      00:10:30
 47732       8   4,635      37,080     1,467.5      83.9      00:10:22
 47860       8   4,635      37,080     1,471.3      84.1      00:10:14
 47970       8   4,635      37,080     1,474.7      84.3      00:10:07
 48072       8   4,635      37,080     1,477.9      84.5      00:10:00
 48213       9   4,635      41,715     1,482.1      84.7      00:09:51
 48341       8   4,635      37,080     1,486.3      85.0      00:09:42
 48458       9   4,635      41,715     1,489.9      85.2      00:09:35
 48610       7   4,635      32,445     1,494.6      85.5      00:09:24
 48754       9   4,635      41,715     1,499.0      85.7      00:09:14
 48881       8   4,635      37,080     1,502.8      85.9      00:09:06
 49007       9   4,635      41,715     1,506.7      86.1      00:08:58
 49110       7   4,635      32,445     1,510.0      86.3      00:08:51
 49200       7   4,635      32,445     1,513.0      86.5      00:08:45
 49328       9   4,635      41,715     1,516.7      86.7      00:08:37
 49434       7   4,635      32,445     1,519.8      86.9      00:08:30
 49543       9   4,635      41,715     1,522.8      87.1      00:08:24
 49663       9   4,635      41,715     1,526.2      87.3      00:08:17
 49794       6   4,635      27,810     1,530.0      87.5      00:08:09
 49903       7   4,635      32,445     1,533.3      87.7      00:08:02
 50017       5   4,635      23,175     1,536.8      87.9      00:07:54
 50144       8   4,635      37,080     1,540.7      88.1      00:07:46
 50263       9   4,635      41,715     1,544.1      88.3      00:07:38
 50408       7   4,635      32,445     1,548.3      88.5      00:07:29
 50538       6   4,635      27,810     1,552.4      88.8      00:07:20
 50666       4   4,635      18,540     1,556.3      89.0      00:07:11
 50777       9   4,635      41,715     1,560.0      89.2      00:07:03
 50896       8   4,635      37,080     1,563.7      89.4      00:06:55
 50998       6   4,635      27,810     1,567.1      89.6      00:06:48
 51121       9   4,635      41,715     1,570.8      89.8      00:06:40
 51276       5   4,635      23,175     1,575.6      90.1      00:06:29
 51444       3   4,635      13,905     1,580.9      90.4      00:06:17
 51627       9   4,635      41,715     1,586.9      90.7      00:06:03
 51813       6   4,635      27,810     1,592.9      91.1      00:05:49
 52010       7   4,635      32,445     1,599.1      91.4      00:05:35
 52221       9   4,635      41,715     1,606.3      91.8      00:05:18
 52387       8   4,635      37,080     1,611.7      92.2      00:05:06
 52554       6   4,635      27,810     1,617.4      92.5      00:04:53
 52745       6   4,635      27,810     1,623.9      92.9      00:04:38
 52971       9   4,635      41,715     1,631.3      93.3      00:04:21
 53206       7   4,635      32,445     1,638.9      93.7      00:04:04
 53407       7   4,635      32,445     1,645.3      94.1      00:03:50
 53607       6   4,635      27,810     1,651.7      94.4      00:03:35
 53750       5   4,635      23,175     1,656.3      94.7      00:03:25
 53841       5   4,635      23,175     1,659.1      94.9      00:03:19
 53938      10   4,635      46,350     1,662.0      95.0      00:03:13
 54040      10   4,635      46,350     1,665.2      95.2      00:03:06
 54156       4   4,635      18,540     1,668.7      95.4      00:02:58
 54258       8   4,635      37,080     1,671.9      95.6      00:02:51
 54339       4   4,635      18,540     1,674.4      95.7      00:02:46
 54478       7   4,635      32,445     1,678.1      96.0      00:02:38
 54590       9   4,635      41,715     1,681.6      96.1      00:02:30
 54782       4   4,635      18,540     1,687.4      96.5      00:02:17
 54977       8   4,635      37,080     1,693.3      96.8      00:02:04
 55101       7   4,635      32,445     1,697.2      97.0      00:01:55
 55213       9   4,635      41,715     1,700.5      97.2      00:01:48
 55359       8   4,635      37,080     1,704.6      97.5      00:01:39
 55499      10   4,635      46,350     1,708.7      97.7      00:01:29
 55638       9   4,635      41,715     1,713.0      97.9      00:01:20
 55786      10   4,635      46,350     1,717.6      98.2      00:01:10
 55962       7   4,635      32,445     1,723.1      98.5      00:00:57
 56135       8   4,635      37,080     1,728.6      98.8      00:00:45
 56268       7   4,635      32,445     1,732.8      99.1      00:00:36
 56369       6   4,635      27,810     1,736.2      99.3      00:00:28
 56469       7   4,635      32,445     1,739.5      99.5      00:00:21
 56584      10   4,635      46,350     1,743.1      99.7      00:00:13
 56687       7   4,635      32,445     1,746.4      99.9      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,635     
Bases * Neighbors  (M)  = 1,748.9        Number of regions         = 56,767    
Computed distances (M)  = 1,748.89       Total run time (seconds)  = 3922.557
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A600_randomseed129.csv sav
> ed

. 
. cap log close

. 
end of do-file
