
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A700_randomseed13.dta /export/storage_covidvacc
> ine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dis
> t_total_10000_5_4q_mnl_A700_randomseed13.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A700_randomseed13.dt
> a

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed13.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   410       2   4,735       9,470        11.1       0.6      00:26:37
   797       6   4,735      28,410        22.4       1.3      00:26:18
  1224       5   4,735      23,675        35.0       2.0      00:25:04
  1639       8   4,735      37,880        48.1       2.7      00:24:10
  2071       8   4,735      37,880        60.9       3.4      00:23:39
  2473       9   4,735      42,615        73.0       4.1      00:23:30
  2913      10   4,735      47,350        86.6       4.8      00:22:57
  3335      10   4,735      47,350        99.8       5.6      00:22:34
  3761      10   4,735      47,350       113.2       6.3      00:22:12
  4138      10   4,735      47,350       124.3       7.0      00:22:20
  4494       9   4,735      42,615       134.8       7.5      00:22:30
  4824       6   4,735      28,410       145.2       8.1      00:22:39
  5176       5   4,735      23,675       155.9       8.7      00:22:42
  5478       3   4,735      14,205       165.1       9.2      00:22:58
  5769       6   4,735      28,410       173.4       9.7      00:23:18
  6127       4   4,735      18,940       184.4      10.3      00:23:13
  6495       7   4,735      33,145       195.4      10.9      00:23:07
  6856       9   4,735      42,615       206.2      11.5      00:23:02
  7252      10   4,735      47,350       218.0      12.2      00:22:50
  7681       3   4,735      14,205       231.4      12.9      00:22:27
  8098       7   4,735      33,145       244.8      13.7      00:22:05
  8479      10   4,735      47,350       257.3      14.4      00:21:50
  8855       6   4,735      28,410       269.3      15.1      00:21:38
  9244       6   4,735      28,410       282.0      15.8      00:21:23
  9539       2   4,735       9,470       291.5      16.3      00:21:24
  9877       7   4,735      33,145       302.5      16.9      00:21:18
 10191       6   4,735      28,410       311.7      17.4      00:21:20
 10500       8   4,735      37,880       321.1      18.0      00:21:20
 10895       4   4,735      18,940       333.1      18.6      00:21:08
 11256       8   4,735      37,880       344.1      19.2      00:20:60
 11567       7   4,735      33,145       353.7      19.8      00:20:58
 11890       6   4,735      28,410       363.7      20.3      00:20:54
 12199       3   4,735      14,205       373.5      20.9      00:20:51
 12605       8   4,735      37,880       385.9      21.6      00:20:37
 13068       7   4,735      33,145       399.9      22.4      00:20:16
 13508       8   4,735      37,880       414.0      23.2      00:19:56
 13811       6   4,735      28,410       423.5      23.7      00:19:53
 14143       9   4,735      42,615       433.7      24.3      00:19:48
 14506       6   4,735      28,410       445.5      24.9      00:19:37
 14896       8   4,735      37,880       457.7      25.6      00:19:24
 15358       5   4,735      23,675       472.6      26.4      00:19:02
 15795       5   4,735      23,675       486.3      27.2      00:18:45
 16241       7   4,735      33,145       500.9      28.0      00:18:26
 16632       5   4,735      23,675       513.5      28.7      00:18:13
 16941       9   4,735      42,615       523.2      29.3      00:18:09
 17233      10   4,735      47,350       532.5      29.8      00:18:06
 17492      10   4,735      47,350       541.0      30.3      00:18:04
 17775       8   4,735      37,880       550.0      30.8      00:18:02
 18093       7   4,735      33,145       560.2      31.3      00:17:55
 18415       7   4,735      33,145       570.3      31.9      00:17:49
 18734       9   4,735      42,615       580.4      32.5      00:17:42
 19041       9   4,735      42,615       590.5      33.0      00:17:36
 19381      10   4,735      47,350       601.4      33.6      00:17:27
 19818       6   4,735      28,410       616.0      34.5      00:17:08
 20251      10   4,735      47,350       630.3      35.3      00:16:51
 20617      10   4,735      47,350       642.0      35.9      00:16:41
 20896       9   4,735      42,615       651.1      36.4      00:16:36
 21254      10   4,735      47,350       661.7      37.0      00:16:28
 21626       9   4,735      42,615       672.8      37.6      00:16:19
 21979       7   4,735      33,145       683.3      38.2      00:16:11
 22373       9   4,735      42,615       694.8      38.9      00:16:01
 22724       8   4,735      37,880       705.5      39.5      00:15:52
 23100       9   4,735      42,615       716.7      40.1      00:15:43
 23451       8   4,735      37,880       727.7      40.7      00:15:34
 23867       2   4,735       9,470       740.4      41.4      00:15:21
 24319       4   4,735      18,940       753.8      42.2      00:15:07
 24789       9   4,735      42,615       768.5      43.0      00:14:50
 25254      10   4,735      47,350       783.0      43.8      00:14:34
 25677      10   4,735      47,350       796.0      44.5      00:14:21
 26000       7   4,735      33,145       806.4      45.1      00:14:13
 26291       7   4,735      33,145       815.7      45.6      00:14:07
 26668       7   4,735      33,145       826.9      46.2      00:13:58
 27037       5   4,735      23,675       838.6      46.9      00:13:48
 27366       8   4,735      37,880       848.7      47.5      00:13:40
 27693       6   4,735      28,410       859.0      48.0      00:13:32
 28127       5   4,735      23,675       873.0      48.8      00:13:18
 28605       5   4,735      23,675       888.7      49.7      00:13:00
 28949       9   4,735      42,615       899.8      50.3      00:12:51
 29346       9   4,735      42,615       912.3      51.0      00:12:39
 29760       9   4,735      42,615       925.5      51.8      00:12:26
 30070       6   4,735      28,410       935.4      52.3      00:12:19
 30414       8   4,735      37,880       946.4      52.9      00:12:10
 30835       7   4,735      33,145       960.2      53.7      00:11:56
 31300       7   4,735      33,145       975.1      54.5      00:11:41
 31755       8   4,735      37,880       990.0      55.4      00:11:26
 32204       7   4,735      33,145     1,005.0      56.2      00:11:11
 32598       6   4,735      28,410     1,018.1      56.9      00:10:59
 32906       5   4,735      23,675     1,028.2      57.5      00:10:51
 33236       5   4,735      23,675     1,039.0      58.1      00:10:42
 33601       8   4,735      37,880     1,051.1      58.8      00:10:32
 33952       7   4,735      33,145     1,062.6      59.4      00:10:22
 34342      10   4,735      47,350     1,075.8      60.2      00:10:10
 34796       6   4,735      28,410     1,090.7      61.0      00:09:55
 35208       8   4,735      37,880     1,104.3      61.8      00:09:43
 35633      10   4,735      47,350     1,118.2      62.5      00:09:30
 36038       2   4,735       9,470     1,131.3      63.3      00:09:18
 36482       8   4,735      37,880     1,145.9      64.1      00:09:04
 36826       5   4,735      23,675     1,156.7      64.7      00:08:55
 37184      10   4,735      47,350     1,167.8      65.3      00:08:46
 37545       7   4,735      33,145     1,178.6      65.9      00:08:38
 37886       4   4,735      18,940     1,189.2      66.5      00:08:29
 38204       6   4,735      28,410     1,199.5      67.1      00:08:21
 38507       6   4,735      28,410     1,209.4      67.6      00:08:13
 38839       9   4,735      42,615     1,220.0      68.2      00:08:05
 39145       7   4,735      33,145     1,229.8      68.8      00:07:57
 39534       6   4,735      28,410     1,241.7      69.5      00:07:47
 39950      10   4,735      47,350     1,254.8      70.2      00:07:35
 40427       9   4,735      42,615     1,269.7      71.0      00:07:21
 40886       8   4,735      37,880     1,284.6      71.8      00:07:08
 41194       9   4,735      42,615     1,294.6      72.4      00:06:60
 41557       8   4,735      37,880     1,306.1      73.1      00:06:50
 41945       7   4,735      33,145     1,318.8      73.8      00:06:39
 42260       8   4,735      37,880     1,328.2      74.3      00:06:32
 42564       6   4,735      28,410     1,337.7      74.8      00:06:24
 42878       5   4,735      23,675     1,347.6      75.4      00:06:16
 43176       7   4,735      33,145     1,357.4      75.9      00:06:08
 43482       8   4,735      37,880     1,367.4      76.5      00:06:00
 43830       9   4,735      42,615     1,378.0      77.1      00:05:51
 44186      10   4,735      47,350     1,389.1      77.7      00:05:42
 44500       9   4,735      42,615     1,398.9      78.2      00:05:34
 44843       6   4,735      28,410     1,409.8      78.8      00:05:25
 45203       2   4,735       9,470     1,421.0      79.5      00:05:15
 45570       8   4,735      37,880     1,431.9      80.1      00:05:06
 45951       6   4,735      28,410     1,443.3      80.7      00:04:56
 46307       8   4,735      37,880     1,455.0      81.4      00:04:46
 46695       4   4,735      18,940     1,467.3      82.1      00:04:36
 47046       4   4,735      18,940     1,478.0      82.7      00:04:27
 47313      10   4,735      47,350     1,485.9      83.1      00:04:21
 47627       3   4,735      14,205     1,495.4      83.6      00:04:13
 47886       7   4,735      33,145     1,503.5      84.1      00:04:06
 48127       9   4,735      42,615     1,511.2      84.5      00:04:00
 48394       7   4,735      33,145     1,519.7      85.0      00:03:53
 48717       7   4,735      33,145     1,529.9      85.6      00:03:45
 49060       9   4,735      42,615     1,540.5      86.2      00:03:35
 49377       6   4,735      28,410     1,550.6      86.7      00:03:27
 49704       8   4,735      37,880     1,560.1      87.3      00:03:19
 50009       8   4,735      37,880     1,569.5      87.8      00:03:11
 50342       7   4,735      33,145     1,579.5      88.3      00:03:02
 50663       7   4,735      33,145     1,589.5      88.9      00:02:54
 50977       7   4,735      33,145     1,599.6      89.5      00:02:45
 51331       8   4,735      37,880     1,610.9      90.1      00:02:35
 51686       7   4,735      33,145     1,622.5      90.8      00:02:25
 52045      10   4,735      47,350     1,634.2      91.4      00:02:15
 52418       9   4,735      42,615     1,647.0      92.1      00:02:03
 52874       5   4,735      23,675     1,662.8      93.0      00:01:49
 53342       8   4,735      37,880     1,678.2      93.9      00:01:36
 53772       6   4,735      28,410     1,692.2      94.6      00:01:23
 54095       8   4,735      37,880     1,702.4      95.2      00:01:14
 54446       9   4,735      42,615     1,713.3      95.8      00:01:05
 54862       9   4,735      42,615     1,725.9      96.5      00:00:54
 55196       6   4,735      28,410     1,736.3      97.1      00:00:45
 55532       6   4,735      28,410     1,746.3      97.7      00:00:36
 55838       8   4,735      37,880     1,755.8      98.2      00:00:28
 56179       6   4,735      28,410     1,766.8      98.8      00:00:18
 56546       7   4,735      33,145     1,779.1      99.5      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,735     
Bases * Neighbors  (M)  = 1,787.9        Number of regions         = 56,821    
Computed distances (M)  = 1,787.89       Total run time (seconds)  = 1565.278
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed13.c
    > sv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A700_randomseed13.csv save
> d

. 
. cap log close

. 
end of do-file
