
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A200_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A200_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A200_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   471       7   4,235      29,645        11.4       0.7      00:23:14
   996       4   4,235      16,940        25.0       1.6      00:21:01
  1479       3   4,235      12,705        38.5       2.4      00:20:17
  1998       8   4,235      33,880        52.5       3.3      00:19:38
  2540       8   4,235      33,880        67.0       4.2      00:19:04
  3061       6   4,235      25,410        81.3       5.1      00:18:41
  3527       7   4,235      29,645        94.7       5.9      00:18:33
  3980       9   4,235      38,115       106.9       6.7      00:18:37
  4353       3   4,235      12,705       116.7       7.3      00:19:04
  4695       5   4,235      21,175       126.3       7.9      00:19:27
  5048       5   4,235      21,175       136.0       8.5      00:19:44
  5389       8   4,235      33,880       145.5       9.1      00:20:00
  5720       9   4,235      38,115       153.8       9.6      00:20:23
  6086       7   4,235      29,645       163.8      10.2      00:20:27
  6458      10   4,235      42,350       173.8      10.9      00:20:32
  6799       7   4,235      29,645       182.8      11.4      00:20:41
  7201      10   4,235      42,350       193.5      12.1      00:20:36
  7618       4   4,235      16,940       205.2      12.8      00:20:24
  8033      10   4,235      42,350       217.1      13.6      00:20:11
  8482       8   4,235      33,880       230.2      14.4      00:19:50
  8916      10   4,235      42,350       242.7      15.2      00:19:35
  9261       8   4,235      33,880       252.7      15.8      00:19:34
  9525       8   4,235      33,880       260.4      16.3      00:19:44
  9865       8   4,235      33,880       270.3      16.9      00:19:41
 10251       6   4,235      25,410       280.3      17.5      00:19:37
 10591      10   4,235      42,350       289.6      18.1      00:19:37
 10955       9   4,235      38,115       299.6      18.7      00:19:33
 11293       6   4,235      25,410       308.7      19.3      00:19:32
 11595      10   4,235      42,350       317.1      19.8      00:19:34
 11952       6   4,235      25,410       327.0      20.4      00:19:29
 12303       8   4,235      33,880       336.8      21.1      00:19:23
 12794       8   4,235      33,880       350.1      21.9      00:19:03
 13284       9   4,235      38,115       363.6      22.7      00:18:43
 13688      10   4,235      42,350       375.5      23.5      00:18:30
 14081       9   4,235      38,115       386.2      24.1      00:18:21
 14482       4   4,235      16,940       397.7      24.9      00:18:09
 14886      10   4,235      42,350       409.0      25.6      00:17:58
 15347       9   4,235      38,115       422.4      26.4      00:17:40
 15805       7   4,235      29,645       435.3      27.2      00:17:24
 16259       7   4,235      29,645       448.6      28.1      00:17:07
 16674      10   4,235      42,350       460.5      28.8      00:16:55
 17028       6   4,235      25,410       470.5      29.4      00:16:49
 17325       7   4,235      29,645       478.9      29.9      00:16:47
 17628       6   4,235      25,410       488.0      30.5      00:16:43
 18030       9   4,235      38,115       499.1      31.2      00:16:33
 18430       4   4,235      16,940       510.4      31.9      00:16:23
 18887       8   4,235      33,880       523.5      32.7      00:16:07
 19326       8   4,235      33,880       536.4      33.5      00:15:52
 19805       7   4,235      29,645       550.6      34.4      00:15:34
 20293       6   4,235      25,410       564.9      35.3      00:15:17
 20720       6   4,235      25,410       577.2      36.1      00:15:04
 21140      10   4,235      42,350       589.0      36.8      00:14:53
 21521       5   4,235      21,175       599.0      37.5      00:14:46
 21936       3   4,235      12,705       609.9      38.1      00:14:37
 22345       7   4,235      29,645       620.7      38.8      00:14:28
 22746       3   4,235      12,705       631.4      39.5      00:14:19
 23132       8   4,235      33,880       641.9      40.1      00:14:11
 23479       7   4,235      29,645       651.5      40.7      00:14:05
 23858       7   4,235      29,645       661.9      41.4      00:13:57
 24234       5   4,235      21,175       671.9      42.0      00:13:49
 24648       7   4,235      29,645       683.4      42.7      00:13:39
 25117       8   4,235      33,880       696.5      43.6      00:13:25
 25583       8   4,235      33,880       709.5      44.4      00:13:11
 25940       5   4,235      21,175       719.6      45.0      00:13:03
 26304       9   4,235      38,115       729.9      45.6      00:12:55
 26701       8   4,235      33,880       740.5      46.3      00:12:46
 27091       7   4,235      29,645       751.4      47.0      00:12:37
 27442       7   4,235      29,645       761.2      47.6      00:12:30
 27839      10   4,235      42,350       772.5      48.3      00:12:19
 28262       9   4,235      38,115       784.6      49.1      00:12:08
 28678       8   4,235      33,880       796.9      49.8      00:11:56
 29033       6   4,235      25,410       807.2      50.5      00:11:47
 29446       9   4,235      38,115       819.0      51.2      00:11:36
 29816       9   4,235      38,115       829.3      51.9      00:11:28
 30095       9   4,235      38,115       837.3      52.4      00:11:23
 30423       4   4,235      16,940       846.7      52.9      00:11:16
 30821       5   4,235      21,175       858.4      53.7      00:11:05
 31302       7   4,235      29,645       872.2      54.5      00:10:51
 31768       9   4,235      38,115       885.9      55.4      00:10:37
 32216       6   4,235      25,410       899.3      56.2      00:10:23
 32588       5   4,235      21,175       910.3      56.9      00:10:14
 32855       6   4,235      25,410       918.1      57.4      00:10:09
 33129       9   4,235      38,115       926.3      57.9      00:10:04
 33510       7   4,235      29,645       937.3      58.6      00:09:54
 33917       6   4,235      25,410       949.4      59.4      00:09:42
 34338       7   4,235      29,645       962.1      60.2      00:09:30
 34832       2   4,235       8,470       976.6      61.1      00:09:15
 35306       8   4,235      33,880       990.6      61.9      00:09:01
 35779      10   4,235      42,350     1,004.3      62.8      00:08:48
 36288       9   4,235      38,115     1,019.2      63.7      00:08:33
 36735       6   4,235      25,410     1,032.0      64.5      00:08:21
 37113      10   4,235      42,350     1,042.7      65.2      00:08:12
 37519       4   4,235      16,940     1,053.5      65.9      00:08:02
 37875       6   4,235      25,410     1,063.3      66.5      00:07:54
 38245       3   4,235      12,705     1,073.9      67.2      00:07:45
 38581       9   4,235      38,115     1,083.8      67.8      00:07:37
 38921       9   4,235      38,115     1,093.5      68.4      00:07:29
 39319       7   4,235      29,645     1,104.6      69.1      00:07:19
 39715       7   4,235      29,645     1,115.6      69.8      00:07:10
 40204      10   4,235      42,350     1,129.3      70.6      00:06:57
 40721       5   4,235      21,175     1,144.2      71.6      00:06:42
 41152       7   4,235      29,645     1,156.7      72.3      00:06:31
 41549       8   4,235      33,880     1,168.0      73.0      00:06:21
 41959       6   4,235      25,410     1,180.0      73.8      00:06:10
 42339       8   4,235      33,880     1,189.9      74.4      00:06:02
 42691       7   4,235      29,645     1,199.9      75.0      00:05:53
 43041       8   4,235      33,880     1,209.9      75.7      00:05:45
 43438       5   4,235      21,175     1,221.8      76.4      00:05:34
 43821      10   4,235      42,350     1,232.2      77.1      00:05:25
 44177       6   4,235      25,410     1,242.2      77.7      00:05:17
 44621       7   4,235      29,645     1,254.6      78.5      00:05:05
 45060       9   4,235      38,115     1,267.0      79.2      00:04:54
 45517       9   4,235      38,115     1,279.3      80.0      00:04:43
 45901       9   4,235      38,115     1,289.5      80.6      00:04:34
 46290      10   4,235      42,350     1,300.9      81.4      00:04:24
 46683       7   4,235      29,645     1,312.0      82.0      00:04:14
 47099       3   4,235      12,705     1,323.4      82.8      00:04:04
 47485       3   4,235      12,705     1,333.6      83.4      00:03:55
 47842       8   4,235      33,880     1,343.5      84.0      00:03:47
 48202       6   4,235      25,410     1,353.7      84.7      00:03:38
 48590       3   4,235      12,705     1,364.8      85.3      00:03:28
 48964       7   4,235      29,645     1,375.2      86.0      00:03:19
 49350       9   4,235      38,115     1,386.1      86.7      00:03:09
 49910       5   4,235      21,175     1,400.8      87.6      00:02:56
 50368      10   4,235      42,350     1,413.4      88.4      00:02:44
 50753       9   4,235      38,115     1,424.2      89.1      00:02:35
 51117       5   4,235      21,175     1,434.9      89.7      00:02:26
 51496       8   4,235      33,880     1,445.5      90.4      00:02:16
 51846       6   4,235      25,410     1,455.9      91.0      00:02:07
 52170       8   4,235      33,880     1,465.6      91.7      00:01:59
 52489       5   4,235      21,175     1,475.2      92.3      00:01:50
 52816       9   4,235      38,115     1,485.4      92.9      00:01:41
 53172       7   4,235      29,645     1,496.0      93.5      00:01:32
 53633       8   4,235      33,880     1,509.5      94.4      00:01:20
 54023       9   4,235      38,115     1,520.6      95.1      00:01:10
 54434       8   4,235      33,880     1,532.1      95.8      00:00:60
 54878       9   4,235      38,115     1,544.1      96.6      00:00:49
 55281       9   4,235      38,115     1,555.3      97.3      00:00:39
 55660      10   4,235      42,350     1,565.3      97.9      00:00:30
 56024       8   4,235      33,880     1,575.8      98.5      00:00:21
 56427       7   4,235      29,645     1,587.6      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1426.915
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > /vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed940.
    > csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A200_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
