
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A900.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A900.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A900.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A900.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   336       4   4,935      19,740         9.6       0.5      00:32:23
   412       6   4,935      29,610        11.7       0.6      00:52:48
   588       6   4,935      29,610        17.0       0.9      00:54:38
   939       9   4,935      44,415        27.4       1.5      00:44:44
  1279       6   4,935      29,610        38.4       2.1      00:39:40
  1623       5   4,935      24,675        49.7       2.7      00:36:33
  1969      10   4,935      49,350        60.5       3.2      00:34:50
  2303       8   4,935      39,480        71.1       3.8      00:33:40
  2669       6   4,935      29,610        82.5       4.4      00:32:27
  3026       9   4,935      44,415        93.8       5.0      00:31:29
  3360       7   4,935      34,545       105.2       5.6      00:30:42
  3700       9   4,935      44,415       116.2       6.2      00:30:07
  4020       8   4,935      39,480       126.0       6.8      00:29:55
  4277       6   4,935      29,610       133.9       7.2      00:30:11
  4538       8   4,935      39,480       142.1       7.6      00:30:19
  4810       6   4,935      29,610       151.0       8.1      00:30:16
  5089       7   4,935      34,545       159.8       8.6      00:30:14
  5358       7   4,935      34,545       168.7       9.1      00:30:10
  5640       9   4,935      44,415       177.0       9.5      00:30:12
  5909       6   4,935      29,610       185.4      10.0      00:30:12
  6189       6   4,935      29,610       194.3      10.4      00:30:05
  6453       8   4,935      39,480       202.5      10.9      00:30:06
  6732      10   4,935      49,350       211.2      11.3      00:30:02
  6990       8   4,935      39,480       219.4      11.8      00:30:01
  7315       7   4,935      34,545       229.5      12.3      00:29:42
  7627       9   4,935      44,415       239.6      12.9      00:29:24
  7923       6   4,935      29,610       249.5      13.4      00:29:09
  8227       6   4,935      29,610       259.8      14.0      00:28:51
  8520       8   4,935      39,480       269.8      14.5      00:28:35
  8827       7   4,935      34,545       280.0      15.0      00:28:19
  9051       9   4,935      44,415       287.5      15.4      00:28:21
  9238       3   4,935      14,805       293.9      15.8      00:28:31
  9377       4   4,935      19,740       298.5      16.0      00:28:52
  9490       8   4,935      39,480       302.4      16.2      00:29:17
  9586       5   4,935      24,675       305.7      16.4      00:29:46
  9702       6   4,935      29,610       309.8      16.6      00:30:07
  9815       8   4,935      39,480       313.6      16.8      00:30:31
  9930       6   4,935      29,610       317.3      17.0      00:30:54
 10072       4   4,935      19,740       321.6      17.3      00:31:12
 10203       7   4,935      34,545       325.4      17.5      00:31:33
 10370       5   4,935      24,675       330.6      17.8      00:31:43
 10524       8   4,935      39,480       335.6      18.0      00:31:55
 10694       6   4,935      29,610       341.0      18.3      00:32:03
 10854       8   4,935      39,480       346.0      18.6      00:32:13
 11014       9   4,935      44,415       351.2      18.9      00:32:21
 11146       6   4,935      29,610       355.3      19.1      00:32:35
 11259       8   4,935      39,480       359.0      19.3      00:32:53
 11365       4   4,935      19,740       362.4      19.5      00:33:12
 11480       5   4,935      24,675       366.2      19.7      00:33:27
 11599       8   4,935      39,480       369.8      19.9      00:33:43
 11711       5   4,935      24,675       373.5      20.1      00:33:58
 11838       7   4,935      34,545       377.7      20.3      00:34:10
 11948       6   4,935      29,610       381.1      20.5      00:34:26
 12041       6   4,935      29,610       384.2      20.6      00:34:43
 12156       8   4,935      39,480       388.1      20.8      00:34:56
 12260       2   4,935       9,870       391.3      21.0      00:35:11
 12441       4   4,935      19,740       397.0      21.3      00:35:10
 12627       6   4,935      29,610       403.1      21.6      00:35:06
 12832       8   4,935      39,480       409.4      22.0      00:35:01
 13005       8   4,935      39,480       414.9      22.3      00:34:59
 13232       4   4,935      19,740       422.3      22.7      00:34:47
 13415       8   4,935      39,480       428.3      23.0      00:34:42
 13582       9   4,935      44,415       434.3      23.3      00:34:38
 13689       4   4,935      19,740       437.8      23.5      00:34:49
 13800      10   4,935      49,350       441.3      23.7      00:34:60
 13931       4   4,935      19,740       445.4      23.9      00:35:06
 14072       8   4,935      39,480       449.9      24.2      00:35:10
 14197       8   4,935      39,480       454.1      24.4      00:35:15
 14348      10   4,935      49,350       459.3      24.7      00:35:15
 14477       3   4,935      14,805       463.6      24.9      00:35:18
 14582       6   4,935      29,610       467.0      25.1      00:35:28
 14704       8   4,935      39,480       470.9      25.3      00:35:34
 14868       9   4,935      44,415       476.3      25.6      00:35:31
 15057      10   4,935      49,350       482.7      25.9      00:35:22
 15221       6   4,935      29,610       488.3      26.2      00:35:17
 15414       6   4,935      29,610       494.6      26.6      00:35:08
 15569       4   4,935      19,740       499.5      26.8      00:35:07
 15748       9   4,935      44,415       505.5      27.1      00:34:60
 15944       9   4,935      44,415       512.2      27.5      00:34:49
 16112      10   4,935      49,350       518.1      27.8      00:34:42
 16281       8   4,935      39,480       523.8      28.1      00:34:36
 16456       8   4,935      39,480       529.8      28.5      00:34:28
 16601       7   4,935      34,545       534.4      28.7      00:34:29
 16738      10   4,935      49,350       539.0      28.9      00:34:29
 16881       5   4,935      24,675       543.6      29.2      00:34:28
 16990       4   4,935      19,740       547.3      29.4      00:34:33
 17116      10   4,935      49,350       551.4      29.6      00:34:35
 17241       9   4,935      44,415       555.4      29.8      00:34:37
 17339      10   4,935      49,350       558.9      30.0      00:34:42
 17466       6   4,935      29,610       563.3      30.2      00:34:42
 17596       7   4,935      34,545       567.8      30.5      00:34:41
 17763       2   4,935       9,870       573.0      30.8      00:34:36
 17929       7   4,935      34,545       578.5      31.1      00:34:30
 18131       7   4,935      34,545       585.4      31.4      00:34:17
 18362       8   4,935      39,480       593.0      31.8      00:33:60
 18534       9   4,935      44,415       598.3      32.1      00:33:54
 18618       8   4,935      39,480       601.2      32.3      00:34:01
 18719       7   4,935      34,545       604.7      32.5      00:34:05
 18870       7   4,935      34,545       609.7      32.7      00:34:00
 19028       6   4,935      29,610       615.3      33.0      00:33:53
 19167       6   4,935      29,610       620.0      33.3      00:33:50
 19300       8   4,935      39,480       624.5      33.5      00:33:48
 19485       7   4,935      34,545       630.8      33.9      00:33:37
 19679       6   4,935      29,610       637.5      34.2      00:33:24
 19864       7   4,935      34,545       643.9      34.6      00:33:13
 20059      10   4,935      49,350       650.8      35.0      00:32:60
 20274      10   4,935      49,350       657.9      35.3      00:32:45
 20465       8   4,935      39,480       664.3      35.7      00:32:34
 20564       7   4,935      34,545       667.7      35.9      00:32:37
 20670       7   4,935      34,545       671.2      36.0      00:32:38
 20793       7   4,935      34,545       675.3      36.3      00:32:37
 20921       6   4,935      29,610       679.7      36.5      00:32:35
 21064       8   4,935      39,480       684.3      36.7      00:32:32
 21205      10   4,935      49,350       688.5      37.0      00:32:30
 21354       8   4,935      39,480       692.9      37.2      00:32:27
 21490      10   4,935      49,350       697.4      37.5      00:32:24
 21620       6   4,935      29,610       701.3      37.7      00:32:23
 21774       3   4,935      14,805       705.9      37.9      00:32:20
 21915       7   4,935      34,545       710.5      38.2      00:32:16
 22040       8   4,935      39,480       714.4      38.4      00:32:15
 22189       7   4,935      34,545       718.8      38.6      00:32:11
 22317      10   4,935      49,350       722.8      38.8      00:32:10
 22469      10   4,935      49,350       727.5      39.1      00:32:05
 22602       8   4,935      39,480       731.7      39.3      00:32:03
 22750       6   4,935      29,610       736.0      39.5      00:31:59
 22947       7   4,935      34,545       742.2      39.9      00:31:48
 23124       8   4,935      39,480       748.0      40.2      00:31:38
 23285       6   4,935      29,610       753.4      40.5      00:31:30
 23447       7   4,935      34,545       758.3      40.7      00:31:24
 23603       4   4,935      19,740       763.0      41.0      00:31:19
 23776      10   4,935      49,350       768.8      41.3      00:31:10
 23974      10   4,935      49,350       775.2      41.6      00:30:58
 24166       3   4,935      14,805       781.0      41.9      00:30:47
 24360       8   4,935      39,480       786.9      42.3      00:30:37
 24513       8   4,935      39,480       792.1      42.5      00:30:30
 24706      10   4,935      49,350       798.6      42.9      00:30:18
 24900       4   4,935      19,740       804.6      43.2      00:30:07
 25087      10   4,935      49,350       810.9      43.5      00:29:55
 25280       6   4,935      29,610       817.2      43.9      00:29:43
 25471      10   4,935      49,350       823.5      44.2      00:29:32
 25621      10   4,935      49,350       828.1      44.5      00:29:27
 25749       9   4,935      44,415       832.6      44.7      00:29:22
 25889       6   4,935      29,610       837.2      45.0      00:29:17
 25995      10   4,935      49,350       840.6      45.1      00:29:16
 26097       6   4,935      29,610       844.1      45.3      00:29:15
 26241      10   4,935      49,350       848.9      45.6      00:29:09
 26421      10   4,935      49,350       854.4      45.9      00:28:60
 26561       4   4,935      19,740       858.9      46.1      00:28:55
 26730      10   4,935      49,350       864.2      46.4      00:28:47
 26889       5   4,935      24,675       869.4      46.7      00:28:39
 27031      10   4,935      49,350       874.1      46.9      00:28:33
 27162       9   4,935      44,415       878.4      47.2      00:28:28
 27291       5   4,935      24,675       882.5      47.4      00:28:24
 27414       4   4,935      19,740       886.5      47.6      00:28:21
 27546       7   4,935      34,545       890.8      47.8      00:28:16
 27673       6   4,935      29,610       895.1      48.1      00:28:11
 27799      10   4,935      49,350       899.3      48.3      00:28:07
 27951      10   4,935      49,350       904.4      48.6      00:27:59
 28165       9   4,935      44,415       911.5      49.0      00:27:44
 28364      10   4,935      49,350       918.2      49.3      00:27:31
 28573       7   4,935      34,545       925.6      49.7      00:27:15
 28683       6   4,935      29,610       929.2      49.9      00:27:12
 28790       6   4,935      29,610       932.9      50.1      00:27:10
 28893       5   4,935      24,675       936.3      50.3      00:27:07
 29011      10   4,935      49,350       940.3      50.5      00:27:03
 29120       1   4,935       4,935       943.9      50.7      00:27:01
 29283       7   4,935      34,545       949.1      51.0      00:26:52
 29438       8   4,935      39,480       954.5      51.3      00:26:43
 29594       3   4,935      14,805       959.4      51.5      00:26:36
 29736       8   4,935      39,480       964.2      51.8      00:26:29
 29847       9   4,935      44,415       967.9      52.0      00:26:26
 29943       8   4,935      39,480       971.0      52.1      00:26:24
 30047       8   4,935      39,480       974.6      52.3      00:26:21
 30164       8   4,935      39,480       978.6      52.6      00:26:17
 30292       8   4,935      39,480       982.8      52.8      00:26:12
 30406       8   4,935      39,480       986.6      53.0      00:26:08
 30514       7   4,935      34,545       990.4      53.2      00:26:04
 30666       8   4,935      39,480       995.4      53.5      00:25:56
 30859       7   4,935      34,545     1,002.0      53.8      00:25:42
 31043       3   4,935      14,805     1,007.9      54.1      00:25:31
 31239       8   4,935      39,480     1,014.6      54.5      00:25:17
 31370       9   4,935      44,415     1,019.0      54.7      00:25:11
 31541       7   4,935      34,545     1,025.0      55.0      00:25:00
 31735      10   4,935      49,350     1,031.6      55.4      00:24:47
 31921       4   4,935      19,740     1,038.1      55.8      00:24:34
 32114       8   4,935      39,480     1,044.8      56.1      00:24:20
 32297       8   4,935      39,480     1,051.2      56.5      00:24:08
 32478       7   4,935      34,545     1,057.6      56.8      00:23:55
 32587       9   4,935      44,415     1,061.2      57.0      00:23:52
 32681       8   4,935      39,480     1,064.4      57.2      00:23:49
 32780       8   4,935      39,480     1,067.8      57.3      00:23:46
 32927       6   4,935      29,610     1,072.9      57.6      00:23:38
 33077       8   4,935      39,480     1,078.0      57.9      00:23:29
 33219       8   4,935      39,480     1,082.8      58.1      00:23:22
 33352       9   4,935      44,415     1,087.3      58.4      00:23:15
 33499       6   4,935      29,610     1,092.4      58.7      00:23:06
 33644       9   4,935      44,415     1,097.5      58.9      00:22:58
 33809      10   4,935      49,350     1,103.1      59.2      00:22:48
 33950       7   4,935      34,545     1,108.0      59.5      00:22:39
 34071       7   4,935      34,545     1,112.1      59.7      00:22:34
 34202       6   4,935      29,610     1,116.8      60.0      00:22:26
 34384       6   4,935      29,610     1,123.0      60.3      00:22:14
 34600      10   4,935      49,350     1,130.4      60.7      00:21:59
 34788       9   4,935      44,415     1,137.0      61.1      00:21:46
 35000       8   4,935      39,480     1,144.2      61.4      00:21:31
 35222       4   4,935      19,740     1,151.8      61.9      00:21:15
 35411       8   4,935      39,480     1,158.4      62.2      00:21:02
 35637       8   4,935      39,480     1,166.0      62.6      00:20:46
 35863       6   4,935      29,610     1,173.6      63.0      00:20:31
 36094       9   4,935      44,415     1,181.5      63.5      00:20:14
 36295       6   4,935      29,610     1,188.5      63.8      00:20:00
 36481       6   4,935      29,610     1,194.7      64.2      00:19:49
 36626       7   4,935      34,545     1,199.6      64.4      00:19:41
 36785       5   4,935      24,675     1,204.6      64.7      00:19:32
 36918       9   4,935      44,415     1,209.2      64.9      00:19:25
 37075      10   4,935      49,350     1,214.2      65.2      00:19:17
 37240      10   4,935      49,350     1,219.2      65.5      00:19:09
 37391       4   4,935      19,740     1,223.9      65.7      00:19:01
 37548       5   4,935      24,675     1,229.0      66.0      00:18:52
 37733       4   4,935      19,740     1,234.8      66.3      00:18:42
 37925       8   4,935      39,480     1,241.1      66.7      00:18:30
 38117      10   4,935      49,350     1,247.6      67.0      00:18:18
 38391       9   4,935      44,415     1,257.0      67.5      00:17:57
 38676      10   4,935      49,350     1,266.5      68.0      00:17:37
 38955       8   4,935      39,480     1,275.8      68.5      00:17:18
 39174       4   4,935      19,740     1,282.9      68.9      00:17:04
 39455      10   4,935      49,350     1,291.9      69.4      00:16:46
 39738      10   4,935      49,350     1,301.1      69.9      00:16:27
 40057      10   4,935      49,350     1,311.6      70.4      00:16:05
 40406       9   4,935      44,415     1,323.1      71.1      00:15:40
 40766       6   4,935      29,610     1,335.3      71.7      00:15:15
 41013       4   4,935      19,740     1,343.7      72.2      00:14:58
 41274       5   4,935      24,675     1,352.3      72.6      00:14:42
 41532       7   4,935      34,545     1,360.9      73.1      00:14:25
 41785       4   4,935      19,740     1,369.4      73.5      00:14:09
 42013       7   4,935      34,545     1,376.9      73.9      00:13:55
 42298       7   4,935      34,545     1,385.7      74.4      00:13:38
 42557       7   4,935      34,545     1,394.3      74.9      00:13:21
 42809       5   4,935      24,675     1,402.6      75.3      00:13:06
 43053       8   4,935      39,480     1,410.9      75.8      00:12:50
 43296      10   4,935      49,350     1,419.2      76.2      00:12:35
 43586       7   4,935      34,545     1,428.7      76.7      00:12:17
 43975       7   4,935      34,545     1,441.5      77.4      00:11:52
 44242       9   4,935      44,415     1,450.2      77.9      00:11:36
 44520       4   4,935      19,740     1,459.0      78.4      00:11:19
 44812       6   4,935      29,610     1,468.7      78.9      00:11:01
 45098       4   4,935      19,740     1,478.0      79.4      00:10:44
 45431       6   4,935      29,610     1,488.2      79.9      00:10:25
 45718      10   4,935      49,350     1,497.1      80.4      00:10:09
 46035       6   4,935      29,610     1,507.6      81.0      00:09:50
 46343       9   4,935      44,415     1,518.0      81.5      00:09:31
 46655       5   4,935      24,675     1,528.2      82.1      00:09:12
 46952       6   4,935      29,610     1,537.8      82.6      00:08:55
 47194       5   4,935      24,675     1,545.2      83.0      00:08:43
 47416       8   4,935      39,480     1,552.2      83.4      00:08:31
 47686      10   4,935      49,350     1,561.0      83.8      00:08:16
 47945       6   4,935      29,610     1,569.4      84.3      00:08:01
 48219       8   4,935      39,480     1,578.3      84.8      00:07:46
 48394       8   4,935      39,480     1,584.1      85.1      00:07:36
 48668       8   4,935      39,480     1,593.2      85.6      00:07:20
 48942       9   4,935      44,415     1,602.2      86.0      00:07:05
 49196       4   4,935      19,740     1,610.8      86.5      00:06:50
 49409       8   4,935      39,480     1,617.3      86.9      00:06:39
 49586       8   4,935      39,480     1,622.6      87.1      00:06:31
 49809      10   4,935      49,350     1,629.5      87.5      00:06:19
 50060       7   4,935      34,545     1,637.7      87.9      00:06:06
 50332       8   4,935      39,480     1,646.1      88.4      00:05:52
 50594       9   4,935      44,415     1,654.7      88.9      00:05:37
 50859       4   4,935      19,740     1,663.6      89.3      00:05:22
 51129       5   4,935      24,675     1,672.7      89.8      00:05:07
 51406       8   4,935      39,480     1,681.9      90.3      00:04:51
 51647       8   4,935      39,480     1,690.3      90.8      00:04:37
 51886      10   4,935      49,350     1,698.4      91.2      00:04:24
 52091       6   4,935      29,610     1,705.5      91.6      00:04:12
 52397       3   4,935      14,805     1,716.4      92.2      00:03:54
 52687      10   4,935      49,350     1,727.0      92.7      00:03:37
 53020       7   4,935      34,545     1,738.6      93.4      00:03:17
 53371      10   4,935      49,350     1,750.5      94.0      00:02:58
 53674       6   4,935      29,610     1,760.9      94.6      00:02:41
 53892       8   4,935      39,480     1,768.1      95.0      00:02:29
 54126       8   4,935      39,480     1,775.8      95.4      00:02:17
 54381       8   4,935      39,480     1,784.0      95.8      00:02:04
 54675       7   4,935      34,545     1,793.3      96.3      00:01:49
 54962       9   4,935      44,415     1,802.5      96.8      00:01:34
 55203       9   4,935      44,415     1,810.3      97.2      00:01:22
 55453      10   4,935      49,350     1,818.0      97.6      00:01:10
 55688       9   4,935      44,415     1,825.5      98.0      00:00:58
 55904       7   4,935      34,545     1,832.8      98.4      00:00:46
 56121      10   4,935      49,350     1,840.0      98.8      00:00:35
 56373       7   4,935      34,545     1,848.7      99.3      00:00:21
 56651       6   4,935      29,610     1,858.2      99.8      00:00:06

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,935     
Bases * Neighbors  (M)  = 1,862.1        Number of regions         = 56,767    
Computed distances (M)  = 1,862.08       Total run time (seconds)  = 2929.552
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A900.csv saved

. 
. cap log close

. 
end of do-file
