
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A1000_randomseed42.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A1000_randomseed42.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A1000_randomseed42.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed42.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   234       9   5,035      45,315         6.8       0.4      00:46:40
   512       9   5,035      45,315        15.0       0.8      00:42:03
   779      10   5,035      50,350        23.4       1.2      00:40:18
  1056       9   5,035      45,315        31.9       1.7      00:39:07
  1311       8   5,035      40,280        40.3       2.1      00:38:35
  1585       9   5,035      45,315        49.5       2.6      00:37:30
  1865       8   5,035      40,280        58.4       3.1      00:36:52
  2154      10   5,035      50,350        67.7       3.6      00:36:09
  2443       9   5,035      45,315        76.9       4.0      00:35:38
  2735      10   5,035      50,350        86.5       4.6      00:35:02
  3037       8   5,035      40,280        96.1       5.1      00:34:29
  3324       7   5,035      35,245       106.0       5.6      00:33:55
  3621       4   5,035      20,140       115.9       6.1      00:33:26
  3903       9   5,035      45,315       125.1       6.6      00:33:11
  4086       9   5,035      45,315       130.8       6.9      00:33:54
  4302       5   5,035      25,175       137.3       7.2      00:34:20
  4524       6   5,035      30,210       144.5       7.6      00:34:31
  4737       7   5,035      35,245       151.8       8.0      00:34:38
  4955       6   5,035      30,210       158.9       8.4      00:34:47
  5173       4   5,035      20,140       165.9       8.7      00:34:55
  5387      10   5,035      50,350       173.1       9.1      00:34:60
  5620      10   5,035      50,350       179.9       9.5      00:35:09
  5823       4   5,035      20,140       186.3       9.8      00:35:21
  6043       8   5,035      40,280       193.7      10.2      00:35:20
  6255       8   5,035      40,280       200.4      10.6      00:35:25
  6474      10   5,035      50,350       207.4      10.9      00:35:27
  6698       9   5,035      45,315       214.3      11.3      00:35:29
  6881       7   5,035      35,245       220.3      11.6      00:35:40
  7105      10   5,035      50,350       227.5      12.0      00:35:37
  7348      10   5,035      50,350       235.3      12.4      00:35:28
  7612       7   5,035      35,245       244.0      12.8      00:35:10
  7870       7   5,035      35,245       252.6      13.3      00:34:52
  8113      10   5,035      50,350       261.1      13.7      00:34:36
  8370       5   5,035      25,175       270.0      14.2      00:34:18
  8635      10   5,035      50,350       279.1      14.7      00:33:57
  8891       7   5,035      35,245       287.9      15.2      00:33:41
  9154       5   5,035      25,175       297.0      15.6      00:33:22
  9356       4   5,035      20,140       303.9      16.0      00:33:21
  9545       8   5,035      40,280       310.5      16.3      00:33:21
  9733       8   5,035      40,280       317.1      16.7      00:33:21
  9915       9   5,035      45,315       323.2      17.0      00:33:26
 10105       6   5,035      30,210       329.0      17.3      00:33:31
 10317       9   5,035      45,315       335.5      17.7      00:33:30
 10522       1   5,035       5,035       342.3      18.0      00:33:27
 10771       8   5,035      40,280       350.3      18.4      00:33:16
 11025       7   5,035      35,245       358.6      18.9      00:33:02
 11225       9   5,035      45,315       365.1      19.2      00:33:01
 11398       8   5,035      40,280       370.8      19.5      00:33:04
 11586       9   5,035      45,315       376.9      19.8      00:33:05
 11776       8   5,035      40,280       383.2      20.2      00:33:04
 11966       6   5,035      30,210       389.4      20.5      00:33:03
 12166       8   5,035      40,280       396.3      20.9      00:32:58
 12376       5   5,035      25,175       403.0      21.2      00:32:54
 12679       6   5,035      30,210       413.0      21.7      00:32:29
 12969       8   5,035      40,280       422.0      22.2      00:32:11
 13270       3   5,035      15,105       432.0      22.7      00:31:47
 13549       1   5,035       5,035       441.8      23.3      00:31:26
 13729       8   5,035      40,280       447.9      23.6      00:31:25
 13930       8   5,035      40,280       454.4      23.9      00:31:21
 14166       7   5,035      35,245       462.3      24.3      00:31:10
 14401       9   5,035      45,315       470.3      24.8      00:30:59
 14630       3   5,035      15,105       478.0      25.2      00:30:49
 14890      10   5,035      50,350       486.6      25.6      00:30:34
 15150       8   5,035      40,280       495.8      26.1      00:30:17
 15431       8   5,035      40,280       505.1      26.6      00:29:59
 15730       6   5,035      30,210       515.1      27.1      00:29:39
 16019       7   5,035      35,245       525.3      27.6      00:29:18
 16311       5   5,035      25,175       535.4      28.2      00:28:57
 16563       4   5,035      20,140       544.0      28.6      00:28:44
 16782       7   5,035      35,245       551.4      29.0      00:28:36
 17001       8   5,035      40,280       558.8      29.4      00:28:28
 17198      10   5,035      50,350       565.3      29.8      00:28:24
 17416       6   5,035      30,210       572.8      30.2      00:28:15
 17601       8   5,035      40,280       579.5      30.5      00:28:10
 17826       7   5,035      35,245       586.8      30.9      00:28:02
 18077       9   5,035      45,315       595.4      31.3      00:27:49
 18399       7   5,035      35,245       606.1      31.9      00:27:28
 18635       7   5,035      35,245       614.0      32.3      00:27:17
 18860       6   5,035      30,210       621.7      32.7      00:27:08
 19083       5   5,035      25,175       629.6      33.1      00:26:58
 19345       9   5,035      45,315       638.6      33.6      00:26:44
 19618       6   5,035      30,210       648.1      34.1      00:26:27
 19893      10   5,035      50,350       658.0      34.6      00:26:10
 20146       5   5,035      25,175       667.0      35.1      00:25:56
 20395       4   5,035      20,140       675.3      35.5      00:25:45
 20548       9   5,035      45,315       680.7      35.8      00:25:44
 20706       4   5,035      20,140       686.0      36.1      00:25:43
 20882      10   5,035      50,350       692.2      36.4      00:25:39
 21041       9   5,035      45,315       697.4      36.7      00:25:38
 21252       7   5,035      35,245       703.9      37.0      00:25:33
 21445       6   5,035      30,210       709.9      37.4      00:25:29
 21648       8   5,035      40,280       716.5      37.7      00:25:23
 21860       7   5,035      35,245       723.1      38.1      00:25:17
 22056       7   5,035      35,245       729.3      38.4      00:25:12
 22252       8   5,035      40,280       735.3      38.7      00:25:08
 22452       8   5,035      40,280       741.6      39.0      00:25:03
 22640       8   5,035      40,280       747.8      39.4      00:24:58
 22895       6   5,035      30,210       755.4      39.8      00:24:48
 23182       5   5,035      25,175       765.1      40.3      00:24:32
 23471      10   5,035      50,350       774.4      40.8      00:24:17
 23746       5   5,035      25,175       783.3      41.2      00:24:03
 24015       5   5,035      25,175       792.2      41.7      00:23:50
 24310       6   5,035      30,210       801.4      42.2      00:23:35
 24557       8   5,035      40,280       809.7      42.6      00:23:24
 24810       6   5,035      30,210       818.0      43.1      00:23:12
 25050      10   5,035      50,350       826.0      43.5      00:23:01
 25290       9   5,035      45,315       834.1      43.9      00:22:51
 25535      10   5,035      50,350       842.3      44.3      00:22:39
 25722       7   5,035      35,245       848.5      44.7      00:22:34
 25935       6   5,035      30,210       855.6      45.0      00:22:26
 26145      10   5,035      50,350       862.7      45.4      00:22:18
 26400       7   5,035      35,245       871.1      45.9      00:22:06
 26647       7   5,035      35,245       879.0      46.3      00:21:56
 26846       3   5,035      15,105       885.6      46.6      00:21:49
 27073       6   5,035      30,210       893.1      47.0      00:21:40
 27281       8   5,035      40,280       900.1      47.4      00:21:32
 27485       5   5,035      25,175       906.8      47.7      00:21:24
 27665      10   5,035      50,350       912.9      48.1      00:21:19
 27889       5   5,035      25,175       920.7      48.5      00:21:09
 28147      10   5,035      50,350       929.4      48.9      00:20:56
 28359       6   5,035      30,210       936.6      49.3      00:20:48
 28616       8   5,035      40,280       945.7      49.8      00:20:34
 28811      10   5,035      50,350       952.4      50.1      00:20:27
 28981       8   5,035      40,280       958.3      50.4      00:20:22
 29172      10   5,035      50,350       964.7      50.8      00:20:15
 29399       8   5,035      40,280       972.5      51.2      00:20:05
 29676       8   5,035      40,280       981.6      51.7      00:19:51
 29818       5   5,035      25,175       986.6      51.9      00:19:48
 29973       6   5,035      30,210       991.7      52.2      00:19:44
 30133       8   5,035      40,280       997.2      52.5      00:19:40
 30346       7   5,035      35,245     1,004.5      52.9      00:19:31
 30552       4   5,035      20,140     1,011.7      53.3      00:19:22
 30808       6   5,035      30,210     1,020.6      53.7      00:19:09
 31083       5   5,035      25,175     1,029.7      54.2      00:18:55
 31371       9   5,035      45,315     1,039.7      54.7      00:18:40
 31673       4   5,035      20,140     1,050.3      55.3      00:18:23
 31933       7   5,035      35,245     1,059.6      55.8      00:18:09
 32196       5   5,035      25,175     1,069.0      56.3      00:17:55
 32447       9   5,035      45,315     1,078.0      56.7      00:17:43
 32613      10   5,035      50,350     1,083.6      57.0      00:17:37
 32806       6   5,035      30,210     1,090.3      57.4      00:17:30
 32985       9   5,035      45,315     1,096.6      57.7      00:17:23
 33165       7   5,035      35,245     1,102.9      58.1      00:17:16
 33408       9   5,035      45,315     1,111.3      58.5      00:17:04
 33648       8   5,035      40,280     1,119.9      58.9      00:16:53
 33860       7   5,035      35,245     1,127.3      59.3      00:16:43
 34099       4   5,035      20,140     1,135.7      59.8      00:16:32
 34385       6   5,035      30,210     1,145.8      60.3      00:16:17
 34682      10   5,035      50,350     1,156.2      60.9      00:16:01
 34966       8   5,035      40,280     1,166.2      61.4      00:15:46
 35273       7   5,035      35,245     1,177.0      62.0      00:15:30
 35568       8   5,035      40,280     1,187.2      62.5      00:15:15
 35850      10   5,035      50,350     1,197.0      63.0      00:15:01
 36172       9   5,035      45,315     1,208.1      63.6      00:14:44
 36481       6   5,035      30,210     1,218.9      64.2      00:14:28
 36656       2   5,035      10,070     1,224.8      64.5      00:14:22
 36884       7   5,035      35,245     1,232.5      64.9      00:14:12
 37112       8   5,035      40,280     1,240.0      65.3      00:14:03
 37308       5   5,035      25,175     1,246.0      65.6      00:13:57
 37527       9   5,035      45,315     1,253.1      66.0      00:13:48
 37706       8   5,035      40,280     1,258.9      66.3      00:13:42
 37885       7   5,035      35,245     1,265.0      66.6      00:13:35
 38062       5   5,035      25,175     1,271.0      66.9      00:13:28
 38240       9   5,035      45,315     1,277.0      67.2      00:13:22
 38376       8   5,035      40,280     1,281.9      67.5      00:13:17
 38580       9   5,035      45,315     1,289.0      67.8      00:13:09
 38862       8   5,035      40,280     1,298.5      68.3      00:12:55
 39051      10   5,035      50,350     1,305.0      68.7      00:12:48
 39224       4   5,035      20,140     1,310.5      69.0      00:12:42
 39407       8   5,035      40,280     1,316.5      69.3      00:12:35
 39610       3   5,035      15,105     1,323.4      69.7      00:12:27
 39753       5   5,035      25,175     1,328.0      69.9      00:12:22
 39978      10   5,035      50,350     1,335.6      70.3      00:12:13
 40265       7   5,035      35,245     1,345.0      70.8      00:11:60
 40540       5   5,035      25,175     1,354.6      71.3      00:11:46
 40822       5   5,035      25,175     1,364.2      71.8      00:11:33
 41057      10   5,035      50,350     1,372.3      72.2      00:11:22
 41307       7   5,035      35,245     1,380.9      72.7      00:11:11
 41525       6   5,035      30,210     1,388.2      73.1      00:11:01
 41768       7   5,035      35,245     1,396.5      73.5      00:10:50
 41986       6   5,035      30,210     1,404.0      73.9      00:10:41
 42241       9   5,035      45,315     1,412.0      74.3      00:10:30
 42487       7   5,035      35,245     1,420.4      74.8      00:10:19
 42739       6   5,035      30,210     1,428.5      75.2      00:10:09
 42953       6   5,035      30,210     1,435.9      75.6      00:09:59
 43179       9   5,035      45,315     1,444.0      76.0      00:09:49
 43389       6   5,035      30,210     1,451.3      76.4      00:09:39
 43653       2   5,035      10,070     1,459.7      76.8      00:09:28
 43936       4   5,035      20,140     1,469.4      77.3      00:09:15
 44190       8   5,035      40,280     1,477.9      77.8      00:09:04
 44393       7   5,035      35,245     1,484.2      78.1      00:08:56
 44620       8   5,035      40,280     1,492.0      78.5      00:08:46
 44847      10   5,035      50,350     1,499.7      78.9      00:08:36
 45097       6   5,035      30,210     1,508.0      79.4      00:08:25
 45351       7   5,035      35,245     1,515.7      79.8      00:08:15
 45553       7   5,035      35,245     1,522.3      80.1      00:08:07
 45806       5   5,035      25,175     1,530.3      80.6      00:07:57
 46033       7   5,035      35,245     1,538.0      81.0      00:07:47
 46270       3   5,035      15,105     1,546.3      81.4      00:07:36
 46505       6   5,035      30,210     1,554.1      81.8      00:07:26
 46792       6   5,035      30,210     1,563.9      82.3      00:07:13
 47022       9   5,035      45,315     1,571.1      82.7      00:07:04
 47206       7   5,035      35,245     1,576.9      83.0      00:06:57
 47428       6   5,035      30,210     1,584.0      83.4      00:06:48
 47632      10   5,035      50,350     1,590.8      83.7      00:06:39
 47820       8   5,035      40,280     1,596.9      84.1      00:06:32
 48024      10   5,035      50,350     1,603.8      84.4      00:06:23
 48255       9   5,035      45,315     1,611.6      84.8      00:06:13
 48460       7   5,035      35,245     1,618.5      85.2      00:06:04
 48681       3   5,035      15,105     1,625.9      85.6      00:05:55
 48959       9   5,035      45,315     1,635.2      86.1      00:05:42
 49205      10   5,035      50,350     1,643.7      86.5      00:05:31
 49412       9   5,035      45,315     1,650.1      86.9      00:05:23
 49644       5   5,035      25,175     1,657.2      87.2      00:05:14
 49838       3   5,035      15,105     1,663.4      87.6      00:05:06
 50039       9   5,035      45,315     1,670.2      87.9      00:04:58
 50257       9   5,035      45,315     1,677.2      88.3      00:04:49
 50498       8   5,035      40,280     1,685.0      88.7      00:04:39
 50753       6   5,035      30,210     1,693.7      89.2      00:04:27
 51019       5   5,035      25,175     1,703.1      89.6      00:04:15
 51281       9   5,035      45,315     1,711.7      90.1      00:04:03
 51566       8   5,035      40,280     1,721.5      90.6      00:03:50
 51835       5   5,035      25,175     1,731.1      91.1      00:03:38
 52077       7   5,035      35,245     1,739.6      91.6      00:03:27
 52365       9   5,035      45,315     1,750.0      92.1      00:03:13
 52667       9   5,035      45,315     1,761.2      92.7      00:02:58
 52975       9   5,035      45,315     1,772.2      93.3      00:02:44
 53300      10   5,035      50,350     1,783.6      93.9      00:02:29
 53643       4   5,035      20,140     1,795.4      94.5      00:02:13
 53907       9   5,035      45,315     1,804.4      95.0      00:02:02
 54160       7   5,035      35,245     1,812.8      95.4      00:01:51
 54420       8   5,035      40,280     1,821.3      95.9      00:01:40
 54690       6   5,035      30,210     1,830.1      96.3      00:01:29
 54933       4   5,035      20,140     1,838.1      96.8      00:01:19
 55118      10   5,035      50,350     1,844.2      97.1      00:01:11
 55325       9   5,035      45,315     1,850.7      97.4      00:01:03
 55516       7   5,035      35,245     1,856.7      97.7      00:00:55
 55682       5   5,035      25,175     1,862.3      98.0      00:00:48
 55912       9   5,035      45,315     1,870.2      98.4      00:00:38
 56169      10   5,035      50,350     1,879.0      98.9      00:00:27
 56419       7   5,035      35,245     1,887.9      99.4      00:00:15
 56751       9   5,035      45,315     1,899.4     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 5,035     
Bases * Neighbors  (M)  = 1,899.8        Number of regions         = 56,767    
Computed distances (M)  = 1,899.82       Total run time (seconds)  = 2432.997
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A1000_randomseed42.csv sav
> ed

. 
. cap log close

. 
end of do-file
