
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_logdistabove1.6.dta /export/storage_covidvaccine
> /Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_to
> tal_10000_5_4q_mnl_logdistabove1.6.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove1.6.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   535       9   4,035      36,315        12.4       0.8      00:20:16
  1086       9   4,035      36,315        26.3       1.7      00:19:02
  1591       4   4,035      16,140        39.7       2.6      00:18:43
  2116       5   4,035      20,175        53.1       3.5      00:18:28
  2641      10   4,035      40,350        66.6       4.4      00:18:15
  3157       8   4,035      32,280        80.2       5.3      00:18:01
  3631       9   4,035      36,315        92.9       6.1      00:17:59
  4105       4   4,035      16,140       105.1       6.9      00:18:01
  4531       7   4,035      28,245       115.8       7.6      00:18:15
  4952       2   4,035       8,070       127.1       8.3      00:18:20
  5347       6   4,035      24,210       137.3       9.0      00:18:31
  5631       8   4,035      32,280       144.3       9.5      00:19:09
  5925       9   4,035      36,315       151.8      10.0      00:19:36
  6315       9   4,035      36,315       161.9      10.6      00:19:39
  6729      10   4,035      40,350       172.3      11.3      00:19:38
  7096       8   4,035      32,280       181.9      11.9      00:19:42
  7546       8   4,035      32,280       193.6      12.7      00:19:29
  7998       4   4,035      16,140       205.9      13.5      00:19:13
  8436       8   4,035      32,280       218.1      14.3      00:18:59
  8885       9   4,035      36,315       230.3      15.1      00:18:44
  9297       8   4,035      32,280       241.8      15.9      00:18:35
  9639      10   4,035      40,350       251.3      16.5      00:18:35
 10034       9   4,035      36,315       261.9      17.2      00:18:30
 10476       8   4,035      32,280       273.0      17.9      00:18:21
 10905       5   4,035      20,175       284.1      18.6      00:18:12
 11265       9   4,035      36,315       293.4      19.3      00:18:11
 11589       8   4,035      32,280       302.0      19.8      00:18:14
 11930       7   4,035      28,245       311.0      20.4      00:18:13
 12257       8   4,035      32,280       319.8      21.0      00:18:13
 12728       9   4,035      36,315       332.1      21.8      00:17:58
 13239       9   4,035      36,315       345.3      22.7      00:17:39
 13704       7   4,035      28,245       358.2      23.5      00:17:22
 14069       5   4,035      20,175       367.6      24.1      00:17:19
 14474       5   4,035      20,175       378.7      24.9      00:17:09
 14839       9   4,035      36,315       388.5      25.5      00:17:04
 15298      10   4,035      40,350       401.1      26.3      00:16:49
 15776       9   4,035      36,315       413.9      27.2      00:16:33
 16200       7   4,035      28,245       425.8      27.9      00:16:21
 16596      10   4,035      40,350       436.7      28.7      00:16:12
 16925      10   4,035      40,350       445.4      29.2      00:16:10
 17243      10   4,035      40,350       454.0      29.8      00:16:07
 17529       8   4,035      32,280       462.2      30.3      00:16:06
 17844       8   4,035      32,280       470.5      30.9      00:16:04
 18200       9   4,035      36,315       480.3      31.5      00:15:57
 18558       5   4,035      20,175       489.6      32.1      00:15:52
 18869       9   4,035      36,315       498.2      32.7      00:15:48
 19216       8   4,035      32,280       508.0      33.3      00:15:41
 19656       7   4,035      28,245       520.3      34.1      00:15:27
 20165       5   4,035      20,175       534.8      35.1      00:15:07
 20584       9   4,035      36,315       546.2      35.9      00:14:56
 20917       6   4,035      24,210       555.4      36.5      00:14:50
 21307       6   4,035      24,210       565.1      37.1      00:14:43
 21681       6   4,035      24,210       574.8      37.7      00:14:36
 22048       7   4,035      28,245       584.1      38.3      00:14:30
 22469       6   4,035      24,210       594.5      39.0      00:14:21
 22839       3   4,035      12,105       603.7      39.6      00:14:15
 23158       9   4,035      36,315       612.3      40.2      00:14:10
 23500      10   4,035      40,350       621.2      40.8      00:14:04
 23945       5   4,035      20,175       632.9      41.5      00:13:52
 24397       7   4,035      28,245       644.2      42.3      00:13:40
 24869       7   4,035      28,245       657.0      43.1      00:13:26
 25378       6   4,035      24,210       670.6      44.0      00:13:10
 25800       6   4,035      24,210       681.9      44.8      00:12:59
 26165       5   4,035      20,175       691.6      45.4      00:12:51
 26595       8   4,035      32,280       702.9      46.1      00:12:40
 27030       6   4,035      24,210       714.4      46.9      00:12:29
 27361       8   4,035      32,280       723.1      47.5      00:12:23
 27703       8   4,035      32,280       732.3      48.1      00:12:16
 28098       9   4,035      36,315       743.1      48.8      00:12:06
 28565       8   4,035      32,280       756.2      49.6      00:11:51
 28909       8   4,035      32,280       765.7      50.3      00:11:44
 29275       5   4,035      20,175       775.4      50.9      00:11:36
 29701       8   4,035      32,280       786.9      51.7      00:11:24
 30014       6   4,035      24,210       795.5      52.2      00:11:18
 30388       6   4,035      24,210       805.8      52.9      00:11:09
 30804       5   4,035      20,175       817.4      53.6      00:10:58
 31341       7   4,035      28,245       832.1      54.6      00:10:41
 31834       8   4,035      32,280       845.9      55.5      00:10:26
 32325       6   4,035      24,210       859.9      56.4      00:10:11
 32658       9   4,035      36,315       869.3      57.1      00:10:03
 32925       8   4,035      32,280       876.7      57.5      00:09:59
 33229       9   4,035      36,315       885.2      58.1      00:09:52
 33668       6   4,035      24,210       897.6      58.9      00:09:40
 34112       7   4,035      28,245       910.1      59.7      00:09:27
 34567       7   4,035      28,245       922.9      60.6      00:09:14
 35055       8   4,035      32,280       936.7      61.5      00:08:60
 35584       8   4,035      32,280       951.5      62.5      00:08:44
 36120       8   4,035      32,280       966.3      63.4      00:08:28
 36619       9   4,035      36,315       980.2      64.3      00:08:14
 37034       2   4,035       8,070       991.3      65.1      00:08:04
 37452       5   4,035      20,175     1,002.0      65.8      00:07:54
 37857       7   4,035      28,245     1,012.6      66.5      00:07:45
 38221      10   4,035      40,350     1,022.6      67.1      00:07:36
 38573       6   4,035      24,210     1,032.4      67.8      00:07:28
 38919      10   4,035      40,350     1,041.8      68.4      00:07:20
 39315       8   4,035      32,280     1,052.4      69.1      00:07:11
 39737       8   4,035      32,280     1,063.5      69.8      00:07:00
 40251       6   4,035      24,210     1,077.3      70.7      00:06:47
 40794       7   4,035      28,245     1,092.2      71.7      00:06:32
 41170       9   4,035      36,315     1,102.5      72.4      00:06:23
 41559      10   4,035      40,350     1,113.1      73.1      00:06:13
 41957       6   4,035      24,210     1,124.2      73.8      00:06:03
 42304       5   4,035      20,175     1,132.9      74.4      00:05:56
 42633      10   4,035      40,350     1,141.7      74.9      00:05:48
 42957       8   4,035      32,280     1,150.5      75.5      00:05:41
 43272       8   4,035      32,280     1,159.4      76.1      00:05:33
 43602       9   4,035      36,315     1,168.3      76.7      00:05:26
 43919       6   4,035      24,210     1,176.8      77.2      00:05:19
 44244      10   4,035      40,350     1,185.4      77.8      00:05:11
 44581       8   4,035      32,280     1,194.2      78.4      00:05:04
 44990       4   4,035      16,140     1,205.4      79.1      00:04:53
 45446       8   4,035      32,280     1,216.9      79.9      00:04:43
 45858       8   4,035      32,280     1,227.5      80.6      00:04:33
 46171       5   4,035      20,175     1,236.0      81.1      00:04:26
 46550       5   4,035      20,175     1,246.4      81.8      00:04:16
 47021       9   4,035      36,315     1,258.9      82.6      00:04:04
 47421       5   4,035      20,175     1,269.1      83.3      00:03:55
 47807       5   4,035      20,175     1,279.2      84.0      00:03:46
 48199       8   4,035      32,280     1,289.7      84.6      00:03:36
 48602       9   4,035      36,315     1,300.7      85.4      00:03:26
 48931       5   4,035      20,175     1,309.4      85.9      00:03:18
 49244       7   4,035      28,245     1,318.0      86.5      00:03:11
 49687       7   4,035      28,245     1,329.0      87.2      00:03:00
 50168       9   4,035      36,315     1,341.6      88.1      00:02:48
 50582       9   4,035      36,315     1,352.3      88.8      00:02:39
 51001       6   4,035      24,210     1,363.9      89.5      00:02:28
 51437       8   4,035      32,280     1,375.7      90.3      00:02:17
 51805       7   4,035      28,245     1,386.1      91.0      00:02:07
 52225       6   4,035      24,210     1,398.0      91.8      00:01:56
 52626       6   4,035      24,210     1,409.6      92.5      00:01:45
 53034       8   4,035      32,280     1,421.5      93.3      00:01:34
 53497       8   4,035      32,280     1,434.4      94.1      00:01:22
 53900       6   4,035      24,210     1,445.5      94.9      00:01:12
 54222      10   4,035      40,350     1,454.1      95.4      00:01:04
 54639       5   4,035      20,175     1,464.8      96.1      00:00:54
 55104       5   4,035      20,175     1,477.2      97.0      00:00:43
 55526       9   4,035      36,315     1,488.0      97.7      00:00:33
 55897       8   4,035      32,280     1,498.0      98.3      00:00:24
 56328      10   4,035      40,350     1,509.8      99.1      00:00:13
 56771      10   4,035      40,350     1,522.2      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1408.563
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6.csv saved

. 
. cap log close

. 
end of do-file
