
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_l
> ocations_total_10000_5_4q_mnl_A800_randomseed940.dta /export/storage_covidvac
> cine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_di
> st_total_10000_5_4q_mnl_A800_randomseed940.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_A800_randomseed940.d
> ta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed940.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   257       8   4,835      38,680         7.1       0.4      00:42:45
   518       5   4,835      24,175        14.6       0.8      00:41:25
   764       6   4,835      29,010        21.9       1.2      00:41:09
  1026       8   4,835      38,680        29.7       1.6      00:40:21
  1260       8   4,835      38,680        37.1       2.0      00:40:13
  1502       9   4,835      43,515        44.9       2.5      00:39:42
  1754       9   4,835      43,515        52.8       2.9      00:39:11
  2026       9   4,835      43,515        60.9       3.3      00:38:40
  2305       8   4,835      38,680        69.7       3.8      00:37:49
  2598       8   4,835      38,680        78.6       4.3      00:37:06
  2888       5   4,835      24,175        87.9       4.8      00:36:18
  3165       6   4,835      29,010        96.6       5.3      00:35:52
  3436       5   4,835      24,175       105.5       5.8      00:35:23
  3700       9   4,835      43,515       113.8       6.2      00:35:08
  3952      10   4,835      48,350       121.4       6.7      00:35:09
  4165      10   4,835      48,350       128.0       7.0      00:35:27
  4391       5   4,835      24,175       134.5       7.4      00:35:41
  4602       5   4,835      24,175       141.3       7.7      00:35:49
  4819       5   4,835      24,175       148.2       8.1      00:35:54
  5045       9   4,835      43,515       155.4       8.5      00:35:54
  5275      10   4,835      48,350       162.4       8.9      00:35:55
  5473       2   4,835       9,670       168.6       9.2      00:36:07
  5683       9   4,835      43,515       174.7       9.6      00:36:19
  5839       7   4,835      33,845       179.4       9.8      00:36:47
  5958       3   4,835      14,505       183.2      10.0      00:37:27
  6073      10   4,835      48,350       186.9      10.2      00:38:04
  6229       7   4,835      33,845       191.7      10.5      00:38:26
  6381       4   4,835      19,340       196.2      10.8      00:38:50
  6525       8   4,835      38,680       200.6      11.0      00:39:14
  6650       9   4,835      43,515       204.4      11.2      00:39:44
  6772       7   4,835      33,845       208.1      11.4      00:40:15
  6882       7   4,835      33,845       211.6      11.6      00:40:47
  7054       6   4,835      29,010       216.8      11.9      00:40:55
  7261       8   4,835      38,680       223.0      12.2      00:40:49
  7448       6   4,835      29,010       229.1      12.6      00:40:45
  7639       5   4,835      24,175       235.1      12.9      00:40:41
  7835       6   4,835      29,010       241.4      13.2      00:40:33
  8023       6   4,835      29,010       247.8      13.6      00:40:25
  8216       6   4,835      29,010       254.2      13.9      00:40:16
  8422       3   4,835      14,505       261.0      14.3      00:40:03
  8625       8   4,835      38,680       267.7      14.7      00:39:51
  8821      10   4,835      48,350       274.1      15.0      00:39:43
  9015       9   4,835      43,515       280.5      15.4      00:39:33
  9192       8   4,835      38,680       286.4      15.7      00:39:30
  9293       7   4,835      33,845       289.8      15.9      00:39:50
  9393      10   4,835      48,350       293.0      16.1      00:40:11
  9526       8   4,835      38,680       297.5      16.3      00:40:20
  9680       7   4,835      33,845       302.8      16.6      00:40:19
  9850       3   4,835      14,505       308.3      16.9      00:40:17
  9995       5   4,835      24,175       312.7      17.1      00:40:24
 10200       5   4,835      24,175       318.7      17.5      00:40:17
 10396       5   4,835      24,175       324.7      17.8      00:40:08
 10622       8   4,835      38,680       331.7      18.2      00:39:52
 10854       8   4,835      38,680       339.0      18.6      00:39:33
 11076       7   4,835      33,845       345.9      19.0      00:39:18
 11257      10   4,835      48,350       351.6      19.3      00:39:13
 11458       5   4,835      24,175       358.0      19.6      00:39:01
 11672       5   4,835      24,175       364.7      20.0      00:38:48
 11876       9   4,835      43,515       371.2      20.3      00:38:37
 12070       9   4,835      43,515       377.4      20.7      00:38:27
 12254       7   4,835      33,845       383.3      21.0      00:38:21
 12514       9   4,835      43,515       391.5      21.5      00:37:56
 12796       4   4,835      19,340       400.0      21.9      00:37:30
 13077       4   4,835      19,340       408.8      22.4      00:37:03
 13363      10   4,835      48,350       417.9      22.9      00:36:34
 13595       7   4,835      33,845       426.0      23.3      00:36:13
 13785       8   4,835      38,680       431.9      23.7      00:36:07
 13972       9   4,835      43,515       437.7      24.0      00:36:01
 14197       8   4,835      38,680       444.9      24.4      00:35:45
 14428       6   4,835      29,010       452.5      24.8      00:35:28
 14633       6   4,835      29,010       459.1      25.2      00:35:17
 14867       7   4,835      33,845       466.6      25.6      00:35:01
 15150       8   4,835      38,680       476.1      26.1      00:34:33
 15431       8   4,835      38,680       485.1      26.6      00:34:09
 15703       4   4,835      19,340       493.7      27.1      00:33:47
 15974       9   4,835      43,515       502.9      27.6      00:33:23
 16244       6   4,835      29,010       511.9      28.1      00:32:60
 16511       9   4,835      43,515       520.9      28.6      00:32:37
 16714       9   4,835      43,515       527.3      28.9      00:32:29
 16924       7   4,835      33,845       534.0      29.3      00:32:19
 17112       9   4,835      43,515       540.0      29.6      00:32:12
 17294       7   4,835      33,845       545.9      29.9      00:32:05
 17465       6   4,835      29,010       551.8      30.2      00:31:59
 17630       7   4,835      33,845       557.4      30.6      00:31:54
 17851       8   4,835      38,680       564.3      30.9      00:31:43
 18077       9   4,835      43,515       571.7      31.3      00:31:30
 18363       3   4,835      14,505       581.0      31.8      00:31:07
 18587       6   4,835      29,010       587.9      32.2      00:30:56
 18770       7   4,835      33,845       594.2      32.6      00:30:48
 18957       8   4,835      38,680       600.4      32.9      00:30:40
 19131       9   4,835      43,515       606.3      33.2      00:30:33
 19371       6   4,835      29,010       614.1      33.7      00:30:18
 19646       6   4,835      29,010       623.4      34.2      00:29:56
 19914       8   4,835      38,680       632.6      34.7      00:29:36
 20184       9   4,835      43,515       641.8      35.2      00:29:15
 20463      10   4,835      48,350       650.7      35.7      00:28:56
 20631       6   4,835      29,010       656.4      36.0      00:28:51
 20816      10   4,835      48,350       662.4      36.3      00:28:44
 20988       5   4,835      24,175       668.1      36.6      00:28:38
 21196       8   4,835      38,680       674.3      37.0      00:28:30
 21411       6   4,835      29,010       680.6      37.3      00:28:22
 21620       6   4,835      29,010       687.1      37.7      00:28:13
 21821       9   4,835      43,515       693.1      38.0      00:28:06
 22037       3   4,835      14,505       699.8      38.4      00:27:56
 22256       1   4,835       4,835       706.2      38.7      00:27:47
 22456       5   4,835      24,175       712.3      39.0      00:27:40
 22676       4   4,835      19,340       719.2      39.4      00:27:29
 22965       9   4,835      43,515       727.7      39.9      00:27:12
 23255       6   4,835      29,010       737.1      40.4      00:26:52
 23572       6   4,835      29,010       746.6      40.9      00:26:32
 23863      10   4,835      48,350       756.0      41.4      00:26:13
 24153       9   4,835      43,515       764.8      41.9      00:25:56
 24455       7   4,835      33,845       774.2      42.4      00:25:37
 24725       7   4,835      33,845       783.0      42.9      00:25:20
 25005       7   4,835      33,845       791.7      43.4      00:25:04
 25293       9   4,835      43,515       801.0      43.9      00:24:46
 25572       6   4,835      29,010       809.8      44.4      00:24:30
 25771       6   4,835      29,010       816.4      44.8      00:24:21
 25979       7   4,835      33,845       823.0      45.1      00:24:12
 26202      10   4,835      48,350       830.3      45.5      00:24:00
 26445      10   4,835      48,350       837.9      45.9      00:23:48
 26709       8   4,835      38,680       846.0      46.4      00:23:35
 26974       5   4,835      24,175       854.7      46.9      00:23:19
 27184       9   4,835      43,515       861.3      47.2      00:23:10
 27363       6   4,835      29,010       866.9      47.5      00:23:04
 27539       9   4,835      43,515       872.6      47.8      00:22:58
 27751       6   4,835      29,010       879.5      48.2      00:22:48
 28010       2   4,835       9,670       887.9      48.7      00:22:34
 28283       7   4,835      33,845       896.9      49.2      00:22:17
 28553       7   4,835      33,845       906.1      49.7      00:22:01
 28761       3   4,835      14,505       913.0      50.0      00:21:51
 28937       8   4,835      38,680       918.8      50.4      00:21:44
 29115      10   4,835      48,350       924.7      50.7      00:21:38
 29356      10   4,835      48,350       932.4      51.1      00:21:25
 29613       9   4,835      43,515       940.6      51.6      00:21:12
 29816       3   4,835      14,505       947.3      51.9      00:21:02
 29997      10   4,835      48,350       953.2      52.2      00:20:56
 30172       8   4,835      38,680       959.0      52.6      00:20:49
 30400       8   4,835      38,680       966.4      53.0      00:20:38
 30629       5   4,835      24,175       974.0      53.4      00:20:26
 30908       6   4,835      29,010       983.3      53.9      00:20:09
 31175       5   4,835      24,175       991.9      54.4      00:19:55
 31462       8   4,835      38,680     1,001.6      54.9      00:19:38
 31754      10   4,835      48,350     1,011.4      55.4      00:19:21
 32031       7   4,835      33,845     1,020.9      56.0      00:19:04
 32315       7   4,835      33,845     1,030.6      56.5      00:18:47
 32547       5   4,835      24,175     1,038.4      56.9      00:18:36
 32715       9   4,835      43,515     1,044.0      57.2      00:18:29
 32898       8   4,835      38,680     1,050.1      57.6      00:18:22
 33079       9   4,835      43,515     1,056.3      57.9      00:18:14
 33278       7   4,835      33,845     1,062.9      58.3      00:18:05
 33520       7   4,835      33,845     1,071.0      58.7      00:17:52
 33765      10   4,835      48,350     1,079.3      59.2      00:17:39
 34006       8   4,835      38,680     1,087.4      59.6      00:17:27
 34238       7   4,835      33,845     1,095.4      60.0      00:17:14
 34524       8   4,835      38,680     1,104.9      60.6      00:16:58
 34825       7   4,835      33,845     1,115.2      61.1      00:16:41
 35129       8   4,835      38,680     1,125.3      61.7      00:16:24
 35428       8   4,835      38,680     1,135.5      62.2      00:16:07
 35711       4   4,835      19,340     1,144.7      62.7      00:15:52
 36005       9   4,835      43,515     1,154.6      63.3      00:15:36
 36291       7   4,835      33,845     1,164.3      63.8      00:15:21
 36560      10   4,835      48,350     1,173.0      64.3      00:15:07
 36756       7   4,835      33,845     1,179.2      64.6      00:14:60
 36946       5   4,835      24,175     1,185.5      65.0      00:14:52
 37160       4   4,835      19,340     1,192.0      65.3      00:14:43
 37347       9   4,835      43,515     1,197.7      65.7      00:14:36
 37529      10   4,835      48,350     1,203.4      66.0      00:14:29
 37703       9   4,835      43,515     1,208.8      66.3      00:14:23
 37903      10   4,835      48,350     1,215.3      66.6      00:14:14
 38098       8   4,835      38,680     1,221.6      67.0      00:14:06
 38301       6   4,835      29,010     1,228.4      67.3      00:13:57
 38500      10   4,835      48,350     1,235.1      67.7      00:13:47
 38770       6   4,835      29,010     1,243.9      68.2      00:13:34
 38994       6   4,835      29,010     1,251.3      68.6      00:13:24
 39173       7   4,835      33,845     1,256.9      68.9      00:13:17
 39382       6   4,835      29,010     1,263.4      69.3      00:13:08
 39575       8   4,835      38,680     1,269.7      69.6      00:12:60
 39787      10   4,835      48,350     1,276.3      70.0      00:12:51
 40039      10   4,835      48,350     1,284.5      70.4      00:12:39
 40317       7   4,835      33,845     1,293.3      70.9      00:12:25
 40582      10   4,835      48,350     1,302.2      71.4      00:12:12
 40850       3   4,835      14,505     1,310.9      71.9      00:11:59
 41032      10   4,835      48,350     1,317.1      72.2      00:11:50
 41204       9   4,835      43,515     1,322.7      72.5      00:11:43
 41424       7   4,835      33,845     1,329.8      72.9      00:11:34
 41646       6   4,835      29,010     1,337.0      73.3      00:11:23
 41873       8   4,835      38,680     1,344.6      73.7      00:11:12
 42048       7   4,835      33,845     1,350.0      74.0      00:11:06
 42242       7   4,835      33,845     1,355.9      74.3      00:10:58
 42407       7   4,835      33,845     1,361.4      74.6      00:10:51
 42599      10   4,835      48,350     1,367.3      74.9      00:10:43
 42764       9   4,835      43,515     1,372.7      75.2      00:10:37
 42948      10   4,835      48,350     1,378.7      75.6      00:10:29
 43106       9   4,835      43,515     1,384.1      75.9      00:10:22
 43299       5   4,835      24,175     1,390.6      76.2      00:10:13
 43471       7   4,835      33,845     1,396.2      76.5      00:10:06
 43746       9   4,835      43,515     1,404.8      77.0      00:09:53
 44033       8   4,835      38,680     1,414.1      77.5      00:09:39
 44225       8   4,835      38,680     1,420.3      77.8      00:09:31
 44410       7   4,835      33,845     1,425.9      78.2      00:09:23
 44660       4   4,835      19,340     1,434.0      78.6      00:09:11
 44915       9   4,835      43,515     1,442.3      79.1      00:08:59
 45177       8   4,835      38,680     1,450.4      79.5      00:08:47
 45401       9   4,835      43,515     1,457.1      79.9      00:08:38
 45594       7   4,835      33,845     1,463.0      80.2      00:08:30
 45834       8   4,835      38,680     1,470.4      80.6      00:08:20
 46057       7   4,835      33,845     1,477.6      81.0      00:08:09
 46262       8   4,835      38,680     1,484.6      81.4      00:07:60
 46497      10   4,835      48,350     1,492.1      81.8      00:07:49
 46756       7   4,835      33,845     1,500.5      82.2      00:07:37
 46970       4   4,835      19,340     1,507.2      82.6      00:07:27
 47169       8   4,835      38,680     1,513.0      82.9      00:07:19
 47365       2   4,835       9,670     1,519.3      83.3      00:07:11
 47563       6   4,835      29,010     1,525.3      83.6      00:07:03
 47745       8   4,835      38,680     1,531.2      83.9      00:06:55
 47935       7   4,835      33,845     1,537.3      84.3      00:06:46
 48132       7   4,835      33,845     1,543.5      84.6      00:06:38
 48323       9   4,835      43,515     1,549.8      85.0      00:06:29
 48547       5   4,835      24,175     1,557.0      85.3      00:06:19
 48756       6   4,835      29,010     1,563.7      85.7      00:06:09
 48943       9   4,835      43,515     1,569.7      86.0      00:06:01
 49135       9   4,835      43,515     1,576.1      86.4      00:05:52
 49330       6   4,835      29,010     1,582.2      86.7      00:05:44
 49527       4   4,835      19,340     1,588.1      87.1      00:05:36
 49735       6   4,835      29,010     1,594.2      87.4      00:05:27
 49934       8   4,835      38,680     1,600.5      87.7      00:05:18
 50156      10   4,835      48,350     1,607.5      88.1      00:05:08
 50389       7   4,835      33,845     1,614.5      88.5      00:04:58
 50594       9   4,835      43,515     1,621.2      88.9      00:04:49
 50780       4   4,835      19,340     1,627.4      89.2      00:04:40
 50965       5   4,835      24,175     1,633.6      89.5      00:04:32
 51171       6   4,835      29,010     1,640.2      89.9      00:04:22
 51367       7   4,835      33,845     1,646.5      90.3      00:04:13
 51585       6   4,835      29,010     1,653.8      90.7      00:04:03
 51829       5   4,835      24,175     1,662.1      91.1      00:03:51
 52089      10   4,835      48,350     1,670.9      91.6      00:03:38
 52381       7   4,835      33,845     1,681.1      92.1      00:03:23
 52679       9   4,835      43,515     1,691.7      92.7      00:03:08
 52969       9   4,835      43,515     1,701.6      93.3      00:02:54
 53267       5   4,835      24,175     1,711.6      93.8      00:02:39
 53572       4   4,835      19,340     1,721.8      94.4      00:02:24
 53809       6   4,835      29,010     1,729.6      94.8      00:02:13
 54030       7   4,835      33,845     1,736.7      95.2      00:02:03
 54263      10   4,835      48,350     1,744.3      95.6      00:01:53
 54539       8   4,835      38,680     1,752.4      96.1      00:01:41
 54809       9   4,835      43,515     1,761.0      96.5      00:01:29
 55055       7   4,835      33,845     1,768.9      97.0      00:01:18
 55301      10   4,835      48,350     1,776.4      97.4      00:01:07
 55527       6   4,835      29,010     1,783.3      97.7      00:00:58
 55740       8   4,835      38,680     1,790.2      98.1      00:00:48
 55979       5   4,835      24,175     1,798.1      98.6      00:00:37
 56223       8   4,835      38,680     1,806.2      99.0      00:00:26
 56483       7   4,835      33,845     1,815.0      99.5      00:00:13

-------------------------------------------------------------------------------
Unique base locations   = 377,322        Unique neighbor locations = 4,835     
Bases * Neighbors  (M)  = 1,824.4        Number of regions         = 56,767    
Computed distances (M)  = 1,824.35       Total run time (seconds)  = 2565.819
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,866,100

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar//
> vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_A800_randomseed940.csv sav
> ed

. 
. cap log close

. 
end of do-file
