
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_High
> Schools_locations_total_10000_5_4q_mnl_A200.dta /export/storage_covidvaccine/
> Result/MNL_partial_new/M5_K10000_4q/HighSchools//vaccinated/ca_blk_HighSchool
> s_dist_total_10000_5_4q_mnl_A200.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/High
> Schools//vaccinated/ca_HighSchools_locations_total_10000_5_4q_mnl_A200.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighS
> chools//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A200.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   355       9   4,235      38,115         8.6       0.5      00:31:05
   720       8   4,235      33,880        17.8       1.1      00:29:42
  1099       8   4,235      33,880        27.9       1.7      00:28:15
  1493       9   4,235      38,115        38.9       2.4      00:26:47
  1873       8   4,235      33,880        49.2       3.1      00:26:18
  2305       7   4,235      29,645        60.9       3.8      00:25:18
  2680       6   4,235      25,410        70.9       4.4      00:25:12
  3084       4   4,235      16,940        81.9       5.1      00:24:45
  3450       7   4,235      29,645        92.6       5.8      00:24:27
  3833      10   4,235      42,350       103.2       6.5      00:24:11
  4089       8   4,235      33,880       109.9       6.9      00:24:53
  4391       7   4,235      29,645       117.7       7.4      00:25:13
  4606       7   4,235      29,645       123.7       7.7      00:25:53
  4900       9   4,235      38,115       132.0       8.3      00:25:60
  5140       4   4,235      16,940       138.4       8.7      00:26:27
  5408      10   4,235      42,350       146.0       9.1      00:26:36
  5591       4   4,235      16,940       150.4       9.4      00:27:21
  5809       7   4,235      29,645       156.2       9.8      00:27:47
  6099       9   4,235      38,115       164.2      10.3      00:27:45
  6346       7   4,235      29,645       170.7      10.7      00:27:58
  6640       3   4,235      12,705       178.5      11.2      00:27:55
  6907       7   4,235      29,645       185.8      11.6      00:27:57
  7282       5   4,235      21,175       195.7      12.2      00:27:33
  7630       8   4,235      33,880       205.6      12.9      00:27:11
  7978      10   4,235      42,350       215.5      13.5      00:26:49
  8324       8   4,235      33,880       225.6      14.1      00:26:27
  8685       8   4,235      33,880       235.9      14.8      00:26:04
  8974       4   4,235      16,940       244.4      15.3      00:25:55
  9264       4   4,235      16,940       252.8      15.8      00:25:48
  9453       5   4,235      21,175       258.2      16.1      00:26:01
  9695       8   4,235      33,880       265.5      16.6      00:26:01
  9946       8   4,235      33,880       272.5      17.0      00:26:01
 10209       5   4,235      21,175       279.2      17.5      00:26:03
 10492       6   4,235      25,410       287.0      17.9      00:25:58
 10797      10   4,235      42,350       295.2      18.5      00:25:50
 11125       5   4,235      21,175       304.2      19.0      00:25:36
 11376       6   4,235      25,410       311.1      19.5      00:25:35
 11590       6   4,235      25,410       316.9      19.8      00:25:41
 11861       7   4,235      29,645       324.6      20.3      00:25:35
 12065       5   4,235      21,175       330.2      20.7      00:25:41
 12291       6   4,235      25,410       336.5      21.0      00:25:42
 12601       6   4,235      25,410       345.0      21.6      00:25:30
 13035       6   4,235      25,410       356.7      22.3      00:25:01
 13347       6   4,235      25,410       365.4      22.8      00:24:49
 13667       8   4,235      33,880       374.9      23.4      00:24:33
 13917       5   4,235      21,175       381.7      23.9      00:24:30
 14185       7   4,235      29,645       389.2      24.3      00:24:24
 14485       9   4,235      38,115       397.9      24.9      00:24:12
 14787       6   4,235      25,410       406.3      25.4      00:24:02
 15142       6   4,235      25,410       416.5      26.0      00:23:43
 15521       6   4,235      25,410       427.3      26.7      00:23:22
 15918       7   4,235      29,645       438.5      27.4      00:22:59
 16258       6   4,235      25,410       448.6      28.1      00:22:42
 16589       9   4,235      38,115       458.1      28.6      00:22:28
 16803       7   4,235      29,645       464.2      29.0      00:22:28
 17052       7   4,235      29,645       471.3      29.5      00:22:23
 17229       9   4,235      38,115       476.1      29.8      00:22:27
 17485       6   4,235      25,410       483.7      30.2      00:22:20
 17654       8   4,235      33,880       488.7      30.6      00:22:23
 17977       6   4,235      25,410       497.6      31.1      00:22:11
 18326       8   4,235      33,880       507.7      31.7      00:21:54
 18655       8   4,235      33,880       516.8      32.3      00:21:41
 18913       9   4,235      38,115       524.3      32.8      00:21:34
 19092       6   4,235      25,410       529.6      33.1      00:21:35
 19349       3   4,235      12,705       537.1      33.6      00:21:28
 19697       4   4,235      16,940       547.4      34.2      00:21:11
 20052       6   4,235      25,410       558.1      34.9      00:20:53
 20418       8   4,235      33,880       568.4      35.5      00:20:36
 20683       5   4,235      21,175       576.2      36.0      00:20:28
 20886       8   4,235      33,880       582.0      36.4      00:20:26
 21139       9   4,235      38,115       589.0      36.8      00:20:20
 21406       7   4,235      29,645       595.8      37.3      00:20:15
 21642       9   4,235      38,115       602.2      37.7      00:20:11
 21888       8   4,235      33,880       608.7      38.1      00:20:07
 22124       7   4,235      29,645       614.8      38.4      00:20:03
 22341       3   4,235      12,705       620.6      38.8      00:20:01
 22569       6   4,235      25,410       626.7      39.2      00:19:57
 22882      10   4,235      42,350       634.8      39.7      00:19:47
 23213       6   4,235      25,410       644.2      40.3      00:19:34
 23562       6   4,235      25,410       653.5      40.9      00:19:20
 23908       8   4,235      33,880       663.3      41.5      00:19:05
 24225       8   4,235      33,880       671.7      42.0      00:18:54
 24561      10   4,235      42,350       680.8      42.6      00:18:42
 24890       3   4,235      12,705       690.1      43.2      00:18:29
 25255       8   4,235      33,880       700.4      43.8      00:18:13
 25565       6   4,235      25,410       709.1      44.3      00:18:02
 25813       5   4,235      21,175       716.0      44.8      00:17:55
 26018       6   4,235      25,410       721.8      45.1      00:17:52
 26250       7   4,235      29,645       728.4      45.6      00:17:46
 26517       7   4,235      29,645       735.5      46.0      00:17:39
 26804       6   4,235      25,410       743.4      46.5      00:17:30
 27073       6   4,235      25,410       751.0      47.0      00:17:21
 27353       9   4,235      38,115       758.7      47.4      00:17:12
 27598      10   4,235      42,350       765.7      47.9      00:17:05
 27863       7   4,235      29,645       773.2      48.4      00:16:57
 28150       8   4,235      33,880       781.5      48.9      00:16:46
 28452       5   4,235      21,175       790.1      49.4      00:16:35
 28724      10   4,235      42,350       798.2      49.9      00:16:25
 28930       8   4,235      33,880       804.2      50.3      00:16:21
 29218      10   4,235      42,350       812.4      50.8      00:16:10
 29441       7   4,235      29,645       818.8      51.2      00:16:04
 29720       5   4,235      21,175       826.5      51.7      00:15:55
 29883       9   4,235      38,115       831.3      52.0      00:15:53
 30109       7   4,235      29,645       837.7      52.4      00:15:47
 30326       5   4,235      21,175       844.0      52.8      00:15:41
 30612       4   4,235      16,940       852.4      53.3      00:15:31
 30943       6   4,235      25,410       861.9      53.9      00:15:17
 31319       5   4,235      21,175       872.7      54.6      00:15:01
 31663       4   4,235      16,940       882.7      55.2      00:14:46
 32016       7   4,235      29,645       893.4      55.9      00:14:31
 32366      10   4,235      42,350       903.9      56.5      00:14:15
 32639       8   4,235      33,880       911.8      57.0      00:14:06
 32857       4   4,235      16,940       918.1      57.4      00:13:60
 33045       3   4,235      12,705       923.8      57.8      00:13:55
 33279       7   4,235      29,645       930.6      58.2      00:13:48
 33548      10   4,235      42,350       938.5      58.7      00:13:38
 33859       9   4,235      38,115       947.7      59.3      00:13:26
 34110       6   4,235      25,410       955.1      59.7      00:13:17
 34445       1   4,235       4,235       965.1      60.4      00:13:03
 34786      10   4,235      42,350       975.2      61.0      00:12:49
 35196       5   4,235      21,175       987.3      61.7      00:12:31
 35528      10   4,235      42,350       997.2      62.4      00:12:18
 35872       6   4,235      25,410     1,007.0      63.0      00:12:05
 36219       7   4,235      29,645     1,017.2      63.6      00:11:51
 36580       9   4,235      38,115     1,027.6      64.3      00:11:36
 36846       7   4,235      29,645     1,035.1      64.7      00:11:28
 37054       9   4,235      38,115     1,041.0      65.1      00:11:22
 37283       5   4,235      21,175     1,047.1      65.5      00:11:16
 37489       8   4,235      33,880     1,052.7      65.8      00:11:11
 37749       3   4,235      12,705     1,059.7      66.3      00:11:03
 37980       6   4,235      25,410     1,066.2      66.7      00:10:56
 38213       6   4,235      25,410     1,073.0      67.1      00:10:48
 38513      10   4,235      42,350     1,081.9      67.7      00:10:37
 38827       1   4,235       4,235     1,090.8      68.2      00:10:26
 39141       8   4,235      33,880     1,099.8      68.8      00:10:14
 39380       9   4,235      38,115     1,106.4      69.2      00:10:07
 39658      10   4,235      42,350     1,114.1      69.7      00:09:58
 40024       3   4,235      12,705     1,124.3      70.3      00:09:44
 40414       5   4,235      21,175     1,135.3      71.0      00:09:29
 40875       6   4,235      25,410     1,148.6      71.8      00:09:10
 41197       7   4,235      29,645     1,157.9      72.4      00:08:58
 41561       5   4,235      21,175     1,168.3      73.1      00:08:45
 41910       6   4,235      25,410     1,178.5      73.7      00:08:31
 42228       6   4,235      25,410     1,187.0      74.2      00:08:21
 42517       7   4,235      29,645     1,195.2      74.7      00:08:11
 42810       9   4,235      38,115     1,203.3      75.2      00:08:01
 43107       9   4,235      38,115     1,212.0      75.8      00:07:50
 43420       6   4,235      25,410     1,221.2      76.4      00:07:39
 43714       7   4,235      29,645     1,229.2      76.9      00:07:29
 43996       6   4,235      25,410     1,237.3      77.4      00:07:20
 44286       9   4,235      38,115     1,245.4      77.9      00:07:10
 44576       5   4,235      21,175     1,253.3      78.4      00:07:00
 44927       5   4,235      21,175     1,263.3      79.0      00:06:47
 45339       4   4,235      16,940     1,274.3      79.7      00:06:33
 45646       3   4,235      12,705     1,282.6      80.2      00:06:23
 46024       9   4,235      38,115     1,293.1      80.9      00:06:10
 46404       7   4,235      29,645     1,304.0      81.5      00:05:56
 46800       9   4,235      38,115     1,315.3      82.3      00:05:42
 47119       4   4,235      16,940     1,324.0      82.8      00:05:31
 47395       8   4,235      33,880     1,331.3      83.3      00:05:22
 47664      10   4,235      42,350     1,338.6      83.7      00:05:14
 47949       5   4,235      21,175     1,346.6      84.2      00:05:04
 48301       9   4,235      38,115     1,356.5      84.8      00:04:52
 48629       6   4,235      25,410     1,365.9      85.4      00:04:41
 48896       8   4,235      33,880     1,373.3      85.9      00:04:32
 49184      10   4,235      42,350     1,381.6      86.4      00:04:22
 49493       5   4,235      21,175     1,389.9      86.9      00:04:12
 49801       8   4,235      33,880     1,397.9      87.4      00:04:02
 50105       7   4,235      29,645     1,406.4      87.9      00:03:52
 50439       7   4,235      29,645     1,415.3      88.5      00:03:41
 50798      10   4,235      42,350     1,425.5      89.1      00:03:29
 51134       4   4,235      16,940     1,435.3      89.8      00:03:17
 51452       8   4,235      33,880     1,444.2      90.3      00:03:06
 51748       5   4,235      21,175     1,453.1      90.9      00:02:55
 52080       8   4,235      33,880     1,462.7      91.5      00:02:43
 52439       9   4,235      38,115     1,473.7      92.2      00:02:30
 52865       6   4,235      25,410     1,486.9      93.0      00:02:14
 53324       8   4,235      33,880     1,500.4      93.8      00:01:57
 53748       7   4,235      29,645     1,512.8      94.6      00:01:42
 54141       6   4,235      25,410     1,523.9      95.3      00:01:29
 54547       8   4,235      33,880     1,534.8      96.0      00:01:16
 54910       7   4,235      29,645     1,545.0      96.6      00:01:04
 55204       8   4,235      33,880     1,553.1      97.1      00:00:54
 55463       8   4,235      33,880     1,560.0      97.6      00:00:46
 55692       9   4,235      38,115     1,566.3      98.0      00:00:39
 55949       7   4,235      29,645     1,573.7      98.4      00:00:30
 56272       8   4,235      33,880     1,583.0      99.0      00:00:19
 56612       9   4,235      38,115     1,593.1      99.6      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,235     
Bases * Neighbors  (M)  = 1,599.1        Number of regions         = 56,821    
Computed distances (M)  = 1,599.10       Total run time (seconds)  = 1895.435
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighScho
    > ols//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A200.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/HighSchoo
> ls//vaccinated/ca_blk_HighSchools_dist_total_10000_5_4q_mnl_A200.csv saved

. 
. cap log close

. 
end of do-file
