
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 5-user 16-core network perpetual
Serial number: 501806317788
  Licensed to: UCLA Anderson School of Management
               Los Angeles, CA

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do /mnt/phd/jihu/VaxDemandDistance/Demand/datawork/geonear_pharmacies.do /exp
> ort/storage_covidvaccine/Data/Intermediate/blk_coords.dta /export/storage_cov
> idvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_Dollar_lo
> cations_total_10000_5_4q_mnl_logdistabove0.8.dta /export/storage_covidvaccine
> /Result/MNL_partial_new/M5_K10000_4q/Dollar//vaccinated/ca_blk_Dollar_dist_to
> tal_10000_5_4q_mnl_logdistabove0.8.csv 3000 50 

. // NOTE: rename the input data's latitude and longitude variables to "latitud
> e" and "longitude" before running this script.
. cap log close

. // JINGYUAN: commented out log file so that we won't be writing on the same l
> og file
. // log using "geonear.log", replace
. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Doll
> ar//vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove0.8.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dolla
> r//vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.8.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   572       7   4,035      28,245        13.4       0.9      00:18:53
  1161       8   4,035      32,280        28.2       1.8      00:17:43
  1721       8   4,035      32,280        43.1       2.8      00:17:11
  2295       4   4,035      16,140        57.8       3.8      00:16:56
  2855       7   4,035      28,245        72.4       4.7      00:16:44
  3406       5   4,035      20,175        87.0       5.7      00:16:32
  3908       1   4,035       4,035       100.2       6.6      00:16:35
  4301       7   4,035      28,245       109.9       7.2      00:17:10
  4682       9   4,035      36,315       120.0       7.9      00:17:34
  5112       8   4,035      32,280       131.2       8.6      00:17:43
  5530       9   4,035      36,315       141.8       9.3      00:17:53
  5925       9   4,035      36,315       151.8      10.0      00:18:06
  6371       7   4,035      28,245       163.3      10.7      00:18:04
  6840       7   4,035      28,245       175.3      11.5      00:17:58
  7337       3   4,035      12,105       188.0      12.3      00:17:47
  7830       7   4,035      28,245       201.1      13.2      00:17:33
  8309       5   4,035      20,175       214.5      14.1      00:17:19
  8817       4   4,035      16,140       228.4      15.0      00:17:02
  9275       8   4,035      32,280       241.1      15.8      00:16:52
  9618      10   4,035      40,350       250.8      16.5      00:16:56
 10013       8   4,035      32,280       261.3      17.1      00:16:56
 10442       9   4,035      36,315       272.1      17.9      00:16:53
 10883       6   4,035      24,210       283.5      18.6      00:16:47
 11318       6   4,035      24,210       294.8      19.3      00:16:41
 11678       6   4,035      24,210       304.4      20.0      00:16:43
 12034       5   4,035      20,175       313.7      20.6      00:16:44
 12482       9   4,035      36,315       325.5      21.4      00:16:35
 13029       8   4,035      32,280       339.7      22.3      00:16:17
 13523      10   4,035      40,350       353.2      23.2      00:16:02
 14038       4   4,035      16,140       366.7      24.1      00:15:47
 14575       4   4,035      16,140       381.4      25.0      00:15:29
 15140       9   4,035      36,315       396.8      26.0      00:15:10
 15681       7   4,035      28,245       411.3      27.0      00:14:54
 16206      10   4,035      40,350       426.0      28.0      00:14:37
 16694       7   4,035      28,245       439.3      28.8      00:14:25
 17050      10   4,035      40,350       449.0      29.5      00:14:23
 17382       9   4,035      36,315       458.0      30.1      00:14:22
 17718       6   4,035      24,210       467.3      30.7      00:14:20
 18121       7   4,035      28,245       478.1      31.4      00:14:14
 18579       6   4,035      24,210       490.2      32.2      00:14:04
 19120       3   4,035      12,105       505.3      33.2      00:13:47
 19669       8   4,035      32,280       520.7      34.2      00:13:30
 20209       6   4,035      24,210       536.0      35.2      00:13:13
 20670       5   4,035      20,175       548.6      36.0      00:13:03
 21044      10   4,035      40,350       558.8      36.7      00:12:58
 21512       7   4,035      28,245       570.5      37.4      00:12:49
 21946      10   4,035      40,350       581.4      38.2      00:12:42
 22372       9   4,035      36,315       592.0      38.9      00:12:36
 22787       8   4,035      32,280       602.5      39.5      00:12:30
 23216       9   4,035      36,315       613.8      40.3      00:12:22
 23673       6   4,035      24,210       625.5      41.1      00:12:13
 24112       4   4,035      16,140       637.3      41.8      00:12:04
 24666       5   4,035      20,175       651.6      42.8      00:11:50
 25202       9   4,035      36,315       665.9      43.7      00:11:36
 25677      10   4,035      40,350       678.3      44.5      00:11:26
 26010       8   4,035      32,280       687.5      45.1      00:11:22
 26441       6   4,035      24,210       698.8      45.9      00:11:13
 26939       4   4,035      16,140       711.9      46.7      00:11:02
 27369       5   4,035      20,175       723.3      47.5      00:10:53
 27759       6   4,035      24,210       733.8      48.2      00:10:46
 28232       9   4,035      36,315       746.7      49.0      00:10:35
 28702      10   4,035      40,350       759.9      49.9      00:10:24
 29040      10   4,035      40,350       769.3      50.5      00:10:18
 29510       7   4,035      28,245       782.0      51.3      00:10:08
 29939       7   4,035      28,245       793.5      52.1      00:09:59
 30339       9   4,035      36,315       804.5      52.8      00:09:51
 30800       7   4,035      28,245       817.2      53.6      00:09:40
 31344       7   4,035      28,245       832.1      54.6      00:09:26
 31844       9   4,035      36,315       846.2      55.5      00:09:13
 32280       9   4,035      36,315       858.7      56.4      00:09:03
 32658       9   4,035      36,315       869.3      57.1      00:08:55
 33018       5   4,035      20,175       879.4      57.7      00:08:48
 33444       7   4,035      28,245       891.2      58.5      00:08:39
 33857       6   4,035      24,210       902.9      59.3      00:08:29
 34283       7   4,035      28,245       915.0      60.1      00:08:19
 34823      10   4,035      40,350       930.2      61.1      00:08:05
 35365       4   4,035      16,140       945.4      62.1      00:07:51
 35924       6   4,035      24,210       960.9      63.1      00:07:37
 36463      10   4,035      40,350       976.0      64.1      00:07:24
 36918      10   4,035      40,350       988.3      64.9      00:07:14
 37339       4   4,035      16,140       999.0      65.6      00:07:06
 37746       9   4,035      36,315     1,009.6      66.3      00:06:58
 38146       7   4,035      28,245     1,020.5      67.0      00:06:50
 38523       4   4,035      16,140     1,031.0      67.7      00:06:42
 38846       9   4,035      36,315     1,039.8      68.2      00:06:36
 39200      10   4,035      40,350     1,049.3      68.9      00:06:29
 39633      10   4,035      40,350     1,060.9      69.6      00:06:20
 40149       9   4,035      36,315     1,074.5      70.5      00:06:08
 40715       9   4,035      36,315     1,090.0      71.5      00:05:54
 41161       8   4,035      32,280     1,102.3      72.3      00:05:44
 41574       7   4,035      28,245     1,113.5      73.1      00:05:35
 41969      10   4,035      40,350     1,124.5      73.8      00:05:27
 42376       9   4,035      36,315     1,134.8      74.5      00:05:19
 42791       8   4,035      32,280     1,145.9      75.2      00:05:10
 43165       9   4,035      36,315     1,156.4      75.9      00:05:02
 43585       9   4,035      36,315     1,167.9      76.7      00:04:53
 43982      10   4,035      40,350     1,178.5      77.3      00:04:44
 44404       6   4,035      24,210     1,189.5      78.1      00:04:36
 44820       7   4,035      28,245     1,200.7      78.8      00:04:27
 45273       6   4,035      24,210     1,212.7      79.6      00:04:17
 45661       6   4,035      24,210     1,222.4      80.2      00:04:09
 46092      10   4,035      40,350     1,233.8      81.0      00:03:60
 46523       9   4,035      36,315     1,245.6      81.8      00:03:50
 46986       7   4,035      28,245     1,258.1      82.6      00:03:40
 47339       9   4,035      36,315     1,266.9      83.2      00:03:33
 47691      10   4,035      40,350     1,276.2      83.8      00:03:26
 48086      10   4,035      40,350     1,286.7      84.5      00:03:17
 48493       9   4,035      36,315     1,297.7      85.2      00:03:08
 48924       8   4,035      32,280     1,309.2      85.9      00:02:59
 49267       4   4,035      16,140     1,318.6      86.5      00:02:51
 49740       4   4,035      16,140     1,330.4      87.3      00:02:41
 50271       9   4,035      36,315     1,344.3      88.2      00:02:30
 50685       8   4,035      32,280     1,355.0      88.9      00:02:21
 51104       7   4,035      28,245     1,366.8      89.7      00:02:11
 51562       9   4,035      36,315     1,379.1      90.5      00:02:01
 52002       8   4,035      32,280     1,391.4      91.3      00:01:50
 52404       6   4,035      24,210     1,403.1      92.1      00:01:41
 52809       6   4,035      24,210     1,415.1      92.9      00:01:31
 53230       6   4,035      24,210     1,427.0      93.7      00:01:21
 53762       7   4,035      28,245     1,441.8      94.6      00:01:08
 54101       7   4,035      28,245     1,450.9      95.2      00:01:01
 54498       7   4,035      28,245     1,461.2      95.9      00:00:52
 54938       7   4,035      28,245     1,472.8      96.7      00:00:42
 55350       9   4,035      36,315     1,483.4      97.4      00:00:34
 55752       9   4,035      36,315     1,494.0      98.1      00:00:25
 56168       5   4,035      20,175     1,505.3      98.8      00:00:15
 56597       9   4,035      36,315     1,517.4      99.6      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1282.65
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.8.csv
    not found)
file /export/storage_covidvaccine/Result/MNL_partial_new/M5_K10000_4q/Dollar//v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove0.8.csv saved

. 
. cap log close

. 
end of do-file
