-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  29 Aug 2023, 10:48:41

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MinDist/M5_K10000/Dollar/ca_Dolla
> r_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MinDist/M5_K10000/Dollar/ca_blk_Do
> llar_dist_total.csv

. di "within: `within'"
within: 500

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   741       7   1,750      12,250         8.3       1.2      00:14:19
  1580       9   1,770      15,930        17.8       2.6      00:12:35
  2136       9   2,719      24,471        26.9       3.5      00:13:43
  2716       6   3,497      20,982        37.7       4.5      00:14:10
  3319       5   3,044      15,220        49.6       5.6      00:14:11
  3833      10   3,376      33,760        60.3       6.5      00:14:30
  4516       3   1,599       4,797        66.7       7.6      00:14:14
  5335      10   1,578      15,780        74.9       9.0      00:13:30
  6198       5   1,356       6,780        81.9      10.4      00:12:54
  7025       6   1,629       9,774        90.4      11.8      00:12:27
  7722       7   1,761      12,327        98.2      13.0      00:12:16
  8388      10   1,763      17,630       106.2      14.2      00:12:04
  9140       9   1,770      15,930       115.3      15.6      00:11:45
  9828       7   1,768      12,376       123.7      16.8      00:11:32
 10525       2   1,648       3,296       130.9      18.0      00:11:24
 11329       8   1,922      15,376       139.8      19.4      00:11:06
 12146       9   2,046      18,414       150.5      20.8      00:10:48
 13170       9   1,866      16,794       162.9      22.5      00:10:19
 13936       9   2,334      21,006       173.6      23.9      00:10:05
 14779      10   2,051      20,510       185.5      25.4      00:09:48
 15629       4   2,423       9,692       198.7      26.9      00:09:31
 16446       7   2,391      16,737       212.0      28.4      00:09:15
 17261       4   1,777       7,108       221.7      29.8      00:09:01
 18143       7   1,726      12,082       232.4      31.4      00:08:44
 18906       6   1,828      10,968       241.6      32.8      00:08:33
 19765       6   1,820      10,920       252.7      34.4      00:08:17
 20641       6   2,039      12,234       264.0      36.0      00:08:01
 21274       1   3,584       3,584       273.0      37.0      00:07:56
 21696       1   3,382       3,382       282.2      37.8      00:07:59
 22142       6   2,398      14,388       289.7      38.5      00:08:00
 22655      10   2,421      24,210       297.9      39.3      00:07:58
 23101       4   2,850      11,400       305.6      40.1      00:07:59
 23549       8   2,670      21,360       313.3      40.8      00:07:58
 24112       4   2,667      10,668       323.2      41.8      00:07:53
 24867       5   2,694      13,470       336.5      43.1      00:07:42
 25592      10   2,863      28,630       349.4      44.4      00:07:31
 26138       7   2,852      19,964       359.9      45.4      00:07:26
 26736       6   3,332      19,992       372.1      46.4      00:07:20
 27234       7   2,848      19,936       382.3      47.2      00:07:16
 27669       7   2,795      19,565       390.3      48.0      00:07:14
 28142      10   2,830      28,300       399.3      48.9      00:07:10
 28729       8   2,738      21,904       410.7      49.9      00:07:02
 29226       6   2,708      16,248       419.9      50.8      00:06:57
 29724       9   2,755      24,795       429.1      51.7      00:06:51
 30234       7   2,903      20,321       439.1      52.6      00:06:46
 30766       8   3,022      24,176       449.8      53.6      00:06:39
 31355       5   3,014      15,070       461.9      54.6      00:06:31
 31963       8   3,014      24,112       474.6      55.8      00:06:21
 32572       6   2,833      16,998       487.4      56.9      00:06:11
 33053      10   2,810      28,100       496.8      57.8      00:06:06
 33527       8   2,778      22,224       505.9      58.6      00:05:60
 34063       9   2,783      25,047       516.4      59.6      00:05:52
 34676       7   2,846      19,922       528.6      60.8      00:05:42
 35328       6   2,943      17,658       542.0      62.0      00:05:31
 35964       7   2,835      19,845       554.5      63.1      00:05:21
 36574       9   2,824      25,416       566.5      64.3      00:05:12
 37111       8   2,649      21,192       576.0      65.2      00:05:04
 37600       7   2,636      18,452       584.1      66.0      00:04:59
 38089       9   2,554      22,986       592.4      66.9      00:04:52
 38501       9   2,553      22,977       599.6      67.6      00:04:47
 38943       8   2,539      20,312       607.2      68.4      00:04:42
 39457       8   2,698      21,584       616.2      69.3      00:04:35
 40039       5   2,721      13,605       626.6      70.3      00:04:26
 40662       7   2,751      19,257       638.1      71.4      00:04:16
 41207       5   2,653      13,265       648.2      72.4      00:04:08
 41782       5   2,554      12,770       658.3      73.5      00:03:59
 42137       9   3,949      35,541       665.6      74.1      00:03:55
 42467       9   3,950      35,550       674.1      74.7      00:03:51
 42855       4   3,806      15,224       683.8      75.3      00:03:46
 43182       8   3,791      30,328       692.5      75.9      00:03:42
 43517       8   3,807      30,456       701.2      76.5      00:03:38
 43894       6   3,790      22,740       710.3      77.2      00:03:33
 44261       7   3,955      27,685       719.6      77.8      00:03:28
 44575       8   3,905      31,240       727.6      78.4      00:03:24
 44827       5   3,947      19,735       734.2      78.8      00:03:22
 45073      10   3,952      39,520       740.8      79.3      00:03:19
 45386       8   3,961      31,688       748.3      79.8      00:03:15
 45651       4   3,941      15,764       755.0      80.2      00:03:13
 45997       9   3,906      35,154       763.8      80.8      00:03:08
 46352       9   3,924      35,316       773.4      81.5      00:03:02
 46673       7   3,901      27,307       781.7      82.0      00:02:58
 47113       7   3,937      27,559       792.9      82.8      00:02:51
 47534       7   3,584      25,088       802.5      83.5      00:02:44
 48097      10   3,466      34,660       814.0      84.5      00:02:35
 48707      10   2,838      28,380       825.6      85.6      00:02:24
 49339       8   3,570      28,560       839.2      86.7      00:02:12
 49772       8   3,898      31,184       849.6      87.4      00:02:06
 50142       9   3,932      35,388       859.0      88.0      00:01:60
 50581       4   3,285      13,140       869.0      88.8      00:01:53
 50986      10   3,203      32,030       877.9      89.5      00:01:46
 51370       8   3,101      24,808       886.3      90.2      00:01:39
 51842       6   3,069      18,414       896.5      91.0      00:01:31
 52328      10   3,046      30,460       907.3      91.9      00:01:22
 52824       8   3,047      24,376       918.3      92.9      00:01:12
 53310       6   3,072      18,432       928.5      93.8      00:01:03
 53830       7   3,186      22,302       939.6      94.8      00:00:53
 54283       9   3,303      29,727       949.7      95.6      00:00:45
 54741      10   3,542      35,420       960.0      96.3      00:00:37
 55185       7   3,889      27,223       970.6      97.1      00:00:30
 55615       4   3,761      15,044       980.9      97.8      00:00:22
 56002      10   2,942      29,420       990.0      98.5      00:00:15
 56430      10   2,962      29,620       998.8      99.3      00:00:07

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,034     
Bases * Neighbors  (M)  = 1,523.2        Number of regions         = 56,821    
Computed distances (M)  = 1,006.54       Total run time (seconds)  = 1035.186
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MinDist/M5_K10000/Dollar/ca_blk_Dolla
    > r_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MinDist/M5_K10000/Dollar/ca_blk_Dollar
> _dist_total.csv saved

. 
. cap log close
