-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 13:32:29

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_1_4q_flexthresh2_3_15.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   466      10   4,035      40,350        10.7       0.7      00:23:32
   971       7   4,035      28,245        23.1       1.5      00:21:39
  1450       8   4,035      32,280        35.9       2.4      00:20:45
  1937       5   4,035      20,175        48.4       3.2      00:20:21
  2426       8   4,035      32,280        61.1       4.0      00:19:59
  2928       7   4,035      28,245        74.2       4.9      00:19:34
  3423       9   4,035      36,315        87.5       5.7      00:19:11
  3887       9   4,035      36,315        99.7       6.5      00:19:04
  4252       9   4,035      36,315       108.8       7.1      00:19:32
  4627       8   4,035      32,280       118.5       7.8      00:19:48
  4954       9   4,035      36,315       127.1       8.3      00:20:10
  5294       9   4,035      36,315       135.9       8.9      00:20:27
  5636       6   4,035      24,210       144.4       9.5      00:20:44
  5979       7   4,035      28,245       153.2      10.1      00:20:54
  6349       7   4,035      28,245       162.7      10.7      00:20:57
  6701       6   4,035      24,210       171.7      11.3      00:21:02
  7079       7   4,035      28,245       181.4      11.9      00:20:60
  7526       4   4,035      16,140       193.0      12.7      00:20:43
  7958       9   4,035      36,315       204.8      13.4      00:20:25
  8397       6   4,035      24,210       216.9      14.2      00:20:06
  8818       8   4,035      32,280       228.4      15.0      00:19:52
  9231       8   4,035      32,280       239.9      15.7      00:19:39
  9558       9   4,035      36,315       249.0      16.3      00:19:39
  9912       4   4,035      16,140       258.8      17.0      00:19:35
 10299      10   4,035      40,350       268.3      17.6      00:19:32
 10678       6   4,035      24,210       278.1      18.3      00:19:26
 11101       3   4,035      12,105       289.1      19.0      00:19:15
 11413      10   4,035      40,350       297.4      19.5      00:19:16
 11718       6   4,035      24,210       305.4      20.0      00:19:19
 12049      10   4,035      40,350       314.2      20.6      00:19:17
 12379       9   4,035      36,315       322.9      21.2      00:19:15
 12847       6   4,035      24,210       334.9      22.0      00:18:58
 13275       8   4,035      32,280       346.2      22.7      00:18:44
 13666       7   4,035      28,245       357.1      23.4      00:18:32
 14036      10   4,035      40,350       366.7      24.1      00:18:26
 14441       6   4,035      24,210       377.8      24.8      00:18:14
 14824       8   4,035      32,280       388.1      25.5      00:18:04
 15300       5   4,035      20,175       401.1      26.3      00:17:45
 15795       5   4,035      20,175       414.4      27.2      00:17:25
 16272       5   4,035      20,175       427.8      28.1      00:17:06
 16698       9   4,035      36,315       439.4      28.8      00:16:53
 17049       8   4,035      32,280       448.9      29.5      00:16:47
 17394       3   4,035      12,105       458.3      30.1      00:16:41
 17711       7   4,035      28,245       467.1      30.7      00:16:37
 18114       7   4,035      28,245       477.9      31.4      00:16:26
 18531       8   4,035      32,280       488.8      32.1      00:16:15
 18995       6   4,035      24,210       501.9      32.9      00:15:58
 19468       9   4,035      36,315       515.0      33.8      00:15:41
 19912       8   4,035      32,280       527.6      34.6      00:15:26
 20396       6   4,035      24,210       541.0      35.5      00:15:09
 20745      10   4,035      40,350       550.6      36.1      00:15:03
 21079       9   4,035      36,315       559.7      36.7      00:14:57
 21461       8   4,035      32,280       569.1      37.3      00:14:50
 21823       6   4,035      24,210       578.1      37.9      00:14:44
 22192       7   4,035      28,245       587.5      38.6      00:14:38
 22569       6   4,035      24,210       597.1      39.2      00:14:30
 22964       7   4,035      28,245       607.0      39.8      00:14:22
 23341       7   4,035      28,245       617.2      40.5      00:14:13
 23740       7   4,035      28,245       627.3      41.2      00:14:04
 24118       9   4,035      36,315       637.4      41.8      00:13:55
 24559       8   4,035      32,280       648.6      42.6      00:13:44
 24995       4   4,035      16,140       660.1      43.3      00:13:32
 25449       8   4,035      32,280       672.5      44.1      00:13:18
 25811       7   4,035      28,245       682.2      44.8      00:13:10
 26129       6   4,035      24,210       690.8      45.3      00:13:05
 26547       6   4,035      24,210       701.5      46.0      00:12:54
 26958      10   4,035      40,350       712.4      46.8      00:12:44
 27317       6   4,035      24,210       721.9      47.4      00:12:36
 27640      10   4,035      40,350       730.6      48.0      00:12:30
 28052       9   4,035      36,315       741.8      48.7      00:12:19
 28473       6   4,035      24,210       753.4      49.5      00:12:07
 28818       5   4,035      20,175       763.1      50.1      00:11:59
 29164       9   4,035      36,315       772.7      50.7      00:11:51
 29575       8   4,035      32,280       783.6      51.4      00:11:40
 29900       5   4,035      20,175       792.5      52.0      00:11:33
 30180       9   4,035      36,315       800.1      52.5      00:11:28
 30539       8   4,035      32,280       810.1      53.2      00:11:19
 30984       2   4,035       8,070       822.3      54.0      00:11:06
 31436       7   4,035      28,245       834.7      54.8      00:10:53
 31896       7   4,035      28,245       847.7      55.6      00:10:39
 32354       9   4,035      36,315       860.8      56.5      00:10:25
 32723       6   4,035      24,210       871.1      57.2      00:10:15
 33056       8   4,035      32,280       880.5      57.8      00:10:07
 33457       5   4,035      20,175       891.6      58.5      00:09:56
 33861       8   4,035      32,280       903.0      59.3      00:09:45
 34264       5   4,035      20,175       914.5      60.0      00:09:34
 34745       8   4,035      32,280       927.9      60.9      00:09:19
 35240       6   4,035      24,210       941.9      61.8      00:09:04
 35745       5   4,035      20,175       955.9      62.7      00:08:49
 36245       8   4,035      32,280       969.9      63.7      00:08:35
 36682       8   4,035      32,280       982.0      64.5      00:08:23
 37061       9   4,035      36,315       992.0      65.1      00:08:14
 37433       4   4,035      16,140     1,001.5      65.7      00:08:05
 37786       9   4,035      36,315     1,010.7      66.3      00:07:58
 38115       8   4,035      32,280     1,019.6      66.9      00:07:50
 38456       7   4,035      28,245     1,029.2      67.5      00:07:42
 38789       9   4,035      36,315     1,038.3      68.1      00:07:34
 39136       7   4,035      28,245     1,047.7      68.8      00:07:26
 39508       3   4,035      12,105     1,057.4      69.4      00:07:17
 39922       9   4,035      36,315     1,068.5      70.1      00:07:07
 40433       3   4,035      12,105     1,082.2      71.0      00:06:53
 40936       7   4,035      28,245     1,096.0      71.9      00:06:38
 41248       7   4,035      28,245     1,104.7      72.5      00:06:31
 41662       9   4,035      36,315     1,116.0      73.2      00:06:20
 42027       4   4,035      16,140     1,125.9      73.9      00:06:11
 42413       6   4,035      24,210     1,135.9      74.6      00:06:02
 42777       7   4,035      28,245     1,145.5      75.2      00:05:54
 43125       8   4,035      32,280     1,155.2      75.8      00:05:45
 43502       6   4,035      24,210     1,165.7      76.5      00:05:35
 43878       8   4,035      32,280     1,175.6      77.2      00:05:26
 44275       8   4,035      32,280     1,186.2      77.9      00:05:16
 44705       9   4,035      36,315     1,197.6      78.6      00:05:05
 45142       4   4,035      16,140     1,209.3      79.4      00:04:54
 45556       4   4,035      16,140     1,219.8      80.1      00:04:44
 45915       8   4,035      32,280     1,229.0      80.7      00:04:36
 46292       6   4,035      24,210     1,239.5      81.4      00:04:26
 46711       7   4,035      28,245     1,250.8      82.1      00:04:16
 47111       6   4,035      24,210     1,261.2      82.8      00:04:06
 47497       7   4,035      28,245     1,271.0      83.4      00:03:57
 47866       8   4,035      32,280     1,280.7      84.1      00:03:48
 48227       6   4,035      24,210     1,290.4      84.7      00:03:39
 48602       9   4,035      36,315     1,300.7      85.4      00:03:29
 48994       7   4,035      28,245     1,311.1      86.1      00:03:20
 49383       6   4,035      24,210     1,321.5      86.7      00:03:10
 49935       8   4,035      32,280     1,335.4      87.6      00:02:56
 50421       9   4,035      36,315     1,347.9      88.5      00:02:44
 50808       8   4,035      32,280     1,358.5      89.2      00:02:35
 51187       8   4,035      32,280     1,368.9      89.8      00:02:25
 51579       5   4,035      20,175     1,379.6      90.6      00:02:15
 51978       8   4,035      32,280     1,390.7      91.3      00:02:04
 52342       6   4,035      24,210     1,401.2      92.0      00:01:55
 52708       8   4,035      32,280     1,412.1      92.7      00:01:44
 53062       7   4,035      28,245     1,422.3      93.4      00:01:35
 53492       8   4,035      32,280     1,434.3      94.1      00:01:24
 53913       8   4,035      32,280     1,445.9      94.9      00:01:13
 54273      10   4,035      40,350     1,455.6      95.5      00:01:04
 54656       5   4,035      20,175     1,465.3      96.2      00:00:55
 55049       4   4,035      16,140     1,475.7      96.9      00:00:45
 55410       8   4,035      32,280     1,485.0      97.5      00:00:36
 55741       5   4,035      20,175     1,493.6      98.0      00:00:28
 56060       2   4,035       8,070     1,502.4      98.6      00:00:20
 56439       8   4,035      32,280     1,513.0      99.3      00:00:10

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1437.043
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vacci
    > nated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv not
    found)
file /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv saved

. 
. cap log close
