-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   5 Nov 2023, 17:46:00

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_fixR400_heuristic.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_fixR400_heuristic.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   490       4   4,035      16,140        11.3       0.7      00:22:16
  1008       7   4,035      28,245        24.1       1.6      00:20:44
  1518      10   4,035      40,350        37.8       2.5      00:19:42
  2027       5   4,035      20,175        50.7       3.3      00:19:23
  2530       7   4,035      28,245        63.6       4.2      00:19:10
  3008       8   4,035      32,280        76.0       5.0      00:19:04
  3480       7   4,035      28,245        89.0       5.8      00:18:49
  3994       7   4,035      28,245       102.2       6.7      00:18:34
  4475       9   4,035      36,315       114.4       7.5      00:18:30
  4946       7   4,035      28,245       126.9       8.3      00:18:22
  5417       6   4,035      24,210       139.3       9.1      00:18:14
  5807       9   4,035      36,315       148.7       9.8      00:18:30
  6191       5   4,035      20,175       158.7      10.4      00:18:39
  6581       9   4,035      36,315       168.7      11.1      00:18:46
  7023       3   4,035      12,105       180.0      11.8      00:18:41
  7546       8   4,035      32,280       193.6      12.7      00:18:20
  8034      10   4,035      40,350       206.9      13.6      00:18:03
  8529      10   4,035      40,350       220.7      14.5      00:17:44
  9022       7   4,035      28,245       234.1      15.4      00:17:28
  9424       8   4,035      32,280       245.2      16.1      00:17:24
  9832       9   4,035      36,315       256.7      16.8      00:17:18
 10259       8   4,035      32,280       267.3      17.5      00:17:15
 10663       6   4,035      24,210       277.7      18.2      00:17:13
 11042       5   4,035      20,175       287.7      18.9      00:17:12
 11367       9   4,035      36,315       296.2      19.4      00:17:17
 11704      10   4,035      40,350       305.1      20.0      00:17:20
 12096       7   4,035      28,245       315.5      20.7      00:17:15
 12535       5   4,035      20,175       327.1      21.5      00:17:05
 13078       2   4,035       8,070       341.0      22.4      00:16:47
 13579      10   4,035      40,350       354.7      23.3      00:16:30
 13880       6   4,035      24,210       362.8      23.8      00:16:33
 14308       8   4,035      32,280       374.2      24.6      00:16:24
 14750      10   4,035      40,350       386.1      25.3      00:16:14
 15233       7   4,035      28,245       399.4      26.2      00:15:58
 15749       6   4,035      24,210       413.1      27.1      00:15:42
 16283      10   4,035      40,350       428.1      28.1      00:15:22
 16720       9   4,035      36,315       440.0      28.9      00:15:12
 17100       9   4,035      36,315       450.2      29.5      00:15:07
 17443       7   4,035      28,245       459.6      30.2      00:15:04
 17837       3   4,035      12,105       470.3      30.9      00:14:57
 18192      10   4,035      40,350       480.1      31.5      00:14:52
 18541      10   4,035      40,350       489.1      32.1      00:14:49
 18830       6   4,035      24,210       497.1      32.6      00:14:49
 19236       8   4,035      32,280       508.6      33.4      00:14:39
 19689       8   4,035      32,280       521.3      34.2      00:14:26
 20175       5   4,035      20,175       535.0      35.1      00:14:11
 20587       8   4,035      32,280       546.3      35.9      00:14:02
 20898       8   4,035      32,280       554.9      36.4      00:13:59
 21271      10   4,035      40,350       564.3      37.0      00:13:54
 21632      10   4,035      40,350       573.5      37.6      00:13:49
 21977       8   4,035      32,280       582.2      38.2      00:13:46
 22350      10   4,035      40,350       591.5      38.8      00:13:40
 22694       8   4,035      32,280       600.4      39.4      00:13:36
 23016       5   4,035      20,175       608.4      39.9      00:13:33
 23369       8   4,035      32,280       618.0      40.6      00:13:27
 23713       8   4,035      32,280       626.7      41.1      00:13:23
 24080       9   4,035      36,315       636.5      41.8      00:13:16
 24605       8   4,035      32,280       650.0      42.7      00:13:01
 25162       6   4,035      24,210       664.9      43.6      00:12:43
 25658       6   4,035      24,210       677.8      44.5      00:12:30
 26064       7   4,035      28,245       689.0      45.2      00:12:20
 26582       5   4,035      20,175       702.5      46.1      00:12:06
 27062       1   4,035       4,035       715.2      46.9      00:11:53
 27404       7   4,035      28,245       724.3      47.5      00:11:47
 27767       8   4,035      32,280       734.1      48.2      00:11:40
 28249       6   4,035      24,210       747.2      49.0      00:11:27
 28687       7   4,035      28,245       759.5      49.8      00:11:15
 29046       7   4,035      28,245       769.4      50.5      00:11:07
 29466      10   4,035      40,350       780.9      51.3      00:10:57
 29879       7   4,035      28,245       791.9      52.0      00:10:48
 30314      10   4,035      40,350       803.8      52.8      00:10:37
 30790       4   4,035      16,140       817.0      53.6      00:10:24
 31342       4   4,035      16,140       832.1      54.6      00:10:08
 31850       4   4,035      16,140       846.4      55.6      00:09:53
 32379       4   4,035      16,140       861.5      56.5      00:09:37
 32812       9   4,035      36,315       873.6      57.3      00:09:26
 33143      10   4,035      40,350       882.9      58.0      00:09:19
 33536      10   4,035      40,350       893.8      58.7      00:09:10
 33939      10   4,035      40,350       905.2      59.4      00:09:00
 34400       5   4,035      20,175       918.3      60.3      00:08:48
 34927       7   4,035      28,245       933.2      61.3      00:08:33
 35450      10   4,035      40,350       947.8      62.2      00:08:19
 36006       8   4,035      32,280       963.2      63.2      00:08:04
 36528       4   4,035      16,140       977.7      64.2      00:07:50
 36949       8   4,035      32,280       989.2      64.9      00:07:40
 37366       9   4,035      36,315       999.7      65.6      00:07:31
 37731       6   4,035      24,210     1,009.2      66.2      00:07:24
 38090       4   4,035      16,140     1,019.0      66.9      00:07:16
 38478       4   4,035      16,140     1,029.7      67.6      00:07:07
 38888       8   4,035      32,280     1,041.0      68.3      00:06:58
 39302       7   4,035      28,245     1,052.0      69.0      00:06:49
 39756       6   4,035      24,210     1,063.9      69.8      00:06:38
 40312       6   4,035      24,210     1,078.9      70.8      00:06:24
 40877       9   4,035      36,315     1,094.4      71.8      00:06:09
 41257      10   4,035      40,350     1,105.0      72.5      00:06:00
 41635       8   4,035      32,280     1,115.2      73.2      00:05:52
 42006       9   4,035      36,315     1,125.4      73.9      00:05:44
 42431       9   4,035      36,315     1,136.4      74.6      00:05:34
 42790      10   4,035      40,350     1,145.9      75.2      00:05:27
 43134       5   4,035      20,175     1,155.5      75.8      00:05:19
 43501       9   4,035      36,315     1,165.7      76.5      00:05:11
 43897       8   4,035      32,280     1,176.1      77.2      00:05:02
 44288       7   4,035      28,245     1,186.6      77.9      00:04:53
 44698       6   4,035      24,210     1,197.4      78.6      00:04:44
 45160       8   4,035      32,280     1,209.8      79.4      00:04:33
 45609       9   4,035      36,315     1,221.1      80.1      00:04:23
 45996      10   4,035      40,350     1,231.2      80.8      00:04:14
 46376       9   4,035      36,315     1,241.8      81.5      00:04:05
 46821       6   4,035      24,210     1,253.8      82.3      00:03:55
 47190       6   4,035      24,210     1,263.1      82.9      00:03:47
 47570       8   4,035      32,280     1,272.9      83.5      00:03:39
 48010       8   4,035      32,280     1,284.7      84.3      00:03:29
 48437       4   4,035      16,140     1,296.1      85.1      00:03:19
 48847       9   4,035      36,315     1,307.1      85.8      00:03:09
 49369       5   4,035      20,175     1,321.2      86.7      00:02:56
 49704       8   4,035      32,280     1,329.4      87.3      00:02:50
 50036       5   4,035      20,175     1,338.1      87.8      00:02:42
 50405       5   4,035      20,175     1,347.5      88.4      00:02:34
 50784       6   4,035      24,210     1,357.8      89.1      00:02:25
 51122       6   4,035      24,210     1,367.2      89.7      00:02:17
 51465       8   4,035      32,280     1,376.4      90.3      00:02:10
 51814      10   4,035      40,350     1,386.3      91.0      00:02:01
 52174       6   4,035      24,210     1,396.5      91.7      00:01:52
 52540       8   4,035      32,280     1,407.1      92.4      00:01:43
 52893       8   4,035      32,280     1,417.5      93.0      00:01:34
 53263      10   4,035      40,350     1,427.9      93.7      00:01:25
 53751       8   4,035      32,280     1,441.5      94.6      00:01:12
 54141       6   4,035      24,210     1,451.9      95.3      00:01:03
 54567       8   4,035      32,280     1,462.8      96.0      00:00:54
 54956       5   4,035      20,175     1,473.3      96.7      00:00:44
 55285       6   4,035      24,210     1,481.9      97.3      00:00:37
 55626       8   4,035      32,280     1,490.4      97.8      00:00:29
 55967       6   4,035      24,210     1,499.9      98.4      00:00:21
 56284       6   4,035      24,210     1,508.6      99.0      00:00:13
 56645       9   4,035      36,315     1,518.7      99.7      00:00:04

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1360.845
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_fixR400_heuristic.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_fixR400_heuristic.csv saved

. 
. cap log close
