-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   4 Oct 2023, 14:33:32

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000/Coffee/
> vaccinated/ca_Coffee_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000/Coffee/v
> accinated/ca_blk_Coffee_dist_total_fixR600.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 30

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   504       3   4,035      12,105        11.6       0.8      00:21:45
  1044       7   4,035      28,245        25.1       1.6      00:19:55
  1560       5   4,035      20,175        38.8       2.5      00:19:10
  2086      10   4,035      40,350        52.3       3.4      00:18:46
  2613       2   4,035       8,070        65.8       4.3      00:18:28
  3143       8   4,035      32,280        79.8       5.2      00:18:06
  3655      10   4,035      40,350        93.6       6.1      00:17:50
  4080       9   4,035      36,315       104.5       6.9      00:18:08
  4454       7   4,035      28,245       113.8       7.5      00:18:36
  4807       3   4,035      12,105       123.3       8.1      00:18:57
  5181       8   4,035      32,280       133.0       8.7      00:19:11
  5645       7   4,035      28,245       144.6       9.5      00:19:06
  6204       8   4,035      32,280       159.1      10.4      00:18:36
  6787       8   4,035      32,280       173.9      11.4      00:18:08
  7378       8   4,035      32,280       189.2      12.4      00:17:39
  7947       7   4,035      28,245       204.5      13.4      00:17:13
  8487       8   4,035      32,280       219.5      14.4      00:16:51
  9034       9   4,035      36,315       234.4      15.4      00:16:31
  9578       6   4,035      24,210       249.6      16.4      00:16:11
 10076      10   4,035      40,350       263.0      17.3      00:15:60
 10500       8   4,035      32,280       273.7      18.0      00:16:00
 10918       4   4,035      16,140       284.4      18.7      00:15:59
 11332      10   4,035      40,350       295.2      19.4      00:15:58
 11734       5   4,035      20,175       305.8      20.1      00:15:57
 12149       6   4,035      24,210       316.9      20.8      00:15:53
 12617       9   4,035      36,315       329.2      21.6      00:15:45
 13110       7   4,035      28,245       341.8      22.4      00:15:34
 13511       9   4,035      36,315       352.9      23.2      00:15:30
 13866       9   4,035      36,315       362.4      23.8      00:15:30
 14312       7   4,035      28,245       374.3      24.6      00:15:22
 14750      10   4,035      40,350       386.1      25.3      00:15:15
 15183       5   4,035      20,175       398.0      26.1      00:15:06
 15654      10   4,035      40,350       410.5      26.9      00:14:56
 16107       4   4,035      16,140       423.2      27.8      00:14:45
 16537       7   4,035      28,245       435.2      28.6      00:14:36
 16912       9   4,035      36,315       445.1      29.2      00:14:33
 17344       9   4,035      36,315       456.9      30.0      00:14:25
 17789       7   4,035      28,245       469.0      30.8      00:14:15
 18247       3   4,035      12,105       481.6      31.6      00:14:05
 18757       9   4,035      36,315       495.2      32.5      00:13:52
 19303       7   4,035      28,245       510.4      33.5      00:13:35
 19845       6   4,035      24,210       525.7      34.5      00:13:18
 20378      10   4,035      40,350       540.4      35.5      00:13:03
 20914       3   4,035      12,105       555.4      36.5      00:12:48
 21418      10   4,035      40,350       568.0      37.3      00:12:38
 21860      10   4,035      40,350       579.2      38.0      00:12:31
 22284       3   4,035      12,105       589.8      38.7      00:12:25
 22665      10   4,035      40,350       599.7      39.4      00:12:20
 23062       8   4,035      32,280       609.7      40.0      00:12:16
 23442       8   4,035      32,280       619.9      40.7      00:12:10
 23868       8   4,035      32,280       630.9      41.4      00:12:03
 24339       7   4,035      28,245       642.8      42.2      00:11:54
 24832       7   4,035      28,245       656.0      43.1      00:11:42
 25332       8   4,035      32,280       669.3      43.9      00:11:30
 25764      10   4,035      40,350       680.8      44.7      00:11:22
 26164       8   4,035      32,280       691.6      45.4      00:11:15
 26597      10   4,035      40,350       702.9      46.1      00:11:06
 27024       6   4,035      24,210       714.3      46.9      00:10:58
 27595      10   4,035      40,350       729.4      47.9      00:10:43
 28154       6   4,035      24,210       744.7      48.9      00:10:28
 28715       5   4,035      20,175       760.2      49.9      00:10:13
 29265       9   4,035      36,315       775.1      50.9      00:09:59
 29805      10   4,035      40,350       789.9      51.8      00:09:46
 30201       8   4,035      32,280       800.8      52.6      00:09:38
 30605       6   4,035      24,210       811.9      53.3      00:09:31
 31080      10   4,035      40,350       824.8      54.1      00:09:20
 31555       8   4,035      32,280       838.1      55.0      00:09:09
 32014       3   4,035      12,105       851.1      55.9      00:08:58
 32478       5   4,035      20,175       864.4      56.7      00:08:47
 33026       9   4,035      36,315       879.6      57.7      00:08:33
 33576       8   4,035      32,280       895.0      58.7      00:08:19
 34113       8   4,035      32,280       910.1      59.7      00:08:06
 34667       6   4,035      24,210       925.7      60.8      00:07:52
 35221       7   4,035      28,245       941.4      61.8      00:07:38
 35780      10   4,035      40,350       956.9      62.8      00:07:25
 36319       6   4,035      24,210       972.0      63.8      00:07:12
 36806       3   4,035      12,105       985.1      64.7      00:07:01
 37263       5   4,035      20,175       997.1      65.4      00:06:52
 37672       4   4,035      16,140     1,007.8      66.1      00:06:45
 38086       8   4,035      32,280     1,018.9      66.9      00:06:37
 38488       9   4,035      36,315     1,030.0      67.6      00:06:29
 38898       6   4,035      24,210     1,041.2      68.3      00:06:20
 39449       8   4,035      32,280     1,055.8      69.3      00:06:08
 40002      10   4,035      40,350     1,070.7      70.3      00:05:56
 40536       8   4,035      32,280     1,085.1      71.2      00:05:44
 41078       7   4,035      28,245     1,100.1      72.2      00:05:31
 41611      10   4,035      40,350     1,114.6      73.2      00:05:20
 42093       5   4,035      20,175     1,127.6      74.0      00:05:09
 42479       9   4,035      36,315     1,137.8      74.7      00:05:02
 42857       8   4,035      32,280     1,147.8      75.3      00:04:55
 43248       5   4,035      20,175     1,158.7      76.1      00:04:47
 43647       5   4,035      20,175     1,169.4      76.8      00:04:39
 44047       9   4,035      36,315     1,180.1      77.5      00:04:31
 44450       6   4,035      24,210     1,190.7      78.1      00:04:23
 44844       5   4,035      20,175     1,201.4      78.9      00:04:15
 45272      10   4,035      40,350     1,212.7      79.6      00:04:06
 45651       4   4,035      16,140     1,222.2      80.2      00:03:60
 46038       5   4,035      20,175     1,232.4      80.9      00:03:52
 46421       4   4,035      16,140     1,242.9      81.6      00:03:44
 46876       6   4,035      24,210     1,255.4      82.4      00:03:34
 47409      10   4,035      40,350     1,268.8      83.3      00:03:23
 47885       5   4,035      20,175     1,281.2      84.1      00:03:13
 48348       6   4,035      24,210     1,293.8      84.9      00:03:03
 48856       6   4,035      24,210     1,307.3      85.8      00:02:52
 49359       8   4,035      32,280     1,320.9      86.7      00:02:41
 49976       6   4,035      24,210     1,336.5      87.7      00:02:29
 50468       8   4,035      32,280     1,349.2      88.6      00:02:18
 50891       7   4,035      28,245     1,360.7      89.3      00:02:09
 51325      10   4,035      40,350     1,372.6      90.1      00:02:00
 51764      10   4,035      40,350     1,384.8      90.9      00:01:50
 52196       4   4,035      16,140     1,397.2      91.7      00:01:41
 52615       7   4,035      28,245     1,409.3      92.5      00:01:31
 53033       7   4,035      28,245     1,421.4      93.3      00:01:21
 53513       8   4,035      32,280     1,434.8      94.2      00:01:11
 53934       9   4,035      36,315     1,446.4      94.9      00:01:01
 54313       9   4,035      36,315     1,456.6      95.6      00:00:53
 54735       9   4,035      36,315     1,467.5      96.3      00:00:45
 55153       7   4,035      28,245     1,478.5      97.0      00:00:36
 55626       8   4,035      32,280     1,490.4      97.8      00:00:26
 56058       5   4,035      20,175     1,502.4      98.6      00:00:17
 56448       6   4,035      24,210     1,513.2      99.3      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1222.712
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  11,327,730

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000/Coffee/vacc
    > inated/ca_blk_Coffee_dist_total_fixR600.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000/Coffee/vacci
> nated/ca_blk_Coffee_dist_total_fixR600.csv saved

. 
. cap log close
