-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  16 Feb 2024, 15:32:27

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   523       6   4,035      24,210        12.2       0.8      00:20:42
  1053       7   4,035      28,245        25.4       1.7      00:19:42
  1547       1   4,035       4,035        38.4       2.5      00:19:20
  2066       7   4,035      28,245        51.8       3.4      00:18:58
  2567       4   4,035      16,140        64.6       4.2      00:18:50
  3091       3   4,035      12,105        78.2       5.1      00:18:30
  3585       3   4,035      12,105        91.8       6.0      00:18:13
  4019      10   4,035      40,350       102.9       6.8      00:18:26
  4380       7   4,035      28,245       111.9       7.3      00:18:57
  4701       9   4,035      36,315       120.5       7.9      00:19:25
  5047       5   4,035      20,175       129.6       8.5      00:19:44
  5393       6   4,035      24,210       138.7       9.1      00:19:59
  5704       6   4,035      24,210       146.1       9.6      00:20:27
  6046      10   4,035      40,350       155.1      10.2      00:20:37
  6407       5   4,035      20,175       164.2      10.8      00:20:43
  6761       7   4,035      28,245       173.2      11.4      00:20:49
  7121       8   4,035      32,280       182.6      12.0      00:20:50
  7543       9   4,035      36,315       193.5      12.7      00:20:38
  7992       7   4,035      28,245       205.8      13.5      00:20:18
  8409      10   4,035      40,350       217.3      14.3      00:20:03
  8824       4   4,035      16,140       228.6      15.0      00:19:51
  9209       4   4,035      16,140       239.3      15.7      00:19:42
  9496       7   4,035      28,245       247.2      16.2      00:19:49
  9825       5   4,035      20,175       256.5      16.8      00:19:47
 10174       8   4,035      32,280       265.2      17.4      00:19:47
 10502       6   4,035      24,210       273.7      18.0      00:19:49
 10904       7   4,035      28,245       284.1      18.6      00:19:39
 11261       4   4,035      16,140       293.3      19.3      00:19:36
 11574       8   4,035      32,280       301.6      19.8      00:19:37
 11896      10   4,035      40,350       310.1      20.4      00:19:35
 12208       8   4,035      32,280       318.5      20.9      00:19:34
 12624       5   4,035      20,175       329.4      21.6      00:19:22
 13104       8   4,035      32,280       341.6      22.4      00:19:03
 13541       7   4,035      28,245       353.7      23.2      00:18:46
 13840       7   4,035      28,245       361.6      23.7      00:18:46
 14220       4   4,035      16,140       371.7      24.4      00:18:37
 14653       8   4,035      32,280       383.5      25.2      00:18:21
 15125      10   4,035      40,350       396.4      26.0      00:18:02
 15625      10   4,035      40,350       409.8      26.9      00:17:41
 16118       5   4,035      20,175       423.6      27.8      00:17:20
 16565       7   4,035      28,245       435.9      28.6      00:17:04
 16927       6   4,035      24,210       445.5      29.2      00:16:58
 17275       7   4,035      28,245       454.9      29.9      00:16:52
 17588       6   4,035      24,210       463.8      30.4      00:16:47
 17967       6   4,035      24,210       473.8      31.1      00:16:38
 18347       8   4,035      32,280       484.3      31.8      00:16:29
 18869       9   4,035      36,315       498.2      32.7      00:16:09
 19425      10   4,035      40,350       513.8      33.7      00:15:45
 19999       6   4,035      24,210       530.1      34.8      00:15:20
 20545       8   4,035      32,280       545.1      35.8      00:14:59
 20924      10   4,035      40,350       555.7      36.5      00:14:50
 21380       9   4,035      36,315       566.9      37.2      00:14:39
 21842      10   4,035      40,350       578.7      38.0      00:14:27
 22303       7   4,035      28,245       590.3      38.7      00:14:15
 22759       3   4,035      12,105       601.9      39.5      00:14:03
 23226       8   4,035      32,280       614.1      40.3      00:13:50
 23682       9   4,035      36,315       625.8      41.1      00:13:39
 24129       7   4,035      28,245       637.6      41.9      00:13:27
 24707       7   4,035      28,245       652.8      42.8      00:13:08
 25260      10   4,035      40,350       667.4      43.8      00:12:51
 25751       8   4,035      32,280       680.4      44.7      00:12:37
 26148       8   4,035      32,280       691.2      45.4      00:12:28
 26694       8   4,035      32,280       705.3      46.3      00:12:12
 27186      10   4,035      40,350       718.5      47.2      00:11:58
 27603       9   4,035      36,315       729.7      47.9      00:11:48
 28115       4   4,035      16,140       743.6      48.8      00:11:33
 28650       4   4,035      16,140       758.5      49.8      00:11:17
 29039       4   4,035      16,140       769.2      50.5      00:11:08
 29469       7   4,035      28,245       780.9      51.3      00:10:57
 29905       4   4,035      16,140       792.6      52.0      00:10:46
 30296       8   4,035      32,280       803.3      52.7      00:10:38
 30763       6   4,035      24,210       816.2      53.6      00:10:25
 31345       5   4,035      20,175       832.2      54.6      00:10:07
 31908       4   4,035      16,140       848.1      55.7      00:09:50
 32448       5   4,035      20,175       863.5      56.7      00:09:34
 32822       9   4,035      36,315       873.9      57.4      00:09:26
 33206       7   4,035      28,245       884.6      58.1      00:09:17
 33657       5   4,035      20,175       897.3      58.9      00:09:05
 34129       6   4,035      24,210       910.6      59.8      00:08:53
 34689       6   4,035      24,210       926.3      60.8      00:08:37
 35244       9   4,035      36,315       942.0      61.8      00:08:21
 35817       6   4,035      24,210       957.9      62.9      00:08:05
 36396       7   4,035      28,245       974.2      63.9      00:07:49
 36872      10   4,035      40,350       986.9      64.8      00:07:37
 37303      10   4,035      40,350       998.2      65.5      00:07:28
 37720       6   4,035      24,210     1,008.9      66.2      00:07:19
 38117       5   4,035      20,175     1,019.7      66.9      00:07:11
 38499       6   4,035      24,210     1,030.4      67.6      00:07:02
 38886       9   4,035      36,315     1,040.9      68.3      00:06:53
 39448       2   4,035       8,070     1,055.8      69.3      00:06:39
 40036       7   4,035      28,245     1,071.6      70.3      00:06:24
 40615       4   4,035      16,140     1,087.2      71.4      00:06:10
 41102      10   4,035      40,350     1,100.7      72.2      00:05:58
 41539       7   4,035      28,245     1,112.6      73.0      00:05:48
 41992       6   4,035      24,210     1,125.1      73.8      00:05:37
 42417       8   4,035      32,280     1,136.0      74.6      00:05:28
 42848      10   4,035      40,350     1,147.5      75.3      00:05:18
 43245       4   4,035      16,140     1,158.7      76.0      00:05:09
 43653       8   4,035      32,280     1,169.6      76.8      00:05:00
 44072       9   4,035      36,315     1,180.8      77.5      00:04:51
 44559       7   4,035      28,245     1,193.7      78.3      00:04:40
 45029      10   4,035      40,350     1,206.4      79.2      00:04:29
 45497       8   4,035      32,280     1,218.3      80.0      00:04:18
 45928      10   4,035      40,350     1,229.3      80.7      00:04:09
 46370       7   4,035      28,245     1,241.6      81.5      00:03:59
 46877       7   4,035      28,245     1,255.4      82.4      00:03:47
 47275       4   4,035      16,140     1,265.3      83.0      00:03:39
 47673       8   4,035      32,280     1,275.6      83.7      00:03:30
 48070      10   4,035      40,350     1,286.3      84.4      00:03:21
 48476       9   4,035      36,315     1,297.2      85.1      00:03:12
 48919       6   4,035      24,210     1,309.0      85.9      00:03:02
 49337      10   4,035      40,350     1,320.4      86.7      00:02:53
 49933       7   4,035      28,245     1,335.3      87.6      00:02:40
 50455       9   4,035      36,315     1,348.8      88.5      00:02:28
 50912       5   4,035      20,175     1,361.3      89.3      00:02:17
 51377       6   4,035      24,210     1,374.0      90.2      00:02:06
 51828       2   4,035       8,070     1,386.7      91.0      00:01:56
 52255       8   4,035      32,280     1,398.8      91.8      00:01:45
 52674      10   4,035      40,350     1,411.1      92.6      00:01:35
 53106      10   4,035      40,350     1,423.5      93.4      00:01:24
 53621       4   4,035      16,140     1,437.9      94.4      00:01:12
 54024       4   4,035      16,140     1,448.8      95.1      00:01:03
 54418      10   4,035      40,350     1,459.3      95.8      00:00:54
 54900       7   4,035      28,245     1,471.8      96.6      00:00:44
 55342       5   4,035      20,175     1,483.2      97.4      00:00:34
 55758       9   4,035      36,315     1,494.1      98.1      00:00:25
 56158       6   4,035      24,210     1,505.0      98.8      00:00:16
 56593       5   4,035      20,175     1,517.3      99.6      00:00:05

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1292.32
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl.csv saved

. 
. cap log close
