-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  12 Sep 2023, 21:26:46

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000/Dollar
> /vaccinated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000/Dollar/
> vaccinated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 30

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   555       9   4,035      36,315        12.9       0.8      00:19:30
  1153       9   4,035      36,315        28.0       1.8      00:17:50
  1724       1   4,035       4,035        43.2       2.8      00:17:09
  2321       3   4,035      12,105        58.4       3.8      00:16:43
  2905       4   4,035      16,140        73.6       4.8      00:16:26
  3484       5   4,035      20,175        89.1       5.9      00:16:06
  4010       6   4,035      24,210       102.6       6.7      00:16:10
  4396       5   4,035      20,175       112.3       7.4      00:16:46
  4796       5   4,035      20,175       123.0       8.1      00:17:05
  5209       8   4,035      32,280       133.8       8.8      00:17:20
  5744       8   4,035      32,280       147.1       9.7      00:17:10
  6352       5   4,035      20,175       162.8      10.7      00:16:44
  6947       5   4,035      20,175       178.1      11.7      00:16:23
  7532       9   4,035      36,315       193.2      12.7      00:16:05
  8117       7   4,035      28,245       209.2      13.7      00:15:43
  8702       7   4,035      28,245       225.3      14.8      00:15:23
  9277       7   4,035      28,245       241.2      15.8      00:15:05
  9849       9   4,035      36,315       257.1      16.9      00:14:47
 10279       7   4,035      28,245       267.8      17.6      00:14:52
 10682      10   4,035      40,350       278.3      18.3      00:14:56
 11083       9   4,035      36,315       288.7      19.0      00:14:59
 11505       5   4,035      20,175       299.9      19.7      00:14:59
 11931       6   4,035      24,210       311.0      20.4      00:14:58
 12359       7   4,035      28,245       322.4      21.2      00:14:55
 12869       9   4,035      36,315       335.5      22.0      00:14:46
 13366       6   4,035      24,210       348.6      22.9      00:14:37
 13728       6   4,035      24,210       358.8      23.6      00:14:37
 14137      10   4,035      40,350       369.4      24.2      00:14:36
 14619      10   4,035      40,350       382.6      25.1      00:14:26
 15109       1   4,035       4,035       395.9      26.0      00:14:16
 15615       5   4,035      20,175       409.5      26.9      00:14:04
 16103       5   4,035      20,175       423.1      27.8      00:13:53
 16557       8   4,035      32,280       435.7      28.6      00:13:45
 16931       5   4,035      20,175       445.6      29.2      00:13:44
 17394       3   4,035      12,105       458.3      30.1      00:13:35
 17856       8   4,035      32,280       470.8      30.9      00:13:26
 18329      10   4,035      40,350       483.8      31.8      00:13:16
 18887       8   4,035      32,280       498.8      32.7      00:13:02
 19465       9   4,035      36,315       514.9      33.8      00:12:45
 20023       9   4,035      36,315       530.8      34.8      00:12:29
 20591       8   4,035      32,280       546.4      35.9      00:12:14
 21187       1   4,035       4,035       562.4      36.9      00:11:59
 21632      10   4,035      40,350       573.5      37.6      00:11:53
 22074       7   4,035      28,245       584.7      38.4      00:11:47
 22513       5   4,035      20,175       595.7      39.1      00:11:42
 22963       9   4,035      36,315       606.9      39.8      00:11:36
 23380       7   4,035      28,245       618.3      40.6      00:11:29
 23820       9   4,035      36,315       629.6      41.3      00:11:22
 24287       9   4,035      36,315       641.7      42.1      00:11:14
 24827       6   4,035      24,210       655.8      43.0      00:11:02
 25350       2   4,035       8,070       669.8      44.0      00:10:51
 25784      10   4,035      40,350       681.4      44.7      00:10:44
 26176      10   4,035      40,350       691.9      45.4      00:10:38
 26641       7   4,035      28,245       704.0      46.2      00:10:30
 27115       5   4,035      20,175       716.5      47.0      00:10:20
 27707      10   4,035      40,350       732.4      48.1      00:10:06
 28288       8   4,035      32,280       748.3      49.1      00:09:51
 28866      10   4,035      40,350       764.5      50.2      00:09:37
 29442       9   4,035      36,315       780.2      51.2      00:09:23
 29930       5   4,035      20,175       793.3      52.1      00:09:13
 30315       5   4,035      20,175       803.9      52.8      00:09:07
 30712       9   4,035      36,315       814.8      53.5      00:09:00
 31219       6   4,035      24,210       828.6      54.4      00:08:49
 31714       7   4,035      28,245       842.5      55.3      00:08:38
 32207       7   4,035      28,245       856.5      56.2      00:08:27
 32726       8   4,035      32,280       871.1      57.2      00:08:15
 33288       7   4,035      28,245       886.9      58.2      00:08:02
 33858       9   4,035      36,315       902.9      59.3      00:07:48
 34421       6   4,035      24,210       918.9      60.3      00:07:35
 34988       4   4,035      16,140       934.9      61.4      00:07:21
 35573       6   4,035      24,210       951.2      62.4      00:07:08
 36144       7   4,035      28,245       967.1      63.5      00:06:55
 36673       9   4,035      36,315       981.8      64.4      00:06:43
 37128       3   4,035      12,105       993.8      65.2      00:06:35
 37551      10   4,035      40,350     1,004.5      65.9      00:06:28
 37957      10   4,035      40,350     1,015.3      66.6      00:06:21
 38339       8   4,035      32,280     1,025.8      67.3      00:06:14
 38743       7   4,035      28,245     1,037.1      68.1      00:06:06
 39224       7   4,035      28,245     1,049.9      68.9      00:05:57
 39792       5   4,035      20,175     1,065.0      69.9      00:05:45
 40379       8   4,035      32,280     1,080.6      70.9      00:05:32
 40942       9   4,035      36,315     1,096.2      72.0      00:05:20
 41486       7   4,035      28,245     1,111.2      72.9      00:05:08
 42015       5   4,035      20,175     1,125.6      73.9      00:04:57
 42412       7   4,035      28,245     1,135.8      74.6      00:04:50
 42801      10   4,035      40,350     1,146.2      75.2      00:04:43
 43146      10   4,035      40,350     1,155.8      75.9      00:04:37
 43496       5   4,035      20,175     1,165.5      76.5      00:04:31
 43892       7   4,035      28,245     1,176.0      77.2      00:04:23
 44294       8   4,035      32,280     1,186.8      77.9      00:04:16
 44698       6   4,035      24,210     1,197.4      78.6      00:04:08
 45102       4   4,035      16,140     1,208.2      79.3      00:04:00
 45522       5   4,035      20,175     1,219.0      80.0      00:03:53
 45928      10   4,035      40,350     1,229.3      80.7      00:03:45
 46312       6   4,035      24,210     1,240.1      81.4      00:03:37
 46747       8   4,035      32,280     1,251.8      82.2      00:03:29
 47310       5   4,035      20,175     1,266.1      83.1      00:03:17
 47769       3   4,035      12,105     1,278.2      83.9      00:03:08
 48248       4   4,035      16,140     1,290.9      84.7      00:02:59
 48689       9   4,035      36,315     1,302.9      85.5      00:02:50
 49175      10   4,035      40,350     1,316.1      86.4      00:02:39
 49747       6   4,035      24,210     1,330.5      87.3      00:02:28
 50305       5   4,035      20,175     1,345.1      88.3      00:02:17
 50721       7   4,035      28,245     1,356.0      89.0      00:02:09
 51107       6   4,035      24,210     1,366.8      89.7      00:02:01
 51561       9   4,035      36,315     1,379.1      90.5      00:01:51
 51984       6   4,035      24,210     1,390.9      91.3      00:01:42
 52392       8   4,035      32,280     1,402.7      92.1      00:01:33
 52811       7   4,035      28,245     1,415.1      92.9      00:01:24
 53237       6   4,035      24,210     1,427.2      93.7      00:01:14
 53749       5   4,035      20,175     1,441.4      94.6      00:01:03
 54127       7   4,035      28,245     1,451.5      95.3      00:00:56
 54539       6   4,035      24,210     1,462.2      96.0      00:00:47
 54960       9   4,035      36,315     1,473.4      96.7      00:00:39
 55427      10   4,035      40,350     1,485.4      97.5      00:00:30
 55900       9   4,035      36,315     1,498.0      98.3      00:00:20
 56320       8   4,035      32,280     1,509.6      99.1      00:00:11
 56768       5   4,035      20,175     1,522.2      99.9      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1185.249
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  11,327,730

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000/Dollar/vac
    > cinated/ca_blk_Dollar_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000/Dollar/vacc
> inated/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close
