-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  15 Jan 2024, 19:32:24

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_1_4q_mnl_flexthresh2_3_15_logd
> istabove1.0_loglintemp.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_logdis
> tabove1.0_loglintemp.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   451       7   4,035      28,245        10.4       0.7      00:24:23
   964       7   4,035      28,245        23.0       1.5      00:21:50
  1449       6   4,035      24,210        35.9       2.4      00:20:46
  1954       9   4,035      36,315        48.9       3.2      00:20:09
  2453       9   4,035      36,315        61.7       4.1      00:19:46
  2983       6   4,035      24,210        75.4       4.9      00:19:14
  3480       7   4,035      28,245        89.0       5.8      00:18:49
  3982       9   4,035      36,315       102.0       6.7      00:18:37
  4406       6   4,035      24,210       112.5       7.4      00:18:50
  4781       8   4,035      32,280       122.6       8.0      00:19:04
  5178       8   4,035      32,280       132.9       8.7      00:19:12
  5555       6   4,035      24,210       142.4       9.3      00:19:25
  5909       8   4,035      32,280       151.3       9.9      00:19:40
  6299       4   4,035      16,140       161.5      10.6      00:19:42
  6715       6   4,035      24,210       172.0      11.3      00:19:40
  7139       6   4,035      24,210       183.0      12.0      00:19:34
  7608       8   4,035      32,280       195.3      12.8      00:19:17
  8087       8   4,035      32,280       208.3      13.7      00:18:58
  8550       9   4,035      36,315       221.3      14.5      00:18:40
  9033       6   4,035      24,210       234.4      15.4      00:18:21
  9395       9   4,035      36,315       244.4      16.0      00:18:21
  9745       6   4,035      24,210       254.3      16.7      00:18:19
 10125       4   4,035      16,140       264.0      17.3      00:18:19
 10529       7   4,035      28,245       274.4      18.0      00:18:14
 10981       9   4,035      36,315       286.1      18.8      00:18:02
 11353       3   4,035      12,105       295.8      19.4      00:18:01
 11691       5   4,035      20,175       304.7      20.0      00:18:01
 12020      10   4,035      40,350       313.4      20.6      00:18:03
 12406       7   4,035      28,245       323.6      21.2      00:17:57
 12906       3   4,035      12,105       336.5      22.1      00:17:40
 13411       8   4,035      32,280       349.9      23.0      00:17:21
 13903       7   4,035      28,245       363.4      23.8      00:17:03
 14411       5   4,035      20,175       377.0      24.7      00:16:45
 14923       9   4,035      36,315       390.7      25.6      00:16:27
 15444       7   4,035      28,245       405.0      26.6      00:16:08
 15944       6   4,035      24,210       418.6      27.5      00:15:51
 16450       5   4,035      20,175       432.8      28.4      00:15:34
 16854       6   4,035      24,210       443.6      29.1      00:15:26
 17251       9   4,035      36,315       454.2      29.8      00:15:19
 17603       6   4,035      24,210       464.2      30.5      00:15:14
 18010      10   4,035      40,350       475.0      31.2      00:15:06
 18434       9   4,035      36,315       486.4      31.9      00:14:57
 18939      10   4,035      40,350       500.3      32.8      00:14:41
 19455       5   4,035      20,175       514.6      33.8      00:14:24
 19965      10   4,035      40,350       529.1      34.7      00:14:07
 20483      10   4,035      40,350       543.3      35.7      00:13:51
 20837       7   4,035      28,245       553.1      36.3      00:13:46
 21217       6   4,035      24,210       563.0      37.0      00:13:40
 21649       4   4,035      16,140       573.9      37.7      00:13:32
 22076       3   4,035      12,105       584.8      38.4      00:13:24
 22517       7   4,035      28,245       595.8      39.1      00:13:15
 22936       5   4,035      20,175       606.2      39.8      00:13:08
 23322       6   4,035      24,210       616.8      40.5      00:13:00
 23746      10   4,035      40,350       627.5      41.2      00:12:52
 24165       3   4,035      12,105       638.5      41.9      00:12:43
 24665       8   4,035      32,280       651.6      42.8      00:12:30
 25176       9   4,035      36,315       665.3      43.7      00:12:16
 25658       6   4,035      24,210       677.8      44.5      00:12:05
 26049       1   4,035       4,035       688.5      45.2      00:11:56
 26507       5   4,035      20,175       700.5      46.0      00:11:46
 26984      10   4,035      40,350       713.2      46.8      00:11:34
 27391       7   4,035      28,245       723.9      47.5      00:11:26
 27803       6   4,035      24,210       735.0      48.2      00:11:17
 28285       6   4,035      24,210       748.2      49.1      00:11:04
 28731      10   4,035      40,350       760.7      49.9      00:10:53
 29077       4   4,035      16,140       770.3      50.6      00:10:46
 29523       8   4,035      32,280       782.3      51.3      00:10:36
 29918       7   4,035      28,245       793.0      52.0      00:10:27
 30239       8   4,035      32,280       801.8      52.6      00:10:22
 30658       7   4,035      28,245       813.3      53.4      00:10:12
 31168       7   4,035      28,245       827.2      54.3      00:09:58
 31673       9   4,035      36,315       841.3      55.2      00:09:45
 32158      10   4,035      40,350       855.2      56.1      00:09:31
 32586       6   4,035      24,210       867.3      56.9      00:09:21
 32892       6   4,035      24,210       875.8      57.5      00:09:16
 33226       6   4,035      24,210       885.1      58.1      00:09:09
 33655       5   4,035      20,175       897.3      58.9      00:08:58
 34083       6   4,035      24,210       909.2      59.7      00:08:48
 34541       6   4,035      24,210       922.3      60.5      00:08:36
 35056       5   4,035      20,175       936.7      61.5      00:08:22
 35575       6   4,035      24,210       951.3      62.4      00:08:08
 36111       9   4,035      36,315       966.1      63.4      00:07:54
 36602       8   4,035      32,280       979.7      64.3      00:07:41
 37016       4   4,035      16,140       990.8      65.0      00:07:32
 37393       7   4,035      28,245     1,000.5      65.7      00:07:25
 37751       7   4,035      28,245     1,009.7      66.3      00:07:18
 38110       6   4,035      24,210     1,019.5      66.9      00:07:11
 38472       7   4,035      28,245     1,029.6      67.6      00:07:03
 38828      10   4,035      40,350     1,039.3      68.2      00:06:55
 39191       7   4,035      28,245     1,049.1      68.9      00:06:48
 39616       2   4,035       8,070     1,060.4      69.6      00:06:38
 40103       8   4,035      32,280     1,073.3      70.4      00:06:26
 40639       5   4,035      20,175     1,087.9      71.4      00:06:13
 41107       6   4,035      24,210     1,100.8      72.3      00:06:01
 41473       7   4,035      28,245     1,110.8      72.9      00:05:54
 41884       7   4,035      28,245     1,122.0      73.6      00:05:44
 42269      10   4,035      40,350     1,132.1      74.3      00:05:36
 42682       7   4,035      28,245     1,143.0      75.0      00:05:27
 43101       9   4,035      36,315     1,154.5      75.8      00:05:17
 43497       7   4,035      28,245     1,165.6      76.5      00:05:08
 43883       8   4,035      32,280     1,175.7      77.2      00:04:59
 44298      10   4,035      40,350     1,186.9      77.9      00:04:50
 44730       9   4,035      36,315     1,198.3      78.6      00:04:40
 45162       3   4,035      12,105     1,209.9      79.4      00:04:30
 45568       8   4,035      32,280     1,220.1      80.1      00:04:22
 45954       5   4,035      20,175     1,230.0      80.7      00:04:13
 46329       8   4,035      32,280     1,240.5      81.4      00:04:04
 46713       7   4,035      28,245     1,250.9      82.1      00:03:56
 47123       3   4,035      12,105     1,261.5      82.8      00:03:47
 47527       8   4,035      32,280     1,271.7      83.5      00:03:38
 47928       9   4,035      36,315     1,282.4      84.2      00:03:29
 48303       9   4,035      36,315     1,292.6      84.8      00:03:20
 48700       6   4,035      24,210     1,303.3      85.5      00:03:11
 49113       5   4,035      20,175     1,314.2      86.3      00:03:02
 49593       5   4,035      20,175     1,326.8      87.1      00:02:51
 50146       3   4,035      12,105     1,341.0      88.0      00:02:38
 50534      10   4,035      40,350     1,351.0      88.7      00:02:30
 50916       9   4,035      36,315     1,361.4      89.4      00:02:21
 51320       7   4,035      28,245     1,372.5      90.1      00:02:11
 51677       8   4,035      32,280     1,382.4      90.7      00:02:03
 52086       9   4,035      36,315     1,393.8      91.5      00:01:53
 52485       8   4,035      32,280     1,405.5      92.2      00:01:43
 52888      10   4,035      40,350     1,417.4      93.0      00:01:32
 53293       7   4,035      28,245     1,428.8      93.8      00:01:22
 53776       6   4,035      24,210     1,442.1      94.7      00:01:11
 54159       8   4,035      32,280     1,452.5      95.3      00:01:02
 54575       8   4,035      32,280     1,463.1      96.0      00:00:53
 55007       6   4,035      24,210     1,474.7      96.8      00:00:42
 55378      10   4,035      40,350     1,484.1      97.4      00:00:34
 55705       6   4,035      24,210     1,492.7      98.0      00:00:27
 56037       9   4,035      36,315     1,501.8      98.6      00:00:19
 56386       9   4,035      36,315     1,511.5      99.2      00:00:11
 56747      10   4,035      40,350     1,521.6      99.9      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1338.772
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_log
    > distabove1.0_loglintemp.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_1_4q_mnl_flexthresh2_3_15_logdistabo
> ve1.0_loglintemp.csv saved

. 
. cap log close
