-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:   5 Sep 2023, 20:25:00

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M10_K10000/Dolla
> r/assigned/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M10_K10000/Dollar
> /assigned/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 500

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   905       6   1,719      10,314        10.0       1.4      00:11:41
  1800       6   2,829      16,974        20.6       3.0      00:10:57
  2506       8   3,530      28,240        32.9       4.1      00:11:36
  3118       9   2,918      26,262        45.5       5.2      00:12:12
  3739       2   3,464       6,928        58.3       6.3      00:12:26
  4596       7   1,611      11,277        67.6       7.7      00:11:58
  5484      10     836       8,360        76.3       9.2      00:11:28
  6494       4   1,615       6,460        84.9      10.9      00:10:52
  7408       7   1,734      12,138        94.7      12.5      00:10:32
  8245       8   1,753      14,024       104.6      14.0      00:10:17
  9061       7   1,759      12,313       114.4      15.4      00:10:03
  9917       6   1,752      10,512       124.7      17.0      00:09:47
 10834       7   1,721      12,047       134.2      18.5      00:09:32
 11640      10   1,975      19,750       143.5      19.9      00:09:24
 12482       9   1,755      15,795       154.6      21.4      00:09:12
 13445       6   1,865      11,190       166.1      23.0      00:08:55
 14070       8   2,103      16,824       175.7      24.1      00:08:55
 14903       6   2,747      16,482       187.1      25.6      00:08:43
 15760       8   2,454      19,632       200.6      27.1      00:08:31
 16578       4   1,748       6,992       213.6      28.6      00:08:19
 17391      10   1,772      17,720       223.2      30.1      00:08:09
 18275       6   1,719      10,314       233.7      31.7      00:07:55
 19077       7   1,813      12,691       243.6      33.1      00:07:45
 20067      10   1,808      18,080       256.3      34.9      00:07:27
 20913      10   2,027      20,270       267.4      36.5      00:07:16
 21500       6   3,808      22,848       277.3      37.4      00:07:15
 21995      10   2,666      26,660       287.2      38.2      00:07:16
 22599       2   2,410       4,820       296.6      39.2      00:07:14
 23168      10   2,835      28,350       306.4      40.2      00:07:12
 23722       8   2,662      21,296       315.9      41.1      00:07:10
 24249       8   2,704      21,632       325.1      42.1      00:07:08
 24800      10   2,690      26,900       334.8      43.0      00:07:05
 25468       4   2,694      10,776       346.8      44.2      00:06:57
 26008       3   2,898       8,694       356.9      45.1      00:06:54
 26604       7   3,288      23,016       368.9      46.1      00:06:49
