-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  21 Jan 2024, 07:47:43

. 
. *Pass in parameters.
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  21 Jan 2024, 07:47:43

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local baselocs "`1'"

. local limit "`5'"

. 
. local nborlocs "`2'"

. local outpath "`3'"

. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. local within "`4'"

. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove1.6.dta

. local limit "`5'"

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6.csv
. 

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total_10000_5_4q_mnl_logdistabove1.6_R100.
> dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6_R100.cs
> v

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   533       3   4,035      12,105        12.4       0.8      00:20:21
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   560       9   4,035      36,315        13.0       0.9      00:19:22
  1088       5   4,035      20,175        26.3       1.7      00:18:59
  1138      10   4,035      40,350        27.6       1.8      00:18:07
  1627       8   4,035      32,280        40.6       2.7      00:18:16
  1673      10   4,035      40,350        41.9       2.7      00:17:44
  2163      10   4,035      40,350        54.3       3.6      00:18:03
  2223       7   4,035      28,245        55.9       3.7      00:17:31
  2702       7   4,035      28,245        68.1       4.5      00:17:49
  2790       8   4,035      32,280        70.6       4.6      00:17:10
  3214       7   4,035      28,245        81.7       5.4      00:17:40
  3308       7   4,035      28,245        84.4       5.5      00:17:04
  3747       9   4,035      36,315        96.1       6.3      00:17:21
  3855       8   4,035      32,280        98.9       6.5      00:16:50
  4165       9   4,035      36,315       106.6       7.0      00:17:44
  4263       3   4,035      12,105       109.1       7.2      00:17:19
  4643       1   4,035       4,035       119.0       7.8      00:17:44
  4536       4   4,035      16,140       115.9       7.6      00:18:14
  4865       6   4,035      24,210       124.8       8.2      00:18:42
  5025       5   4,035      20,175       129.0       8.5      00:18:02
  5216       4   4,035      16,140       134.0       8.8      00:19:02
  5416       9   4,035      36,315       139.3       9.1      00:18:14
  5547       6   4,035      24,210       142.3       9.3      00:19:27
  5807       9   4,035      36,315       148.7       9.8      00:18:31
  5842       3   4,035      12,105       149.6       9.8      00:19:55
  6273       9   4,035      36,315       160.9      10.6      00:18:23
  6183       8   4,035      32,280       158.5      10.4      00:20:07
  6747       8   4,035      32,280       172.8      11.3      00:18:16
  6512       8   4,035      32,280       166.9      11.0      00:20:21
  7242       8   4,035      32,280       185.5      12.2      00:18:04
  6851       7   4,035      28,245       175.6      11.5      00:20:30
  7761       7   4,035      28,245       199.2      13.1      00:17:45
  7234       9   4,035      36,315       185.2      12.2      00:20:30
  8269       9   4,035      36,315       213.3      14.0      00:17:25
  7643       2   4,035       8,070       196.2      12.9      00:20:20
  8769       6   4,035      24,210       227.1      14.9      00:17:09
  8055       6   4,035      24,210       207.5      13.6      00:20:07
  9232      10   4,035      40,350       240.0      15.8      00:16:58
  8477       5   4,035      20,175       219.2      14.4      00:19:52
  9603       5   4,035      20,175       250.3      16.4      00:16:59
  8908       8   4,035      32,280       231.0      15.2      00:19:37
 10010       9   4,035      36,315       261.2      17.1      00:16:56
  9313       6   4,035      24,210       242.2      15.9      00:19:25
 10452       8   4,035      32,280       272.4      17.9      00:16:52
  9668       8   4,035      32,280       252.2      16.5      00:19:21
 10937       8   4,035      32,280       285.0      18.7      00:16:41
 10024       7   4,035      28,245       261.6      17.2      00:19:19
 11358       4   4,035      16,140       295.9      19.4      00:16:37
 10375       9   4,035      36,315       270.3      17.7      00:19:21
 11755       9   4,035      36,315       306.3      20.1      00:16:35
 10786       5   4,035      20,175       280.9      18.4      00:19:12
 12165       6   4,035      24,210       317.4      20.8      00:16:30
 11183       5   4,035      20,175       291.3      19.1      00:19:04
 12662       7   4,035      28,245       330.4      21.7      00:16:16
 11465       7   4,035      28,245       298.8      19.6      00:19:09
 13239       9   4,035      36,315       345.3      22.7      00:15:57
 11766       8   4,035      32,280       306.6      20.1      00:19:13
 13800       9   4,035      36,315       360.6      23.7      00:15:36
 12090      10   4,035      40,350       315.3      20.7      00:19:11
 14387       8   4,035      32,280       376.4      24.7      00:15:15
 12435       8   4,035      32,280       324.4      21.3      00:19:08
 14979       9   4,035      36,315       392.3      25.8      00:14:55
 12898       5   4,035      20,175       336.3      22.1      00:18:52
 15540       3   4,035      12,105       407.6      26.8      00:14:37
 13355       7   4,035      28,245       348.3      22.9      00:18:35
 16111       7   4,035      28,245       423.4      27.8      00:14:19
 16640       6   4,035      24,210       437.8      28.7      00:14:04
 13726       5   4,035      20,175       358.8      23.5      00:18:25
 14090       4   4,035      16,140       368.2      24.2      00:18:20
 17055       7   4,035      28,245       449.1      29.5      00:13:59
 17459       6   4,035      24,210       460.0      30.2      00:13:53
 14476       9   4,035      36,315       378.8      24.9      00:18:10
 17877      10   4,035      40,350       471.4      30.9      00:13:47
 14860       7   4,035      28,245       389.0      25.5      00:18:01
 18314       9   4,035      36,315       483.4      31.7      00:13:39
 15383       5   4,035      20,175       403.4      26.5      00:17:37
 18828       8   4,035      32,280       497.1      32.6      00:13:26
 15963      10   4,035      40,350       419.1      27.5      00:17:09
 19386       8   4,035      32,280       512.6      33.6      00:13:10
 16516       8   4,035      32,280       434.7      28.5      00:16:44
 19948       6   4,035      24,210       528.6      34.7      00:12:53
 16906       5   4,035      20,175       444.9      29.2      00:16:36
 20506       7   4,035      28,245       544.0      35.7      00:12:37
 17213      10   4,035      40,350       453.2      29.7      00:16:34
 20878       9   4,035      36,315       554.3      36.4      00:12:33
 17504      10   4,035      40,350       461.5      30.3      00:16:31
 21320       4   4,035      16,140       565.4      37.1      00:12:27
 17843       8   4,035      32,280       470.5      30.9      00:16:26
 21770       8   4,035      32,280       576.8      37.9      00:12:20
 18215      10   4,035      40,350       480.8      31.6      00:16:18
 22222       7   4,035      28,245       588.3      38.6      00:12:12
 18678       5   4,035      20,175       493.0      32.4      00:16:03
 22676       5   4,035      20,175       600.0      39.4      00:12:04
 19213       9   4,035      36,315       507.9      33.3      00:15:41
 23124      10   4,035      40,350       611.4      40.1      00:11:57
 19732       5   4,035      20,175       522.5      34.3      00:15:21
 23569       5   4,035      20,175       622.9      40.9      00:11:49
 20248       3   4,035      12,105       537.0      35.2      00:15:02
 24011       9   4,035      36,315       634.6      41.7      00:11:41
 20644       6   4,035      24,210       547.9      36.0      00:14:52
 24559       8   4,035      32,280       648.6      42.6      00:11:29
 20944       5   4,035      20,175       556.2      36.5      00:14:48
 25110       9   4,035      36,315       663.4      43.5      00:11:15
 21320       4   4,035      16,140       565.4      37.1      00:14:43
 25646       8   4,035      32,280       677.5      44.5      00:11:03
 21668       7   4,035      28,245       574.4      37.7      00:14:37
 26043      10   4,035      40,350       688.4      45.2      00:10:56
 22022       9   4,035      36,315       583.4      38.3      00:14:32
 26500       3   4,035      12,105       700.4      46.0      00:10:47
 22374       7   4,035      28,245       592.1      38.9      00:14:27
 26990       7   4,035      28,245       713.3      46.8      00:10:37
 22718       6   4,035      24,210       601.0      39.4      00:14:21
 27386       3   4,035      12,105       723.8      47.5      00:10:31
 23086      10   4,035      40,350       610.4      40.1      00:14:14
 27830      10   4,035      40,350       735.8      48.3      00:10:22
 23492       6   4,035      24,210       621.0      40.8      00:14:04
 28356       6   4,035      24,210       750.2      49.2      00:10:09
 23905       8   4,035      32,280       631.9      41.5      00:13:54
 28814       7   4,035      28,245       763.0      50.1      00:09:59
 24383       6   4,035      24,210       643.8      42.3      00:13:41
 29225       7   4,035      28,245       774.2      50.8      00:09:51
 24882       5   4,035      20,175       657.3      43.1      00:13:25
 29736       8   4,035      32,280       788.0      51.7      00:09:39
 25332       8   4,035      32,280       669.3      43.9      00:13:13
 30114       6   4,035      24,210       798.3      52.4      00:09:33
 25735       7   4,035      28,245       680.0      44.6      00:13:03
 30548       9   4,035      36,315       810.4      53.2      00:09:24
 26052       3   4,035      12,105       688.6      45.2      00:12:57
 31110       6   4,035      24,210       825.6      54.2      00:09:10
 26441       6   4,035      24,210       698.8      45.9      00:12:48
 31674      10   4,035      40,350       841.3      55.2      00:08:56
 26893      10   4,035      40,350       710.7      46.6      00:12:36
 32229       5   4,035      20,175       857.2      56.3      00:08:41
 27312       4   4,035      16,140       721.8      47.4      00:12:25
 32686       7   4,035      28,245       870.0      57.1      00:08:31
 27727      10   4,035      40,350       733.0      48.1      00:12:15
 33071       4   4,035      16,140       880.9      57.8      00:08:24
 28212       8   4,035      32,280       746.2      49.0      00:11:60
 33511       5   4,035      20,175       893.0      58.6      00:08:15
 28662      10   4,035      40,350       758.8      49.8      00:11:47
 33994       5   4,035      20,175       906.8      59.5      00:08:04
 28974       9   4,035      36,315       767.5      50.4      00:11:41
 34497      10   4,035      40,350       921.0      60.4      00:07:52
 29370      10   4,035      40,350       778.2      51.1      00:11:31
 35069       9   4,035      36,315       937.1      61.5      00:07:37
 29777       6   4,035      24,210       789.1      51.8      00:11:20
 35631       3   4,035      12,105       952.8      62.5      00:07:24
 30111      10   4,035      40,350       798.2      52.4      00:11:13
 36194       6   4,035      24,210       968.5      63.6      00:07:10
 30460       9   4,035      36,315       807.9      53.0      00:11:06
 36701       2   4,035       8,070       982.4      64.5      00:06:59
 30864       9   4,035      36,315       819.1      53.8      00:10:55
 37141       9   4,035      36,315       994.2      65.3      00:06:51
 31324       8   4,035      32,280       831.6      54.6      00:10:42
 37553       5   4,035      20,175     1,004.6      65.9      00:06:43
 31813       7   4,035      28,245       845.3      55.5      00:10:27
 37948      10   4,035      40,350     1,015.1      66.6      00:06:36
 32331       6   4,035      24,210       860.1      56.5      00:10:10
 38340       7   4,035      28,245     1,025.9      67.3      00:06:29
 32726       8   4,035      32,280       871.1      57.2      00:10:00
 38720       6   4,035      24,210     1,036.4      68.0      00:06:21
 33095       9   4,035      36,315       881.6      57.9      00:09:51
 39188       6   4,035      24,210     1,049.0      68.9      00:06:11
 33499       6   4,035      24,210       892.7      58.6      00:09:40
 39767       6   4,035      24,210     1,064.3      69.9      00:05:59
 33892       9   4,035      36,315       903.9      59.3      00:09:30
 40341       7   4,035      28,245     1,079.6      70.9      00:05:46
 34317       9   4,035      36,315       916.1      60.1      00:09:18
 40906       7   4,035      28,245     1,095.2      71.9      00:05:33
 34838       7   4,035      28,245       930.7      61.1      00:09:02
 41325       8   4,035      32,280     1,106.7      72.6      00:05:24
 35381       2   4,035       8,070       945.8      62.1      00:08:46
 41799       8   4,035      32,280     1,119.7      73.5      00:05:14
 35891      10   4,035      40,350       960.0      63.0      00:08:32
 42236       8   4,035      32,280     1,131.1      74.2      00:05:06
 36372       6   4,035      24,210       973.5      63.9      00:08:18
 42675       5   4,035      20,175     1,142.8      75.0      00:04:57
 36799       2   4,035       8,070       984.9      64.6      00:08:07
 43110       7   4,035      28,245     1,154.8      75.8      00:04:48
 37186       1   4,035       4,035       995.2      65.3      00:07:59
 43547       3   4,035      12,105     1,166.8      76.6      00:04:39
 37548       5   4,035      20,175     1,004.4      65.9      00:07:51
 43952       5   4,035      20,175     1,177.6      77.3      00:04:31
 37896       7   4,035      28,245     1,013.7      66.5      00:07:43
 44404       6   4,035      24,210     1,189.5      78.1      00:04:22
 38238       7   4,035      28,245     1,023.1      67.1      00:07:36
 44889       8   4,035      32,280     1,202.6      78.9      00:04:11
 38563       8   4,035      32,280     1,032.1      67.7      00:07:28
 45390      10   4,035      40,350     1,215.4      79.8      00:04:01
 38901       4   4,035      16,140     1,041.3      68.3      00:07:21
 45819       5   4,035      20,175     1,226.5      80.5      00:03:53
 39252       3   4,035      12,105     1,050.6      69.0      00:07:13
 46256       6   4,035      24,210     1,238.5      81.3      00:03:44
 39661       7   4,035      28,245     1,061.6      69.7      00:07:03
 46724       7   4,035      28,245     1,251.2      82.1      00:03:34
 40175       5   4,035      20,175     1,075.2      70.6      00:06:49
 47179       7   4,035      28,245     1,262.8      82.9      00:03:25
 40739      10   4,035      40,350     1,090.7      71.6      00:06:34
 47598       5   4,035      20,175     1,273.6      83.6      00:03:17
 41163       6   4,035      24,210     1,102.3      72.4      00:06:23
 47995       6   4,035      24,210     1,284.3      84.3      00:03:08
 41557       8   4,035      32,280     1,113.0      73.1      00:06:13
 48397       4   4,035      16,140     1,295.1      85.0      00:03:00
 41974       5   4,035      20,175     1,124.6      73.8      00:06:02
 48846       8   4,035      32,280     1,307.1      85.8      00:02:51
 42348       9   4,035      36,315     1,134.0      74.4      00:05:54
 49292       3   4,035      12,105     1,319.2      86.6      00:02:41
 42720       9   4,035      36,315     1,144.1      75.1      00:05:45
 49889       6   4,035      24,210     1,334.1      87.6      00:02:29
 43099       6   4,035      24,210     1,154.5      75.8      00:05:36
 50413       5   4,035      20,175     1,347.7      88.5      00:02:19
 43464       5   4,035      20,175     1,164.8      76.4      00:05:27
 50836       7   4,035      28,245     1,359.2      89.2      00:02:10
 43790       9   4,035      36,315     1,173.2      77.0      00:05:20
 51275       9   4,035      36,315     1,371.2      90.0      00:02:00
 44132       8   4,035      32,280     1,182.4      77.6      00:05:12
 51703       6   4,035      24,210     1,383.1      90.8      00:01:51
 44540       9   4,035      36,315     1,193.2      78.3      00:05:02
 52136       9   4,035      36,315     1,395.3      91.6      00:01:41
 44953      10   4,035      40,350     1,204.3      79.0      00:04:52
 52548       8   4,035      32,280     1,407.3      92.4      00:01:32
 45404       8   4,035      32,280     1,215.8      79.8      00:04:41
 52970       9   4,035      36,315     1,419.6      93.2      00:01:22
 45753       7   4,035      28,245     1,224.7      80.4      00:04:34
 53442       5   4,035      20,175     1,432.8      94.0      00:01:12
 46168       8   4,035      32,280     1,236.0      81.1      00:04:23
 53907       4   4,035      16,140     1,445.7      94.9      00:01:01
 46556       7   4,035      28,245     1,246.6      81.8      00:04:14
 54324       9   4,035      36,315     1,457.0      95.6      00:00:53
 47007       6   4,035      24,210     1,258.6      82.6      00:04:02
 54784      10   4,035      40,350     1,468.7      96.4      00:00:43
 47343       3   4,035      12,105     1,267.0      83.2      00:03:55
 55248       6   4,035      24,210     1,481.0      97.2      00:00:34
 47681       6   4,035      24,210     1,275.9      83.7      00:03:47
 55668      10   4,035      40,350     1,491.6      97.9      00:00:25
 47979       8   4,035      32,280     1,283.9      84.3      00:03:41
 56082       7   4,035      28,245     1,502.9      98.6      00:00:16
 48277       9   4,035      36,315     1,291.7      84.8      00:03:34
 56521       8   4,035      32,280     1,515.3      99.5      00:00:07
 48672       4   4,035      16,140     1,302.5      85.5      00:03:24
 49077      10   4,035      40,350     1,313.3      86.2      00:03:14

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1212.865
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
 49471       5   4,035      20,175     1,323.7      86.9      00:03:04
 49776       7   4,035      28,245     1,331.3      87.4      00:02:58
 50108       5   4,035      20,175     1,340.0      88.0      00:02:50
 50462      10   4,035      40,350     1,349.0      88.5      00:02:42
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6.csv
    not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6.csv saved

. 
. cap log close
 50810       6   4,035      24,210     1,358.5      89.2      00:02:33
 51153       3   4,035      12,105     1,367.9      89.8      00:02:25
 51492       5   4,035      20,175     1,377.2      90.4      00:02:16
 51828       2   4,035       8,070     1,386.7      91.0      00:02:08
 52165       9   4,035      36,315     1,396.2      91.6      00:01:59
 52594       9   4,035      36,315     1,408.7      92.5      00:01:47
 53110      10   4,035      40,350     1,423.6      93.4      00:01:33
 53640       9   4,035      36,315     1,438.4      94.4      00:01:19
 53972       7   4,035      28,245     1,447.4      95.0      00:01:11
 54326       8   4,035      32,280     1,457.0      95.6      00:01:02
 54735       9   4,035      36,315     1,467.5      96.3      00:00:52
 55144       6   4,035      24,210     1,478.3      97.0      00:00:42
 55579       3   4,035      12,105     1,489.2      97.7      00:00:32
 55942       8   4,035      32,280     1,499.2      98.4      00:00:23
 56361      10   4,035      40,350     1,510.7      99.2      00:00:12
 56794       9   4,035      36,315     1,522.9     100.0      00:00:01

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1417.531
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. 
. count
  18,879,550

. ds
blkid    locid    dist     logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/
    > vaccinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6_R100
    > .csv not found)
file /export/storage_covidvaccine/Result/MaxVaxDistLogLin/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total_10000_5_4q_mnl_logdistabove1.6_R100.csv sa
> ved

. 
. cap log close
