-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  11 Sep 2023, 23:15:54

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data//Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K8000/Dollar/vacci
> nated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K8000/Dollar/vaccin
> ated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 2000

. di "limit: `limit'"
limit: 30

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   534       5   4,035      20,175        12.4       0.8      00:20:19
  1098       2   4,035       8,070        26.5       1.7      00:18:49
  1651       5   4,035      20,175        41.2       2.7      00:18:00
  2208       8   4,035      32,280        55.5       3.6      00:17:39
  2768       7   4,035      28,245        70.0       4.6      00:17:20
  3319       5   4,035      20,175        84.6       5.6      00:17:01
  3861       9   4,035      36,315        99.1       6.5      00:16:48
  4252       9   4,035      36,315       108.8       7.1      00:17:22
  4645      10   4,035      40,350       119.0       7.8      00:17:44
  5016       2   4,035       8,070       128.7       8.4      00:18:05
  5383      10   4,035      40,350       138.4       9.1      00:18:22
  6002       6   4,035      24,210       153.8      10.1      00:17:50
  6625       7   4,035      28,245       169.8      11.1      00:17:18
  7266       7   4,035      28,245       186.1      12.2      00:16:48
  7886       7   4,035      28,245       202.7      13.3      00:16:18
  8479      10   4,035      40,350       219.2      14.4      00:15:53
  9043       8   4,035      32,280       234.7      15.4      00:15:35
  9593       7   4,035      28,245       250.0      16.4      00:15:18
 10050       9   4,035      36,315       262.3      17.2      00:15:15
 10428       9   4,035      36,315       271.7      17.8      00:15:23
 10815       7   4,035      28,245       281.6      18.5      00:15:27
 11203       7   4,035      28,245       291.9      19.2      00:15:29
 11604       5   4,035      20,175       302.4      19.8      00:15:30
 11982       7   4,035      28,245       312.3      20.5      00:15:32
 12390       7   4,035      28,245       323.2      21.2      00:15:30
 12865      10   4,035      40,350       335.4      22.0      00:15:22
 13359       8   4,035      32,280       348.4      22.9      00:15:12
 13755       9   4,035      36,315       359.5      23.6      00:15:08
 14196       9   4,035      36,315       371.1      24.4      00:15:02
 14696       4   4,035      16,140       384.6      25.2      00:14:49
 15172       9   4,035      36,315       397.7      26.1      00:14:39
 15608       8   4,035      32,280       409.3      26.9      00:14:32
 16033       9   4,035      36,315       421.1      27.6      00:14:25
 16453       6   4,035      24,210       432.9      28.4      00:14:18
 16746       5   4,035      20,175       440.7      28.9      00:14:21
 17059       7   4,035      28,245       449.2      29.5      00:14:22
 17427       6   4,035      24,210       459.1      30.1      00:14:19
 17850       6   4,035      24,210       470.7      30.9      00:14:11
 18325       6   4,035      24,210       483.7      31.7      00:13:60
 18894       8   4,035      32,280       499.0      32.7      00:13:42
 19500       9   4,035      36,315       515.9      33.9      00:13:22
 20043       7   4,035      28,245       531.4      34.9      00:13:05
 20602       8   4,035      32,280       546.7      35.9      00:12:49
 21181       9   4,035      36,315       562.2      36.9      00:12:33
 21540       7   4,035      28,245       571.2      37.5      00:12:31
 21939       9   4,035      36,315       581.2      38.1      00:12:27
 22304       6   4,035      24,210       590.3      38.7      00:12:24
 22645       8   4,035      32,280       599.1      39.3      00:12:21
 22995       7   4,035      28,245       607.8      39.9      00:12:19
 23379       6   4,035      24,210       618.3      40.6      00:12:13
 23798      10   4,035      40,350       629.0      41.3      00:12:06
 24247      10   4,035      40,350       640.6      42.0      00:11:58
 24798       3   4,035      12,105       655.1      43.0      00:11:44
 25333       8   4,035      32,280       669.4      43.9      00:11:30
 25759      10   4,035      40,350       680.7      44.7      00:11:22
 26134       8   4,035      32,280       690.9      45.3      00:11:16
 26594       8   4,035      32,280       702.8      46.1      00:11:06
 27042       9   4,035      36,315       714.7      46.9      00:10:57
 27619       9   4,035      36,315       730.1      47.9      00:10:42
 28221       6   4,035      24,210       746.4      49.0      00:10:25
 28819       9   4,035      36,315       763.1      50.1      00:10:09
 29410       7   4,035      28,245       779.3      51.1      00:09:53
 29918       7   4,035      28,245       793.0      52.0      00:09:41
 30306       7   4,035      28,245       803.6      52.7      00:09:34
 30701       6   4,035      24,210       814.5      53.5      00:09:27
 31169      10   4,035      40,350       827.2      54.3      00:09:16
 31638      10   4,035      40,350       840.4      55.2      00:09:05
 32118       7   4,035      28,245       854.0      56.1      00:08:54
 32609       8   4,035      32,280       867.9      57.0      00:08:42
 33198       5   4,035      20,175       884.4      58.0      00:08:27
 33800       8   4,035      32,280       901.3      59.2      00:08:11
 34399       8   4,035      32,280       918.3      60.3      00:07:55
 35025       8   4,035      32,280       935.9      61.4      00:07:39
 35651       9   4,035      36,315       953.4      62.6      00:07:23
 36258       8   4,035      32,280       970.2      63.7      00:07:08
 36790       6   4,035      24,210       984.7      64.6      00:06:56
 37252       8   4,035      32,280       996.8      65.4      00:06:47
 37681       4   4,035      16,140     1,008.0      66.2      00:06:39
 38108       7   4,035      28,245     1,019.5      66.9      00:06:31
 38513      10   4,035      40,350     1,030.8      67.7      00:06:23
 38915       9   4,035      36,315     1,041.7      68.4      00:06:15
 39479       8   4,035      32,280     1,056.6      69.4      00:06:03
 40068       2   4,035       8,070     1,072.4      70.4      00:05:50
 40647       8   4,035      32,280     1,088.1      71.4      00:05:37
 41243       8   4,035      32,280     1,104.6      72.5      00:05:23
 41850       8   4,035      32,280     1,121.1      73.6      00:05:09
 42298       5   4,035      20,175     1,132.7      74.3      00:05:01
 42680      10   4,035      40,350     1,143.0      75.0      00:04:53
 43062       9   4,035      36,315     1,153.4      75.7      00:04:46
 43419       7   4,035      28,245     1,163.5      76.4      00:04:39
 43818       2   4,035       8,070     1,173.9      77.0      00:04:31
 44217       6   4,035      24,210     1,184.7      77.8      00:04:23
 44643       6   4,035      24,210     1,196.0      78.5      00:04:15
 45054       7   4,035      28,245     1,207.1      79.2      00:04:07
 45505       4   4,035      16,140     1,218.5      80.0      00:03:58
 45911       6   4,035      24,210     1,228.8      80.7      00:03:51
 46288       7   4,035      28,245     1,239.4      81.3      00:03:43
 46729       6   4,035      24,210     1,251.3      82.1      00:03:34
 47318       8   4,035      32,280     1,266.3      83.1      00:03:21
 47802       7   4,035      28,245     1,279.1      84.0      00:03:11
 48287       9   4,035      36,315     1,292.0      84.8      00:03:01
 48765      10   4,035      40,350     1,305.0      85.7      00:02:51
 49223      10   4,035      40,350     1,317.5      86.5      00:02:41
 49838      10   4,035      40,350     1,332.8      87.5      00:02:29
 50400       5   4,035      20,175     1,347.3      88.4      00:02:18
 50811       5   4,035      20,175     1,358.5      89.2      00:02:09
 51223      10   4,035      40,350     1,369.8      89.9      00:02:00
 51665       4   4,035      16,140     1,382.1      90.7      00:01:51
 52098       9   4,035      36,315     1,394.2      91.5      00:01:41
 52367       9   4,035      36,315     1,402.0      92.0      00:01:36
 52583       8   4,035      32,280     1,408.4      92.4      00:01:31
 52784       9   4,035      36,315     1,414.3      92.8      00:01:27
 52999      10   4,035      40,350     1,420.4      93.2      00:01:22
 53194       8   4,035      32,280     1,425.9      93.6      00:01:18
 53407       8   4,035      32,280     1,431.8      94.0      00:01:14
 53662       8   4,035      32,280     1,439.0      94.5      00:01:08
 53850       6   4,035      24,210     1,444.2      94.8      00:01:04
 54005       5   4,035      20,175     1,448.3      95.1      00:01:01
 54180       5   4,035      20,175     1,453.1      95.4      00:00:58
 54353       8   4,035      32,280     1,457.7      95.7      00:00:54
 54559       9   4,035      36,315     1,462.6      96.0      00:00:50
 54747       6   4,035      24,210     1,467.8      96.3      00:00:46
 54942       9   4,035      36,315     1,472.9      96.7      00:00:42
 55145      10   4,035      40,350     1,478.3      97.0      00:00:38
 55379       9   4,035      36,315     1,484.2      97.4      00:00:33
 55628       6   4,035      24,210     1,490.5      97.8      00:00:28
 55865       6   4,035      24,210     1,497.0      98.3      00:00:23
 56085       9   4,035      36,315     1,503.1      98.7      00:00:18
 56282       8   4,035      32,280     1,508.5      99.0      00:00:13
 56478       8   4,035      32,280     1,514.1      99.4      00:00:08
 56731       8   4,035      32,280     1,521.1      99.8      00:00:02

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1320.359
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  11,327,730

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
(file
    /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K8000/Dollar/vaccinate
    > d/ca_blk_Dollar_dist_total.csv not found)
file /export/storage_covidvaccine/Result/MaxVaxFixV/M10_K8000/Dollar/vaccinated
> /ca_blk_Dollar_dist_total.csv saved

. 
. cap log close
