-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  30 Oct 2023, 17:57:58

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capc
> oef/Dollar/vaccinated/ca_Dollar_locations_total_fixR400.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capco
> ef/Dollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   382       9   4,035      36,315         8.8       0.6      00:28:40
   789       6   4,035      24,210        18.9       1.2      00:26:38
  1194       8   4,035      32,280        29.0       1.9      00:25:46
  1592       8   4,035      32,280        39.7       2.6      00:24:57
  2016       7   4,035      28,245        50.5       3.3      00:24:21
  2437       6   4,035      24,210        61.3       4.0      00:23:52
  2876       7   4,035      28,245        72.9       4.8      00:23:15
  3306       6   4,035      24,210        84.3       5.5      00:22:46
  3730       6   4,035      24,210        95.6       6.3      00:22:25
  4132       9   4,035      36,315       105.8       6.9      00:22:21
  4491       4   4,035      16,140       114.8       7.5      00:22:31
  4839       6   4,035      24,210       124.0       8.1      00:22:35
  5199       9   4,035      36,315       133.5       8.8      00:22:35
  5540       5   4,035      20,175       142.1       9.3      00:22:42
  5830       6   4,035      24,210       149.3       9.8      00:23:02
  6122       8   4,035      32,280       157.0      10.3      00:23:14
  6397       7   4,035      28,245       164.0      10.8      00:23:31
  6646       8   4,035      32,280       170.3      11.2      00:23:52
  6986       4   4,035      16,140       179.0      11.8      00:23:48
  7375       5   4,035      20,175       189.1      12.4      00:23:33
  7769       6   4,035      24,210       199.4      13.1      00:23:16
  8149      10   4,035      40,350       210.1      13.8      00:22:57
  8525      10   4,035      40,350       220.6      14.5      00:22:40
  8907       9   4,035      36,315       231.0      15.2      00:22:25
  9252       7   4,035      28,245       240.5      15.8      00:22:15
  9527       6   4,035      24,210       248.1      16.3      00:22:18
  9826       7   4,035      28,245       256.5      16.8      00:22:15
 10101       4   4,035      16,140       263.5      17.3      00:22:20
 10435       8   4,035      32,280       271.9      17.8      00:22:17
 10747       4   4,035      16,140       280.0      18.4      00:22:14
 11045       5   4,035      20,175       287.8      18.9      00:22:13
 11300       9   4,035      36,315       294.3      19.3      00:22:18
 11552       4   4,035      16,140       301.0      19.8      00:22:22
 11856       8   4,035      32,280       309.1      20.3      00:22:17
 12173       6   4,035      24,210       317.6      20.8      00:22:11
 12511      10   4,035      40,350       326.4      21.4      00:22:02
 12905      10   4,035      40,350       336.4      22.1      00:21:47
 13347       6   4,035      24,210       348.1      22.8      00:21:25
 13688      10   4,035      40,350       357.7      23.5      00:21:13
 13977      10   4,035      40,350       365.2      24.0      00:21:10
 14367       9   4,035      36,315       375.8      24.7      00:20:54
 14756       6   4,035      24,210       386.2      25.3      00:20:39
 15166      10   4,035      40,350       397.5      26.1      00:20:20
 15592       2   4,035       8,070       408.9      26.8      00:20:01
 16001       6   4,035      24,210       420.2      27.6      00:19:43
 16407       8   4,035      32,280       431.6      28.3      00:19:25
 16735       7   4,035      28,245       440.4      28.9      00:19:18
 17046       7   4,035      28,245       448.9      29.5      00:19:11
 17368       5   4,035      20,175       457.5      30.0      00:19:03
 17676       4   4,035      16,140       466.2      30.6      00:18:55
 18056       8   4,035      32,280       476.2      31.3      00:18:43
 18333       6   4,035      24,210       483.9      31.8      00:18:39
 18633       8   4,035      32,280       491.7      32.3      00:18:34
 18930       8   4,035      32,280       500.0      32.8      00:18:27
 19278      10   4,035      40,350       509.7      33.5      00:18:15
 19673       5   4,035      20,175       520.8      34.2      00:17:60
 20077       8   4,035      32,280       532.4      34.9      00:17:43
 20493       8   4,035      32,280       543.7      35.7      00:17:27
 20759       6   4,035      24,210       551.0      36.2      00:17:23
 21049      10   4,035      40,350       558.9      36.7      00:17:17
 21373       3   4,035      12,105       566.7      37.2      00:17:11
 21673       7   4,035      28,245       574.5      37.7      00:17:06
 21988       4   4,035      16,140       582.5      38.2      00:16:59
 22286       8   4,035      32,280       589.9      38.7      00:16:54
 22591       5   4,035      20,175       597.7      39.2      00:16:48
 22898       8   4,035      32,280       605.3      39.7      00:16:43
 23183      10   4,035      40,350       612.9      40.2      00:16:37
 23521       4   4,035      16,140       621.6      40.8      00:16:28
 23808      10   4,035      40,350       629.2      41.3      00:16:22
 24107       8   4,035      32,280       637.2      41.8      00:16:15
 24513       8   4,035      32,280       647.4      42.5      00:16:02
 24908       3   4,035      12,105       658.0      43.2      00:15:48
 25308       9   4,035      36,315       668.7      43.9      00:15:35
 25657      10   4,035      40,350       677.8      44.5      00:15:25
 25855       4   4,035      16,140       683.4      44.9      00:15:23
 26120      10   4,035      40,350       690.5      45.3      00:15:18
 26432       8   4,035      32,280       698.6      45.9      00:15:11
 26751       6   4,035      24,210       706.8      46.4      00:15:03
 27062       1   4,035       4,035       715.2      46.9      00:14:54
 27284       5   4,035      20,175       721.0      47.3      00:14:52
 27504       8   4,035      32,280       726.9      47.7      00:14:49
 27740       8   4,035      32,280       733.3      48.1      00:14:45
 28003       9   4,035      36,315       740.5      48.6      00:14:39
 28332       6   4,035      24,210       749.6      49.2      00:14:29
 28663       2   4,035       8,070       758.9      49.8      00:14:18
 28872       8   4,035      32,280       764.7      50.2      00:14:15
 29169       5   4,035      20,175       772.8      50.7      00:14:07
 29483       9   4,035      36,315       781.3      51.3      00:13:57
 29796      10   4,035      40,350       789.6      51.8      00:13:49
 30082       6   4,035      24,210       797.4      52.3      00:13:41
 30379       7   4,035      28,245       805.6      52.9      00:13:32
 30685       6   4,035      24,210       814.1      53.4      00:13:23
 31066       8   4,035      32,280       824.4      54.1      00:13:10
 31446       7   4,035      28,245       835.0      54.8      00:12:56
 31816       8   4,035      32,280       845.4      55.5      00:12:43
 32190       7   4,035      28,245       856.1      56.2      00:12:30
 32548       6   4,035      24,210       866.3      56.9      00:12:17
 32823       7   4,035      28,245       873.9      57.4      00:12:10
 33068      10   4,035      40,350       880.8      57.8      00:12:04
 33341       2   4,035       8,070       888.4      58.3      00:11:56
 33659       8   4,035      32,280       897.4      58.9      00:11:46
 33950       8   4,035      32,280       905.5      59.4      00:11:37
 34236      10   4,035      40,350       913.7      60.0      00:11:29
 34580      10   4,035      40,350       923.3      60.6      00:11:17
 34925       4   4,035      16,140       933.1      61.2      00:11:05
 35271       6   4,035      24,210       942.8      61.9      00:10:54
 35616       7   4,035      28,245       952.4      62.5      00:10:43
 35965       7   4,035      28,245       962.0      63.1      00:10:31
 36315       8   4,035      32,280       971.9      63.8      00:10:20
 36637       6   4,035      24,210       980.7      64.4      00:10:10
 36934      10   4,035      40,350       988.8      64.9      00:10:01
 37237       5   4,035      20,175       996.4      65.4      00:09:54
 37513       7   4,035      28,245     1,003.6      65.9      00:09:46
 37779      10   4,035      40,350     1,010.5      66.3      00:09:40
 38041       2   4,035       8,070     1,017.5      66.8      00:09:33
 38291       7   4,035      28,245     1,024.4      67.2      00:09:26
 38539      10   4,035      40,350     1,031.5      67.7      00:09:19
 38900       9   4,035      36,315     1,041.3      68.3      00:09:07
 39162       4   4,035      16,140     1,048.4      68.8      00:09:00
 39407       6   4,035      24,210     1,054.8      69.2      00:08:54
 39673       6   4,035      24,210     1,061.8      69.7      00:08:47
 39976       4   4,035      16,140     1,070.0      70.2      00:08:38
 40362       7   4,035      28,245     1,080.2      70.9      00:08:26
 40740       8   4,035      32,280     1,090.7      71.6      00:08:13
 41056       4   4,035      16,140     1,099.5      72.2      00:08:03
 41320      10   4,035      40,350     1,106.6      72.6      00:07:56
 41607       8   4,035      32,280     1,114.4      73.1      00:07:47
 41875       4   4,035      16,140     1,121.8      73.6      00:07:39
 42126       2   4,035       8,070     1,128.4      74.1      00:07:33
 42393       9   4,035      36,315     1,135.3      74.5      00:07:25
 42638       5   4,035      20,175     1,141.8      74.9      00:07:19
 42879       6   4,035      24,210     1,148.4      75.4      00:07:12
 43113      10   4,035      40,350     1,154.9      75.8      00:07:05
 43349       4   4,035      16,140     1,161.5      76.2      00:06:58
 43625       6   4,035      24,210     1,168.9      76.7      00:06:50
 43983       6   4,035      24,210     1,178.5      77.3      00:06:39
 44245       4   4,035      16,140     1,185.4      77.8      00:06:31
 44471       9   4,035      36,315     1,191.3      78.2      00:06:26
 44743       5   4,035      20,175     1,198.6      78.7      00:06:18
 44997       6   4,035      24,210     1,205.5      79.1      00:06:10
 45317       1   4,035       4,035     1,213.7      79.7      00:06:01
 45597       7   4,035      28,245     1,220.8      80.1      00:05:53
 45889      10   4,035      40,350     1,228.3      80.6      00:05:44
 46170       6   4,035      24,210     1,236.0      81.1      00:05:36
 46450      10   4,035      40,350     1,243.6      81.6      00:05:27
 46782       6   4,035      24,210     1,252.7      82.2      00:05:16
 47057       7   4,035      28,245     1,259.8      82.7      00:05:08
 47294      10   4,035      40,350     1,265.8      83.1      00:05:02
 47580       8   4,035      32,280     1,273.1      83.6      00:04:54
 47894      10   4,035      40,350     1,281.5      84.1      00:04:44
 48222       8   4,035      32,280     1,290.3      84.7      00:04:34
 48549       9   4,035      36,315     1,299.2      85.3      00:04:23
 48882       8   4,035      32,280     1,308.0      85.9      00:04:13
 49259       7   4,035      28,245     1,318.4      86.5      00:04:00
 49554       6   4,035      24,210     1,325.8      87.0      00:03:52
 49808       5   4,035      20,175     1,332.1      87.4      00:03:45
 50064       6   4,035      24,210     1,338.8      87.9      00:03:37
 50344       5   4,035      20,175     1,346.0      88.3      00:03:29
 50623       6   4,035      24,210     1,353.4      88.8      00:03:20
 50888       8   4,035      32,280     1,360.6      89.3      00:03:12
 51145       2   4,035       8,070     1,367.8      89.8      00:03:04
 51424       8   4,035      32,280     1,375.3      90.3      00:02:55
 51694       8   4,035      32,280     1,382.9      90.8      00:02:46
 51961       8   4,035      32,280     1,390.3      91.3      00:02:38
 52220       7   4,035      28,245     1,397.8      91.7      00:02:29
 52548       8   4,035      32,280     1,407.3      92.4      00:02:17
 52888      10   4,035      40,350     1,417.4      93.0      00:02:05
 53238      10   4,035      40,350     1,427.2      93.7      00:01:54
 53601       9   4,035      36,315     1,437.4      94.3      00:01:42
 53856      10   4,035      40,350     1,444.3      94.8      00:01:33
 54143       5   4,035      20,175     1,452.0      95.3      00:01:24
 54407       8   4,035      32,280     1,459.1      95.8      00:01:16
 54679       5   4,035      20,175     1,465.9      96.2      00:01:08
 54957       8   4,035      32,280     1,473.3      96.7      00:00:60
 55190       7   4,035      28,245     1,479.5      97.1      00:00:52
 55436       4   4,035      16,140     1,485.6      97.5      00:00:45
 55716       7   4,035      28,245     1,493.0      98.0      00:00:36
 55986       7   4,035      28,245     1,500.4      98.5      00:00:28
 56249      10   4,035      40,350     1,507.7      99.0      00:00:19
 56493       5   4,035      20,175     1,514.6      99.4      00:00:11

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1818.761
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K8000_4q_capcoef/D
> ollar/vaccinated/ca_blk_Dollar_dist_total_fixR400.csv saved

. 
. cap log close
