-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  13 Dec 2023, 21:37:56

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dol
> lar/vaccinated/ca_Dollar_locations_total.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Doll
> ar/vaccinated/ca_blk_Dollar_dist_total.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   562       9   4,035      36,315        13.1       0.9      00:19:16
  1145       6   4,035      24,210        27.8       1.8      00:17:59
  1715       9   4,035      36,315        43.0       2.8      00:17:15
  2297       5   4,035      20,175        57.8       3.8      00:16:55
  2876       7   4,035      28,245        72.9       4.8      00:16:37
  3448      10   4,035      40,350        88.2       5.8      00:16:18
  4011       9   4,035      36,315       102.7       6.7      00:16:10
  4535      10   4,035      40,350       115.9       7.6      00:16:12
  5045       6   4,035      24,210       129.5       8.5      00:16:10
  5536       9   4,035      36,315       142.0       9.3      00:16:14
  5953      10   4,035      40,350       152.6      10.0      00:16:30
  6383       4   4,035      16,140       163.6      10.7      00:16:39
  6830       7   4,035      28,245       175.1      11.5      00:16:42
  7359       9   4,035      36,315       188.6      12.4      00:16:32
  7898       7   4,035      28,245       203.1      13.3      00:16:17
  8416      10   4,035      40,350       217.5      14.3      00:16:02
  8936      10   4,035      40,350       231.8      15.2      00:15:48
  9385       8   4,035      32,280       244.2      16.0      00:15:44
  9811       3   4,035      12,105       256.1      16.8      00:15:41
 10251       6   4,035      24,210       267.1      17.5      00:15:42
 10714       9   4,035      36,315       279.1      18.3      00:15:37
 11167       5   4,035      20,175       290.9      19.1      00:15:33
 11588       3   4,035      12,105       301.9      19.8      00:15:32
 12055      10   4,035      40,350       314.4      20.6      00:15:24
 12582       7   4,035      28,245       328.3      21.5      00:15:11
 13165       9   4,035      36,315       343.3      22.5      00:14:55
 13667       8   4,035      32,280       357.2      23.4      00:14:43
 14117       7   4,035      28,245       368.8      24.2      00:14:38
 14644       6   4,035      24,210       383.3      25.2      00:14:24
 15192       7   4,035      28,245       398.3      26.1      00:14:09
 15757       5   4,035      20,175       413.3      27.1      00:13:54
 16303       5   4,035      20,175       428.7      28.1      00:13:38
 16779       4   4,035      16,140       441.6      29.0      00:13:30
 17226       6   4,035      24,210       453.6      29.8      00:13:23
 17668       9   4,035      36,315       466.0      30.6      00:13:15
 18157       7   4,035      28,245       479.1      31.4      00:13:06
 18591       6   4,035      24,210       490.5      32.2      00:13:00
 19026       7   4,035      28,245       502.8      33.0      00:12:52
 19519      10   4,035      40,350       516.5      33.9      00:12:41
 20057       8   4,035      32,280       531.8      34.9      00:12:27
 20574       9   4,035      36,315       546.0      35.8      00:12:15
 20982       9   4,035      36,315       557.2      36.6      00:12:09
 21436       6   4,035      24,210       568.4      37.3      00:12:04
 21864       7   4,035      28,245       579.3      38.0      00:11:58
 22306       9   4,035      36,315       590.4      38.7      00:11:52
 22723       9   4,035      36,315       601.2      39.5      00:11:47
 23155       9   4,035      36,315       612.1      40.2      00:11:41
 23578       7   4,035      28,245       623.1      40.9      00:11:35
 24018       5   4,035      20,175       634.8      41.7      00:11:27
 24591       8   4,035      32,280       649.6      42.6      00:11:14
 25159       8   4,035      32,280       664.8      43.6      00:10:60
 25678       9   4,035      36,315       678.4      44.5      00:10:49
 26086      10   4,035      40,350       689.5      45.3      00:10:42
 26603       8   4,035      32,280       703.1      46.1      00:10:31
 27106      10   4,035      40,350       716.3      47.0      00:10:21
 27509       8   4,035      32,280       727.0      47.7      00:10:14
 27941      10   4,035      40,350       738.9      48.5      00:10:06
 28444       7   4,035      28,245       752.6      49.4      00:09:55
 28852       6   4,035      24,210       764.1      50.1      00:09:47
 29317       6   4,035      24,210       776.6      51.0      00:09:38
 29781      10   4,035      40,350       789.3      51.8      00:09:28
 30231       4   4,035      16,140       801.6      52.6      00:09:19
 30679       8   4,035      32,280       813.9      53.4      00:09:10
 31214       9   4,035      36,315       828.5      54.4      00:08:58
 31744       4   4,035      16,140       843.4      55.4      00:08:45
 32260       8   4,035      32,280       858.1      56.3      00:08:33
 32732       9   4,035      36,315       871.3      57.2      00:08:22
 33108       6   4,035      24,210       881.9      57.9      00:08:15
 33558       7   4,035      28,245       894.5      58.7      00:08:06
 34020       3   4,035      12,105       907.4      59.6      00:07:56
 34502       9   4,035      36,315       921.2      60.5      00:07:45
 35033      10   4,035      40,350       936.1      61.4      00:07:32
 35581       7   4,035      28,245       951.4      62.4      00:07:20
 36146      10   4,035      40,350       967.1      63.5      00:07:06
 36662      10   4,035      40,350       981.5      64.4      00:06:55
 37106       9   4,035      36,315       993.2      65.2      00:06:46
 37548       5   4,035      20,175     1,004.4      65.9      00:06:38
 37949       7   4,035      28,245     1,015.1      66.6      00:06:31
 38352      10   4,035      40,350     1,026.2      67.4      00:06:23
 38753       9   4,035      36,315     1,037.3      68.1      00:06:15
 39242       7   4,035      28,245     1,050.4      68.9      00:06:05
 39819       6   4,035      24,210     1,065.6      69.9      00:05:53
 40389       4   4,035      16,140     1,080.9      70.9      00:05:40
 40942       9   4,035      36,315     1,096.2      72.0      00:05:28
 41349       7   4,035      28,245     1,107.4      72.7      00:05:20
 41779      10   4,035      40,350     1,119.2      73.5      00:05:11
 42203       9   4,035      36,315     1,130.3      74.2      00:05:03
 42658      10   4,035      40,350     1,142.4      75.0      00:04:54
 43070       8   4,035      32,280     1,153.6      75.7      00:04:46
 43470      10   4,035      40,350     1,164.9      76.5      00:04:37
 43906      10   4,035      40,350     1,176.4      77.2      00:04:29
 44354       6   4,035      24,210     1,188.3      78.0      00:04:20
 44813      10   4,035      40,350     1,200.5      78.8      00:04:11
 45312       1   4,035       4,035     1,213.6      79.7      00:04:00
 45775       6   4,035      24,210     1,225.3      80.4      00:03:52
 46226      10   4,035      40,350     1,237.6      81.2      00:03:42
 46682       6   4,035      24,210     1,250.0      82.0      00:03:33
 47136       2   4,035       8,070     1,261.8      82.8      00:03:24
 47572      10   4,035      40,350     1,272.9      83.5      00:03:15
 48067      10   4,035      40,350     1,286.2      84.4      00:03:05
 48578       8   4,035      32,280     1,300.0      85.3      00:02:54
 49129       5   4,035      20,175     1,314.7      86.3      00:02:42
 49629       7   4,035      28,245     1,327.6      87.1      00:02:32
 50059      10   4,035      40,350     1,338.7      87.9      00:02:24
 50530       8   4,035      32,280     1,350.9      88.7      00:02:14
 50987      10   4,035      40,350     1,363.5      89.5      00:02:05
 51453       5   4,035      20,175     1,376.1      90.3      00:01:55
 51903       9   4,035      36,315     1,388.7      91.1      00:01:45
 52345       6   4,035      24,210     1,401.3      92.0      00:01:35
 52781       7   4,035      28,245     1,414.2      92.8      00:01:25
 53231       6   4,035      24,210     1,427.0      93.7      00:01:15
 53752       6   4,035      24,210     1,441.5      94.6      00:01:04
 54197       6   4,035      24,210     1,453.5      95.4      00:00:55
 54688       8   4,035      32,280     1,466.2      96.2      00:00:45
 55157       8   4,035      32,280     1,478.6      97.1      00:00:35
 55611      10   4,035      40,350     1,490.1      97.8      00:00:26
 56043      10   4,035      40,350     1,502.0      98.6      00:00:17
 56457       9   4,035      36,315     1,513.5      99.3      00:00:08

-------------------------------------------------------------------------------
Unique base locations   = 377,591        Unique neighbor locations = 4,035     
Bases * Neighbors  (M)  = 1,523.6        Number of regions         = 56,821    
Computed distances (M)  = 1,523.58       Total run time (seconds)  = 1193.326
-------------------------------------------------------------------------------

. 
. rename id locid

. rename km_to_id dist

. 
. gen logdist = log(dist)

. drop dist

. 
. count
  18,879,550

. ds
blkid    locid    logdist

. 
. gsort blkid logdist //this is important as future code assumes this

. 
. export delim "`outpath'", replace
file /export/storage_covidvaccine/Result/MaxVaxHPIDistBLP/M5_K10000_4q/Dollar/v
> accinated/ca_blk_Dollar_dist_total.csv saved

. 
. cap log close
