-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /mnt/phd/jihu/VaxDemandDistance/utils/geonear.log
  log type:  text
 opened on:  14 Jan 2024, 13:32:29

. 
. *Pass in parameters.
. local baselocs "`1'"

. local nborlocs "`2'"

. local outpath "`3'"

. local within "`4'"

. local limit "`5'"

. 
. if "`within'" == "" local within 200 //max distance in km to search for neigh
> bors

. if "`limit'" == "" local limit 300 //max number of neighbors to return

. 
. di "baselocs: `baselocs'"
baselocs: /export/storage_covidvaccine/Data/Intermediate/blk_coords.dta

. di "nborlocs: `nborlocs'"
nborlocs: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/v
> accinated/ca_Dollar_locations_total_10000_1_4q_flexthresh2_3_15.dta

. di "outpath: `outpath'"
outpath: /export/storage_covidvaccine/Result/MNL_partial/M5_K10000_4q/Dollar/va
> ccinated/ca_blk_Dollar_dist_total_10000_1_4q_flexthresh2_3_15.csv

. di "within: `within'"
within: 3000

. di "limit: `limit'"
limit: 50

. 
. use "`baselocs'", clear

. 
. ds
latitude   longitude  blkid

. 
. geonear blkid latitude longitude using "`nborlocs'", neighbors(id latitude lo
> ngitude) long within(`within') limit(`limit')

current   base    nbor      ops in       cumul   cumul %     remaining
 region   locs    locs      region     ops (M)    % done    (hh:mm:ss)
   466      10   4,035      40,350        10.7       0.7      00:23:32
   971       7   4,035      28,245        23.1       1.5      00:21:39
  1450       8   4,035      32,280        35.9       2.4      00:20:45
  1937       5   4,035      20,175        48.4       3.2      00:20:21
  2426       8   4,035      32,280        61.1       4.0      00:19:59
  2928       7   4,035      28,245        74.2       4.9      00:19:34
  3423       9   4,035      36,315        87.5       5.7      00:19:11
  3887       9   4,035      36,315        99.7       6.5      00:19:04
  4252       9   4,035      36,315       108.8       7.1      00:19:32
  4627       8   4,035      32,280       118.5       7.8      00:19:48
  4954       9   4,035      36,315       127.1       8.3      00:20:10
  5294       9   4,035      36,315       135.9       8.9      00:20:27
  5636       6   4,035      24,210       144.4       9.5      00:20:44
  5979       7   4,035      28,245       153.2      10.1      00:20:54
  6349       7   4,035      28,245       162.7      10.7      00:20:57
  6701       6   4,035      24,210       171.7      11.3      00:21:02
  7079       7   4,035      28,245       181.4      11.9      00:20:60
  7526       4   4,035      16,140       193.0      12.7      00:20:43
  7958       9   4,035      36,315       204.8      13.4      00:20:25
  8397       6   4,035      24,210       216.9      14.2      00:20:06
  8818       8   4,035      32,280       228.4      15.0      00:19:52
  9231       8   4,035      32,280       239.9      15.7      00:19:39
  9558       9   4,035      36,315       249.0      16.3      00:19:39
  9912       4   4,035      16,140       258.8      17.0      00:19:35
 10299      10   4,035      40,350       268.3      17.6      00:19:32
 10678       6   4,035      24,210       278.1      18.3      00:19:26
 11101       3   4,035      12,105       289.1      19.0      00:19:15
 11413      10   4,035      40,350       297.4      19.5      00:19:16
 11718       6   4,035      24,210       305.4      20.0      00:19:19
 12049      10   4,035      40,350       314.2      20.6      00:19:17
 12379       9   4,035      36,315       322.9      21.2      00:19:15
 12847       6   4,035      24,210       334.9      22.0      00:18:58
 13275       8   4,035      32,280       346.2      22.7      00:18:44
 13666       7   4,035      28,245       357.1      23.4      00:18:32
 14036      10   4,035      40,350       366.7      24.1      00:18:26
 14441       6   4,035      24,210       377.8      24.8      00:18:14
 14824       8   4,035      32,280       388.1      25.5      00:18:04
 15300       5   4,035      20,175       401.1      26.3      00:17:45
 15795       5   4,035      20,175       414.4      27.2      00:17:25
 16272       5   4,035      20,175       427.8      28.1      00:17:06
 16698       9   4,035      36,315       439.4      28.8      00:16:53
 17049       8   4,035      32,280       448.9      29.5      00:16:47
 17394       3   4,035      12,105       458.3      30.1      00:16:41
 17711       7   4,035      28,245       467.1      30.7      00:16:37
 18114       7   4,035      28,245       477.9      31.4      00:16:26
 18531       8   4,035      32,280       488.8      32.1      00:16:15
 18995       6   4,035      24,210       501.9      32.9      00:15:58
 19468       9   4,035      36,315       515.0      33.8      00:15:41
 19912       8   4,035      32,280       527.6      34.6      00:15:26
